[{"course_name": "ACCTG 151: Introductory Financial Accounting I", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Basic concepts, principles, and practices for the recording, summarizing, and interpreting of accounting data."}, {"course_name": "ACCTG 152: Introductory Financial Accounting II", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Accounting for partnerships, corporations, cash flows, certain liabilities and assets, and the analysis of financial statements.", "prerequisite": "ACCTG 151"}, {"course_name": "ACCTG 197: Special Topics", "department": "Accounting (ACCTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ACCTG 199: Foreign Studies", "department": "Accounting (ACCTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ACCTG 211: Financial and Managerial Accounting for Decision Making", "department": "Accounting (ACCTG)", "credits": "4 Credits", "description": "Introduction to the role of accounting numbers in the process of managing a business and in investor decision making.  ACCTG 211 Financial and Managerial Accounting for Decision Making (4)The objective of this course is to introduce students to the discipline of accounting through an introduction to two of accounting's sub-disciplines, financial and managerial accounting. The more specific purpose is to provide students a basic understanding of the role of financial and managerial accounting information in the decisions of capital market participants external to a business enterprise (e.g., stockholders, banks, financial analysts, prospective stockholders), and in the decisions of those who manage business enterprises. Accounting information has an important role in the resource allocation process in our socio-economic system as a whole, as well as in each individual business enterprise. This course provides students an understanding of (1) the nature of the accounting function, and (2) how the information in accounting reports are used by various decision makers in their resource allocation decisions. In this course students will develop an understanding of (a) the five activity dimensions of accounting (the collection, recording, analysis, interpretation and reporting of information to decision makers for (mainly) their investment decisions), (b) the issues surrounding the five activity dimensions, (c) the environment in which accounting is practiced, and (d) what information is used in a number of specific decision situations, and how such information is used in such decision situations. The analysis, interpretation and decision-making orientation of this course includes a study of the procedural (mechanical and processing) aspects of the recording activity dimension which is an important means to the end --where the end is the analysis and interpretation of the information, and the reports produced by the recording/processing part of accounting. Through this focus on the recording activity dimension, students will obtain an understanding of (a) the nature and quality (strengths and weaknesses) of accounting information, (b) how to proceed in analyzing and interpreting accounting information, and (c) numerous other aspects of financial and managerial accounting. This course is an important background course for all business majors, as well as for numerous non-business majors.", "prerequisite": "MATH 21"}, {"course_name": "ACCTG 211H: Financial and Managerial Accounting for Decision Making", "department": "Accounting (ACCTG)", "credits": "4 Credits", "description": "The objective of this course is to introduce students to the discipline of accounting through an introduction to two of accounting's sub-disciplines, financial and managerial accounting. The more specific purpose is to provide students a basic understanding of the role of financial and managerial accounting information in the decisions of capital market participants external to a business enterprise (e.g., stockholders, banks, financial analysts, prospective stockholders), and in the decisions of those who manage business enterprises. Accounting information has an important role in the resource allocation process in our socio-economic system as a whole, as well as in each individual business enterprise. This course provides students an understanding of (1) the nature of the accounting function, and (2) how the information in accounting reports are used by various decision makers in their resource allocation decisions. In this course students will develop an understanding of (a) the five activity dimensions of accounting (the collection, recording, analysis, interpretation and reporting of information to decision makers for (mainly) their investment decisions), (b) the issues surrounding the five activity dimensions, (c) the environment in which accounting is practiced, and (d) what information is used in a number of specific decision situations, and how such information is used in such decision situations. The analysis, interpretation and decision-making orientation of this course includes a study of the procedural (mechanical and processing) aspects of the recording activity dimension which is an important means to the end --where the end is the analysis and interpretation of the information, and the reports produced by the recording/processing part of accounting. Through this focus on the recording activity dimension, students will obtain an understanding of (a) the nature and quality (strengths and weaknesses) of accounting information, (b) how to proceed in analyzing and interpreting accounting information, and (c) numerous other aspects of financial and managerial accounting. This course is an important background course for all business majors, as well as for numerous non-business majors.", "prerequisite": "MATH 21", "other": ["Honors"]}, {"course_name": "ACCTG 296: Independent Studies", "department": "Accounting (ACCTG)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "ACCTG 297: Special Topics", "department": "Accounting (ACCTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ACCTG 299: Foreign Studies", "department": "Accounting (ACCTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ACCTG 305: Financial Statements and Management Decisions", "department": "Accounting (ACCTG)", "credits": "4 Credits", "description": "Impact of management's financing, investing, and operating decisions on GAAP- based financial statements. This course is a one-semester condensed version of the traditional two-semester intermediate accounting sequence (ACCTG 371 or 471; and 472) intended for the non-accounting major. Students who have passed ACCTG 371 or 471; and 472 may not take this course for credit. It is a required course for the Finance major. Students will gain a fundamental understanding of the information conveyed in the financial statements and, as a result, develop an appreciation for its usefulness and limitations in decision making. They will also develop the prerequisite knowledge base necessary to conduct financial statement analysis as required in Level I of the Chartered Financial Analyst (CFA) exam. A financial statement user decision-making perspective, rather than the accountant/preparer approach found in the traditional intermediate accounting sequence, is emphasized. Student success in meeting the learning objectives will be assessed through a combination of exams, quizzes, assigned homework problems, and participation. The comprehensive final exam will test the student's comprehension of the relevant material.", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 310: Federal Taxation I", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Study of income determination concepts for individuals and corporations, impact of taxation on decisions, elementary research techniques, and ethical standards. ACCTG 310 Principles of Taxation (3) This course is directed to the study of concepts relative to: (a) the determination of taxable income and tax liability, (b) the influence of tax considerations on the decisions of taxpayers, and (c) elementary tax research techniques. Primary emphasis is given to concepts that are fundamental to the federal taxation of income with respect to business entities. Also, basic aspects of the taxation of individuals are introduced.The objectives of this course are to enable students to do the following: 1) apply basic tax rules and regulations to compute the taxable income and federal income tax liability for corporate and individual taxpayers, 2) incorporate tax costs and tax benefits into calculations of the net present value of cash inflows and outflows from taxable activities, 3) recognize tax planning opportunities or problems inherent in common transactions, and 4) appreciate the impact of the basis of accounting on both tax and financial reporting.Typical topics include sources of authority, structure of an income tax, property transactions, choice of entity, distribution of income, selection of jurisdiction, means of financing, and taxation of individuals. Students should be familiar with basic accounting concepts, should understand the nature of financial instruments, and should be able to apply the concept of present value and future value in estimating cash inflows and outflows.This is a required course for accounting majors and, for many of them, the only tax course that they take. Other students who meet the prerequisite requirements may take this course as an elective. Also, this principles course in taxation is a prerequisite requirement for an advanced course in taxation.Evaluation is based primarily on periodic examinations. No special facilities are required. However, students have on-line access to tax laws and regulations, tax cases, and administrative guidance. This course is generally offered every semester with enrollments of twenty to thirty students per section.", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 311: Accounting Systems and Control", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Introduction to accounting procedures to gather, to aggregate, and to report accounting data to managers and to external readers.  ACCTG 311 Accounting Information Systems (3)This course pertains to the study of accounting information systems as an important part of a firm's total information systems. The accounting cycle, as the key process providing financial information to management, is thoroughly reviewed and documented. Emphasis is given to the importance of computer-based accounting information systems in supporting internal controls and improving financial reporting, asset security and efficiency and effectiveness of performance. Course objectives: 1.) to understand the accounting model and specifically, the accounting cycle within a business entity; 2.) to process business and accounting transactions and complete the accounting cycle within a computer-based accounting information system; 3.) to analyze accounting information and related internal controls within a computer-based accounting information system; 4.) to examine relevant ethical issues; 5.) to gain an appreciation for evolving technology advancements, such as ERP's and e-commerce, and their impact on the accounting cycle and internal controls. This is a prescribed course for majors in Accounting and it serves as a foundation and prerequisite for most 300-level and 400-level accounting courses. Students will be evaluated based on performance on exams, computer-based accounting system project, and periodic homework assignments. Typically, 50% or more of student's grade is based on performance on exams. Course will be taught in either a technology classroom with computers for all students or periodic sessions in the computer lab. [Students will require consistent access to a computer to complete computer-based accounting system project].", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 312: Accounting Technology Lab", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Hands-on course to teach accounting software, applications of spreadsheets and databases in accounting, and surveying of underlying database theory.  ACCTG 312 Accounting Technology Lab (3) This is a hands-on course to teach accounting software, applications of spreadsheets and databases in accounting, and surveying of underlying database theory .", "prerequisite": "ACCTG 305"}, {"course_name": "ACCTG 340: Cost Accounting", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Accounting for manufacturing concerns; actual and standard cost systems, and managerial uses of cost data.", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 371: Intermediate Accounting I", "department": "Accounting (ACCTG)", "credits": "4 Credits", "description": "Financial accounting methods, theory and concepts; analysis of problems in applying concepts to financial statements and asset accounts.", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 397: Special Topics", "department": "Accounting (ACCTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "ACCTG 399: Foreign Studies", "department": "Accounting (ACCTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ACCTG 403: Auditing", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Financial compliance, internal, and operational audits; standards and procedures; sampling; EDP auditing; professional issues; application of concepts through written responses.  ACCTG 403 Auditing (3)Financial statement, regulatory and contract compliance, internal and operational audits, professional standards and ethical conduct; statistical and judgmental sampling; the audit-impact of information technology; audit risk and internal control structure evaluation; application of procedures in transaction cycles; audit reporting; professional issues.", "prerequisite": "ACCTG 371"}, {"course_name": "ACCTG 403W: Auditing", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Financial, compliance, internal, and operational audits; standards and procedures; sampling; EDP auditing; professional issues; application of concepts through written responses.  ACCTG 403W Auditing (3) Financial statement, regulatory and contract compliance, internal and operational audits, professional standards and ethical conduct; statistical and judgmental sampling; the audit-impact of information technology; audit risk and internal control structure evaluation; application of procedures in transaction cycles; audit reporting; professional issues.", "prerequisite": "ACCTG 371", "other": ["Writing Across the Curriculum"]}, {"course_name": "ACCTG 404: Managerial Accounting: Economic Perspective", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Accounting techniques as planning, control, and motivating devices in business and other organizations; accounting data for decision making and performance evaluation. ACCTG 404 Managerial Accounting (3) This course emphasizes the use of accounting information for internal purposes as opposed to the external disclosure focus of the financial accounting course. The cost covers the vocabulary and mechanics of cost accounting and the design of management accounting systems for planning and controlling operations, and for motivating personnel. The course integrates accounting with ideas from data analysis, decision analysis, finance, microeconomics, and operations management. The themes stressed throughout the course will be the notion that information is costly; the circumstances that necessitate cost allocation, the idea that different costs and different allocation schemes apply for different purposes; and fundamentals of incentive and compensation plans. Among the topics covered are cost behavior, cost-volume analysis, relevant costs, and the use of cost information for decision making. The course will rely on lectures and discussion of case studies.", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 405: Principles of Taxation I", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Elements of tax policy and tax-planning concepts for personal and business decision making; with emphasis on taxation of individuals.  ACCTG 405 Principles of Taxation (3) Introduction to Taxation, is the first course that undergraduate accounting majors take that is devoted entirely to taxation. Although the course is intended for accounting majors, the content is relevant to finance majors seeking elective courses. The objective of the course is to provide students with a basic understanding of the concepts, terminology, and decision-making skills specific to the discipline of taxation that are germane to the professional development of those preparing for a career in accounting. Although the course surveys the many forms of taxation that are found in industrialized societies, and the comparisons thereof, the main focus is on the federal income taxation of individuals. However, coverage is provided regarding the manner in which the taxation of individuals relates to corporate and partnership entities. ACCTG 405 is related to other accounting courses through its coverage of income concepts, and micro-economic principles. The former compares differences in the measurement of financial accounting income with the manner in which income is determined according to the tax laws. The latter emphasizes business decision-making principles that are important in the managerial portion of the accounting program. The course covers topics that illustrate fundamental tax strategies and how such enable taxpayers to achieve business and personal economic objectives. The assessment process in ACCTG 405 incorporates examinations, homework assignments, and individual and group projects. The exams are combinations of objective questions and open-ended problems. Exams are often given in the evening. Course learning aids include a text book, on-line tax research services, spreadsheet software, and a packet of handouts prepared by instructors to keep the classes updated on the many changes in the tax laws that occur each year.", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 406: Principles of Taxation II", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Impact of federal tax structure on business decisions, research methodology, tax planning; ethical considerations of tax practice.", "prerequisite": "ACCTG 405"}, {"course_name": "ACCTG 410: Federal Taxation II", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "An examination of the rules and forms used to compute the federal tax liability of corporations and partners.", "prerequisite": "ACCTG 310"}, {"course_name": "ACCTG 411: Accounting Practicum:  VITA", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Introduces students to practical aspects of tax preparation through the IRS' VITA program and completion of a tax research project.", "prerequisite": "ACCTG 310"}, {"course_name": "ACCTG 417: Corporate and Managerial Communication", "department": "Accounting (ACCTG)", "credits": "2-3 Credits", "description": "Developing student's expertise in interpreting and communicating accounting and financial information to business professionals.  ACCTG 417 Corporate and Managerial Communication (2-3) This course provides an opportunity for business students to develop oral, graphic, and written communication skills essential to success in a corporate environment, with emphasis on corporate accounting, finance, and/or consulting contexts. The course provides a framework for understanding the characteristics of effective business communication. It further provides guidelines for the successful development and delivery of professional messages. This course employs individual and team activities designed to strengthen skills in the development and delivery of corporate messages. Participants will gain experience analyzing and discussing financial and accounting data, evaluate and prepare professional responses to corporate problems/opportunities, and develop strategies for conversing with multiple business audiences. Specific selection of topics will evolve to reflect current issues in business, finance, and accounting.", "prerequisite": "CAS 100"}, {"course_name": "ACCTG 422: Accounting Systems", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Understanding flow and documentation of accounting information and internal controls in the context of accounting cycles. ACCTG 422 Accounting Systems (3) This course primarily investigates accounting transactions cycles-processes and procedures by which an organization's financial information is recorded, processed, reported, and disposed of. The processes covered in this course range from manual to fully automated and Web-enabled systems. The documentation and analysis of the accounting cycles for the revenue, expenditure, conversion, and managerial reporting areas are explored via flowcharts and narrative descriptions. The concepts of files, transaction updates, editing, and reporting in the automated accounting systems are explored. The course also covers internal controls in the manual and automated systems. Additional topics may include fraud examination, applicable laws and regulations, and computerized auditing.", "prerequisite": "ACCTG 312"}, {"course_name": "ACCTG 423: Accounting Data Analytics", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "This course focuses on helping students develop data analytic skills using accounting data. Data has proliferated in business and managers and accountants need to understand the implications for decision-making and tap into the data to provide better insights into a firm/client/customer/supplier. This course is intended to provide students with an understanding of data analytic thinking and terminology as well as hands-on experience with data analytics tools and techniques. It is designed to help accounting students develop an analytical mindset and link data analytics to four major subdomains of accounting (i.e., financial, managerial, audit, and tax). It will cover how to use programming software to automate data analytic tasks. Students will learn how to analyze large amounts of data to find actionable insights. The first half of the course introduces the accounting data analytics framework. Under this framework, students will learn the importance of assembling accounting data, the desirable characteristics of data for effective calculations and visualization, and analysis and interpretation of fundamental data analytic tools, such as regressions. The second half of the course focuses on how to apply data analytic skills to the four major subdomains of accounting: financial, managerial, audit, and tax. Respective hands-on examples will be used for demonstration. Students should leave this course with the skills necessary to translate accounting and business problems into actionable proposals that they can competently present to managers and data scientists.", "prerequisite": "ACCTG 471"}, {"course_name": "ACCTG 426: Financial Statement Analysis", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "The exploration of conventional and advanced methods of analyzing financial statements, including the assessment of earnings quality. ACCTG 426 Financial Statement Analysis (3) The objective of this course is to explore conventional and advanced analytical methods of analyzing financial statements. Expanding on the material covered in the principles of accounting and principles of finance courses and using actual financial statements, students: review and apply the traditional methods for analyzing financial statements, such as ratio analysis, trend analysis, and common-size analysis, apply advanced tools for analyzing financial statements, such as financial distress prediction models and earning manipulation prediction models, and evaluate accounting policies and disclosures and their impact on the financial statements through the assessment of earnings quality.", "prerequisite": "FIN 301"}, {"course_name": "ACCTG 431: Advanced Auditing", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Examination of legal liability, EDP, statistical sampling, SEC reporting, internal control, and financial reporting in specialized industries.", "prerequisite": "ACCTG 403"}, {"course_name": "ACCTG 432: Accounting Information Systems", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Accounting data are utilized as information in making decisions and as a control mechanism. The focus of this course, however, will be upon the actual production of accounting data. The purpose of the course is to learn how accountants collect relevant data and transform them into reports appropriate for managers and external readers. Procedural details will focus first on the traditional accounting cycle and the journal entries for business transactions and events. Then we shall examine in detail the principle accounting cycles: sales cycle, cash receipts cycle, purchases cycle, cash disbursements cycle, payroll cycle, facilities cycle, general ledger cycle, production cycle. For each cycle, you should be able to explain the relation of the accounting process to the business enterprise, the basic journal entries, the basic internal control features, and the document flow.", "prerequisite": "ACCTG 371"}, {"course_name": "ACCTG 440: Advanced Management Accounting", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Management accounting topics such as decision models, quantitative techniques, variance analysis, and their use in accounting.  ACCTG 440 Advanced Management Accounting (3) An in-depth examination of accounting techniques used within modern organizations. The course is designed for students interested in pursuing careers in corporate accounting or financial management. The portfolio of managerial accounting procedures, including cost measurement and allocation, budgeting practices, transfer pricing, and variance analyses appropriate to an organization's unique circumstances are derived. The student will learn to apply psychological and sociological theories of behavior to practical problems of control and to apply quantitative methods and models to managerial decision-making. Other topics covered by the course may include, financial management of working capital, long-term assets and liabilities; techniques for managing inventory; and strategic cost management including inter-organizational cost management.", "prerequisite": "ACCTG 340"}, {"course_name": "ACCTG 450: Advanced Accounting", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Accounting theory and practice for business combinations, branches, international operations, partnerships, consolidated financial statements, corporate liquidations, nonprofit organizations, estates, and trusts.", "prerequisite": "ACCTG 472"}, {"course_name": "ACCTG 461: International Accounting", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Study of international accounting issues with emphasis on need, use, and interpretation of financial accounting required in global business environment.", "prerequisite": "ACCTG 471", "other": ["International Cultures (IL)"]}, {"course_name": "ACCTG 462: Governmental and Not-for-Profit Accounting", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Provides an understanding of governmental and not-for-profit accounting theory, procedures, and financial statements.", "prerequisite": "ACCTG 311"}, {"course_name": "ACCTG 471: Intermediate Financial Accounting I", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Theory and practice issues in income concepts and value measurement; GAAP; revenues, costs, assets, liabilities, and equities. ACCTG 471 Intermediate Accounting I (3) This course provides students with an understanding of generally accepted accounting principles and procedures so that they properly account for and present information in financial statements prepared for external users. The student should acquire a complete understanding of the accounting issues relating to cash, receivables, inventory, plant assets, natural resources, and intangibles. The student should be able to evaluate alternative accounting methods and choose the methods which will best convey the financial information related to the above areas. The student should be able to apply appropriate generally accepted accounting principles and procedures to account for transactions related to the above asset areas. The student should be able to demonstrate an understanding of the transaction analysis, recording, classification, summarization, and reporting procedures in the accounting cycle, and an understanding of the information contained in the financial statements. Finally, student should be able to demonstrate written communication skills required of accountants.", "prerequisite": "ACCTG 211"}, {"course_name": "ACCTG 472: Intermediate Financial Accounting II", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Off-balance-sheet financing; special issues in cost capitalization, liabilities, and equities; matching; funds flow statements; statement analysis; inflation accounting.", "prerequisite": "ACCTG 371"}, {"course_name": "ACCTG 473: Advanced Financial Accounting", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Reporting for multi-corporate enterprises, business combinations, quasi- reorganizations, and selected contemporary reporting problems. ACCTG 473 Advanced Financial Accounting (3) This course explores four major topics: accounting for business combinations, introduction to derivatives and special purpose entities, accounting for foreign currency transactions and consolidating foreign subsidiaries, and ethics and policy issues for the profession.", "prerequisite": "ACCTG 472"}, {"course_name": "ACCTG 481: Financial Statement Analysis: Accounting Based Evaluation and Decision     Making", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "An accounting based evaluation and decision making approach to analyzing financial statements by studying business and firm valuation. ACCTG 481 Financial Statement Analysis (3) The proposed course in financial statement analysis is structured to improve the student's ability to extract and interpret information from actual financial statements and to expose the student to how financial statement information is integrated into equity valuation and credit analysis. The course would not only rely upon textbook-based and lecture-based learning, but also emphasize case-based learning.The course will consist of two main sections. The first will deal with accounting and business analysis. This part will explore the types of financial information data typically available for publicly traded companies and introduce a model of the economic drivers of company performance. It would incorporate some technical accounting as well as some standards business economics/strategy concepts. Students will be forced to recast financial statements that they believe do not reflect the underlying economic state of the company. Financial reporting issues relating to revenue and expense recognition, leases and consolidations will be discussed.The other section of the course will deal with firm valuation. Students would be exposed to some standard approaches to equity valuation and the analysis activities underlying these approaches. Aspects of valuation that would be covered in this section of the course are financial ratio analysis, forecasting, pro-forma statements, cost of capital and valuation methods.The course will rely on lectures and extensive use of case studies.", "prerequisite": "ACCTG 472"}, {"course_name": "ACCTG 483: Forensic Accounting", "department": "Accounting (ACCTG)", "credits": "3 Credits", "description": "Study of investigative accounting, consulting and litigation support activities undertaken in forensic accounting engagements.  ACCTG 483 Forensic Accounting (3) ACCTG 483 is the exploration of the broad discipline known as \"forensic accounting\" which includes a variety of investigative accounting, valuation, damage assessment and litigation support services. Forensic accounting is an evolving discipline which is distinguished from assurance services in that it does not involve reporting on the fairness of financial statements. It generally involves the investigation and analysis of financial data for some specific purpose - obtaining an in-depth understanding of information that enables the forensic accountant to prove, disprove or at least confidently speculate about allegations related to the information and to report those findings objectively. Forensic accountants are involved in presenting analyses that might be valuable for such things as settling legal disputes, calculating economic damages, valuing intellectual property, determining the extent of damage or loss due to fraud, or tracing elusive assets or revenue sources. A forensic accountant might also participate in pro-active engagements such as the development of systems and procedures to prevent fraud. The first part of the course deals with the technical and ethical framework of forensic accounting and focuses on the understanding of forensic and investigative accounting including investigation methodology, the nature of fraud, fraud risk factors, financial statement fraud, litigation support and dispute resolution services and development of the skills needed in those professional activities. These skills include the ability to integrate knowledge of accounting, finance, economics, business law and other business disciplines in gathering, analyzing and evaluating evidence and drawing conclusions. The second part of the course focuses on forensic accounting investigation and analysis of financial information in connection with litigation, dispute resolution, estimation of economic damages, or other specific objectives, and the preparation of comprehensive, objective reports of findings and conclusions.", "prerequisite": "ACCTG 472"}, {"course_name": "ACCTG 494: Research Project", "department": "Accounting (ACCTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "ACCTG 494H: Research Project", "department": "Accounting (ACCTG)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised student activities on research projects identified on an individual or small-group basis. ACCTG 494H Research Project (1-6) ACCTG 494H, Senior Honors Thesis in Accounting - Investigation of an original problem area associated with accounting, including literature review. A thesis topic must be approved and a thesis supervisor must be identified before the course may be scheduled. Students sign up for three credits in each of their last two semesters for a total of six credits.", "other": ["Honors"]}, {"course_name": "ACCTG 495: Internship", "department": "Accounting (ACCTG)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Full-Time Equivalent Course"]}, {"course_name": "ACCTG 496: Independent Studies", "department": "Accounting (ACCTG)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "ACCTG 497: Special Topics", "department": "Accounting (ACCTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ACCTG 498: Special Topics", "department": "Accounting (ACCTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.      ."}, {"course_name": "ACCTG 499: Foreign Studies", "department": "Accounting (ACCTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]