[{"course_name": "ANTH 1: Understanding Humans", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 1 tells the story of humankind, how we as a species developed, and how modern Homo sapiens have developed more cultural complexity over time, moving, in the last 12,000 years, from a worldwide small population of hunter-foragers to a population so large that it strains the planet's resources, with nation-states competing for the loyalty of their citizens with powerful ethnic and religious enclaves and also with global corporations. All of these trends -- biological, demographic, and cultural -- are viewed from the perspective of evolution away from our earliest human patterns, toward the effects of demographic density and sociocultural complexity. The course takes a question-oriented approach to show the relevance of anthropology in today's world. Lectures are structured around what it means to be human -- from a perspective of either biological anthropology, sociocultural anthropology, archaeology, or linguistics. Overall the course has three main goals: 1) provide an introduction to anthropology's subject matter, human cultural and physical characteristics, throughout our species' geographical and chronological range; 2) introduce students to some of the biological, ethnographic, archaeological, and linguistic methods that anthropologists rely on to reach their conclusions; and 3) impart a framework of knowledge that will facilitate understanding of one's own place in human history, in the larger culture, community, family, and household.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 2N: World Archaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 2N (World Archaeology) introduces students to the concepts and evidence used in understanding the development of cultural diversity on our planet. This course provides an interdisciplinary overview of the major developments in the early human past. Beginning with hominid tool-users, this course tracks the evolution and eventual spread of humans to all corners of the earth, Ice Age hunter-gatherers, the origins of art, the origins of agriculture and settled village life, and the rise and fall of complex urban civilizations. Through cross-cultural comparisons of indigenous cultures of the past and anthropological theory, students are exposed to topics such as the origins of gender differences in the division of labor, the role of ideology in cultural adaptation, differential access to technologies, economic production, artistic expression, the origins of social inequality, the ways that symbolic representation in the past shaped the nature of shared meaning and values, and the mechanisms of cultural change. ANTH 2N provides a unique perspective for understanding our increasingly complex and diverse contemporary world. Specifically, students will learn 1) archaeological approaches for identifying variability in the development of cultural systems; 2) anthropological concepts and archaeological evidence used to evaluate factors that shape the diversity of past cultural systems; and 3) the tools to explore the dynamic interaction between scientific process, reconstruction of past cultures, and current issues facing societies in an ever-changing world. The course also emphasizes ethical considerations within archaeology to illustrate the role of representations, values, norms, and traditions on reconstructions of past human societies. ANTH 2N fulfills 3 credits of the General Education Integrative Studies requirements by integrating two General Education Domain fields: the Social and Behavioral Sciences (GS) and the Humanities (GH). Students develop competency for combining knowledge across different domains and interpreting the past human experience in light of current issues and concerns. Students thus gain skills in evaluating their own values relative to the deep history of the human past and different ways for structuring and understanding the world. The course also fulfills an International Cultures (IL) requirement by providing an informed perspective on human cultural and behavioral diversity in the past. To achieve these educational objectives, ANTH 2N draws on multiple teaching formats and resources, including classroom lectures, hands-on labs, and readings from a textbook. Students are evaluated based on two exams and their participation and two quizzes in lab section. ANTH 2N is offered every semester.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 8: Aztec, Inca, Maya", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 8 is a comparative survey of the development of the pre-Columbian Latin American civilizations. It is a general survey of three of the great complex societies of the New World - the Aztec and the Maya of Mesoamerica (Southern Mexico and Northern Central America), and the Inca of the Central Andes of South America. Both the Aztec and the Inca empires were thriving in the 16th century when Europeans arrived, and are known almost completely from ethnographic information such as oral and written records. The Classic Maya were much earlier (AD 250-900), and are known primarily through archaeological research, but also through the lens of the New World's only sophisticated writing system. The course informs students about the methods of archaeology and places these cultures in a broader comparative perspective. By studying archaeological evidence from several sites we will address a few important theoretical issues in archaeology. These issues include: 1) the relationship between people, the environment, and social organization 2) the study of elites and commoners in archaeological cultures, and 3) the use of historical and archaeological data in reconstructing the past. Throughout the semester we will also examine varied lines of evidence, including archaeological artifacts, human remains, architecture, murals, sculpture, and historical texts (esp. codices and colonial accounts) to assess the role of evidence and theory in how we conceptualize the past. The information presented emphasizes the nature of these societies, analysis and interpretation of their basic institutions, religions, world views, as well as their culture histories. Central to the presentation is the degree to which modern Latin American cultures and populations have deep cultural and biological roots in the Pre-Columbian past, and many ethnographic models are discussed. Within the context of each segment, sociological concepts such as institutions, households, stratification, political economy, urbanization, and a host of others are used as organizing features. Issues of gender, ethnicity, and class structure are also discussed. Issues such as the peopling of the Americas, the origins of agriculture, and other Mesoamerican cultures are also reviewed.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 9N: Rise of Civilization in the Old World", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 9N introduces students to the anthropology of early complex societies in the Old World, with an emphasis on the civilizations of Mesopotamia, Egypt, the Indus Valley and China. Course information emphasizes the nature of these societies, analysis and interpretation of their basic institutions, their religions and world views, and their culture histories. Within the context of each segment sociological concepts such as \"institution\", \"household\", \"stratification\", \"political economy\", \"urbanization\", and a host of others are used as organizing features. Issues of gender, ethnicity, and class structure are also discussed, and much information is presented in weeks 2 and 3 that is pertinent to an understanding of human biological variation and our cultural attitudes toward it, with obvious implications for issues of race. The course is much broader, however, in that it attempts to place the emergence of these ancient civilizations into the overall perspective of the larger evolutionary career of the human species in the Old World, including human biological and cultural evolution during the later stages of the Paleolithic, the origins and spread of early agriculture, etc. During the first part of the course there is also a series of introductory lectures designed to inform students about what archaeology is and how prehistoric archaeologists carry out scientific research to reconstruct and explain what happened in the past. A great deal of emphasis is placed on ideas, concepts, and theories used by anthropological archaeologists to design and interpret their research and to explore not only what happened in the past, but to develop ideas about why things happened as well. Also included are lectures about archaeological finds or issues that have been particularly well publicized and about which students often express considerable curiosity. The main objectives are a) to expose students to a series of historically significant non-modern, non-Western societies and cultures using overtly evolutionary, behavioral, and sociological perspectives; b) to enlighten students concerning the kinds of extant information that are available for these societies, how research is designed to acquire new data, and how scholar's interpret these data, and c) to stress the nature of the agrarian human condition out of which modern societies so recently emerged, and under which people in many developing societies still live. Central to the latter are issues of subsistence agriculture and human demography. Central to ANTH 9 are comparisons among several great Old World civilizations, comparisons with other world civilizations and cultures, and comparisons with modern society.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 11: North American Archaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "The story of the indigenous peoples of North America and its parallels with developments elsewhere in the world have captured the imaginations of many people over the years. But it takes more than imagination to explore this saga -- it takes the careful application of archaeology. This course surveys the archaeology of North America, including Mexico. The archaeological history of North American Indians is traced from their origins in Eurasia over 14,000 years ago into the period of European colonization. An ecological approach is taken to the examination of all major regions of the continent. The Eastern Woodlands coverage will include the many burial mound and temple mound cultures of the region. The objectives of the course are to familiarize students with the wide range of human adaptations that prevailed over time and space, to link the evolution of those adaptations to the surviving descendant native cultures of North America, and to provide students with a framework for understanding the many archaeological sites that are open to the public across the United States, Canada, and Mexico. A secondary objective of the course is to familiarize students with the techniques and methods archaeologists use to test hypotheses using archaeological data. The course takes an explicitly scientific approach to the subject, one that is based upon well-established evolutionary and ecological theory and is also firmly grounded in the evidence. The course makes extensive use of images of sites and artifacts as well as other graphics that are necessary for a comprehensive understanding of the subject. ANTH 11 fulfills both US and IL requirements. The course is structured to cultivate students¿ understanding of the similarities and differences among past Native American cultures of North America. Additional international focus is provided through exploration of the archaeological evidence for indigenous cultural traditions in locations within present-day Canada (Arctic, Iroquoians) and Mexico (Archaic, Classic, Post-Classic periods). The course fulfills the IL designation by introducing students to cultural and behavioral variation and cultural achievements of indigenous North Americans. In addition, the course fulfills the US designation by interweaving discussion of the significant influence and impact of Native American history/culture on the history and development of the United States. The ethics associated with North American archaeology and their impact on US culture and cultural perception are also explored.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 21: Introductory Biological Anthropology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 21 (Introductory Biological Anthropology) is designed to introduce students to the fundamental principles and findings of human evolutionary biology. This course provides an overview of current data and theory related to biological variability among living and past human populations and among the extensive fossils that document human evolution. Through comparisons between humans and other mammals, particularly the living nonhuman primates, this course provides an essential comparative zoological perspective with which we can understand the origins, evolution, and diversity of our species. The course is structured around the theory of evolution, the unifying concept of biological anthropology. Throughout the course, students will be introduced to evolutionary theory as well as to the mechanisms of evolution and their relevance for understanding variation in past and present human populations. The course covers current research and topics in human evolutionary biology including evolutionary theory, natural selection, molecular and population genetics, human variation, human biology, primate diversity and behavior, and the paleontological record of human evolution. This course not only introduces students to the core concepts within the field of Biological Anthropology, but also provides a rich foundation for understanding the human condition from a biological and anthropological perspective. By the end of the course, students will be able to 1) explain the theory of evolution and the mechanisms underlying this process; 2) discuss human variation and human biology within the context of primate diversity and adaptations; 3) describe the major behavioral and morphological trends over the course of human evolutionary history and how they relate to modern human diversity. ANTH 21 is one of three core courses required of majors and minors in the Department of Anthropology and can also be used to fulfill three credits of General Education in the Natural Sciences. The course consists of two lectures and one lab section per week. Lab exercises and hands-on demonstrations help students understand the principles and findings of biological anthropology. Brief written lab exercises foster interactive learning.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 22: Humans as Primates", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Humans as Primates is intended to introduce the student to the biological bases of human anatomy and behavior by drawing comparisons to the behavior and biology of our closest living relatives, the non-human primates. The principal goal of the course is to critically evaluate arguments concerning what uniquely makes us human and the role of genetics, environment, and evolutionary history on the development of human behavior and anatomy. The course will draw heavily on studies of living non-human primates as well as evolutionary theory, paleoanthropology, and evolutionary psychology to address issues such as human growth and development, dietary adaptations, human variation, human communication, intelligence, reproduction, violence and aggression, and culture. Humans as Primates is divided into four main thematic units each designed to present a set of related lessons exploring the role of biology in various aspects of human life. The first unit provides the foundation for the course by introducing the place of humans in the natural world. This unit presents a survey of living primates and their relationship to humans as well as an overview of evolutionary processes and human evolution. The other units present topics in human biology, communication, and social behavior focusing specifically on topics of importance to current events and aspects of popular culture and modern life. This course should be of significant interest to students in a diversity of disciplines including the biological and social sciences as well as anyone interested in human behavior. The course can be used to fulfill three credits of General Education in the Natural Sciences (GN). As such this course will help students understand how scientific information from a variety of disciplines can be used to investigate and understand human biology and behavior. The course will introduce the student to methods of data collection and analysis, foster critical thinking skills, and provide a rich background for understanding human diversity, human biology, and behavior. Students will have the opportunity to synthesize information from a broad range of disciplines to develop a fuller understanding of the biological basis of human behavior.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "ANTH 40: Biocultural Evolution", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Examination of evolutionary models of the development of the human capacity for culture, and of culture as an adaptive mechanism.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 40Q: Biocultural Evolution", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Are we \"stuck\" with prehistoric genes in a rapidly changing ecological and cultural environment? What does our evolutionary history really tell us about human nature, health, and well-being? To answer these questions, we must explore the complex interplay between human biology and culture in shaping the human species throughout our evolutionary history - our biocultural evolution. This course is about how we shape our biology, perhaps just as much as it shapes us. Each week, we will explore key topics in human evolution from a biocultural perspective. Through this lens, we will learn how human evolutionary biology shapes our diet, physical activity, reproduction, diseases, and our capacity for culture. In turn, we also examine how our culture has shaped our biological capacities and limitations. Through these explorations, students will critically examine the processes and outcomes of biocultural evolution, including feedbacks between our biology and culture, and the timescales at which evolution occurs.", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 45N: Cultural Diversity: A Global Perspective", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 45N (Cultural Diversity: A Global Perspective) is designed to introduce students to the concepts and evidence used in understanding the cultural diversity of our planet. \"Culture\" can be defined as a socially transmitted system of shared conventions, beliefs, practices, and behavior. Cultural systems vary across time and space, and dynamic cultural processes are involved in how humans interact with each other, other organisms, and the environment. This class provides students with the tools to approach questions about the diversity of human cultures, how they vary across different societies, how different people experience and represent social worlds, why they change, and the importance of understanding such variability for the global challenges we face in an ever-changing world. Anthropology takes as its subject the entirety of the human experience, in all of its diversity through time and space. Anthropology thus provides a unique perspective for understanding our increasingly complex and diverse contemporary world. Specifically, ANTH 45N has three goals: 1) Introduce students to anthropological approaches for describing variability in systems of shared human thought, belief, and social practice. 2) Utilize anthropological concepts and evidence to evaluate factors that shape the diversity of cultural systems over time and space. 3) Provide students the opportunity to explore the dynamic interaction between contemporary cultural systems, histories of change, and the physical environment. ANTH 45N is designed to integrate two General Education Domain fields: the Social and Behavioral Sciences (GS) and the Humanities (GH). The course integrates different methods of inquiry and different forms of knowledge about the many factors that interact to influence patterns of convention, practice, and diverse ways of life. ANTH 45N enables students to develop competency for integrating knowledge across different domains and interpreting the human experience through multiple social, historical, and environmental perspectives. Students thus gain skills in evaluating their own values relative to the broad context of diverse ways for understanding the world. To achieve these educational objectives, ANTH 45N draws on multiple teaching formats and resources, including classroom lectures and discussions, readings from general textbooks and primary literature, critical analysis of ethnographic film, and online written materials and podcasts.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 45Q: Cultural Diversity: A Global Perspective", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 45Q (Cultural Diversity: A Global Perspective) is designed to introduce students to the concepts and evidence used in understanding the cultural diversity of our planet. \"Culture\" can be defined as a socially transmitted system of shared conventions, beliefs, practices, and behavior. Cultural systems vary across time and space, and dynamic cultural processes are involved in how humans interact with each other, other organisms, and the environment. This class provides students with the tools to approach questions about the diversity of human cultures, how they vary across different societies, how different people experience and represent social worlds, why they change, and the importance of understanding such variability for the global challenges we face in an ever-changing world. Anthropology takes as its subject the entirety of the human experience, in all of its diversity through time and space. Anthropology thus provides a unique perspective for understanding our increasingly complex and diverse contemporary world. Specifically, ANTH 45Q has three goals: 1) Introduce students to anthropological approaches for describing variability in systems of shared human thought, belief, and social practice. 2) Utilize anthropological concepts and evidence to evaluate factors that shape the diversity of cultural systems over time and space. 3) Provide students the opportunity to explore the dynamic interaction between contemporary cultural systems, histories of change, and the physical environment. ANTH 45Q is designed to integrate two General Education Domain fields: the Social and Behavioral Sciences (GS) and the Humanities (GH). The course integrates different methods of inquiry and different forms of knowledge about the many factors that interact to influence patterns of convention, practice, and diverse ways of life. ANTH 45Q enables students to develop competency for integrating knowledge across different domains and interpreting the human experience through multiple social, historical, and environmental perspectives. Students thus gain skills in evaluating their own values relative to the broad context of diverse ways for understanding the world. To achieve these educational objectives, ANTH 45Q draws on multiple teaching formats and resources, including classroom lectures and discussions, readings from general textbooks and primary literature, critical analysis of ethnographic film, and online written materials and podcasts.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 60N: Society and Cultures in Modern Israel", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Israel is often portrayed in media and popular society in incomplete or distorted terms. In some cases, it is presented as a troubled, violent, dangerous place, as a place permeated by long-standing hatred between Jews and Muslims, Israelis and Arabs, Israelis and Palestinians. In others, the focus is on the state's role as the center of Judsiam--a home of the \"chosen people\" and the source of inspiration for one of the world's great monotheistic religions. Some present it as a model for how a democracy can succeed under trying demographic, historic, and geopolitical circumstances. Others frame Israel as a place of conflagration (armageddon) that will usher in a messianic period or as a nation-state with a discriminatory regime that privileges its majority population over its minority and administers oppressive policies over Palestinians in the occupied territories it captured in the 1967 War. While there are elements of truth in each of these presentations, the full picture of Israeli society is much richer and more complex. This course teaches students to cut through the mythology, and develop a more accurate understanding of what Israel is in the 21st century. Since Israel is a culturally, ethnically, and religiously diverse society, it is only possible to understand the true nature of modern Israel through exploring the many sub-groups that comprise the Israeli citizenry. The course looks at Ashkenazi and Mizrahi Jews (both religious and secular), Muslim and Christian Palestinian Arab citizens of Israel, Ethiopian-Israelis, Russian-Israelis, Bedouins, and Druze. For each group, it looks at demographics, background histories, migration patterns, institutions, cultural norms, values, and practices. We will look at what is important to each group, how they see and organize themselves, and how they understand and experience the world around them. The course aims to convey an understanding of the geographic, demographic, and social-historical context in which Israelis live as well as the diversity of Israeli culture. Students will be challenged to be critical readers of Israeli society and the way it is represented and to strive for measured, evidence-based analyses.", "other": ["Cross-listed with: JST 60N, PLSC 60N, SOC 60N", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ANTH 83S: First-Year Seminar in Anthropology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 83S First-Year Seminar in Anthropology meets the Bachelor of Arts degree requirements. This seminar introduces students to anthropology as a scientific discipline with ties to other social and natural sciences. Through active participation in the seminar, students will be exposed to an aspect of anthropology that corresponds to a faculty member's area of expertise. Because students are introduced to cutting edge research, the course content will vary from one semester to the next. Seminar topics highlight current debates in the discipline and the research process. Research design, analytical methods, and sampling issues are covered by having students read and discuss new and controversial developments in anthropology. Strong emphasis is placed on the broader societal significance of scholarly research related to the seminar's principal focus. Student comprehension of topics raised in class will be assessed by classroom participation, exams, and papers. In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them, including the opportunity to develop relationships with faculty and other students who share their academic interests. This seminar fulfills both a first-year seminar requirement and a general education social science requirement for Bachelor of Arts.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 100N: Anthropology of Race and Racism", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Is \"race\" real? This course examines the concepts of race and racism from the perspective of four-field anthropology. Relying on ethnographic, biological, linguistic, and archaeological data, the course will introduce students to what anthropologists know about human diversity, as well as how the concept of \"race\" was developed to classify that diversity and justify social inequality.  The course introduces students to basic concepts of anthropology by highlighting the variability of the race concept across time and space. Students will learn to understand race as a biocultural concept - one that is socially constructed, but that has very real biological and material consequences. In the first section of the course, students will learn why the concept of race does not reflect a natural or biological reality. In the second section of the course, students will gain an understanding of the cultural and interpersonal processes shaping racism and race. The third section explores how and why race and racism are so durable and pernicious in reinforcing structural social inequality. Students will learn how the persistence of racism, racialized structure, and race-thinking affect human well-being, including significant disparities in economic and health outcomes.", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 120: First Farmers", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This class compares the archaeological record of the first farming societies around the world. Beginning ca. 11,000 years ago, people started experimenting with various wild plants and animals in their surroundings through selective propagation and harvesting. These activities eventually resulted in genetically and morphologically distinctive species. Many human societies became dependent on these domesticates, and they still form the bulk of our subsistence today. These changes occurred independently in several regions under varying social, cultural, and environmental conditions. By looking at the archaeological record for the domestication and early farming societies in cross-cultural comparison, we can begin to understand the similarities and differences in the processes that resulted in the emergence and spread of food production. The course introduces students to archaeological and anthropological concepts by viewing cultural groups in ecological and social context, and highlighting the variability of human adaptations. To further illustrate the diversity of farming practices, examples from historic and contemporary ethnography will be studied. Students will gain an appreciation not only of the variety of subsistence adaptations involving domesticates, but also of the time, skill, knowledge, and labor required as a non-industrial food producer. Ethnographic examples also provide an avenue to address the cultural, ritual, and symbolic elements of food production and consumption that are often difficult to see in the archaeological record. Animal and plant husbandry are viewed as sources of food, raw materials, and wealth, and we will examine how farming practices help shape the economic, social, ecological and religious contexts of non-industrialized societies in the past and present. Finally, students will also explore the environmental impacts of different farming techniques and learn about the natural and cultural histories of the foods they eat. The earliest domesticates, such as wheat, rice, corn, potatoes, cows, pigs, chickens, sheep and goats, still provide the bulk of the world population¿s caloric consumption, and relatively few additional plant and animal species have been domesticated more recently. Industrial and globalized food production techniques have limited the genetic diversity of the modern food supply and created new environmental challenges in various parts of the world. This course provides students with an understanding of the origins of their daily foods as well as an appreciation for some of the contemporary challenges in food production.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 129N: Chocolate Worlds", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course will examine the \"world\" of chocolate throughout human history. First cultivated by the ancient peoples of the Americas and then manufactured by Europeans and Pennsylvanians alike, chocolate has played a privileged role as a luxury good. An interdomain course, \"Chocolate Worlds\" is interdisciplinary, taught by faculty in the departments of Plant Science, Anthropology, and History. As a team we investigate the how diverse societies have differentially interacted with this crop. Rather than be organized chronologically, this course will be divided into course Units, such as the history of cocoa uses and cultivation, cocoa plant science and farming issues, chocolate making and markets, and the state of the global chocolate industry. The course's lectures and assigned readings work in concert equally directed by scientific inquiry and the queries of the social sciences and humanities. Assignments will address real world questions relating to contemporary cocoa cultivation and production, and its role in international development and social justice. As a class we will take field trips to sites such as local chocolate manufacturing facilities and cocoa research sites and laboratories. The learning objectives of this course include students' broad knowledge of cacao production, its history, and ethnical issues surrounding its cultivation in today's global economy. Additionally, students will gain an historical appreciation for the role this crop his played in diverse human societies and a scientific understanding of its genetic structure.", "other": ["Cross-listed with: HIST 129N, PLANT 129N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Other Cultures", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 140: Anthropology of Alcohol", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This class provides a lively tour around the world and through the millennia, telling the compelling story of humanity's quest for alcohol. Beginning about 10,000 years ago, humans in China and the Middle East became more sedentary and began to rely more on the food they grew than from hunting and gathering. The cereal grains these early societies relied upon, such as rice, wheat, and barley, soon formed the basis for the first alcoholic beverages. Relying on ethnographic, biological, linguistic, and archaeological data, the course will introduce students to what we now know about how humans created and currently use fermented beverages across cultures. The course introduces students to the basic concepts of anthropology by highlighting the variability of alcohol use through time and space. From the world's first beer in Henan, China in 7000 B.C. to modern breweries in Pennsylvania the class will explore the historical and societal impacts of alcohol production. From the ceremonial use of distilled sugarcane in southern Mexico to ritualized tailgating in the United States, students will be presented with the highly varied ways in which alcohol is consumed. Anthropology of Alcohol provides students with an understanding of the origins of one of the world's earliest and most utilized psychoactive drugs as well as an appreciation for some of the contemporary challenges of alcohol use on college campuses in the US.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 146: Indigenous North America", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course is a review of the indigenous cultures of North America, located north of Mexico. It will cover the cultures that developed just prior to, during, and immediately after contact with non-indigenous explorers and pioneers. The primary themes include (1) the astonishing diversity of ways of life that developed across the North American continent; (2) the exploration of this diversity from the perspective of cultural ecology; and (3) trends of cultural change and continuity that contribute to present-day Native American cultures. Students will also explore the stereotypes that plague a richer understanding of and respect for Native American communities. The course will introduce students to cultures that differ from their own. ANTH 146 meets both United States cultures and International Cultures objectives. Approximately 50% of the course focuses on the indigenous cultures of North America prior to European contact and the later founding of the United States. The course will introduce students to the diversity of cultures that have existed in North America prior the founding of the United States and Canada. Students will develop an understanding of similarities and differences among these non-US cultures and between these indigenous cultures and the culture of the US. Approximately 50% of the course will examine the impact these indigenous cultures have had on the historic and present-day United States culture - such as plant domestication, technological achievements, linguistic influence, and stereotypes.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 150N: Human Nature: The Science of Extreme Altruism and Violence", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Why do humans so readily help strangers in some circumstances and not others? Why does our species have a tragic history of war, genocide, and violence? Just how flexible is our tendency for altruism and violence? Human Nature: The science of extreme altruism and violence surveys and synthesizes two of the most fascinating and unusual features of humans: our extremely high levels of altruism alongside our tragic propensity for violence. Treating humans as both biological and cultural creatures, we use the tools of anthropology, biology, and psychology to explore some of the most vexing questions in the social sciences and humanities. We will consider the role of the brain, hormones, genetics, social context, and evolution in producing the best and worst our species is capable of. While there are no prerequisites, you will gain a foundation in basic neurobiology and behavioral endocrinology alongside familiarity with leading theories of violence and altruism. We will use a combination of lectures, readings, and discussions to understand the science of altruism and violence. Throughout the course, we will use well-known current events and cross-culture case studies to anchor theory in real social contexts. By the end of this course, you will have the tools to evaluate behavior as the product of a complex interaction between biological, physiological, and social structures. You will never look at the world the same again!", "other": ["Cross-listed with: PSYCH 150N", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 150Q: Human Nature: The Science of Extreme Altruism and Violence", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Why do humans so readily help strangers in some circumstances and not others? Why does our species have a tragic history of war, genocide, and violence? Just how flexible is our tendency for altruism and violence? Human Nature: The science of extreme altruism and violence surveys and synthesizes two of the most fascinating and unusual features of humans: our extremely high levels of altruism alongside our tragic propensity for violence. Treating humans as both biological and cultural creatures, we use the tools of anthropology, biology, and psychology to explore some of the most vexing questions in the social sciences and humanities. We will consider the role of the brain, hormones, genetics, social context, and evolution in producing the best and worst our species is capable of. While there are no prerequisites, you will gain a foundation in basic neurobiology and behavioral endocrinology alongside familiarity with leading theories of violence and altruism. We will use a combination of lectures, readings, and discussions to understand the science of altruism and violence. Throughout the course, we will use well-known current events and cross-culture case studies to anchor theory in real social contexts. By the end of this course, you will have the tools to evaluate behavior as the product of a complex interaction between biological, physiological, and social structures. You will never look at the world the same again!", "other": ["Cross-listed with: PSYCH 150Q", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 152: Hunters and Gatherers", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "A comparative study of hunter/gatherer societies using both archaeological and ethnographic evidence.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 176: Sex and Gender: A biosocial and comparative perspective", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course approaches the topic of sex and gender using an interactionist perspective: biological sex is an evolutionary adaptation, and gender is an adaptive social construction, and the two interact and mutually constrain one another. The focus is primarily on gender, the expression of behavior, rather than sexual behavior per se. The content of this course stresses both the common expression of cross-cultural patterns in gender roles and the diversity of those patterns through time and across space, surveying some cultural, biosocial, and evolutionary explanations of such patterning. Topics covered include the evolution of sex and primate perspectives on sex and gender differences, and biosocial aspects of sex and gender in disease and mortality, reproductive physiology and decision-making, subsistence practices, initiation, homosexuality and warfare, and power and politics.", "other": ["International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 197: Special Topics", "department": "Anthropology (ANTH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "ANTH 199: Foreign Studies", "department": "Anthropology (ANTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ANTH 210N: Anthropology, Ancestry, and You", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Anthropology, Ancestry, and You will integrate anthropology and genetics through the exploration of the students' own genealogies and genomic ancestries. Engaging students in the investigation of their own origins will promote learning of science and social science. Instead of a textbook, students will have the opportunity to purchase a commercially available genetic ancestry test after receiving training on the potential risks and benefits of participating in personal genetic testing. This interdomain course will provide an opportunity for students from any major to explore topics including, ethical considerations of genetics research, human evolution and adaptation, DNA and inheritance, race, and identity.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 215: Skin: Evolution, Biology and Culture", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course will explore the evolution and roles of skin and human life, including health, communication, and social wellbeing.  ANTH 215 Skin: Evolution, Biology and Culture (3) (GN) Skin mediates the most important of transactions of human lives because it is our interface with the physical and social environments. Skin is constantly changing and reflects our age, ancestry, and health, while serving as our personal \"billboard.\" In \"Skin,\" students will explore the evolutionary and social histories of human skin, including the changes in structure and function it has undergone in the course of human evolution. Three unique attributes of human skin will be explored at length: 1) functional nakedness and sweatiness; 2) the range of skin's natural colors; and 3) skin as a surface for decoration.The course begins with an overview of the structure and function of human skin and proceeds to an exploration of the comparative biology and evolution of skin in vertebrates, especially nonhuman mammals. Special attention will be paid to the outermost layer of skin, the epidermis. This will lead to a discussion of human hairlessness and sweating, and the role of skin in temperature regulation. Detailed exploration of the evolution of human skin color follows. The key role played by melanin pigmentation in protecting skin from sunlight will be discussed as a prelude to review of the evolution of human pigmentation in human dispersals. Discussion of the role of skin color in human interactions through history follows, including an introduction to the development and manifestations of color-based racism. The importance of skin as the organ of touch and as a vehicle for communication will then be reviewed. This will introduce the subject of skin as a mirror of human emotions, as in anger and blushing. Because aging of skin is one of the most visible signs of aging and is one of the most significant of human preoccupations, this phenomenon will be discussed in detail, and some of the most common skin diseases and problems associated with \"wear and tear\" will be surveyed. Considerable time and discussion will be devoted to skin decoration, with particular attention paid to the use of cosmetics and paints in the establishment of identity and the advertisement of sexuality in individuals, and the importance of tattoos in expressing individuality and group identity. The course will conclude with a speculative investigation of the future of human skin, including the prospects for artificial skin and robotic skin, and the expanding frontiers of skin decoration and communication via remote touch.", "other": ["General Education:  Natural Sciences (GN)"]}, {"course_name": "ANTH 216N: Sex and Evolution", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course introduces students to evolutionary theory and explores its relevance to the anthropological study of human sexuality and sex differences. In doing so, the course draws from in integrates findings from a wide array of disciplines, including evolutionary biology, genetics, neuroscience, endocrinology, behavioral ecology, anthropology, and psychology. After honing their evolutionary skills by investigating reproduction in other species, students will apply evolutionary principles to understanding human mating. Why do we prefer certain characteristics in a mate? How do these preferences differ between and within the sexes, and why? How do mating behaviors vary across cultures, and why are some behaviors more culturally variable than others? Other topics covered include infidelity, sexual jealousy, concealed ovulation, sexual conflict and rape, orgasm, parental care and abuse, and menopause. In understanding the evolutionary basis for a trait, it is helpful to understand its development. Thus, this course also covers the basics of sexual differentiation and investigates how variation in these processes might lead to variation in sexual orientation and gender identity. Students should take away not only a better understanding of human sexuality but also a way of thinking that helps them understand all living things.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 218: Genes, Evolution and Behavior", "department": "Anthropology (ANTH)", "credits": "4 Credits", "description": "This course explores how genes influence our traits and how our traits evolve, with special emphasis on behavior.  ANTH 218 Genes, Evolution and Behavior (4) (GN)Genes, Evolution & Behavior is a science course designed to introduce students to modern genetics and explore the genetic and evolutionary bases for human and nonhuman primate traits, with special focus on behavior. In particular, students will investigate the main features of DNA, genomes, genes and how genetic variation can be associated with both rare Mendelian traits and common traits that vary continuously. That is, we will consider how some traits vary primarily due to genetic variants with relatively large effects, while other traits vary due to differences between individuals in many genes with small effects, along with environmental differences. Students will gain an understanding of human and nonhuman primate behavioral ecology and how the evolutionary forces of mutation, migration, genetic drift and selection shape behaviors and their underlying genes. The approach to the material will be both practical and personalized, as students will be invited to assay their own DNA for particular genetic variants and to measure some of the traits studied (e.g., facial features using 3d photos, voice pitch, skin color, and personality traits) on themselves. During the course of the semester, we will consider how various physical traits such as facial appearance, voice, bitter tasting ability, skin pigmentation, disease risks, and body odor, and behavioral/psychological traits such as diet, territoriality, cooperation, altruism, cognition, mating behaviors and parenting are influenced by genes and shaped by the forces of evolution. Numerous hands-on experiments will be used to help students to visualize the sometimes-abstract methods and concepts occurring on unfamiliar scales of time and size. Students should come away from the course with a basic understanding of modern genetics, how genes influence the characteristics of organisms, and how anatomy, physiology, behavior and their underlying genes evolve. This course has a lab component and thus fulfills lab requirements, as well as serving toward the major and minor in Anthropology.", "other": ["General Education:  Natural Sciences (GN)"]}, {"course_name": "ANTH 219N: Spillover: The Anthropology of Emerging Infectious Diseases", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "We live in a world of increasing global awareness and public anxiety of emerging zoonotic diseases. Why do infections continue to spillover from wildlife to humans? What will the next outbreak be? Where will it emerge? Will it become a pandemic threat? Answering these questions requires exploring how our biology interacts with social, cultural, ecological, and climatic processes to influence the spillover of infections from animals to humans. This course begins with an introduction to human determinants of infectious disease that have persisted since the origins of agriculture, including: changing modes of subsistence and human settlement patterns, environmental transformation, and social inequalities. We will then explore how these processes shape contemporary pathways of zoonotic spillover and have led to the characterization and mapping of infectious disease \"hotspots.\" The course will continue with an overview of emerging zoonoses of global health significance from a biocultural perspective. We will then narrow in on the most salient hosts and transmission pathways, focusing on evolutionary constraints and sociocultural risk factors that shape pathogen host switching. From these examples, we will look critically at the conceptual trends that have shaped our understanding of spillover events as a public health concern, with special attention to synergies and mismatches between locally and publicly perceived health risks. This course emphasizes the value of anthropological approaches in building more holistic and equitable solutions to emerging human health threats, including opportunities for applied anthropology within human health.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 220: Anthropology and Art/ifacts", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course examines anthropological approaches to the study of art works, their production, and function in diverse human societies, both past and present.  ANTH 220 Anthropology and Art/ifacts (3) (GA GH IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the ways in which the discipline of anthropology has used art and artistic production as an interpretive lens, as a means to understand past human action, cultural behaviors and ancient societies as a whole. To take up this topic, the course is divided into five distinct units allowing a thematic and comparative analysis of a variety of human societies. We will critique the conceptual divide between 'art' and 'artifact' focusing on long-standing assumptions about philosophies of aesthetics, derived primarily from early modern European (Renaissance) notions of 'art'. Geographically, the course content has a global reach, but primarily focuses on the artistic production of the Americas, Africa and Oceania, challenging the label of 'primitive' that has historically been applied by modern Western approaches. During the course of the term, we will conduct analyses aimed at elucidating how scholars have used the interpretation of art objects to better understand the complexity of human experience, specifically in regards to categories such as gender, kinship, social hierarchy and cosmology. Each class meeting will consist of a lecture and also a discussion component, primarily focusing on the assigned readings to ensure complete comprehension and relevancy. Students will be evaluated on essays and exams. This course will satisfy general education requirements and provide a base for other courses in anthropology, art history, museum studies and history.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)"]}, {"course_name": "ANTH 221N: Ancient Maya: Sacred Blood & Conjured Serpent", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "The Ancient Maya: Sacred Blood and Conjured Serpent. ANTH 221N Ancient Maya Civilization (3) (GS;GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. Great civilizations emerged independently in several parts of the world beginning about 5500 years ago. Most students have had some exposure to the great Old World civilizations (Mesopotamia, Egypt, China), but know comparatively little about their counterparts in the New World. Among these, the Classic Maya (AD 250-900) are the most familiar, and are heavily featured in popular culture. Many students have (or will) visit Maya sites as tourists, and be impressed by the flamboyant archaeological remains of these ancient people. Despite their visibility, the Maya are widely misunderstood and heavily sensationalized. ANTH 221N traces the development of ancient Maya culture from about 10000 BC through its eventual conquest by the Spaniards in the 16th century. The primary focus will be on the Classic period, when Maya civilization achieved unparalleled heights in architecture, art, astronomy, mathematics, and writing. The course content makes extensive use of images of sites, artifacts, and artwork to introduce and immerse students to the particularities of the Ancient Maya worldview. The Maya were participants in a much wider tradition of complex civilization in the region archaeologists call Mesoamerica, and several lectures will place them in this more general context. A good amount of content in this course will come from research done by members of the Penn State Anthropology Dept., which has a long tradition of Mesoamerican/Maya research since the early 1960s, and has heavily influenced both the study of Mesoamerican societies and complex cultures in general. Content and topics in the course will also situate Maya peoples, both ancient and modern, in relation to important topics in the contemporary world such as environmental sustainability and degradation, ethnic identity, and state formation. This course will fulfill basic BA and GenEd requirements (GS, GH, IL). It may also be used to fulfill an ANTH BA or ANTHS BS additional course requirement.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 222: Archaeology of Domesticated Animals", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Biological, ecological and cultural history of animal domestication.  ANTH 222 Archaeology of Domesticated Animals (3) (GS;IL)(BA) This course meets the Bachelor of Arts degree requirements. Animals were domesticated in a variety of places throughout the world beginning about 12,000 years ago, fundamentally shifting human-animal relationships. Most students have had some exposure to domesticated animals, particularly family pets such as dogs or cats, and some farm animals commonly found in the US. Yet few students know much about the biological, ecological, and cultural history of these animals, the contexts and timing of their domestication, the changing economic and cultural significance of individual species through time, nor economically and culturally important animals in other parts of the world. ANTH 222 will trace the history of domestication of key species: sheep, goat, cow, water buffalo, yak, pig, llama, alpaca, guinea pig, chicken, dog, cat, elephant, camel, horse, donkey, and mule. Emphasis is placed on the biology (genetics, morphology, wild progenitors, ecological niche, breeds) in concert with the cultural contexts in which domestication occurred. Furthermore, students will explore a range of human-animal relationships in regard to these domesticates with examples from archaeology, ethnography, modern US society, and history. This class discusses animals as food, raw materials, wealth, labor, and companions, as well as their economic, social, religious, and environmental impacts in different cultural and ecological settings.", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "ANTH 223N: European Prehistory", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "ANTH 223 (European Prehistory) is designed to introduce students to the concepts and evidence used in understanding the development of cultural diversity on our planet using prehistoric Europe as a case study. This class explores the archaeological record of human societies in Europe from the Upper Palaeolithic to the Iron Age, spanning a 40,000-year period. Many archaeological sites, such as Stonehenge, are widely known but often misunderstood or sensationalized. ANTH 223 traces the history of humans in Europe and provides the cultural, chronological, and environmental contexts to understand these places on the landscape. The class explores the extinction of Neanderthals and Pleistocene animals, the origins of art, the transition to agriculture, the beginnings of metallurgy, and the rise of complex societies. Emphasis is placed on the evidence for subsistence and production, funerary rites, changes in settlement, production of art, symbolism, the role of technology, and emergence of social hierarchies. The course introduces students to archaeological and anthropological concepts by viewing cultural groups in ecological and social context, and highlighting the variability of human adaptations to shifting climates and natural and social environments. It also introduces students to key concepts from the humanities, especially the analysis of systems of visual culture and historic texts, and their integration into reconstructions of past human lifeways. ANTH 223 integrates two General Education Domain fields: the Social and Behavioral Sciences (GS) and the Humanities (GH). The course enables students to develop competency for combining knowledge across different domains, using methods from the social sciences and humanities in concert to create understandings of past lifeways, and interpreting the past human experience in light of current issues and concerns. Students thus gain skills in evaluating their own values relative to the deep history of the human past and different ways for structuring and understanding the world. To achieve these educational objectives, ANTH 223 draws on multiple teaching formats and resources, including classroom lectures, films, and readings from a textbook and additional texts.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 240N: Livelihoods and Ecosystems: Anthropological Approaches to Human-Environment Interaction", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course provides an anthropological understanding of the relationship between human subsistence and environment. The impacts of environmental change on human societies, and the roles those societies play in ecological modification, have deep roots in human evolution. This class focuses on providing students with tools to understand the foundations and cross-cultural expressions of resource use, environmental transformation, and their ecological interactions. The class has three goals: 1) introduce students to ways of thinking about ecological and social factors that shape variability in how humans define, use, and consume resources, 2) provide students the opportunity to explore archaeological, ethnographic, and ecological evidence of the interaction between human livelihoods and habitats across the entirety of the human experience, 3) utilize those concepts and evidence to investigate variability in contemporary livelihoods, socio-ecological systems, and the dilemmas we all face in natural resource use and sustainability. Regarding the first goal, students are introduced to the natural science of conservation biology and community ecology, along with influential concepts in the social science of decision-making and cultural institutions of resource management. We review key models of ecosystem dynamics and social interaction from evolutionary ecology, disturbance ecology, niche construction, common property theory, and political ecology to approach questions about consumption, complex socio-ecological systems, and the role of humans in food webs and trophic interactions. The course then investigates archaeological and paleo-ecological evidence concerning the evolution of human subsistence systems, global settlement, intensification, and their implications for understanding environmental change over the last two million years. We take the broadest possible anthropological approach: we explore the diversity of ways that humans have made a living in the past, and investigate a wide variety of contemporary systems of resource use. We begin with the emergence of subsistence regimes among the earliest members of our genus and variability in environmental conditions through the Pleistocene. We then discuss the spread of modern humans and arguments concerning the ecological impact of people in the New Worlds as humans first colonized Australia, the Americas, and islands of Pacific and Indian Oceans. Finally, students investigate contemporary Indigenous systems of resource use and food production, exploring interactions between people and culturally constructed environments, commensal relationships between humans and non-human plants and animals, processes of intensification, and ecosystem function. The course incorporates these concepts with studies of inequality into new ways of understanding global issues of conservation, economics, and policy impinging on environmental change.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 260: Building the Human Animal", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "An exploration of how the same genetic and developmental properites that shape animal evolution produced the unique human form.  ANTH 260 Building the Human Animal (3) (GN) Honors Building the Human Animal: How do animal bodies adapt to their environment? How is the shape of our bodies encoded in our genes, and how can the same genes be used to make animals as different as a fly and a human? How does evolution create such variety in animal forms? What are the evolutionary pressures that made us human? Can the origins of the human body be seen in less advanced animals? These are questions being asked and answered by the relatively new field of evolutionary and developmental biology (evo-devo). We will investigate these questions and learn how their answers help us better understand human evolutionary history. Readings will include excerpts from three classic and accessible popular science books in conjunction with articles from the primary literature. After a brief introduction into the broad field of Anthropology, we will learn how Darwin developed his theory of Natural Selection and show that evolution can actually be observed and tested in living organisms, such as the Galapagos finch. Next we will explore how genes are used to construct animals from single cells to the adult. We will find that similarities between humans and other animals run surprisingly deep. We will follow with a discussion of how these genetic, developmental, and selective pressures effected the evolution of our body from lowly fishes to the walking, large brained primates that we are. Finally, we will discuss how these exciting advances can be communicated to the general public through popular writing and multimedia museum exhibits. This course will consist of lectures and discussions of the readings.", "other": ["General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "ANTH 271: Parasites and Human Evolution", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "The goal of this course is to advance our understanding of human evolution by studying the ecologies and evolutionary histories of our parasites. Many of these parasites flourish only under very specific human behaviors and habitats, are wholly dependent on us, and have evolved with us for thousands or millions of years. Therefore, by asking when and how we first acquired those parasites, under which environmental and cultural conditions we are the most susceptible, and how the parasites have evolved and adapted to us and we in response to them, we can gain considerable insight into our own evolutionary history. As examples, the lifecycle of tapeworms is dependent on our consumption of meat, the speciation of body and head lice was likely coincident with the development of clothing, and the spread of endemic malaria was likely associated with agriculture. A series of human parasites will be studied in sufficient depth - from biology to genetics to population dynamics and so on - to facilitate a holistic consideration of the implications for human evolution, population history, and culture.", "prerequisite": "BIOL 110", "other": ["Honors"]}, {"course_name": "ANTH 294: Research Project", "department": "Anthropology (ANTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "ANTH 296: Independent Studies", "department": "Anthropology (ANTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "ANTH 297: Special Topics", "department": "Anthropology (ANTH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ANTH 299: Foreign Studies", "department": "Anthropology (ANTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ANTH 303: Race and Gender in the Americas: Latin American and Caribbean Cultures", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Utilizing a theoretical framework of intersectionality, this course examines historical and cultural constructions of race and gender in Latin America and the Caribbean. AFAM 303 / ANTH 303 / WMNST 303 Race and Gender in the Americas: Latin American and Caribbean Cultures (3) (GS;IL) Utilizing a theoretical framework of interesectionaly this course examines how racial, gender, sexual, and class identities are constructed in Latin American/Caribbean societies. The course applies an anthropological perspective to a wide range of countries in the region to reflect on how historical events such as the conquest, colonization, slavery, and independence movements are relevant to understanding the region today, as well as how race, gender, and sexuality inform contemporary themes of empire, nation-building, imperialism, neo-colonialism, revolution, violence, militarization, social movements, religion, neoliberalism, U.S. involvement/relations, and popular culture. The course addresses issues of power, culture, racial formation, and citizenship by incorporating interdisciplinary material beyond ethnography such as newspapers, grassroots media, biographies, films, music, novels, personal testimonies, etc. Rooted in feminist anthropological scholarship, this course emphasizes how power (from above and below) and culture mediate relationships between individual/community agency and institutions/structures. As an effort to encourage students to think about Anthropology and culture beyond superficial or romanticizing celebrations of multiculturalism, food, and music, the course stresses the theoretical importance of situating power and privilege amidst difference. We conceptualize culture not only as socially transmitted patterns of behavior and ideas/meanings, but as a complex and dynamic process/medium grounded in unequal relations in which power is constituted and resisted. The ethnographic emphasis of the course centers on the complex lived realities and voices of people, encouraging students to learn, understand, and respect cultural difference. The course offers students a broad sense of how power is central in the production of knowledge (particularly within the disciplines of Anthropology and History). Students will critically engage an array of topical issues in Latin America beyond dichotomous thinking. Discussion of course material includes contemplating issues of ethics, subjectivity, bias, and privilege. Conversations regarding processes of \"Othering\" and traditional \"us vs. them\" debates that often occur when discussing developing countries will prompt students to situate their own power/privilege and challenge our assumptions and preconceived notions of Latin America. Moreover, this course teaches Latin American Cultures within a global context of racialization. As such it also stresses the historical and contemporary social, economic, cultural and political significance of the U.S. in Latin America, to demonstrate how we are connected and responsible to what happens \"over there.\"; In order to promote service learning, a core tenant of feminist pedagogy, this course also offers students the opportunity to participate in an optional embedded program entitled \"Cuba: Identity, Diversity and Popular Culture\". This two week course in Havana, Cuba promotes interactive learning in and outside the classroom with international study. This course component successfully combines academic classes, hands-on activities, and service learning.", "other": ["Cross-listed with: AFAM 303, WMNST 303", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "ANTH 321W: Intellectual Background of Archaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Introduction to primary sources on the development of archaeology as a scientific discipline.", "prerequisite": "3 credits of ANTH", "other": ["Writing Across the Curriculum"]}, {"course_name": "ANTH 375Q: Anthropology of Food Honors", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course is an anthropological approach to understanding temporal and spatial variation in human food consumption and nutrition: why do we eat what we eat? To answer this question, we approach it from multiple perspectives: biological, evolutionary, ecological and social. In this course, students will investigate how food tastes, preferences, and diets of different individuals and societies both in the past and present are affected by genetic variation, by processes of individual and cultural learning, by evolutionary and ecological forces and histories of ecological and social interaction, by existing social contexts and structures, and by global political and economic forces. Topics include a broad survey of human and nonhuman primate diets and their physiological and behavioral correlates; theories of optimal diet breadth and prey choice; fossil and archaeological evidence for early human diets; genetic adaptations to diet; metabolic syndrome; food security; food taboos; the origins and cross cultural uses of spices; ecological impacts of hunting, gathering, and agropastoralism especially relative to food webs, biodiversity and sustainability; cultural diversity in the social uses and meanings of food and the sharing of food and how sociopolitical contexts have shaped the overexploitation of certain resources throughout history. Students will come away from this course with an understanding of the diversity of human foodways through time and space: how biology, culture, and ecology interact to shape the food we eat, and how the food we eat shapes us.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ANTH 380: Anthropology Museum Studies", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Introduction to the history, significance, and operation of anthropology museums.  ANTH 380 Museum Studies (3) This course introduces students to the operation of anthropology museums and to the growing field of museum studies. The course explores the historical setting within which these institutions evolved and the role of museums in the development of anthropology. Students will learn about the primary functions of museums through individual and group projects. Other topics to be covered include museum organization and administration, collection management, curation and conservation, research and education, public relations and financing, and ethical and legal issues. Students will get hands-on experience with the planning and implementation of a display in the Matson Museum of Anthropology. In addition, students will learn about museum careers, museum developments in other countries, and contemporary controversies, such as repatriation and the shifting role of museums in contemporary society. The course will provide the student with an introduction not only to the behind-the-scenes nuts-and-bolts of daily museum operations but also to the institutional role of museums as the preservers, interpreters, and communicators of humanity's cultural heritage. Students are evaluated based on two papers, work on Matson Museum exhibits, and participation in class discussions. This course fulfills a 3-credit requirement for additional courses for the anthropology major. This course expands on the history of anthropology and professional employment in the field that is presented in introductory courses."}, {"course_name": "ANTH 395: Internship", "department": "Anthropology (ANTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "ANTH 399: Foreign Studies", "department": "Anthropology (ANTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ANTH 401: Human Evolution: The Material Evidence", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Human origins as seen in the fossil record and comparative biology of humans and their primate relatives.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 403: Evolution of Human Walking", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "An in depth analysis of the biology, biomechanics, evolutionary history of human walking and running.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 405: Primatology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Nonhuman primate origins, evolution, comparative physical and behavioral characteristics, ecological context, phylogeny and taxonomy; and their importance in anthropology.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 408: Anthropological Demography", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Analysis of demographic studies in traditional and very small populations.  ANTH 408 Anthropological Demography (3)(BA) This course meets the Bachelor of Arts degree requirements. This course examines population-related problems from an anthropological perspective. Special emphasis is placed on ecological and economic approaches to the study of population dynamics in small-scale, preindustrial societies. This is an advanced undergraduate course that builds upon introductory anthropology and leads the student into more difficult demographic problems that are linked with economics, politics, religion and other cultural factors that shape population and population change. While the course is designed to introduce any of the basic analytical methods of demography, attention is focused primarily on fundamental theoretical issues concerning population growth, resources, fertility, mortality, age structure, and household demography in traditional societies. Data is drawn from ethnographic studies of living populations, from historical demography, and from paleodemography (the reconstruction of population patterns from skeletal samples). There will be three take-home problem sets. These will be a mixture of short essay questions and simple numerical exercises that can be solved on a pocket calculator or a spreadsheet. This course fulfills a 3 credit 400-level requirement for the Anthropology major and minor.", "prerequisite": "3 credits of ANTH", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 410: Osteology", "department": "Anthropology (ANTH)", "credits": "4 Credits", "description": "Introduction to the systematic study of the human skeleton from an evolutionary developmental biological perspective.  ANTH 410 Osteology (4) This course introduces students to the aspects of the human skeleton and dentition that are of anatomical, archaeological, forensic, and developmental significance. Topics include the identification of skeletal and dental structures; the distinction between normal and pathological bone; the estimation of age, sex, and stature from skeletons; bone metabolism; growth and development; and the functional aspects of musculoskeletal and dental systems. Up to one-half of the course is spent on bone identification and skeletal anatomy. Lectures are supplemented by labs that provide practical experience in the identification of individual bones and anatomical structures, age and sex estimation, and the differentiation of abnormal from normal bony structures. It is absolutely essential for students to attend labs to familiarize themselves with bone specimens and casts. At the close of this course, students are expected to be able to recognize human bones and be familiar with anatomical terms, the bony landmarks that define their shape, and the relation of those bones with various soft-tissue structures. Students will have a basic grasp of bone growth and development, as well as how to identify an individual's general characteristics from the skeleton, such as age, sex, and prior life-history events including disease and trauma. The course fulfills a 400-level elective for the Anthropology (BA) major and minor, as well as the Archaeological Science and Biological Anthropology (BS) degree programs.", "prerequisite": "5th Semester standing"}, {"course_name": "ANTH 411: Skeletal Forensic Anthropology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "An introduction to anthropological forensic science with an emphasis on what can be learned from human skeletons and archaeological recovery methods.  ANTH 411 Skeletal Forensic Anthropology (3) This course is a survey of forensic anthropology focusing on human skeletal remains and archaeological recovery methods. Emphasis is placed on field methods used to collect human remains from surface and buried contexts; taphonomic processes; estimating age, sex, stature, and ancestry from human skeletons; recognizing signs of trauma and scavenger damage; and identifying individuals from skeletons. Lectures are accompanied by class discussions and complemented by practical lab sections closely tied to lecture materials. There will be two exams, a midterm and a final, and students are responsible for preparing a poster and presenting a semester-long research project. This course is related to existing ANTH 410, Human Osteology, and proposed course ANTH 413, Molecular Forensic Anthropology. It fulfills a 400-level requirement for the anthropology major or minor, as well as the university's Forensic Science major.", "prerequisite": "5th Semester standing"}, {"course_name": "ANTH 412: Settlement Demography", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Examination of the demography and ecology of human settlement systems in the preindustrial past.  ANTH 412 Settlement Demography (3)This seminar will examine the population dynamics of human settlement systems in preindustrial societies, living, historic, and prehistoric. The focus will be on subsistence-level agrarian settlements, but some attention will also be paid to settlement patterns in hunter-gatherers, in market economics, and in complex societies. After reviewing basic assumptions and problems of working with spatial data, the course will examine processes determining settlement size, composition, and location on the micro-level (i.e. that of individual households, farmsteads, hamlets, and villages) and then pass on to regional patterns of transport, migration, and defense. The processes of site colonization, settlement expansion and contraction, site abandonment, and re-colonization will all be considered in detail. Since human settlements are always non-randomly distributed across spatially-heterogeneous landscapes, some basic landscape ecology will be presented in the course. Some fundamentals of geostatistical analysis will also be taught, although the course is not intended to be a survey of quantitative geography or spatial analysis. Rather, it is designed to be a more specialized follow-up to ANTH 408 (Anthropological Demography); the new course builds upon the basic explored in ANTH 408 by extending them into the spatial domain. During the last quarter of the semester, students will split into 2-3 teams, each of which will re-analyze settlement data from a region and time period of its choice for presentation to the rest of the class. The proposed course will provide 3 elective credits toward the undergraduate major and minor, and will be open to graduate students as well. The overall aim is to produce scholars who can think in creative ways about the dynamics of settlement systems in their own reading and research. The course should be of interest to archaeologists, anthropological demographers, ethnologists, and other students interested in human population science, especially as it relates to preindustrial society.", "prerequisite": "ANTH 21"}, {"course_name": "ANTH 413: Molecular Forensic Anthropology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "An introduction to the field of the application of DNA methods to estimating forensically useful phenotypes.  ANTH 413 Molecular Forensic Anthropology (3) This course is a survey of forensic anthropology focusing on human genetic methods. Emphasis is placed on laboratory methods for analyzing DNA variation, the genomic and geographical distributions of genetic variation, estimating genetic ancestry, sex, pigmentation, facial features, and other traits. Lectures are accompanied by class discussions and complemented by practical lab sections closely tied to lecture materials. There will be three exams and students are responsible for preparing a poster and presenting a semester-long research project. This course is related to existing ANTH 411, Skeletal Forensic Anthropology. It fulfills a 400-level requirement for the anthropology major or minor, as well as the university's new Forensic Science major.", "prerequisite": "5th Semester standing"}, {"course_name": "ANTH 414: Microbial Anthropology: A microbial lens on the human experience", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "The human body contains more microorganisms than it does its own cells, yet these complex communities of microorganisms are largely absent from Anthropology textbooks. This course investigates the interplay between microbiology and anthropology, exploring the roles that microbes play in human evolution, adaptation, health, and culture. We will first review basic concepts in microbiology (what are microbes?) and microbiome science (how is DNA useful?) and apply this understanding to core concepts in anthropology, including those that guide our understanding of living, ancient, and extinct humans. For example, what human activities or practices influenced the origins of disease, both infectious and non-infectious? How are microbes shared or transmitted during human interactions? Can microbes provide information about past human behavior or culture? How do microbes help or hinder human adaptation to new environments? This examination will be done through lectures and in-class discussions based on primary literature from different scientific fields of study. This understanding will be used to apply new interdisciplinary research approaches and see anthropology in a new light."}, {"course_name": "ANTH 416: The Evolution of Human Mating", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "The Evolution of Human Mating is a science course designed to familiarize students with the primary literature on the evolution and development of human mating behavior and sex differences.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 418: Medical Anthropology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course provides an introduction to the field of medical anthropology from an ecological, biocultural, and economic perspective. Drawing on readings and ethnographic sources, students will examine how anthropology and the social sciences have addressed issues of health in a global context. Students will begin the semester with an introduction to the study of health in anthropology. After discussing the basic theoretical frameworks, students will consider topics of nutrition, the life cycle, reproduction, and infectious disease. In the final portion of the course, students will focus on the health consequences of stress and culture change. One of the primary aims of this course is to illustrate how medical anthropology can be applied in real world settings, including during outbreak investigations, and in understanding patterns in population health."}, {"course_name": "ANTH 419: Anthropology and One Health", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Is there a true distinction between human health, the health of animals, and the health of the environments we share? Or is there only \"one health\"? This course examines the interconnectedness between human, animal and environmental health that have shaped our evolutionary history and modern-day health challenges. The course will start by exploring the ways by which human-animal-environment interactions have changed over evolutionary timescales, and in response climate, landscape, and population changes. The course will focus on how these changes manifest in modern environments to contribute to the transmission and spread of pre-existing and new zoonotic diseases between animals and humans. We will also explore interactions between infectious diseases and other One Health issues, including food security, livelihoods, and biodiversity conservation. Through this course, students will be introduced to relevant anthropological theories and methods within the One Health framework. Equipped with a strong theoretical background, students will critically examine the conceptual trends that have shaped anthropological contributions to One Health. Students will engage with primary literature to learn how anthropology and social science are applied to modern day issues in global settings. This course assumes that anthropological engagement within One Health and related fields is not yet fully realized, and in turn, encourages students to explore new connections. The course thereby provides a forum for students in anthropology and other One Health related fields (e.g. biology, ecology, public health, human and veterinary medicine, sociology, geography, nutrition, and others) to engage in interdisciplinary thinking within One Health."}, {"course_name": "ANTH 420: Archaeology of the Near East", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Culture of the Near East and India from Paleolithic times through the Bronze Age.", "prerequisite": "3 credits in CAMS or 3 credits in ANTH or permission of instructor", "other": ["Cross-listed with: CAMS 430, JST 420", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 421: Intro to Geospatial Science in Anthropology and Archaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course is a practical, data driven, introduction to applications of Geospatial tools in anthropological and archaeological research.  ANTH 421 Intro to Geospatial Science in Anthropology and Archaeology (3)As anthropologists, we are interested in humans, how humans interact with each other, and how that interaction is modulated by space and place. The purpose of this course is to introduce students to the basic concepts of spatial theory in anthropology, and the use of GIS (Geographic Information Systems) as a tool in anthropological and archaeological research designs. Students will gain familiarity with geospatial technologies, their use as a tool for data creation, storage and manipulation, and a broad array of data analyses. The course is relevant to anyone documenting or investigating spatial dimensions of human social behavior. Students will gain familiarity with GIS software, its use as a tool for data creation, and a broad array of data analyses.This class will be offered each Fall semester. It will introduce students to sources and uses of data in addressing anthropological or archaeological research questions. It will prepare the student for more advanced spatial analysis courses such as Advanced Geospatial Science for Anthropologists and Archaeologists. Students will be expected to develop a research project which uses GIS as a tool to address broader anthropological research questions. The class will culminate in the development of a research contract for a future fieldwork project. A list of sample topics is provided. Students will be expected to develop an original and functioning GIS which addresses their research question. The purpose of this exercise is to introduce the student to all stages in the development and operationalization of an anthropological research GIS in the development of an archaeological or anthropological project. There are two components to this class: classroom and labs. The classroom component will consist of lectures and discussions. The student will receive hands-on experience with GIS applications during the laboratory component of the class. The laboratory component will enable students to gain experience applying the concepts discussed in class to archaeological data through use of GIS programs in a technology classroom setting. Data used in the laboratory exercises derive from actual anthropological and archaeological fieldwork. Students are expected to complete labs in one of the several computer labs across campus that have GIS software installed. Grades are based upon the completion of 12 lab exercises, a draft of a proposed contract, the final contract and a short presentation of the proposed contract to the class. This course will fulfill three credits of the requirement in both the Minor and Major in Anthropology. This is the first part of a two part course. The second part of this course is called Advanced Geospatial Science for Anthropologists and Archaeologists.", "prerequisite": "ANTH 001 or ANTH 002"}, {"course_name": "ANTH 422: Meso-American Archaeology and Ethnography", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Survey of ethnohistorical and ethnographic patterns of Meso-American society; origin and development of ancient civilization in Mexico, Guatemala, and Honduras.", "prerequisite": "3 credits of ANTH", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 423: The Evolution of American Indian Culture", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Historic and archaeological sources used to trace American Indian lifestyles from the first immigrants to the period of Euro-American contact.", "prerequisite": "3 credits of ANTH", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 424: Andean Ethnology and Archaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Cultures of the Andes from earliest settlements to Inka Empire; includes discussion of life in modern Andean communities.  ANTH 424 Andean Ethnology and Archaeology (3)(BA) This course meets the Bachelor of Arts degree requirements. When the Spanish conquistadors arrived in the Andes in 1532, they were astonished by the complexity and grandeur of the Inca Empire, which stretched along western South America incorporating a multitude of different societies that occupied a seemingly inhospitable landscape with coastal deserts, rugged mountain chains, and dense jungles. This course traces out the history and development of Andean cultures from the earliest peopling of the continent to the rise and fall of the Inca Empire. Using archaeological, historical, and ethnographic sources, students will learn about the relationship between Andean societies and their environments and landscapes, as well as the economic, social, and political changes that transformed small egalitarian communities through time into large, stratified states. Through the course, students will not only gain a strong background in pre-Columbian Andean history but will also hone their skills in the use of different lines of evidence to reconstruct the past while learning to critically evaluate existing interpretations. All students are expected to participate actively in discussions. Lectures will be supplemented by illustrations (slides, handouts, videos), and students will learn how societal dynamics are expressed in material culture and in the organization of architecture and settlements. Grades will be based on the results of three exams, a short paper, and participation in discussions. The course complements existing courses at the same (400) level on the archaeology of Mesoamerica (ANTH 422) and North America (ANTH 423). It continues the discussion (at a higher level) of some of the themes covered in ANTH 008 (Incas, Aztecs, Mayas). It fulfills the archaeology credits requirement for the major and is one of the 400-level courses that can be used for the minor. For students outside the major, it may be used to meet the Other Cultures or the Social Sciences requirement in Bachelor of Arts programs.", "prerequisite": "3 credits of ANTH", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 425: Zooarchaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Introduction to the systematic study of animal skeletal remains from archaeological sites.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 426W: Archaeological Laboratory Analysis", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Scientific laboratory methods used in the analysis of ceramic and lithic artifacts.  ANTH 426W Archaeological Laboratory Analysis (3) This course, Archaeological Laboratory Analysis, employs experiential learning to teach students how to ask and answer archaeological questions using real data. While students learn the fundamentals of interpretation in other courses using already processed computer (and internet) assembled data sets, this is not how archaeological data are analyzed. Archaeological data emerge from the ground covered with dirt and the analyst must learn how to identify and measure their important attributes, and interpret what they mean. This class will provide a hands-on learning experience where students learn how to examine and use physical remains to reconstruct and interpret human behavior.Students in the Anthropology program currently learn this critical step on anad hocbasis by working with faculty on individual research projects. This approach, while effective, is neither systematic nor comprehensive. This is a course on analytical systematics. It provides students with an introduction to problem formulation, artifact processing, artifact cataloging, attribute identification, artifact classification, analysis, data illustration and photography. At the same time, students will be introduced to two separate and distinct approaches to interpretation: 1) morphological/diacritical analysis, and 2) direct experimentation and replication.Students will be graded on the completion of nine laboratory exercises. These exercises will require that students identify the research question being addresses, the theoretical assumptions used in the analysis, the data sample, the analytical method(s) employed, and the conclusions reached. The exercises will also request that students identify personal insights and difficulties encountered during the analysis.This course fills a vital position in training undergraduate majors by providing them with practical training in research design and data analysis. It also provides the logical link between our general courses in prehistory, our courses on archaeological theory, and our method courses on field methods of data recovery. All of these courses intersect in the archaeological laboratory where data interpretations are made and new information about the past takes shape. In addition to contributing to both the BA and BS undergraduate majors and minors, this course will also provide a framework for training graduate students who enter the program with minimal field and laboratory training in archaeology.", "prerequisite": "3 credits of ANTH", "other": ["Writing Across the Curriculum"]}, {"course_name": "ANTH 427W: Forensic Archaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Application of archaeological techniques to crime scene investigations, with practical experience in field and laboratory contexts.", "prerequisite": "ANTH 2N", "other": ["Writing Across the Curriculum"]}, {"course_name": "ANTH 428: Archaeological Methods and Theory", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Scientific methods as applied to archaeological data: evolution, ecology, diffusion, and cyclicism theory.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 429: Paleoethnobotany", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Introductory course in paleoethnobotany, the study of the interrelationships between people of the past, natural environment, and plant resources.  ANTH 429 Paleoethnobotany (3)This course is a survey of the fast-developing field of paleoethnobotany-- also known as \"archaeobotany\" or \"phytoarchaeology\"-- that involves the extension of ethnobotany into the past, emphasizing archaeological plant remains and study of the historical dimensions, complex dynamics, and myriad interrelations between people and plant resources. The primary goals of the course are 1) to promote understanding of the vital interplay between the natural environment and human societies, with their diverse systems of belief and resource use, especially those of the past but with relevance to the present; and 2) to foster an appreciation for what modern paleoethnobotany involves as a subdiscipline or specialization in archaeology, related to both anthropology and the plant sciences. The course begins by considering the history and nature of the field, including parallel developments in plant biology. The first half of the semester entails weekly sessions that focus attention on the plant organism, sources of archaeobotanical data, taphonomic issues, and the major classes of archaeobotanical materials. Fundamental issues involved in fieldwork, and the variety of laboratory concerns and methodologies specific to paleoethnobotany as whole and with regard to individual subareas are addressed. Individual laboratory sessions highlight the different preservation states that affect ancient plant materials, as well as methods of identification and analysis. In the second half of the semester, attention is focused on theory and application, issues central to and/or addressed by paleoethnobotany as a subdiscipline of archaeological anthropology. The course follows a seminar style, with substantial participation by students, including individual presentations, laboratory study, and analysis. Learning is augmented and enhanced by use of various visual aids, along with modern comparative specimens and actual archaeological plant remains. ANTH 429 will fulfill 3 credits of the additional courses in the Anthropology minor and majors. ANTH 2 is a prerequisite.", "prerequisite": "ANTH 2N"}, {"course_name": "ANTH 430: Ancient Brews", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Understanding how past humans altered their environments is at the core of this Ancient Brews course. Through the domestication of plants and animals to the continuous modification of technologies, our ancestors have successfully produced a wide range of alcoholic beverages. In ANTH430, we will recreate several alcohols (e.g., beer, cider, and wine) using the most basic methods through a process of experimental archaeology. From harvesting corn, apples, and grapes from Penn State¿s agricultural fields, to crushing barley with grinding stones, to cooking the ingredients in clay pots, the students will get firsthand experience with several ancient methods of alcohol production. Most of the semester is seminar-style, where we discuss journal articles relating to specific anthropological approaches to the evolution of alcohol.", "prerequisite": "ANTH 140", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 431: Advanced Geospatial Science for Anthropologists and Archaeologists", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course is an intensive, data driven, treatment of the use of geographic information systems in anthropological and archaeological research.  ANTH 431 Advanced Geospatial Science for Anthropologists and Archaeologists (3)As anthropologists, we investigate how humans evolved, behave, define groups, and interact socially. Examining how these processes are shaped by space and place is central to the anthropological enterprise. The use of geospatial science in anthropological and archaeological research is now commonplace. Geospatial technologies are now intimately involved in anthropological and archaeological research designs. The course objective is to expose students to advanced concepts and techniques of conducting geospatial science research in anthropological and archaeological contexts. The course is a continuation and development of the introductory geospatial science course and it will fulfill three credits of the requirement in both the major and minor in Anthropology. Students will develop an in depth understanding of anthropologically and archaeologically tailored geospatial project design and implementation. Students are expected to complete the work for the course in one of several computer labs across campus that has the appropriate software installed.", "prerequisite": "ANTH 421"}, {"course_name": "ANTH 432: Environmental Archaeology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Introductory course in Environmental Archaeology, with empahsis on method and theory in the subfields archaeobotany, pedoarchaeology, and zooarchaeology.  ANTH 432 Environmental Archaeology (3)This class is a survey of the fast-developing field of environmental archaeology, or archaeobiology, which encompasses archaeology, the earth sciences, plant biology, and zoology. Environmental archaeologists apply techniques and insights obtained from these fields to questions concerning the relationships among humans, cultural systems, and the natural world, as reflected in the archaeological record. The general goal of the course is to promote understanding of the vital interplay between human societies, with their diverse systems of belief and cultural practices, and the natural environment, with emphasis on human interactions with biotic resources. Instruction is by lecture, supplemented by laboratory sessions emphasizing hands-on experience. Weekly topics are explored through selected readings and class discussions, augmented with laboratory assignments (practical exercises) variously focused on specific types or classes of archaeobiological materials. ANTH 432 will fulfill 3 credits of the additional courses in the Anthropology minor and major, as well as the Archaeological Science major. Anth 002 is a prerequisite.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 433: Archaeological Ethics and Law", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Introductory course that examines prominent ethical and legal issues in archaeology integral to modern applied research and practice. ANTH 433 Archaeological Ethics and Law (3)This course explores the ethical, legal, and practical dimensions of modern archaeology through a consideration of the following topics: archaeology as a profession; archaeological ethics; the relationship between archaeology and others (the public, ethnic groups, avocationals, collectors, etc.); international and national approaches to archaeological heritage management; the antiquities market; maritime law, underwater archaeology, and treasure hunting; cultural resource management in the united states; and archaeological outreach and education. Students are introduced to a variety of legal and ethical issues in archaeology that span local to international scales. Through lecture, discussion, and readings, students will consider the archeology and ethics of ownership and stewardship, including issues centered on intellectual property rights, representation, repatriation, and reburial of cultural properties. They will be able to identify the various stakeholders in contemporary archaeology, and assess their values and interests in issues such as the treatment, ownership, and disposition of human remains, heritage sites, submerged cultural resources, and antiquities. They will consider growing problems with illicit collecting and excavation, illegal trade, and global concerns centered on the international trafficking of antiquities, and will be variously exposed to relevant national and international legislation involving cultural patrimony and management of antiquities, including international treaties such as the 1970 UNESCO Convention on Cultural Property, and related pieces of US federal legislation. The 1990 Native American Graves Protection and Repatriation Act (NAGPRA) and the Archaeological and Historic Preservation Act (ARPA) of 1974 figure prominently in the course. In general, upon completion of the course students will come to have a stronger appreciation of archaeological ethics and \"archaeopolitics\" they will have a good understanding of the U.S. Secretary of the Interior's standards (36CFR61) for professional archaeologists and will be able to assess and evaluate contemporary issues of archaeological ethics and law in the context of modern practice. ANTH 2 is a prerequisite of this course.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 434N: Black Ecologies", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "African and African Diasporic peoples have been central to the creation and transformation of global ecologies and landscapes. As the birthplace of humankind, the African continent features the longest archaeological record in the world, with abundant, yet often underrepresented, material and historical evidence for remarkable Indigenous African innovations in the areas of technology, food production, and resource and land use. This course specifically examines Black ecologies preceding and then radically transformed by the Trans-Atlantic Slave Trade. Beginning in the late fifteenth century, the enslavement of millions of Africans and their forced translocation to the Americas and Caribbean precipitated ecological transformations on all sides of the Atlantic, as African peoples, knowledge, resources and ecological inheritances were appropriated by the European mercantile system. Enslaved Africans transformed American landscapes via extractive industries of plantations and mines and suffered the emergence of toxic landscapes and disease alongside Native American communities. Africans also recreated African ecologies as they created livelihoods and landscapes of resistance and freedom in the Americas. The legacies of the Atlantic Era maintain a persistent dynamic in which African and African Diasporic communities experience disproportionate burdens of environmental injustice today. The concept of Black ecologies reflects the marginality, systemic racism and dispossession experienced by Black peoples and their landscapes. Black ecologies also allow us to understand African and African Diasporic ecological innovations, resistance and resilience, and the pathways to future sustainability and justice they promise.", "prerequisite": "3 credits of ANTH", "other": ["Cross-listed with: AFAM 435N, AFR 435N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ANTH 435: Ancient Economy", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "The course examines the comparative organization and development of ancient economies in both the Old and New Worlds.  ANTH 435 Ancient Economy (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the origin and development of ancient economy from its earliest beginnings to the advent of complex monetary economies that existed prior to the industrial revolution. It examines the common economic structures found in ancient foraging, pastoral, and agricultural societies and how those structures were modified and transformed as these societies were integrated into more complex monetary economies. The goal of the course is to develop a comprehensive understanding of ancient economies, the function and purpose of their economic structures, and how those structures of production and distribution were modified and retained within the modern economies that we live in today. While the economy is often approached as its own field of study, this course shows how and why the economy was embedded in social, political and religious institutions that were so prominent in the ancient past. The course will discuss the domestic and institutional economy, the origin and organization of ancient market systems, the development of urban centers and the economies that supported them, the role of merchants in ancient societies, and origins of many of our 21st century institutions including money, banking, insurance, and the organization of craft production before the industrial revolution.The class draws upon the rich literature in archaeology, history and ethnohistory that examines the structure of ancient societies. It employs a cross-cultural perspective to model ancient economies and to investigate how social forces influenced their development. A range of different historic and prehistoric societies are discussed each semester to illustrate the cross-cultural perspective. The societies discussed vary from semester to semester and include, but will not be limited to, the ancient Sumerian, Assyrian, Greek, Roman, Mongol, Aztec and Inka societies. Examples will be selected that include societies at different scales of complexity from simple hunting and gathering groups to pre-industrial states.The course fulfills the Social and Behavioral requirements in Liberal Arts. It also fulfills specific major and minor requirements for the BA in Anthropology, the BS in Archaeological Sciences, and the BS in Bioanthropology. The course is also relevant for students in CAMS, History, and Ancient History that are interested in a comparative study of New and Old World civilizations.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "ANTH 439W: Studies in Classical and Ancient Mediterranean Archaeology", "department": "Anthropology (ANTH)", "credits": "3-6 Credits/Maximum of 6", "description": "CAMS 440W Studies in Classical and Ancient Mediterranean Archaeology (3-6) (BA) This course meets the Bachelor of Arts degree requirements. CAMS 440W is a writing-across-the-curriculum upper-level archaeology course on various topics in the broad field of Classical and Mediterranean archaeology. The selected topic will emphasize interdisciplinary themes, such as comparative state formation, societal collapse, gender in the ancient world or the socio-economic and cultural development of a society or region and its interaction with other Mediterranean, Near Eastern and North African cultures. Students will learn of major publications in the field of study, and how to conduct searches of the previous archaeological literature and the related literary record. As one requirement, students will complete a research paper on a topic related to the theme of the course that semester. The sequence of writing assignments is designed to allow students to develop a project, to search for related publications, to develop a proposal, and to revise drafts of the final paper. The course is also intended to provide students with a practical background in Classical and Mediterranean archaeology that will help prepare them for archaeological fieldwork, for the interpretation of archaeological publications, and, as relevant, for utilizing the literary and/or epigraphic record for interpreting archaeological evidence. Those considering enrolling in this course may obtain information about the specific topic by asking the faculty member listed as teaching the course or the Undergraduate Officer in the Department of Classics and Ancient Mediterranean Studies.", "prerequisite": "3 credits in CAMS or 3 credits in ANTH or permission of instructor", "other": ["Cross-listed with: CAMS 440W", "Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"course_name": "ANTH 441: From Stone Ax to Uzi: Tradition and Change in the New Guinea Highlands", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course explores cultural change and innovation among tribal peoples of Highland New Guinea from stone tool technology to globalization.  ANTH 441 From Stone Ax to Uzi: Tradition and Change in the New Guinea Highlands (3) (IL)The indigenous peoples of Highland Papua New Guinea were unknown to the outside world until the 1930s and began to be seriously influenced by European contact only after the First World War. At first contact with Europeans, the million or so people living in the Highlands used a stone tool technology, had no knowledge of the wheel, and lived in small, politically and economically independent local groups. They presented a major population engaged in a way of life typical of human society in a technologically simpler past, and have been crucial in anthropology's discussion of the general characteristics of human culture and institutions. The study of these cultures also provides an opportunity to explore the processes through which these peoples have assimilated thousands of years of technological, political, and economic innovation in a very brief period, while simultaneously maintaining and recreating their cultural identity, despite the impact of colonial rule and global influences. Apart from the specific history of these populations, the course will also give students insight into the processes of globalization and internationalization that necessarily effect changes in traditional cultures, and will require that they consider the advantages and disadvantages that accrue from these processes. Among the topics this course will cover are traditional and current approaches to dispute settlement, economic changes that entail moving from subsistence agriculture as the basis of the economy to cash cropping for a global market, the ecological effects of extractive industries such as mining and how those effects are translated into social and cultural domains, the reorganization of gender roles, the incorporation of politically independent tribal units into a centralized, powerful state, and the demise of traditional religion with the conversion to Christianity. Students will be evaluated on contributions to class discussion, essay exams, a term paper and a brief oral presentation based on that paper. The course will provide support and depth for more general courses dealing with warfare, gender, religion, politics and economics and specific understandings for programs devoted to exploring cultural variation and modernization.", "prerequisite": "ANTH 045", "other": ["International Cultures (IL)"]}, {"course_name": "ANTH 444: The Evolution of War", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Critical overview of the ethnography and theory of primitive warfare.  ANTH 444 Primitive Warfare (3) Anthropology 444 is concerned with the phenomenon of lethal group violence in tribal societies so called \"primitive war\". Through lectures, readings, and research projects, this course reviews anthropological approaches to the study of primitive war, focusing both on ethnographic examples and on theoretical approaches. The course covers topics such as explanations, traditional and modern, for the existence of warfare; the primate background to human warfare; and the social causes and individual motives leading to warfare in tribal societies; as well as its consequences for those societies. Students become familiar with both general and particular manifestations of primitive warfare, and are exposed to individual ethnographic cases of primitive warfare as they motivate a variety of theoretical paradigms.All students are expected to attend all lectures and to complete all weekly readings. At the last class meeting of each week, a rotation of students are assigned to organize and direct the class discussion of the week's readings in the light of the lectures earlier in the week. Performance in this activity constitutes 40% of the student's grade. Another 40% is earned in the research term paper each student must prepare. The final 20% of the grade is based on overall student contribution to class discussion, particularly during those weeks when the student is not a discussion leader. There is no final examination. This course can be used to fulfill major and minor requirements in Anthropology. Because warfare was and often still is a major activity in most tribal societies, this course provides an important complement to area-focused ethnography and archaeology courses such as ANTH 241 (Peoples and Cultures of Highland New Guinea), ANTH 422 (Mesoamerica), ANTH 423 (North America), ANTH 425 (American Southwest), ANTH 440 (Lowland South America), and ANTH 447 (Africa). This course is also relevant to topically focused course such as ANTH 450 (Comparative Social Organization), ANTH 451 (Economic Anthropology), ANTH 454 (Political Anthropology), and ANTH 456 (Cultural Ecology). On the graduate level, this course addresses central topics covered in ANTH 522-523 (Ecological Theory in Anthropology), ANTH 556 (Social Organization of Traditional Societies), and ANTH 559 (Behavioral Anthropology).", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 445W: Ethnographic Film", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Comparisons of written and visual ethnography; critical assessment of ethnographic film; cross-cultural variation.  ANTH 445W Ethnographic Film (3) Students will be presented with both written and filmed ethnographic material dealing with a number of cultural subsystems (e.g., kinship and family relations, religion, political systems) and with a number of different world cultures. The aim of the course is three-fold: 1) to convey through visual anthropology the complexity and inter-relations of cultural subsystems, which is often difficult to do in written sources; 2) to develop the skills of critical viewing of ethnographic film; and 3) to provide students with critiques of their written work that will enable them to learn and practice the skills of clear, organized and convincing writing. Towards these ends, students will be expected to read and view weekly assignments for selected topics, to write twelve critical essays that compare the written and filmed sources, and to evaluate the aims, effectiveness, and methods of the films. Essays will be graded for both content and form and will provide a basis for class discussion. Students will also be required to write a term paper focused on a particular ethnographic film of their choice (one not shown in class) supplemented by additional research. As an aid in the writing of the paper, at least one class period will be devoted to learning how to do library research in Anthropology.This course will complement other courses in Anthropology such as ANTH 045 and ANTH 001. The course can be used to fulfill a requirement in both the major and minor in Anthropology, and will fulfill both a Writing Intensive requirement and a Bachelor of Arts social/behavioral science requirement. It will also provide students in other departments with the opportunity to study aspects of diverse, non-western cultures.", "other": ["Writing Across the Curriculum"]}, {"course_name": "ANTH 446: Mating and Marriage", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "An examination of human mating mainly from the viewpoint of behavioral ecology, centering on the species-typical institution of marriage. ANTH 446 Mating and Marriage (3) This course is an examination of human mating and marriage mainly (although not exclusively) from the viewpoint of evolutionary behavioral ecology. Its central concern is the species-typical and uniquely human institution of marriage. Why do all human societies recognize this peculiar institution, whose social and biological functions, apparently obvious, become mysterious on close examination? What, exactly, is marriage? What are its consistent characteristics and attributes--or does it have none? How are spouses chosen, and by whom? What does being married imply for the behavior of the spouses, and that of their children and other relatives? What are the evolutionary scenarios that might have led us to marriage? Although sexual behavior is clearly a key element in answering some of these questions, and receives considerable attention, this is not a course on human sexuality. Nor is it a course on kinship, even though kinship is also crucial to understanding marriage and also receives a good deal of attention. Rather, this course attempts to bring to bear on this central social institution bodies of knowledge from the biological and social sciences that may contribute to understanding how and why marriage arose as a universal feature of human societies, and how and why it is perpetuated in contemporary societies. We begin the semester with the posing of the central problem--what is marriage and why do we have it? For about half the course, we approach this question from an evolutionary, sociobiological point of view: We look into the biological background of human mating--its evolutionary history, its physiology, its behavioral ecology, etc. as we go through a semi-popular book on the subject by a biological anthropologist. Next we turn to more academic readings, old and new, that further elucidate the ecological constraints and fitness consequences of various behaviors relating to mating and mate choice, child rearing, etc., in terms of reproductive success, survivorship, etc. In the second half of the course, we take a more social anthropological point of view. We look at what anthropologists have written about marriage and marriage customs over the years. We try to relate the traditional social anthropology to more modern human behavioral ecology. Finally, in a research project report, each student examines some specifics of marriage as it is manifested in ethnographically known societies. In these reports we are particularly interested in how and by whom mates and spouses are chosen, and who contributes what to the raising of children.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 448: Ethnography of the United States", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Ethnographic descriptions of various dimensions of life in the United States. ANTH 448 / AMST 448 Ethnography of the United States (3) Ethnographic descriptions of various dimensions of life in the United States. The course covers uses of ethnography in American Studies toward an understanding of social and cultural communication and performance. The application of ethnography and concepts of cultural anthropology to complex societies such as the United States is discussed. The course teaches students to use ethnographic methods for research of American society and culture. Attention is given to the ethics and issues of ethnographic fieldwork. The course satisfies the \"area\" requirement in \"society\" for American Studies majors.", "prerequisite": "3 credits of ANTH", "other": ["Cross-listed with: AMST 448"]}, {"course_name": "ANTH 453: Anthropology of Religion", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Traditional and modern religions and historical and contemporary religious movements from an anthropological perspective.  ANTH 453 Anthropology of Religion (3)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine the origin, evolution and social function of religion from a cultural materialist perspective. It will begin with a general discussion of an anthropological approach to the study of religion, using numerous examples from different cultures for purposes of illustration. Following a discussion of several topics relevant to the anthropological study of religion --including magic, rituals, witchcraft and mythology-- the course will focus on the relationship between politics and religion: first discussing the role of religion as a mechanism of social and political control, and then examining the role of religion as a vehicle of sociopolitical change in the form of what anthropologists call revitalization movements. This course links to courses on the sociology, history, and philosophy of religion, to courses on intellectual history, and history of social sciences. Course evaluation will be based on 3 take-home essay examinations. Students will give the instructor 3 questions at indicated times; the instructor will return one question; the student will write an essay on the indicated question. Attendance is mandatory. This course will fulfill a 3 credit 400 level requirement for the Anthropology major and minor.", "prerequisite": "3 credits of ANTH", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 455: Global Processes and Local Systems", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Ethnographic, comparative, historic, evolutionary treatment of global economic, political, and cultural processes and their consequences for local systems. ANTH 455 Global Processes and Local Systems (3) (BA) This course meets the Bachelor of Arts degree requirements. Students will learn about global economic, political, and cultural processes and their consequences for local systems, how anthropologists do ethnography in the modern world of villages and factories; varieties of anthropological approaches and theories and how to assess them and how to critically assess ethnographic work.Students will write a series of book reviews in which they critically analyze the works they read in the course. Each review will present the main argument of the work; the theoretical assumptions the argument entails; the evidence the author used, the methods the author used to develop the evidence; the relationships among theoretical assumptions, arguments, evidence, and methods; and conclusions. Each review will assess the validity and reliability of the findings and the relationships of findings, arguments, and assumptions to the conclusions. These reviews will direct the student's attention to the salient points of scientific ethnography and anthropological theory with specific examples. Grades for the reviews will be assigned on the basis of how well each component of the review is completed, short in-class writing assignments to test reading comprehension and orient discussion, and a synthetic essay.", "prerequisite": "3 credits of ANTH", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 456: Cultural Ecology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Survey of the methods and concepts of cultural ecology, focusing on the interaction between cultural and geographical systems.", "prerequisite": "3 credits of ANTH", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 457: Jewish Communities: Identity, Survival, and Transformation in Unexpected   Places", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Examines the global array of smaller Jewish communities that have flourished outside the main urban centers of Jewish settlement. JST 457 / ANTH 457 / SOC 457 Jewish Communities: Identity, Survival, and Transformation in Unexpected Places (3) (US;IL) This course addresses an understudied aspect of Jewish experience. It aims to expand our understanding of Jewish communities by focusing on those that are, alternatively, small, situated in out-of-the-way places, culturally outside the Jewish urban mainstream, or embedded in a larger society with markedly different values and traditions. These communities often constitute the points-of-contact between Jews and non-Jews, and in so doing sometimes transform Jews, non-Jews, and the relationships among them. Other such communities constitute experiments in Jewish lifeways and provide mainstream Jews with pilot projects for potential social and cultural change. This course will explore the significance of small, little-known, idiosyncratic, and anomalous Jewish communities on Jewish history and culture, and draw on them to instruct students on the social and cultural processes of small or unusual communities generally. The communities studied will be located both in the U.S. and elsewhere in which Jews have lived as a minority community during modern times. The course will look at the founding, growth, and decline of such communities and at their social processes and institutions. It will explore how to understand and analyze such communities, which vary from one part of the world to another. The social world of Jewish communities, large and small, is a core interest of Penn State's Jewish Studies Program. This course will complement the current offerings in Jewish Studies, strengthening the social, cultural, and contemporary perspectives available in the Program. It will provide students with an opportunity to explore individual experience and micro-level processes among Jews, and to study the dynamics of identity and survival. It will complement the current offerings in Sociology and Anthropology by affording an opportunity to focus on community-level social processes and by adding a course on contemporary Jewry. The course will integrate knowledge from a variety of sources and fields, promote intercultural understanding, and meet US and IL requirements. Materials will be interdisciplinary, and will include ethnographies, sociological studies, population studies, histories, and personal narratives. They will include primary texts, creative works, and scholarly analyses. The assignments will be structured to facilitate preliminary experience in independent analysis, library research, or field research. The course will be offered approximately once a year. Enrollment will be limited to 30 students in order to promote active, engaged learning. Evaluations will be based on short papers and outlines that will prepare students for their final, term papers.", "prerequisite": "Three credits in JST, ANTH, or SOC", "other": ["Cross-listed with: JST 457, SOC 457", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "ANTH 458: Ethnographic Field Methods", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Course introduces students to ethnographic field methods, includes student projects and simple analyses that don't require statistical sophistication. ANTH 458 Ethnographic Field Methods (3)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed to introduce you to some (not all) ethnographic field methods. It will include actual projects you will have to carry out and other material that will make you a better ethnographer, such as how to pose questions that can be answered, how to select an appropriate sample for a project, how to take and use field notes. Because the emphasis is on field methods, we will do only simple analyses that don't require any statistical sophistication (e.g., descriptive statistics, chi square tests)", "prerequisite": "Three credits in ANTH", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "ANTH 460: Human Genetics", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course will cover the nature and contents of the human genome and the basic principles of evolution. We will also explore the future implications of personal genomics and how this information is being used to reconstruct our evolutionary history and to advance human medicine. We will carefully consider the processes by which we can identify how information contained within our genomes may affect physical and behavioral phenotypes, and what other factors may be involved (e.g., the environment). The points will be illustrated by a variety of examples of human evolution and important biomedical issues", "prerequisite": "ANTH 21", "other": ["Cross-listed with: BIOL 460"]}, {"course_name": "ANTH 460H: Honors Human Genetics", "department": "Anthropology (ANTH)", "credits": "4 Credits", "description": "This course will cover the nature and contents of the human genome and the basic principles of evolution. We will also explore the future implications of personal genomics and how this information is being used to reconstruct our evolutionary history and to advance human medicine..We will carefully consider the processes by which we can identify how information contained within our genomes may affect physical and behavioral phenotypes, and what other factors may be involved (e.g., the environment). The points will be illustrated by a variety of examples of human evolution and important biomedical issues.", "prerequisite": "ANTH 21", "other": ["Cross-listed with: BIOL 460H", "Honors"]}, {"course_name": "ANTH 461: Molecular Anthropology", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Provides framework to understand current issues in biology, genetics, and anthropology as they relate to the evolution of our species.  ANTH 461 Molecular Anthropology (3) The aim of this course is to provide students with the framework to understand current issues in biology, genetics, and anthropology as they relate to the evolution of our species. Basic methods in molecular biology, structure of the genome, molecular evolution, and human population genetics will be covered in the first part of the course. Once these tools are in place we will examine both classical and contemporary research reports on a number of topics, including the place of humans among the apes; mitochondrial Eve, DNA in forensics; Neandertal DNA and other applications of ancient DNA; reconstructing recent human evolution' the biological meaning of race; disease gene mapping; recent technological advances in genomics; skin, hair, and eye color genes; and the genetic future of our species. There will be three exams that will each count for 25% of the grade. Attendance and participation are mandatory and will count for 25% of the final grade. A portion of this participation grade is earned by presenting 10 min. summaries of particular readings. Each student will be expected to summarize a scientific paper four times during the semester. These summaries are not expected to be exhaustive reports on the material, but should reflect an effort on the part of the student to understand and discuss the material and may require some background work.", "prerequisite": "3 credits of ANTH or 3 credits of BIOL"}, {"course_name": "ANTH 465: Fifteen Great Biology Papers", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Reading and discussion of the most influential papers in the history of biology that illustrate exceptional insight and elegant reasoning.  ANTH 465 Honors Fifteen Great Biology Papers (3) Thousands of papers are published annually in the life sciences, but only a few have lasting impact on their field. These are usually characterized by elegant and thoughtful insight, and creative scientific thinking. For each of the fourteen weeks of the semester we will read and discuss a landmark paper of this type. The 15th paper? That will be the student's term project. The student will read one classic paper in the history of biological thought each week and discuss the paper in class. During the last half of each class in last third of the semester, the students will present the classics they have chosen for their term paper. The major topics covered in this course are: Weeks 1-4: Basic history of thought about origin and nature of variation in living organisms Weeks 5-8: Landmarks in the philosophy of science Weeks 9-12: History and development of ideas in evolutionary biology. Weeks 13-14: Foundations of 20th Century biology The objective of this course is to give students an experience with and appreciation for (1) the history and origins of science, biology in particular, (2) the nature of cogent critical thinking and expression, (3) the basis for fundamental ideas in biology today, (4) a sense of the nature of papers that had great influence on the future of the field, and (5) experience scouting, choosing, evaluating, and writing about papers of this nature. Evaluation will be based on class attendance and participation, critical thinking ability and effort as manifest in class, and a term paper (graded also to include quality of writing and research.) This course is generally related to all life science courses, and relevant to social and other sciences, philosophy, and history. This course can fulfill elective credits for Anthropology majors and minors.", "prerequisite": "ANTH 021 or   3 credits in evolutionary biology or genetics, and   3 credits in statistics", "other": ["Honors"]}, {"course_name": "ANTH 466: The Skull", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Survey of the mammalian skull from many perspectives including evolution, development, anatomy, function, and variability of the skull.  ANTH 466 The Skull (3) This course will provide a survey of what is known about the Mamallian skull from many perspectives including evolution, development, anatomy, function, and variability of the skull. The course will consist of lectures and a laboratory component. Students will learn about the basic skull architecture and be introduced to various specializations of extinct and extant species. The section on evolution will cover the evolution of the skull from the earliest jawless vertebrates through human evolution. During the section on development, we will discuss the nature of the formation of bone embryologically. Other topics include the ways in which bone changes shape and size during prenatal and postnatal growth, how changes in growth can result in evolutionary change in morphology. The section on the function of bone will focus on biomechanical interpretations of the morphology of the skull. The lectures will focus on human anatomy but provide contrasts with other mammals (e.g., horse, dog, mouse). The last section on variability will survey the major groups of mammals highlighting similarities and differences in bony architecture and skull morphology. This portion of the course will be more laboratory-based with students examining specimens, taking measurements and leading discussions on hypotheses regarding why skull architecture is so different among mammals. The objective of this course is to provide the student with a broad survey of information relating to the mammalian skull. Through assigned readings and lectures the student will become familiar with salient anatomical and osteological features, obvious differences in skull architecture and the various biological processes responsible for these differences. During the final laboratory part of the course the students will bring their knowledge to an assigned problem and specimen in order to apply what they have learned to a scientific question. Students will be required to attend all lectures and laboratories. Periodic quizzes will be administered as well as an exam at midterm. A paper that focuses on the student's laboratory experience will be required at the completion of the course.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 468: Evolution and Development of Human Origins", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "In depth analysis of the genetic and developmental basis for phenotypic variation and evolution of humans and primates.  ANTH 468 Evolution and Development of Human Origins (3) Recently biology has undergone a revolution regarding our understanding of the mechanisms underlying the evolution and development of animal form. This knowledge has a profound impact on the way we conduct and interpret morphological analyses pertaining to human evolution. In this course we will explore basic principles underlying Darwinian natural selection and our understanding of the evolution of complex characters. Then we will delve into developmental genetics to explore how the gene regulation can alter spatial and temporal expression patterns during development. We will next conduct a survey the basic embryology of key morphological systems of interest to biological anthropologists including: the axial skeleton and somite formation, limb buds, musculoskeletal system, skull formation, and dental and skin appendage formation. We will also explore issues concerning skeletal plasticity, fossil analysis, and comparative genomics. Discussion particular case studies related to human and primate evolution and morphological variation will illustrate the principles discussed in this course.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 470: Our Place in Nature", "department": "Anthropology (ANTH)", "credits": "3 Credits/Maximum of 3", "description": "An in-depth consideration of humanity's behavioral origins as biological beings through natural selection.  ANTH 470 Honors Our Place in Nature (3) The title \"Our Place in Nature\" takes off from T.H. Huxley's famous book in 1863 that put humans in rather than outside of nature, and the idea of the course is to place humans in the context of organic evolution both specifically and as a kind of general \"model\" organism (for example, genomic, phylogenetic, and comparative perspectives will be included). We will take a theme (one or more related topics, depending on enrollment, timeliness, etc.), which students will be assigned to work on singly or in groups. We'll first read from the historical, comparative, and evolutionary literature to see how \"Our Place in Nature\" relative to that theme, was first argued. Then we will follow the literature in evolutionary, developmental and genetic biology to the present to see how our current understanding of the trait evolved. Current research, especially on developmental and genetic aspects of the trait, will be examined in depth. We'll pay special attention to research strategies, comparative and genomic approaches, and latent working assumptions that help or hinder our explanations. The sociocultural context will be considered throughout, including the implications for society of our changing scientific assessment of the trait.As an Honors course, we will have the time, and the students the dedication, to pursue the chosen topic(s) in much greater and more rigorous detail than is possible in the usual lecture or even seminar course formats. The students who enroll for this course will be given a description of the approach and the intended general topic, on a course web page or by email when I learn they have registered. Requisite background reading will be identified so students will know what will be expected of them. Some prior reading will be assigned, so that we can begin the semester with a common basis in background. The course will assume the level of knowledge such as can be obtained in one of several recent \"Evolution\" texts, an understanding of modern genetics and genetic methodology, basic statistics, and a general work on the history and philosophy of science and evolutionary thinking (initially, probably J.A. Moore's Science as a Way of Knowing). This substantial background requirement is based on this being an upper-level class; for good students to get what good students deserve at a good university, we need to be able to start at a high level.Evaluation will stress original synthetic thought and investigation rather than memorized factual recapitulation. Work groups will tackle particular problems, present them, and turn in written products. There will be a written take-home synthetic essay exam. There will be other written assignments summarizing assigned reading or topics to keep students on track. The class will generally be based on oral discussion and/or be run in Socratic Q&A format. Evaluation will include a major component related to attendance and to level and quality of in- class participation, acquired knowledge and quality of thought and communication. This course will build on, and incorporate, knowledge acquired in physical anthropology, evolutionary biology, statistics, and genetics courses and will count as 3 credits toward the additional courses in biological anthropology required for the Anthropology major.", "prerequisite": "5th Semester standing", "other": ["Honors"]}, {"course_name": "ANTH 471H: Biology, Evolution, and Society", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Exploration of the genetic theory of evolution and development, its history and application within Biology and beyond.", "prerequisite": "BIOL 222", "other": ["Honors"]}, {"course_name": "ANTH 472: The Ecology of Traditional Farming", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "This course will examine the ecology of traditional farming, focusing on the farming household, its farm, and its subsistence needs.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 476W: Anthropology of Gender", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Cross-cultural construction of gender and sex roles; theories of gender construction; case studies and practical effects. ANTH 476 / WMNST 476 Anthropology of Gender (3)Students will learn the current theoretical approaches in anthropology to the cultural construction of gender and sex roles. The first 2-3 weeks of the course will concentrate on exploring and understanding these theoretical approaches. The remaining weeks will focus on case studies of non-western gender systems, and on the practical effects of those systems, but students will also be encouraged to relate these systems to their own experience. Each meeting will be based on discussion of the readings assigned for that meeting and students will be expected to participate. During the period devoted to theoretical approaches, discussion will focus on the assumptions, advantages, and disadvantages of each approach. For the part of the course devoted to readings on individual societies, one reading each week will be the basis for a critical essay of approximately five pages. These essays will be expected to include: 1) an identification of the theoretical approach that informs the work, 2) a statement of the author's arguments or questions, 3) a discussion of the methods used to provide data in support of the arguments or to answer questions, 4) a critique of the adequacy of data, and 5) a statement suggesting which additional elements might make for a better study. These essays will be graded for both content and form and students will have the option of rewriting essays (and improving their grade) after they receive comments. These essays will provide 60% of the course grade, while participation in discussions will provide another 15%.A short research paper will also be required. The paper must focus on a question or hypothesis concerning gender, and a preliminary proposal that includes the focus of the paper, its relevance to the course, and a beginning bibliography is required. A first draft of the paper will be required two weeks before the end of the semester. The research paper will provide 25% of the course grade.The course complements other courses in Anthropology that deal with sex differences, but will provide a perspective on gender that is not available elsewhere in the curriculum. The course can be used to fulfill a Behavioral Anthropology requirement in both the major and minor in Anthropology and a writing across the curriculum requirement. It will also provide students in other departments with the opportunity to study aspects of diverse, non-western cultures. The course is currently identified as one that may be taken to fulfill the requirements of the Women's Studies minor.", "prerequisite": "3 credits of ANTH or 3 credits of WMNST", "other": ["Cross-listed with: WMNST 476W", "Writing Across the Curriculum"]}, {"course_name": "ANTH 478: Cannibalism", "department": "Anthropology (ANTH)", "credits": "3 Credits", "description": "Explores the cultural institution of cannibalism, uses of the \"cannibal\" label, and cannibalism's meaning among those who practiced it.", "prerequisite": "ANTH 045", "other": ["International Cultures (IL)"]}, {"course_name": "ANTH 492: Intermediate Field Methods", "department": "Anthropology (ANTH)", "credits": "3-6 Credits/Maximum of 6", "description": "On-site experience in collecting archaeological, behavioral, or biological data.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 493: Field Techniques", "department": "Anthropology (ANTH)", "credits": "3-6 Credits/Maximum of 6", "description": "Training in techniques involving analyses of archaeological, behavioral, or biological data.", "prerequisite": "3 credits of ANTH"}, {"course_name": "ANTH 494: Research Project", "department": "Anthropology (ANTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "ANTH 494H: Research Project", "department": "Anthropology (ANTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "ANTH 495: Internship", "department": "Anthropology (ANTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "ANTH 496: Independent Studies", "department": "Anthropology (ANTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall ouside the scope of formal courses."}, {"course_name": "ANTH 497: Special Topics", "department": "Anthropology (ANTH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ANTH 499: Foreign Studies", "department": "Anthropology (ANTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]