[{"course_name": "ARAB 1: Elementary Modern Standard Arabic I", "department": "Arabic (ARAB)", "credits": "4 Credits", "description": "Introduction to reading, writing, pronunciation, and aural comprehension of modern standard Arabic; simple grammatical forms; basic vocabulary.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "ARAB 2: Elementary Modern Standard Arabic II", "department": "Arabic (ARAB)", "credits": "4 Credits", "description": "Continuation of ARAB 1 ; development of additional skills in conversation, reading, and writing; grammar and vocabulary building; cultural components.  ARAB 2 Elementary Modern Standard Arabic II (4) (BA) This course meets the Bachelor of Arts degree requirements.This language and culture course, which counts towards the language requirement for B.A. (and some other) degrees, presents the second semester of the study of the Modern Standard Arabic language and an exploration of several aspects of Arab cultures. ARAB 2 is the continuation of ARAB 1 , an elementary course designed to introduce learners of Arabic as a second/foreign language to the basic structures of Arabic and to its uses in common situations of everyday communication. ARAB 2 begins with a review of the basics learned in ARAB 1 , and, as in some sections of ARAB 1, the course may follow the story of an Arab American family. ARAB 2 expands on vocabulary, goes into more complex grammar structures, and further introduces Arab culture. The \"multiplicity\" of the Arabic language and the coexistence of spoken (colloquial) and written standard forms of Arabic continue to be addressed in order to prepare the student for the complex reality of the language. This course underscores all four communication skills (reading, speaking, listening and writing) and uses audio and video material to take the learner to native speakers in their natural environment; introducing invaluable listening segments and various cultural aspects of the Arab world. The course may also have recourse to popular media such as films, comics, newspaper headlines, websites, music, and songs. Students are reminded through their oral presentations that Arabic is spoken as an official language in 22 countries with diverse and rich historical, political, economical, religious, artistic, and literary venues, and Arabic is also used in many additional parts of the world. Class activities and projects are designed to enable students to become active, creative participants, and transmitters of new knowledge to their peers. The course is designed for students who have completed Arabic 001 in Penn State's language sequence or have the equivalent level of language proficiency. In turn, this course serves as a prerequisite for AARAB 3. Placement within the Arabic language sequence follows the University's foreign language placement policy; for example, students whose native language is Arabic are not eligible to receive credit in this course.", "prerequisite": "ARAB 001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "ARAB 3: Intermediate Modern Standard Arabic", "department": "Arabic (ARAB)", "credits": "4 Credits", "description": "More complex grammatical forms; vocabulary building principles; continued development of skills in conversation, reading, writing; culturally-oriented readings and films.  ARAB 3 Intermediate Modern Standard Arabic (4) (BA) This course meets the Bachelor of Arts degree requirements.This language and culture course, which completes the 12th-credit-level language requirement for B.A. (and some other) degrees, presents the third semester of the study of the Modern Standard Arabic language and an exploration of several aspects of Arab cultures. ARAB 3 is an intermediate course designed as a continuation of ARAB 2 and a basis for further study of Arabic as a second or foreign language. The course intends to alert students to the wealth and intricacies involved in learning the Arabic language and its many cultures. In addition to being the official language of 22 countries, with great ancient civilizations, complex modern histories, and intense political situations, Arabic is also the language of the Islamic religion; the language of a booming music and film industry, and the language of a significant body of literature. The multiplicity of the Arabic language, as well as the coexistence of colloquial and modern standard Arabic, is addressed in this course. The course emphasizes all four communication skills (reading, speaking, listening and writing). Vocabulary and grammar are expanded. Students become involved in the Arabic language and its cultures through various activities, which may be designed around a serialized and audio-visually enhanced story set in an Arabic environment, as well as through an oral report presented in class. The course may use popular media such as films, comics, newspaper articles, music, websites, and songs. Themes relating to contemporary experience are treated, such as relationships with family members and friends, the decision to immigrate, daily life within a residence, how a child of an Arab immigrant feels, the cultural importance of hospitality, and the month of Ramadan. The course is designed for students who have completed ARAB 2 in Penn State's language sequence or have the equivalent level of language proficiency. In turn, ARAB 3 course serves as a prerequisite for ARAB 110. Placement within the Arabic language sequence follows the University's foreign language placement policy; for example, students whose native language is Arabic are not eligible to receive credit in this course.", "prerequisite": "ARAB 002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "ARAB 51: Elementary Intensive Arabic for Graduate Students I", "department": "Arabic (ARAB)", "credits": "3 Credits", "description": "Intensive introduction to Modern Standard or Colloquial Arabic: first half of graduate sequence in elementary reading, writing, listening, cultures.  ARAB 51 Elementary Intensive Arabic for Graduate Students I (3)Students learn the Arabic alphabet. They learn to form the letters in all their different positions, they also learn to read them. Practice through dictation, listening and reading lists of words containing the different sounds and letters. Students learn how to greet one another. They also learn vocabulary words they can use in simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"course_name": "ARAB 52: Elementary Intensive Arabic for Graduate Students II", "department": "Arabic (ARAB)", "credits": "3 Credits", "description": "Intensive introduction to Modern Standard or Colloquial Arabic: second half of graduate sequence in elementary reading, writing, speaking, listening, cultures.  ARAB 52 Elementary Intensive Arabic for Graduate Students II (3)This is the second in a series of three courses designed to give students an intensive introduction to Arabic. This is the second half of graduate intensive sequence in elementary reading, writing, speaking, listening, and cultural contexts. Students will learn the Arabic vocabulary. Lessons are taught in an authentic cultural context.", "prerequisite": "ARAB 051 and graduate standing"}, {"course_name": "ARAB 97: Special Topics", "department": "Arabic (ARAB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ARAB 99: Foreign Studies", "department": "Arabic (ARAB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ARAB 110: Arab Language, Cultures, and Current Topics", "department": "Arabic (ARAB)", "credits": "3 Credits", "description": "Fourth-semester Modern Standard Arabic: study of cultures through authentic discourse, texts, film; development of reading, writing, listening, speaking skills.  ARAB 110 Arab Language, Cultures, and Current Topics (3) (GH;IL) (BA) This course meets the Bachelor of Arts degree requirements.This language and culture course, which fulfills the Humanities or the International Cultures requirement within General Education or the Other Cultures requirement within the Bachelor of Arts degree, will offer a continuation of the study of the Modern Standard Arabic language and an exploration of several aspects of Arabic cultures, such as the religious and cultural traditions of the month of Ramadan, the differences between American and Arab relationships, preparing for a trip to the Middle East, and an introduction and brief exposition of the Palestinian problem. The course is designed for students who have completed ARAB 003 in our language sequence or have the equivalent level of language proficiency. Students will develop listening, reading, writing, and speaking skills, and will be introduced to a range of Arabic cultures and encouraged to see both commonalities and differences among them. The material is always presented through culturally rich texts. The course offers opportunities for students to increase their knowledge and appreciation of not only the language, in its Modern Standard form, but also the varieties of cultural production in the Arabic-speaking world, in their many facets and diverse manifestations. Along with continuation of language learning, students are exposed to Web sites, film, music, comics, literature etc. Students' assignments use a combination of reading, writing, listening, and researching skills. Students often work in groups, performing oral and written class activities. This course serves as a prerequisite for ARAB 401.", "prerequisite": "ARAB 003 or permission of program", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"course_name": "ARAB 164: Introduction to the Qur'an", "department": "Arabic (ARAB)", "credits": "3 Credits", "description": "The Qur'an is the sacred text of Islam. Revered by over a billion Muslims today, it is little understood by non-Muslims. This course will introduce students to the literary and religious meanings of this important text, which is seen as both the very word of God as well as the premier example of Arabic style. Attention will be given to the many cultures which have been influenced by this text, especially the Middle Eastern world. All readings will be in English translation.", "other": ["Cross-listed with: RLST 164", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARAB 165: Islamic States, Societies and Cultures c. 600-1500", "department": "Arabic (ARAB)", "credits": "3 Credits", "description": "This course introduces students to the history and culture(s) of the Islamic world from c. 600-1500. The course develops a historical framework for understanding developments in religious and legal thought and practice, science, medicine, and technology, philosophy, and the arts. Students will learn about culture through lecture and discussion and through examination and analysis of a variety of texts and examples of material culture from different periods and regions.", "other": ["Cross-listed with: HIST 165, RLST 165", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARAB 197: Special Topics", "department": "Arabic (ARAB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ARAB 199: Foreign Studies", "department": "Arabic (ARAB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ARAB 295: Internship", "department": "Arabic (ARAB)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "ARAB 296: Independent Studies", "department": "Arabic (ARAB)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "ARAB 297: Special Topics", "department": "Arabic (ARAB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ARAB 299: Foreign Studies", "department": "Arabic (ARAB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ARAB 397: Special Topics", "department": "Arabic (ARAB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ARAB 399: Foreign Studies", "department": "Arabic (ARAB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "ARAB 401: Advanced Language & Cultures I", "department": "Arabic (ARAB)", "credits": "3 Credits", "description": "Fifth-semester Modern Standard Arabic: reading more complex texts, films, further development of conversation, composition skills, Arab cultures, current issues.  ARAB 401 Advanced Language & Cultures I (3)(IL) (BA) This course meets the Bachelor of Arts degree requirement.This language and culture course, which fulfills International Cultures requirement or the Other Cultures requirement within the Bachelor of Arts degree, will offer a continuation of the study of the Modern Standard Arabic language and an exploration of several aspects of Arab cultures. Language skills (reading, writing, speaking, listening) are further developed through the exploration of several culturally important themes that illustrate a range of cultural situations and contexts. Among the themes that may be discussed are the following: new opportunities and also persistent problems facing Arab youth; social and economic conditions in which fundamentalist and other groups present their agendas; the condition of women and the pressures often exerted by society's norms and traditions to keep women out of the public scene; cultural, emotional, and literary reactions to the tragedy of displaced peoples; Islam and other religions among Arab cultures; love and the images and symbolism used to describe it; the writings of one or more well-known authors, including the evolution within the works of the author(s) and the influence of these writings on Arab thought; Arabic cultures in various parts of the world, including the U.S. All themes are presented in the target language and represent a wide range of Arabic culture and current issues. The course may also involve popular media such as comics, newspaper headlines, music and songs, and a visit to the library. Class activities and projects are designed to enable students to become active and creative participants and transmitters of new knowledge to their peers. Students will be asked to conduct research using authentic material, and to write a short paper in Arabic as a wrap up of their final presentation.", "prerequisite": "ARAB 110", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARAB 402: Advanced Language & Cultures II", "department": "Arabic (ARAB)", "credits": "3 Credits", "description": "Sixth-semester Modern Standard Arabic: reading more complex texts, films, further development of conversation, composition skills, Arab cultures, current issues.  ARAB 402 Advanced Language & Cultures II (3) (IL) (BA) This course meets the Bachelor of Arts degree requirements.This language and culture course, which fulfills the Humanities or the International Cultures requirement within General Education or the Other Cultures requirement within the Bachelor of Arts degree, will build upon previous courses in the Arabic curriculum and offer a continuation of the study of the Modern Standard Arabic language, an exploration of several aspects of Arab culture in a range of contexts, and the exploration of current issues and topics of interest in Middle Eastern media. Among the themes that may be discussed are the following: the achievements of Arab Nobel Prize winners, holiday traditions, colloquial Arabic, love, social and economic conditions of the poor and the middle-class, practical and psychological problems arising from belonging to a certain social class, ways in which the state (in different countries) relates to the needs of the people, Arab cultures in various parts of the world including the U.S., and a variety of the most recent social and political newspaper and magazine articles.All themes are presented in the target language and represent a wide range of Arabic culture and current issues. The course course may also involve popular media via the reading of comics, relevant headlines, music and songs, and computer practice for students to learn how to type in Arabic and benefit from available resources to equip students with this useful Arabic tool. Class activities and projects are designed to enable students to become active and creative participants and transmitters of new knowledge to their peers. Themes will often be examined comparatively and will draw on students' personal experience to connect with the material presented.The course is designed for students who have completed Arabic 401 in our language sequence or have the equivalent level of language proficiency. At University Park the course will be offered every semester or every other semester, according to enrollment patterns and the availability of staff. At other locations, course-offering patterns will be determined by their needs.", "prerequisite": "ARAB 401", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARAB 494: Research Project", "department": "Arabic (ARAB)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "ARAB 494H: Research Project", "department": "Arabic (ARAB)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "ARAB 496: Independent Studies", "department": "Arabic (ARAB)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "ARAB 497: Special Topics", "department": "Arabic (ARAB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "ARAB 499: Foreign Studies", "department": "Arabic (ARAB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]