[{"course_name": "ART 1: Introduction to the Visual Arts", "department": "Art (ART)", "credits": "3 Credits", "description": "ART 1 is a course on understanding and interpreting art and serves as an introduction to the visual arts. The material follows an interdisciplinary approach to the practice of the visual arts, examining the social, cultural, historical, and aesthetic implications of studio activity.This course is organized around six central topics: Art as Expression, Art as Cultural Narratives, Form and Content, Two-Dimensional Art, Three-Dimensional Art, and Writing About Art.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 2: Interactive Learning and Web-Design", "department": "Art (ART)", "credits": "3 Credits", "description": "Introduce students to research on-line, preparing verbal, visual and other elements for presentation of outcomes and posting them to the Internet. ART 2 Interactive Learning and Web-Design (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This course is constructed to introduce students to doing research on-line, preparing the verbal, visual and other elements for a presentation of their research and posting them to the Internet with special emphasis placed on the aesthetics of Web design and effective communication. Both individual and group projects are included. It is intended to provide the skills to work collaboratively using computers and the Internet effectively, efficiently and with an awareness of the aesthetic qualities of that work. This final emphasis is particularly important since the quality of presentation is not included in most classes where Web sites are developed and they are crucial to the effective use of this medium. Aesthetic judgments by the students of their peers work is central to making comprehensive and complete evaluations of it. A central message of the course is that content and presentation cannot be separated and a primary skill to be learned is how to discover, create and refine images for use on the Web in conjunction with clear, well-organized and legible text.The student's work will be evaluated on the basis of how well they grasped the problem, worked with others to solve it, when required, and the effectiveness of the final result.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 3: Visual Images on the Web", "department": "Art (ART)", "credits": "3 Credits", "description": "Introduce students to using visual images for communication on the World Wide Web. ART 3 Visual Images on the Web (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This course is constructed to introduce students to doing art work on-line, preparing visual, verbal and other media for presentation on the Internet with special emphasis placed on the aesthetics of image making and good Web design.Working both individually and in groups is included. Each student is assigned to a working group, which makes collaboration and communication possible.All the projects emphasis art making of different kinds - still and animated, bit-map and vector - as well as different formats - HTML, Flash format and Portable Document format. The grasping of the different kinds of images each makes available, aesthetic qualities of each and they can be used in communication at the center of the course.The student's work will be evaluated on the basis of how well they grasped the problem, worked with others, when required, to solve it and the effectiveness of the final result.The students may do the work for the course on their personal computers or in the University labs on any of the available platforms - Windows, Mac or UNIX.The course will be offered in the spring and the fall and have an enrollment of 200 students.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 10: Introduction to Visual Studies", "department": "Art (ART)", "credits": "3 Credits", "description": "ART 10 is an introductory art appreciation course created for students without any artistic background. This course introduces students to various art movements, cultural influences, artistic genres, artists, and their artwork. The main emphasis of the course is to teach students hands-on studio arts techniques as they conduct personal research and explore their own creativity. While utilizing art historical and contemporary art concepts, the course guides the students through different time periods. Examining and discussing artwork is a crucial part of this course that encourages the students to express their opinions about art in an intelligent and articulate manner. Visiting art galleries and museums allows the students to experience art in person and to convey constructive criticism through writing. By the conclusion of the course, students compile a portfolio of narratives and artworks reflective of their research, understanding, creativity, and personal growth.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 11: First-Year Seminar- School of Visual Arts", "department": "Art (ART)", "credits": "1 Credits/Maximum of 1", "description": "Facilitate adjustment to high expectations, demanding workload, increased academic liberties, and other aspects of college life in the arts. The First-Year Seminar will help facilitate students' adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life and introduce them to their responsibilities as members of both the School of Visual Arts (SoVA) and University community. In addition, the First-Year Seminar is designed to engage students, acquaint them with the learning tools and resources available at Penn State and orient them to the SoVA community from the outset of their undergraduate studies in a way that will bridge to later experiences in their chosen program of study. The first-year seminar will serve as a broad introduction to SoVA's programs of study in Studio Art, Art Education, and Interdisciplinary Digital Studio (IDS) as well to Penn State's academic policies and procedures. Topics to be covered: Introduction to SoVA's areas of study (Studio Art, Art Education, and Interdisciplinary Digital Studio) University wide Web based academic resources, academic policies and procedures Introduction to Penn State's Student Affairs Offices (e.g., Career Services, Center for Women Students, Multicultural Resource Center, and Student Activities)", "other": ["First-Year Seminar"]}, {"course_name": "ART 17: Introduction to Metal Arts", "department": "Art (ART)", "credits": "3 Credits", "description": "Introduction for non-art majors to fundamental jewelry making and small-scale metalsmithing processes including fabrication, surface treatment, and finishing of metalwork. ART 17 Introduction to Metal Arts (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. ART 17 is intended as a general survey of metal arts for non-majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and a sensitivity to the various metal arts conventions. Students are given the opportunity to briefly explore many of the traditional materials and processes of metalsmithing including those that are used in cold joining, surface texture, and fabrication. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which the metal arts function. As a general appreciation offering, emphasis is placed on active learning processes that involve students in basic studio materials and techniques. Since the School of Visual Arts now requires a portfolio review for visual arts majors to enroll in studio courses, ART 17 provides an opportunity for non-art majors to do studio work in conjunction with an exploration of art concepts.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking"]}, {"course_name": "ART 20: Introduction to Drawing", "department": "Art (ART)", "credits": "3 Credits", "description": "ART 20 is intended as a general survey of the art of drawing for non-majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and on the various conventions used in drawing. Students will be given the opportunity to briefly explore many of the traditional materials of drawing, including pencil, charcoal, conte, ink and ink wash, pastel, as well as experimental tools. Slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which drawing functions. As a general appreciation offering, emphasis is placed on active learning processes that involve students in basic studio materials and techniques. Since the School of Visual Arts now requires a portfolio review for Visual Arts majors to enroll in studio courses, ART 20 provides an opportunity for non-art majors to do studio work in conjunction with an exploration of art concepts.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking"]}, {"course_name": "ART 30: Introduction to Sculpture", "department": "Art (ART)", "credits": "3 Credits", "description": "Introduction to sculpture for non-art majors consisting of lectures/basic studio work coordinated to cover broad range of processes. ART 30 Introduction to Sculpture (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. ART 30 is intended as a general survey of the art of sculpture for non-majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and sensitivity to the various sculptural conventions. Students are given the opportunity to briefly explore many of the traditional materials of sculpture including those that are used in modeling and replication, subtractive processes, and fabrication. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which the art of sculpture functions. Students enrolled in this course will be required to participate in the following active learning components:1. Studio Assignments: a) Modeling and Replication b) Subtractive Processes c) Fabrication Assignment2. Creating a social and historical context for sculpture making through slide presentations, studio visits and museum critiques: a) Slide presentations: students will be asked to consider the concepts of their creative projects in relationship to the sculptural works of historical and contemporary artists in order to understand the ways in which the three dimensional aspects of sculpture convey meaning. b) Studio visits: Students will visit the personal studios of local artists to learn how professional artists develop best practices as related to the three basic approaches to rendering sculptural form outlined above. Additionally, they will explore and discuss with these artists the concepts expressed in their sculptural works. c) Museum critiques: Museum visits will enable students to learn how to engage and respond to actual works of art as compared with those that they experience as slide and printed representations. The role of museums and galleries in contemporary art practice will also be discussed.Grading and evaluation: Students' sculptural projects will be evaluated according to the following criteria: 1) the uniqueness of the visual concepts developed in their studio assignments; 2) the strength of their visual compositions-their ability to communicate concepts clearly; 3) the quality of their craftsmanship-an effective use of materials and procedures and commitment to the studio assignments-the effort expended on each project; 4) Their willingness to participate in critique sessions-a thoughtful and informed interpretation of visual ideas in sculptural works produced by them in class as well as those discussed during slide presentations, studio visits, and museum critiques.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking"]}, {"course_name": "ART 40: Introduction to Printmaking", "department": "Art (ART)", "credits": "3 Credits", "description": "Instruction and practice in elementary printmaking and papermaking processes. ART 40 Introduction to Printmaking (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. ART 40 is intended as a general survey of the art of printmaking for non-majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and sensitivity to the various printmaking conventions. Students are given the opportunity to briefly explore the various approaches to printmaking, which may utilize some or all of the following: screenprinting, relief, intaglio, lithography, and others. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which the art of printmaking functions.Students enrolled in this course will be required to participate in the following active learning components:1. Studio Printmaking Assignments: a) Screenprinting b) Relief c) Itaglio d) Lithography e) Others (collagraph, monotype, electrostatic, artists books)2. Creating a social and historical context for printmaking through slide presentations, studio visits and museum critiques: a) Slide presentations: students will be asked to consider the concepts of their creative projects in relationship to prints of historical and contemporary artists in order to understand the ways in which the two-dimensional aspects and various processes of printmaking convey meaning. b) Studio visits: Students will visit the personal studios of local printmakers to learn how professional artists develop best practices as related to the basic approaches to printmaking outlined above. Additionally, they will explore and discuss with these artists the concepts expressed in their printed images. c) Museum critiques: Museum visits will enable students to learn how to engage and respond to actual prints as compared with those that they experience as slide and book/journal reproductions. The role of museums and galleries in exhibiting prints will also be discussedGrading and evaluation: Students' printmaking projects will be evaluated according to the following criteria: 1) the uniqueness of the visual concepts developed in their studio assignments; 2) the strength of their visual compositions-their ability to communicate concepts clearly; 3) the quality of their craftsmanship-an effective use of materials and procedures and commitment to the studio assignments-the effort expended on each project; 4) Their willingness to participate in critique sessions-a thoughtful and informed interpretation of visual ideas in prints produced by them in class as well as those discussed during slide presentations, studio visits, and museum critiques.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking"]}, {"course_name": "ART 50: Introduction to Painting", "department": "Art (ART)", "credits": "3 Credits", "description": "Introductory experience in making of art through painting media; designed for non-majors seeking a general overview of studio practice. ART 50 Introduction to Painting (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. ART 50 is intended as a general survey of the art of painting for non-majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and sensitivity to the various conventions used in the discipline of painting. Students are given the opportunity to briefly explore the various approaches to creating visual images by applying various painting materials, techniques, and concepts. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which the art of painting functions.Students enrolled in this course will be required to participate in the following active learning components:1. Studio Painting Assignments: a) Visual concept development: students will be introduced to the various ways that artists create meanings through painting. b) Materials development: through a process of exploration and experimentation, students will learn how to apply various painterly media and tools in creating visual images. c) Technique development: through a process of exploration, experimentation, and skill development students will learn how to render and model painterly images that range between abstract and realistic representations.2. Creating a social and historical context for painting through slide presentations, studio visits and museum critiques: a) Slide presentations: students will be asked to consider the concepts of their creative projects in relationship to paintings by historical and contemporary artists in order to understand the ways in which the two-dimensional aspects and various processes of painting convey meaning. b) Studio visits: Students will visit the personal studios of local painters to learn how professional artists develop best practices as related to the basic approaches to painting outlined above. Additionally, they will explore and discuss with these artists the concepts expressed in their painted images. c) Museum critiques: Museum visits will enable students to learn how to engage and respond to actual paintings as compared with those that they experience as slide and book/journal reproductions. The role of museums and galleries in exhibiting paintings will also be discussed.Grading and evaluation: Students' painting projects will be evaluated according to the following criteria: 1) the uniqueness of the visual concepts developed in their studio assignments; 2) the strength of their visual compositions-their ability to communicate concepts clearly; 3) the quality of their craftsmanship-an effective use of materials and procedures and commitment to the studio assignments-the effort expended on each project; 4) Their willingness to participate in critique sessions-a thoughtful and informed interpretation of visual ideas in paintings produced by them in class as well as those discussed during slide presentations, studio visits, and museum critiques.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking"]}, {"course_name": "ART 51N: Meteorology and Visual Arts: To Know is to See", "department": "Art (ART)", "credits": "3 Credits", "description": "This course examines the inter-relationship between what we know and what we see, through an introductory exploration of art and science. Engaging students in the study of weather formation, mainly clouds, artistic depictions within the genre of landscape, and the expressed practice of painting; fosters the development of observational skills necessary for reading the landscape and interpreting collected data. What we know and what we see is an on-going evolution of development; syncing the old with the new. Therefore, observation and interpretation are essential to critical thinking, making the intersection between art and science a fertile ground for discovery and learning. The exciting part of the course is the large amount of overlap in the general ideas and thought processes used in meteorology and art, especially when using clouds as the connective tissue. Scientists and artists are both detail oriented and worry about the quality of their work. Both involve collecting data to find the best approaches to a problem, and reasoning through challenges that arise. Students will be challenged throughout the course to seek these connections and how perspectives from each discipline inform the other. Meteorology and art have long been aligned in a common quest to understand how the world works, each seeking interpretations and explanations using a range of complementary and contrasting practices and perspectives. Clouds come in a vast array of sizes and shapes, and are depicted in art using a variety of techniques, creating a shared focus for a deeper understanding of both areas of endeavor. Students will learn about the concept of mixing, which is important to cloud formation and to painting. Students will conduct experiments to learn about cloud processes, and will learn and practice artistic techniques to convey atmospheric conditions. Ideas from both perspectives will be integrated in analysis and discussion. Data from instruments and the individual artist will be collected, shared, and analyzed. Learning how clouds form will help with painting, and questions and perspectives that arise from painting will increase the understanding of cloud processes. The common threads in this approach are a curious mind, a strong detail-oriented focus, effective communication, and respect for the creative tension between ambiguity and assurance in the search for a better sense of causes, connections, and incessant changes.", "other": ["Cross-listed with: METEO 51N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 80: Introduction to Ceramics", "department": "Art (ART)", "credits": "3 Credits", "description": "Introduction to the concepts and techniques fundamental to the making of pottery and ceramic sculpture. ART 80 Introduction to Ceramics (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. ART 080 is intended as a general survey of the art of ceramics for non-majors. As a studio offering, emphasis is placed on hands-on activities, which promote visual literacy and sensitivity to the various conventions in ceramics. Students are given the opportunity to briefly explore many of the traditional approaches to ceramics including those that are used in hand building, wheel throwing, glazing, and kiln firing. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which the art of ceramics functions. As a general appreciation offering, emphasis is placed on active learning processes that involve students in basic studio materials and techniques. Since the School of Visual Arts now requires a portfolio review for visual arts majors to enroll in studio courses, ART 80 provides an opportunity for non-art majors to do studio work in conjunction with an exploration of art concepts.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 97: Special Topics", "department": "Art (ART)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "ART 98: Special Topics", "department": "Art (ART)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 100: Concepts and Creation in the Visual Arts", "department": "Art (ART)", "credits": "3 Credits", "description": "A study of the personal and cultural foundations of artistic creation and practice of creative production in the art studio.  ART 100 Concepts and Creation in the Visual Arts (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. ART 100 is intended as an introduction to the concepts underpinning artistic creation. Through lectures and studio work, students will explore relationships between artistic processes and in daily life. The objective of the course is to develop in the student both an appreciation and understanding of contemporary art through an examination of art and contemporary social, cultural, and political issues surrounding artistic practice. Students will respond to the ideas presented in the lectures by completing a series of artworks intended to reflect the issues and concepts that have been presented. The intended, though not exclusive, audience for the course is non-art majors. While the focus of the course is a critical examination of both the artworks studied and the artworks created by the students, the critique will be derived from the various backgrounds and academic experiences of the students and not necessarily from their knowledge of art. In this manner, the course can become a relevant complement to all of their studies. In short, the goal of the course is to understand art as a means to critically engage and begin to understand our surroundings and not simply as an end product. Evaluation of student achievement will be done in both the classroom and studio portions of the course. Since it is not expected that students have a background in art, content knowledge assessment will primarily be based on the students' active participation in class discussions as well as objective tests in the form of written responses to the issues and concepts examined. In the studio, their work will be judged on how well students have responded to the concepts and issues explored as well as on their ability to articulate their own ideas in relation to those of other students and other aesthetic and cultural ideas to which they have been exposed. In the studio, this process will primarily be done in the form of individual conversation and group critique. Since the School of Visual Arts now requires a portfolio review for visual arts majors to enroll in studio courses, ART 50 provides an opportunity for non-art majors to do studio work in conjunction with an exploration of art concepts.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"course_name": "ART 101: Introduction to Web Design", "department": "Art (ART)", "credits": "3 Credits", "description": "A beginning level course in Web Design, with emphasis on designing with standards to assure accessibility and effective communication.  ART 101 Introduction to Web Design (3) (GA) (BA) This course meets the Bachelor of Arts degree requirements.ART 101 is a beginning level web design course that is concerned with the designing and creating of web sites using XHTML and recommended government standards. This emphasis is central so that the work the students do will reach the broadest audience, including people with disabilities, through the use of a broad range of software and hardware. This course will teach students how to meet the present government standards for accessibility by the disabled and the technical and accessibility standards recommended by the World Wide Web Consortium (W3C). This course will also place an emphasis on the uses of art-images to present information along with the presentation of text and typography for communication and how these elements can make projects on the web more effective. The course will introduce topics such as: clarity of art and design, ease of use (navigability), and in creating art and graphics for web delivery (optimization). There will also be discussion on the dynamics of networked communications, along with issues pertaining to the authoring and publishing of content and media on the internet.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"course_name": "ART 102: Beginning Computer Aided Design for Artists", "department": "Art (ART)", "credits": "3 Credits", "description": "ART 102 is an introduction to Computer Aided Design as an artistic media. Students will model objects in a virtual environment and then realize their objects tangibly though 3D printing and other digital output processes. ART 102 will consist of class lecture, demonstration, work periods, and critique. ART 102 is (an almost) paperless computer based class.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 110: Ideas as Visual Images", "department": "Art (ART)", "credits": "3 Credits", "description": "Introduction to the ideational relationships among subject, form, and content in visual images."}, {"course_name": "ART 111: Ideas as Objects", "department": "Art (ART)", "credits": "3 Credits/Maximum of 3", "description": "An introduction to the relationship between ideas and the creation of three-dimensional objects. In this course, students will learn concepts, methods, and vocabulary relative to the production of three-dimensional objects. Through slide lectures, discussions, critiques, and assigned projects, participants will investigate how to make, analyze, and critique sculptural objects within the context of contemporary art and visual culture. Students are expected to be inquisitive about the discipline and willing to immerse themselves in it. Students are expected to ask questions, explore new ideas, and engage in the course material.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 122Y: Commentary on Art", "department": "Art (ART)", "credits": "3 Credits", "description": "An introduction to verbal commentary, both oral and written, about art.  The development of critical and expressive skills given emphasis.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "ART 144Z: Climate Change: Arts, Agency and Activism", "department": "Art (ART)", "credits": "3 Credits", "description": "This course introduces students to contemporary art activism and environmental and humanitarian issues through research presentations, discussions and the production of artwork. It encourages students to imagine the effects of climate change and investigate how art can bring new ways of thinking about and bring a greater awareness to global issues. Media will vary depending on student ideas, it may include drawing, painting, video, sculpture, photography or installation art. Coursework integrates written, oral and visual communication. As an introductory course, assessment will be based equally on class discussion, research presentations, the content of art works produced and student's ability to articulate the synthesis of their work within the theme of climate change. ART 144Z fulfills 3 credits of the GA Domain General Education requirements. ART 144Z may also be used in combination with either BIOL 144Z or PSYCH 144Z as linked courses to fulfill 6-credits of Integrative Studies.", "other": ["General Education: Arts (GA)", "General Education - Integrative: Linked", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ART 160N: STEAM: Connecting Art to Science, Technology, Engineering and Mathematics", "department": "Art (ART)", "credits": "3 Credits", "description": "Drawing from traditions of scientific illustration, fine art and literary interpretations of scientific concepts, and collaborations between scientists and artists, this course will establish the ways in which the arts and the creative process have informed the sciences, and have served as a source of inspiration, discovery, and dissemination of scientific thought. Building upon principles shared by the creative process, design-thinking, and the scientific method, the course modules investigate the relationship between form and function in art and each of the STEM disciplines, and explore how the creative process enhances sensory processing and perception of scientific concepts. Through hands-on activities, students will develop creative thinking skills and apply them to understanding and communicating fundamental STEM concepts. The course combines lectures, visual presentations, and problem-based learning activities to build knowledge of pivotal intersections between the arts and sciences, and to develop an appreciation of the interconnectedness of STEM (Science, Technology, Engineering, and Mathematics) and the Arts (STEAM). This course will examine art objects and processes that have facilitated understanding for scientists - as a process of discovery or record; and for audiences - as form of communication or art. Fundamental questions will be: \"Can art or the creative process facilitate discovery and understanding for the scientist? How\" \"Can artistic interpretations of scientific concepts facilitate communication of science to different audiences?\" \"Can creative practice, ie drawing, enhance skills that serve scientific method, i.e., observation?\" Finally, students will seek creative forms to convey scientific concepts in class projects, with the purpose of integrating these dualistic modes of inquiry to build upon their analytic and critical thinking skills holistically.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ART 165: Artistic Concepts of Space", "department": "Art (ART)", "credits": "3 Credits", "description": "A studio course that utilizes lecture and varied media experiences to investigate space as artistic expression.  ART 165 Artistic Concepts of Space (3) ART 165 Artistic Concepts of Space is a hands-on studio course supplemented by lecture. It utilizes various media experiences to investigate notions of space in artistic expression. Explorations will include traditional and contemporary ways of depicting and constructing space as well as contemporary approaches. Both 2-D and 3-D studio investigations will be employed. A lecture component will provide a historical and cultural backdrop upon which students may better understand the role of special depiction in artistic expression.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 166: Artistic Concepts of Form", "department": "Art (ART)", "credits": "3 Credits", "description": "Modeling in light and dark - with particular attention to drawing. (Approximately 5 weeks) Cultural/historical variations of form - including, but not limited to: Egyptian, Medieval, Byzantine, and Modern, and Contemporary. (Approximately 2 weeks) Sculptural notions of form will be investigated by the actual creation of artistic objects, via exercises in modeling, construction, reduction, assemblage, and casting. (Approximately 8 weeks)", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 168: The Digital Medium", "department": "Art (ART)", "credits": "3 Credits", "description": "ART 168 The Digital Medium (3) This course will provide a much needed introductory technological/digital component wherein computing will be discussed as a media, rather than a tool. Students will be engaged in the creation of artistic manifestations of individual interpretations surrounding themes and concepts introduced in class. Each unit of the course will build upon the next resulting in a knowledge base of the possibilities of what the digital medium includes. Students will be asked to demonstrate their knowledge of the medium with a culminating final project that uses at least four of the techniques demonstrated in class. The final project will be determined by the student, manifestations may include a web site, short film, installation, projects, or performance.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 170N: Plant and Microbial Art", "department": "Art (ART)", "credits": "3 Credits", "description": "This inter-domain general education course provides a cross-disciplinary platform for plant- and microbe-facilitated creative production and art-mediated scientific learning. The course balances studio art activities with lecture- and discussion-based learning about integrated science and art topics. Students use the media of plant and microbial pigments, growth, and biology in a hybrid studio-lab environment. The biology, chemistry, and physics of these living and life-derived media are expected to form integral parts of student presentations. Lectures will provide information about broad scientific principles and in-depth learning about specific phenomena underlying the biologically-based media as well as relevant bio-art issues and contexts in which work is produced. Student projects will represent an integration of natural science understanding with artistic expression. Students will be encouraged to go in various directions with their creative efforts, including visual mechanics (light, color, composition), mark making (painting, drawing), meaning making (metaphors, allegories, cultural appropriations), storytelling, sensing (ways of seeing, phenomenology), and new media issues (e.g., post-humanism). Some example types of bio-media and their scientific connections include: plant pigments, which facilitate discussion of light, photosynthesis, basic chemistry and chromatography; bacterial cultures, which facilitate discussion of microbiology, cell biology, and cellular movements; and fluorescent proteins, which facilitate discussion of DNA, RNA, protein structure, mutations, species concepts, and genetic engineering. Student projects integrate the scientific basis of the bio-art media used such that the media become part of the message of the art.", "other": ["Cross-listed with: PPEM 170N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ART 175N: Intersections Between Art and Psychology", "department": "Art (ART)", "credits": "3 Credits", "description": "This course investigates the historical and theoretical intersections between psychology and art. These intersections are organized upon three general domains of perception, cognition, and expression. Within these domain topics may include, but are not limited to: automatic drawing, art and the subconscious, surrealism, symbolism, expressionism, and models and techniques of art therapy. Theorists may include, but are not limited to (I.E. Aristotle, Lowenfeld, Freud, Jung, Moon, etc). Students will be expected to consider the psychological structure beneath creative thought and output. Students will also be expected to reflect on their own experiences and processes throughout their studio work.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ART 197: Special Topics", "department": "Art (ART)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "ART 197A: Special Topics - InterDomain", "department": "Art (ART)", "credits": "3 Credits", "description": "Formal course given on a topical or special interest subject offered infrequently; several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GN/GS GenEd course", "other": ["Cross-listed with: SC 197A", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain"]}, {"course_name": "ART 198: Special Topics", "department": "Art (ART)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 199: Foreign Studies--Art", "department": "Art (ART)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ART 207N: LGBTQ+ Identity, Culture and The Arts", "department": "Art (ART)", "credits": "3 Credits", "description": "WMNST 207N: LGBTQ+ Identity, Culture and the Arts will blend theories and methods in the Social and Behavioral Sciences (GS) with those of the Integrative Arts (GA). The course introduces key ideas, concepts and issues related to LGBTQ+ identity and culture, while highlighting aesthetic values of LGBTQ+ expression. The course broadly traces the historical, global, political and academic trajectories of LGBTQ+ studies and considers contemporary topics (for example, global-local influences, intersectionality, activism, and the media) as they relate to LGBTQ+ identity and the arts. The course is attentive to the ways that sexual identities intersect with other types of identities, such as age, gender, race/ethnicity, ability, religion. The course will also help students develop arts-related skills and teach students to recognize and value the arts as an integral part of LGBTQ+ cultural expression. Students will write critical papers, participate in discussions with artists and scholars, explore queer art and art spaces, as well as create a performance or installation art project. Incorporating seminar - and lecture-style instruction with constructivist-creative learning and experiential strategies, the course seeks to develop a learning community stimulated by discourse, collaboration, and creative/aesthetic exploration. This course is a General Education interdomain (N) course for General Education Social and Behavioral Sciences (GS) and General Education Arts (GA), with US Cultures (US), International Cultures (IL) designate. The course is cross listed in both Women's Studies and Arts.", "other": ["Cross-listed with: WMNST 207N", "Bachelor of Arts: Arts", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ART 211: Introduction to Digital Art and Design Criticism", "department": "Art (ART)", "credits": "3 Credits/Maximum of 3", "description": "An introduction to the language, aesthetics and cultural impacts of digital art and design in contemporary society. ART 211 Introduction to Digital Art and Design Criticism (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. ART 211 examines 1) the conventions, language, practices, and aesthetics used by digital artists and designers and 2) the social and cultural implications that they and their works have for society with regard for the contexts of politics, philosophy, economics, race, gender, and technological development. Critical and creative thinking and expression are given primary emphasis in class activities and assignments. The course meets twice weekly and topics are explored through lectures, discussions, readings, presentations by visiting speakers, and out-of-class trips. Course assignments are writing and project based and require students to respond to ideas and concepts presented in class and to develop critiques of digital works through a variety of formats. Assignments include informal in-class projects, media reviews, a course journal, and a final project. Students build writing skills through analyzing assigned readings and developing research- and reflection-based projects about digital art and design. Speaking and listening skills are developed through discussions and collaborative activities.Course topics explore the: - social contexts of digital art/design; - significance of the computer interface to digital art and design; - practices used by digital artists and designers and their impact on audiences; and - professional issues, concerns, and controversies affecting digital art/design, artists/designers, and their audiencesStudents are required to have access to the Internet and to their University e-mail account.ART 211 will enroll 25 students and will be offered spring semester.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)"]}, {"course_name": "ART 211Y: Introduction to Digital Art and Design Criticism", "department": "Art (ART)", "credits": "3 Credits", "description": "An introduction to the language, aesthetics, and cultural impacts of digital art and design in contemporary society.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "ART 220: Figure Drawing", "department": "Art (ART)", "credits": "3 Credits", "description": "Drawing from life. Emphasis on developing the ability to comprehend and record the human figure. ART 220 Figure Drawing (3) This course is intended to further investigate the art of figure drawing for art majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and sensitivity to the various conventions used in figure drawing. Students will be given the opportunity to explore many of the traditional materials of drawing, including pencil, charcoal, cont', ink and ink wash, pastel, as well as experimental tools. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which figure drawing functions. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 223: Drawing: Techniques, Materials, and Tools", "department": "Art (ART)", "credits": "3 Credits", "description": "Drawing with an emphasis on organization and the development of drawing skills through a variety of techniques, materials, and tools. ART 223 Drawing: Techniques, Materials, and Tools (3) This course is intended to further investigate the art of drawing for art majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and sensitivity to the various conventions used in drawing. Students will be given the opportunity to explore many of the traditional materials of drawing, including pencil, charcoal, cont', ink and ink wash, pastel, as well as experimental tools. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which drawing functions. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 230: Beginning Sculpture", "department": "Art (ART)", "credits": "3 Credits", "description": "An introduction to sculpture consisting of lectures, demonstrations, and basic studio work coordinated to cover a broad range of processes. ART 230 Beginning Sculpture (3) This course is intended to investigate the art of sculpture for art majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and sensitivity to the various conventions used in sculpture. Students will be given the opportunity to explore many of the traditional materials and processes of sculpture, including additive and subtractive processes, plaster-working, wood fabrication, metal fabrication, and mixed-media usage, as well as experimental tools and processes. Slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which sculpture functions. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 240: Beginning Printmaking", "department": "Art (ART)", "credits": "3 Credits", "description": "An introduction to printmaking consisting of lectures, demonstrations, and studio work to cover a broad range of processes. ART 240 Beginning Printmaking (3) This course will consist of lectures, demonstrations, and studio practice in a broad range of printmaking processes. Critiques will be directed toward technical, aesthetic, and historical issues in black and white and color print. Various print collections within the University will be employed to acquaint the students with the work of the professional in the field. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 250: Beginning Oil Painting", "department": "Art (ART)", "credits": "3 Credits", "description": "The materials and techniques of painting in oil and their uses in creative painting on panels and canvas. ART 250 Beginning Oil Painting (3) This course is designed to teach beginning students the basic fundamentals of painting and introduce them to the visual arts as a vehicle for personal expression. It is divided into technical categories for organizational purposes. The unique process of each discipline structures the course and allows for individual expression from a diversity of students with different skills and interests. The basic skills are introduced and studied through the creative process, from conception of an idea, preliminary sketches, variations, and final painting. Emphasis is placed on understanding the goals for each student and focusing on his or her shortcomings and strengths. While a basic mastery of mimetic painting is aimed at, a diverse range of aesthetic styles is presented. Thus the purpose of this course is to increase the appreciation of the visual arts through studio processes and the development of meaningful critical facility. We hope to educate students who will understand the fundamentals of painting and who will become part of an educated audience for the arts. Hopefully, they will be more imaginative and creative people. The studio emphasis on individual growth allows for flexibility in course structure to accommodate the general education objectives as well as for future painting majors. Creative and visual thinking are innately part of all students and these basic studio courses encourage and nurture them.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 260: Water Media", "department": "Art (ART)", "credits": "3 Credits/Maximum of 6", "description": "This course develops artistic expression in water-based painting media while developing skills with watercolor, ink, acrylic, and natural pigments. ART 260 Water Media introduces techniques and concepts relevant to the creation of artworks using water based painting media, materials and techniques, including watercolor, ink, acrylic, and natural pigments, as well as different grounds and surfaces. Basic techniques are introduced and skills are developed while experimentation and innovation are encouraged. Water based painting media such as watercolor, ink, acrylic, and natural pigments, are covered. Examples from historical and contemporary water media painting practice will be presented and discussed. Particular emphasis will be placed upon the development of individual expression and a critical awareness concerning processes, composition, and content. Students apply their emerging skills and expressive preferences in developing a concentrated body of work. A goal is that the work demonstrates technical competence and conceptual awareness through the pursuit and refinement of an evolving personal vision. Students are introduced to the process of `critique, which is central to the critical learning skills that are core experiences to the studio experience. This course gives students the requisite technical and conceptual skills to take more advanced painting and drawing courses such as ART 320 ADVANCED DRAWING and ART 350 INTERMEDIATE PAINTING among others. ART 260 will be offered once a year in the Spring semester."}, {"course_name": "ART 265: Artistic Concepts of Color", "department": "Art (ART)", "credits": "3 Credits", "description": "A studio course that utilizes lecture and various media to investigate color as artistic expression. ART 265 Artistic Concepts of Color (3) ART 265 Artistic Concepts of Color is a hands-on studio course supplemented by lecture. It utilizes various media experiences to investigate notions of color in artistic expression. Explorations will include traditional ways of investigating and creating color as well as contemporary approaches. Both 2-D and 3-D studio investigations will be employed. A lecture component will provide a historical and cultural backdrop upon which students may better understand the role of special depiction in artistic expression.", "prerequisite": "ART 165"}, {"course_name": "ART 266: Artistic Concepts of Light", "department": "Art (ART)", "credits": "3 Credits", "description": "A studio course that utilizes lecture and varied media experiences to investigate light as artistic expression.  ART 266 Artistic Concepts of Light (3) ART 266 Artistic Concepts of Light provides students with necessary concepts about light. Both 2-D and 3-D studio investigations will be employed. A lecture component will provide a historical and cultural backdrop upon which students may better understand the role of special depiction in artistic expression.", "prerequisite": "ART 165"}, {"course_name": "ART 269: Methods and Materials I", "department": "Art (ART)", "credits": "3 Credits/Maximum of 9", "description": "A studio course that focuses on specific media or techniques reflecting varied faculty expertise. ART 269 Methods and Materials I (3) This course,provides students with the opportunity to experience particular areas of visual art in which", "prerequisite": "ART 165"}, {"course_name": "ART 280: Beginning Ceramics", "department": "Art (ART)", "credits": "3 Credits", "description": "The fundamentals of ceramics, throwing, hand-building, and glazing; acquainting the student with ceramic materials, techniques, and philosophy. ART 280 Beginning Ceramics (3) This course is intended to further investigate the art of ceramics for art majors. As a studio offering, emphasis is placed on hands-on studio activities, which promote visual literacy and sensitivity to the various conventions used in ceramics. Students will be given the opportunity to explore many of the traditional materials of ceramics, including functional and nonfunctional applications, stoneware, and high fire glazes. As well, slide presentations, studio visits and museum critiques will augment studio exercises to facilitate a greater awareness of the cultural context in which the field of ceramics functions. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 110", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 290: Beginning Photography", "department": "Art (ART)", "credits": "3 Credits", "description": "Fundamental techniques and approaches to the art of photography utilizing digital photographic technologies; digital camera required. ART 290. Beginning Photography (3)(BA) This course meets the Bachelor of Arts degree requirements. ART 290 is the first course for students who desire to pursue a concentration in photography. It will focus on the process of making photographs and the development of a critical understanding of photographic images and their evaluation.In ART 290 students will develop the habit of taking photographs on a regular basis. Each week, students will be expected to turn in 24 pictures on one of five assignments for review and critique by both instructors and members of the class. Each assignment will be covered over a three-week period.The topics of the five assignments will vary, but each will focus on important aspects of photography. They may include: portraits, self-portraits, nature photographs, travel photographs, documentary series, experimental images, action assignments, etc. The final assignment will be a self-defined topic that allows the student to explore and work in an area of personal interest. Each topic will be selected to acquaint the student with important aesthetic principals in photography and at the same time advance their technical skill in the process of making photographic images.As part of the five assignments in ART 290, students will also gain background on the history of photography and the critical evaluation of photographs. For each assignment there will be an accompanying gallery of work by other photographers (professionals, amateurs, and students) on the assigned topic area. Each photograph in the gallery will be accompanied by an \"artist's statement\" - a written critical statement where the photographer describes his or her work and methods.Students will be required to complete each of the five assigned topics by submitting a final \"gallery\" of four photographs with a written \"artist's statement\" that speaks to the intent, process, and result of their work. Final submissions will help students develop skills in not only making photographs but critically evaluating their own work and articulating their personal means, methods, and objectives as photographers.Grading will be based on (1) the completion of weekly submissions, (2) the quality of photographs in final submissions for each assignment, (3) attendance, and (4) participation in critiques.A digital camera is required. ART 290 will be offered fall and spring semesters.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 296: Independent Studies", "department": "Art (ART)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 297: Special Topics", "department": "Art (ART)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 299: Foreign Study--Art", "department": "Art (ART)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ART 320: Advanced Drawing", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "Drawing for art majors; emphasis on sustained individual approaches based on figurative and nonfigurative sources. ART 320 Advanced Drawing (4 per semester/maximum of 8) This course is for students who have a firm commitment in the arts, who have adequate background in the use of techniques and materials, and who have experimented with a variety of approaches to subject matter. This course is designed to focus and develop personal approaches to subject matter and to encourage a sustained interest in work. Portfolios will be graded and midterm and at the end of the semester. In addition to the portfolio requirements, each student will give a presentation on a contemporary artist whose work has in some way influenced your own current body of work. Critiques will be regularly scheduled. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 110", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 330: Intermediate Sculpture: Metal Fabrication and Mixed-media", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "Development of technical and conceptual skills through metal fabrication, welding, and mixed-media processes. ART 330 Intermediate Sculpture: Metal Fabrication and Mixed-media (4 per semester/maximum of 8) This course is for students who have a firm commitment in the arts, who have adequate background in the use of techniques and materials, and who have experimented with a variety of approaches to subject matter. This course is designed to focus and develop personal approaches to subject matter and to encourage a sustained interest in work. Projects will be assigned throughout the semester and group critiques will be scheduled at regular intervals. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 230", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 331: Intermediate Sculpture: Metal Casting and Mold-Making", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "Development of technical and conceptual skills through metal casting and mold- making processes. ART 331 Intermediate Sculpture: Metal Casting and Mold-Making (4 per semester/maximum of 12) This course is for students who have a firm commitment in the arts, who have adequate background in the use of techniques and materials, and who have experimented with a variety of approaches to subject matter. This course is designed to focus and develop personal approaches to subject matter and to encourage a sustained interest in work through the development of technical and conceptual skills through metal casting and mold-making. Students will learn both traditional and non-traditional ways of making sculptural objects that use these skills as primary means of artistic communication. Readings, lectures, movies, and demonstrations will introduce students to the materials and techniques used in the various sculpture processes. Projects will be assigned throughout the semester and group critiques will be scheduled at regular intervals. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 230", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 340: Printmaking", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "Development of technical and expressive skills through selected problems in one or more of the print processes. ART 340 Printmaking (4 per semester/maximum of 8) This course is for students who have a firm commitment in the arts, who have adequate background in the use of techniques and materials, and who have experimented with a variety of approaches to subject matter. This course is designed to focus and develop personal approaches to subject matter and to encourage a sustained interest in work. Readings, lectures, movies, and demonstrations will introduce students to the materials and techniques used in the various printmaking processes. Projects will be assigned throughout the semester and group critiques will be scheduled at regular intervals. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 240", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 341: Intermediate Printmaking:  Intaglio/Relief", "department": "Art (ART)", "credits": "4 Credits", "description": "Instruction and practice in the fundamentals of intaglio and relief printmaking processes in their relation to the fine arts. ART 341 Intermediate Printmaking: Intaglio/Relief (4) This course is designed for the student who is interested in expanding her/his image making vocabulary through intaglio and relief printmaking processes. It will expose students to the history and practice of these processes, and will prepare students to competently produce original works.Readings, lectures, and demonstrations will introduce students to the materials and techniques used in the various intaglio and relief processes. Projects will be assigned throughout the semester and group critiques will be scheduled at regular intervals.This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of complete artworks.", "prerequisite": "ART 240", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 342: Intermediate Printmaking:  Lithography/Serigraphy", "department": "Art (ART)", "credits": "4 Credits", "description": "Instruction and practice in the fundamentals of the lithographic and serigraphic processes and their relationship to the meaning of the print. ART 342 Intermediate Printmaking: Lithography/Serigraphy (4) This course is designed for the student who is interested in expanding her/his image making vocabulary through lithographic and serigraphic printmaking processes. It will expose students to the history and practice of these processes, and will prepare students to competently produce original works.Readings, lectures, and demonstrations will introduce students to the materials and techniques used in the various lithographic and serigraphic processes. Projects will be assigned throughout the semester and group critiques will be scheduled at regular intervals.This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 240", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 343: New Media Printmaking", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "A studio course concentrating on the integration of new media and traditional printmaking processes. ART 343 New Media Printmaking (4 per semester/maximum of 8) ART 343 is a studio art class that focuses on creating and critically evaluating printed media. Problem solving with new and traditional print technologies will allow the student to use both the computer and the printing press as a means to a creative end. Students will acquire the skills to critically participate in our technology driven culture, while at the same time they will develop an appreciation for the aesthetics of the handmade. This course will explore the nature and potential of printed media through lectures, readings, demonstrations, studio practice, and critiques. Various conceptually driven assignments will cover a range of graphic computer programs (Adobe Photoshop and Adobe Illustrator) and specific print outputs (digital, photo litho, photo etching and serigraphy) These assignments will engage students in research methods to advance their skills in printed media and help them to develop an understanding of the critical evaluation and assessment of Art.", "prerequisite": "ART 240", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 350: Intermediate Painting", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "A variable offering in painting; course conditions defined on a rotating basis according to needs of individuals and groups. ART 350 Intermediate Painting (4 per semester/maximum of 8) This course is will further develop painting techniques, using the genres of landscape, still life, and painting from the model, collage, abstraction, and some digital applications. Examples from past and contemporary painting practice will be presented and discussed. Particular emphasis will be placed upon the development of a critical awareness concerning processes and content. Readings and discussions will focus on contemporary cultural and political issues. Projects will be assigned throughout the semester and group critiques will be scheduled at regular intervals. This labor-intensive studio relies upon cumulative learning experience through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their creative use and application is essential to the success of completed artworks.", "prerequisite": "ART 250", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 365: Themes and Issues I", "department": "Art (ART)", "credits": "3 Credits", "description": "An advanced studio course that emphasizes individual approach to theme oriented problem solving through traditional and non-traditional multi-media explorations. ART 365 Themes and Issues I (3) ART 365 contains a common course theme wherein students will be asked to build a series of three completed works in diverse materials and techniques. Students will work to build clear concepts that are communicated through objects and images. Beginning with a thorough investigation of how artists of all fields (music, architecture, design, writing, theatre etc.) have interpreted the theme students will be guided through research, brainstorming, and concept development activities. During this they will be asked to keep a journal which documents their process through written descriptions and comments but also image based resources, sketches, diagrams, and in progress photographs. Students will be urged to complete pieces that are conceptually linked so as to begin working in series. At the completion of each piece, students and faculty will conduct group critiques.", "prerequisite": "ART 165"}, {"course_name": "ART 366: Themes and Issues II", "department": "Art (ART)", "credits": "3 Credits", "description": "An advanced studio course that emphasizes individual approach to theme oriented problem solving through traditional and non-traditional multi-media explorations. ART 366 Themes and Issues II (3) ART 366 contains a common course theme wherein students will be asked to build a series of three completed works in diverse materials and techniques. Students will work to build clear concepts that are communicated through objects and images. Beginning with a thorough investigation of how artists of all fields (music, architecture, design, writing, theatre etc.) have interpreted the theme students will be guided through research, brainstorming, and concept development activities. During this they will be asked to keep a journal which documents their process through written descriptions and comments but also image based resources, sketches, diagrams, and in progress photographs. Students will be urged to complete pieces that are conceptually linked so as to begin working in series. At the completion of each piece students and faculty will conduct group critiques and each student will mount a smale-scale individual exhibition at one of the many available areas for exhibition on campus.", "prerequisite": "ART 165"}, {"course_name": "ART 380: Intermediate Throwing", "department": "Art (ART)", "credits": "4 Credits/Maximum of 12", "description": "Intermediate ceramics course with focus on using wheel and throwing skills leading to personal expression in form, glazing, and firing. ART 380 Intermediate Throwing (4 per semester/maximum of 12) The purpose of this course is to explore the use of the wheel. Various types of forms will be addressed such as bowls, covered jars, and vases. Technical skills will be learned with the goal to use them to create a personal means of expression via the wheel. Both traditional and nontraditional vessels will be created. Forming, trimming and glazing techniques will be covered. There will be both group and individual critiques along with slide presentations and demonstrations. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 280", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 381: Intermediate Handbuilding", "department": "Art (ART)", "credits": "4 Credits/Maximum of 12", "description": "An intermediate ceramics course with a focus on handbuilding techniques, leading to personal expression in forming, glazing, and firing. ART 381 Intermediate Handbuilding (4 per semester/maximum of 12) The purpose of this course is to explore different means of expression with the techniques of handbuilding. Clay is unlike any other material in that it can be transformed into virtually anything. Some of the forming methods which be addressed are coil, slab, carving, modeling and slump/press molds. The course will have assignments that are technically challenging, but will call on creative and artistic abilities. Slide presentations and group and individual critiques will be part of the curriculum. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 280", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 390: Introduction to Photochemical Photography", "department": "Art (ART)", "credits": "4 Credits", "description": "Introduction to the fundamentals of black and white photochemical photography. ART 390 Introduction to Photochemical Photography (4)(BA) This course meets the Bachelor of Arts degree requirements. ART 390 will explore the art and science of 35mm black and white photography. It will introduce students to chemically based photography as a process and continue to advance their skill and background as photographers.In the course, students will learn about film cameras and their operation, basic film types, film developing and processing, and basic photochemical printing practices. Students will also develop skills through experience in making, developing, printing, and presenting photographs created through photochemical processes. Each student will be required to turn in 20 contact sheets (36 exposures each) during the semester on required weekly assignments and develop a final project containing 25 mounted 8 x 10 black and white prints.40% of the semester grade will be based on the final project, 40% on weekly assignments, and 20% on quizzes.A 35mm film camera with adjustable shutter speeds and aperture settings and a light meter (hand-held or built into the camera) is required. In addition, materials (film, photo paper, developing tanks, photo thermometer, etc.) will cost around $300 to $350. ART 390 will be offered fall and spring semesters.", "prerequisite": "ART 111", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 397: Special Topics", "department": "Art (ART)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 399: Foreign Study--Art", "department": "Art (ART)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ART 404: Art and Life: Where They Intersect", "department": "Art (ART)", "credits": "4 Credits", "description": "This course addresses where art and life meet; how life influences what artists make, and how art influences our lives. \"Art and Life: Where They Intersect\" focuses on interdisciplinary areas that address notions of creativity, critical thinking, and studio practice as well as how these perspectives can influence what an artist creates. The essence of the course examines how life influences what an artist makes, and conversely how what we create influences how we live. Themes and ideas draw from interdisciplinary perspectives such as contextual approaches to creativity that are linked to themes in sociology, material theories of art as related to distributed views of cognition, expressive aesthetics that are connected to introspective perspectives of psychoanalytic theories, and other forms of creative agency found in the human sciences. The content of the course includes both studio practice and critical studies. This combination of experiential learning and critical theory is designed to give students a greater understanding and comprehension of the creative process from the point of view of individual interests and a variety of cultural contexts. The course includes students writing autobiographies in relation to their artwork. This reflective analysis is referenced to seminal essays that focus on different disciplinary perspectives on creativity. Creative studio projects will be undertaken to complement textual analysis and seminar discussion. By integrating studio practices with critical studies the creative process is more fully understood. The course curriculum relies on active student participation in class discussions and a willingness to share and take risks in the spirit of contributing to a collaborative learning experience. Art is by nature multidisciplinary and increasingly teaching art means teaching about life. The course is designed for students with a desire to acquire a deeper understanding of their creative research in the context of contemporary culture.", "prerequisite": "Fifth semester standing or higher"}, {"course_name": "ART 409: Museum Studies", "department": "Art (ART)", "credits": "3 Credits", "description": "An introduction to the professional activities that occur in art museums. ART 409 / ARTH 409 Museum Studies (3)(BA) This course meets the Bachelor of Arts degree requirements. This course introduces students to the broad field of art museum work, specifically museum administration, education, curatorial work, registration, and exhibition design. Readings by authors in each field provide current theoretical and philosophical frameworks for all areas, which are then followed by discussions and practical experiences with professional museum practitioners, including the staff of a museum, for example, the Palmer Museum of Art, and invited guests. Museum Studies is open to students who have complete six credits in art, art education, or art history. This course is especially beneficial for majors in art, art education, and art history who are considering a career in an art museum or who want to become more aware about how an art museum functions. In addition to providing an in-depth introduction to art museum work, the course encourages students to build the critical thinking and response skills that are crucial to success in the real-world environment of a museum. The readings provide a solid foundation for later reference or further study in the student's chosen field. Offered every spring, this course will have a maximum enrollment of 20 students. Grades are based on class participation, four out-of-class projects, and a final project. Extra credit is offered for an off-campus visit to a museum, among other options.", "other": ["Cross-listed with: ARTH 409", "Bachelor of Arts: Arts"]}, {"course_name": "ART 411: Seminar in Contemporary Art", "department": "Art (ART)", "credits": "3 Credits/Maximum of 6", "description": "Trends in contemporary art investigated within the framework of studio visitations, museum tours, and through other related avenues of encounter. ART 411 Seminar in Contemporary Art (3) This seminar on contemporary art exposes students to artistic practices and to the advanced-level critical discourses accompanying them. It is relevant to all students interested in expanding their knowledge of contemporary art and essential to BFA students who are encouraged to take the course more than once. The only prerequisite for this course is ART 122 The seminar's intimate format allows for discussions and a convivial examination of the pluralistic expressions of contemporary art while articulating it with theory and criticism.From an international perspective, this seminar focuses on art since the 1960s. Besides more traditional artistic expressions such as painting, sculpture, photography, installation, performance and video, the course examines networked collaborations before and after the Internet, art and social activism, and a range of new media and new genre artistic practices. The conceptual issues these works raise include among others the dematerialization of the art object, issues of site-specificity and public art, and institutional critique. The course approaches these developments through artists' writings and essays in contemporary theory and criticism. Works of art are presented through videos, power points, films, performances, gallery visits, field trips, and discussions of related essays. Critical \"reading\" includes an extensive introduction to the work's historical contexts, readings from primary source materials, and the exploration of critical methods of analysis. From a cross-disciplinary perspective - including historical, esthetic and philosophical approaches - this course examines principles, assumptions, and tensions inherent in artist's works as well as in our responses to them.Student evaluation is based on short written papers such as an exhibition review or an interview, participation in class discussions, and a creative project (ranging from a web site to an installation, artist's book, or a performance), which must reflect a general understanding of the issues addressed in the course. The course is offered at least once a year with the enrollment of 15 students.", "prerequisite": "ART 122Y", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)"]}, {"course_name": "ART 413: Performance Art", "department": "Art (ART)", "credits": "3 Credits", "description": "The development, production, and presentation of performance art works, and the study of performance art theory and history. ART 413 Performance Art (3)(BA) This course meets the Bachelor of Arts degree requirements. This course will consist of lectures, readings, demonstrations, critiques, and studio practices in performance art. The course will begin with introductory exercises aimed toward the use and understanding of objects, images, materials, and actions of the body as performance elements. Performance assignments will range from autobiographical works to those which will address political issues effecting art and the body today such as sexuality, ethnicity, health, ecology, the art market, government intervention, and others. Reading and discussion assignments will cover the theory and history of performance art in the twentieth-century.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 421: Drawing", "department": "Art (ART)", "credits": "4 Credits/Maximum of 12", "description": "Drawing for advanced students, with total emphasis on sustained individual approaches.", "prerequisite": "ART 320", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 422: Advanced Figure Drawing", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "Concentrated work in recording and understanding the human figure.", "prerequisite": "ART 220", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 430: Advanced Sculpture", "department": "Art (ART)", "credits": "4 Credits/Maximum of 12", "description": "Advanced work in sculpture, with an emphasis on professional practice and individual development.", "prerequisite": "ART 230", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 431: Installation Art", "department": "Art (ART)", "credits": "4 Credits", "description": "Study and production of original visual statements through installation work as an art form.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 432: Flexible Molds: Parting Seams and Sculptural Concepts", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "ART 432 FLEXIBLE MOLDS: PARTING SEAMS & SCULPTURAL CONCEPTS introduces the relevancy of producing material specific multiples in a contemporary sculptural practice. It will offer students a broad understanding of the conceptual ramifications of molding an object and referencing a \"mass-produced\" look verses casting in a organic \"fused form\" way. Technical information on how to make one, two and three (+) part flexible molds in urethane compounds to be cast in concept relevant materials is emphasized. While the technical mold making and casting applications learned will be consistent for all members of the class, the results of the skills learned are expected to fold into each individual's artistic strengths differently. These technical skills are folded into three projects. The intent of these is to refine the students' craftpersonship in relation to constructing a mold and see construction precision as a portal to an expansive approach to casting. These multiple types of casting processes are expected to fold into projects that incorporate multiple genres. The course prerequisites, ART 230 or ART 280 allow for beginning level students to take the course while its 400 level welcomes both undergraduate and graduate students. If a student may repeat the class, the content of the class customizes to match the students increased technical skill. With repeating students, a more advanced approach to realizing individually proposed project ideas is expected.", "prerequisite": "ART 230"}, {"course_name": "ART 433: Sustainable Studio", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "Sustainable Studio is designed to provide students the opportunity to form a community of makers interested in issues regarding sustainability as related to artistic practice. From rural Pennsylvania to megacities of China, people are leading the charge to take on the big challenges of sustainability. How do we reach across boundaries and disciplines, to farmers, architects, scientists, poets, writers and together aim towards a sustainable planet. We will reach out across disciplines at PSU, to Bioengineering, Geography, Agriculture, Philosophy, Women Studies ( to name but a few) and seek out collaborative projects and intersectionality of ideas and production. This class will introduce you to concepts of sustainability and societal wellbeing through the language of creativity and the studio. We will address interconnected and evolving issues in food, water, biodiversity, energy, and climate, land use and examine how ethical and imaginative people can work together to deal with them. Both ancient and modern production methods using sustainable resources will be explored through hands-on workshops and investigative research. Traditional methods of making pigments and papers will be re-examined with contemporary considerations. We will also research non-toxic biodegradable art materials such as bioplastics, botanical dyes, bio-leathers and exploratory substructures and medias. This hands-on studio offering provides students the opportunity to create and exhibit artworks made from their hand-made materials: charcoal, pastels, sketchbooks, paint, hand-made papers and surfaces from locally and globally sourced materials. Visiting artists and lecturers will facilitate awareness of cultural context and historical uses of art materials from around the world. Special studio sessions, labs and DIY workshops will provide students with an opportunity to make their own art materials expanding skill sets and knowledge of how art materials are made. Auxiliary activities such as working on location at the student farm and the Sustainability Experience Center, attending special community events, making documented presentations, and museum & library visits will serve to augment studio sessions, facilitating a greater awareness of the cultural context in which art contributes to the larger conversation of sustainability.", "prerequisite": "ART 110"}, {"course_name": "ART 438: The Body: Issues and Objects", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "Creating representations of the human body and related objects as a means of sculptural expression. ART 338 The Body: Issues and Objects (4 per semester/maximum of 8) This course is for students who have a firm commitment in the arts, who have adequate background in the use of techniques and materials, and who have experimented with a variety of approaches to subject matter. This course is designed to focus and develop personal approaches to subject matter and to encourage a sustained interest in work through the exploration of both historical and contemporary artmaking practice concerning the representation of the human body and objects related to identity. Students will learn both traditional and non-traditional ways of making sculptural objects that use the body as a primary means of artistic communication. Readings, lectures, movies, and demonstrations will introduce students to the materials and techniques used in the various sculpture processes. Projects will be assigned throughout the semester and group critiques will be scheduled at regular intervals. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 230", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 440: Advanced Printmaking", "department": "Art (ART)", "credits": "4 Credits/Maximum of 12", "description": "Individual projects in one or more of the printmaking processes. Emphasis is on developing a portfolio of prints.", "prerequisite": "ART 240", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 446: Artists Books", "department": "Art (ART)", "credits": "4 Credits", "description": "Study and production of original visual statements through the book as an art form.  ART 446ART 446 Artists Books (4) This course will consist of lectures, demonstrations, and studio practice in production of artists books. Lectures and demonstrations will include hand papermaking, signature binding, book design, new and alternative book forms, and container construction. Each student will produce six either unique or editioned books during the semester; each book will have a mock up, title, colophon page, and will be signed. This labor-intensive studio relies upon cumulative learning experiences through increasingly demanding projects. Competency is expected in numerous new skills and techniques, and their application in creating visually compelling concepts is essential to the success of completed artworks.", "prerequisite": "ART 110", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 450: Advanced Painting", "department": "Art (ART)", "credits": "4 Credits/Maximum of 12", "description": "Development of the artist through a series of commitments; each semester serves as a contractual agreement along professional lines.", "prerequisite": "ART 350", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 455: Advanced Painting Critique", "department": "Art (ART)", "credits": "4 Credits/Maximum of 8", "description": "The painter in relation to his peers and his profession.", "prerequisite": "ART 350", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 465: Individual Approaches I", "department": "Art (ART)", "credits": "3 Credits", "description": "An advance studio where students are expected to explore personal themes and individual concepts in their art work.  ART 465 ART 465 Individual Approaches I (3) ART 465 is an advanced studio course concentrating on creating art within a series. Students will be asked to complete 4-6 pieces that stem from an individual idea. Medium is open and can be traditional or non-traditional. Students will be required to document and maintain a journal outlining the steps needed to complete each piece. Weekly formal and/or informal critiques will allow students constant feedback of their progress.", "prerequisite": "ART 165"}, {"course_name": "ART 466W: Individual Approaches II", "department": "Art (ART)", "credits": "3 Credits", "description": "An advance studio/lecture addressing the preparation for potential employment and/or entrance into graduate studies.  ART 466W ART 466W Individual Approaches II (3)(BA) This course meets the Bachelor of Arts degree requirements. ART 466W is the Visual Art Studies capstone experience where students are given the opportunity to experience the professional aspects of a practicing artist. In addition to completing the last 2-4 pieces toward their exit portfolio students will address vital activities surrounding applying for employment and graduate school. Students will create \"packets\" including resumes, cover letters, post cards, slides, and portfolio CDs that can be used directly out of school for various calls and job listings. In addition topics that will be addressed in depth are photo-documentation, and inventory of work through database maintenance. All of these issues will culminate with small group exhibitions which will be curated, installed, and promoted by the students.", "prerequisite": "ART 240", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"course_name": "ART 467: Matter, Materiality and Mediums: An Interdisciplinary Approach to Artistic Stuff", "department": "Art (ART)", "credits": "3 Credits", "description": "Considers the physical challenges and long traditions of use of artistic media from both studio and historical points of view.  ART (ART H) 467 Matter, Materiality and Mediums: An Interdisciplinary Approach to Artistic (3) Art and Art History are disciplines famously preoccupied with stuff: its malleability and its endurance, its sensuous properties and formal possibilities, its economic value and its mythic or even supernatural power. As an introduction to art through its materiality, this class will focus its attention upon a different material every week. With two class meetings per week, classes will alternate between 'practicum' sections (demonstrations of selected materials with visits to metal foundries, studios and laboratories) and 'historical' sections (lectures and discussions of those materials as they have worked in different historical and cultural contexts). The class will also introduce students to humanistic discussions of 'matter' as well as attend to the cultural work involved in western art history's preoccupation with the differences between 'matter' and artistic 'medium.'"}, {"course_name": "ART 468: The Intermediate Digital Medium", "department": "Art (ART)", "credits": "3 Credits", "description": "An advanced studio course using the computer as an artistic media.  ART 468 ART 468 The Intermediate Digital Medium (3) This course will provide the much needed advanced technological/digital component wherein computing will be discussed as a media, rather than a tool. Students will be engaged in the creation of graphic/moving/three-dimensional imagery and sound that explores themes and concepts introduced in class. While most of the course will center around the use of industry standard computers there will be some forays into hardware associated with production, sound, and projection of images.", "prerequisite": "ART 165"}, {"course_name": "ART 469: Methods and Materials II", "department": "Art (ART)", "credits": "3 Credits/Maximum of 9", "description": "A studio course that focuses on specific media or techniques reflecting varied faculty expertise.  ART 469 ART 469 Methods and Materials II (3) This course provides students the opportunity to experience particular areas of visual art in which", "prerequisite": "ART 165"}, {"course_name": "ART 476: History and Theory of Digital Art", "department": "Art (ART)", "credits": "3 Credits", "description": "History and theories of contemporary digital art emphasizing humanistic approaches to technology. ART 476 / ARTH 476 History and Theory of Digital Art (3)(BA) This course meets the Bachelor of Arts degree requirements. Approaches to Digital Art is a survey class that will offer the web designer, cyberspace architect, MUD traffic controller or enthusiastic surfer an opportunity to examine the humanistic aspects of contemporary digital art. Through readings and direct interaction with digital media and digital artists, the class will develop an appreciation of the ways in which the interface between human beings and technology has been historically constructed and is subject to critical investigation. The goal of the class is to prepare each student so that she or he may engage with digital media in a way that is every more historically and socially self aware.Students will address the ways in which digital technologies transform artistic practices such as museum display, the writing of art criticism, the definition of works of art, changing role of the artist and the changing space of the art studio. More important, however, by engaging with digital works of art students will learn to think critically about technology and its engagement with culture at large. They will be encouraged to think about the political, economic and social impact of digital technologies. This humanistic approach to technology would make this course particularly useful to students of art history, philosophy, comparative literature, art education, and the visual/plastic arts. A significant portion of the course will be devoted to the ways in which art on the internet and digital art in general challenge the integrity of categories such as race and national identity. For example, students will have an opportunity to engage with African American artists such as Keith Obadike, whose on-line performances include an attempt to put his \"blackness\" up for sale on ebay.com in August of 2001. Students may also look at the ways in which net.art (Art made to be viewed on the internet) can critique commercial cooptation of global culture: etoy.com, for example, is an international and collaborative artist's group that satirizes global capital by camouflaging itself as a multinational corporation.This class will depend largely upon written responses and class discussion, rather than upon tests. Thus, students will learn how to approach difficult theoretical sources that have been assigned to them, and they will learn how to ask the kinds of questions that will help them understand such sources. This course will emphasize critical thinking rather than memorization, so students will develop analytical skills that will be useful in many other contexts. Because students will be given weekly writing assignments, they will be able to improve their skills in composition.", "prerequisite": "3 credits of ARTH", "other": ["Cross-listed with: ARTH 476", "Bachelor of Arts: Arts"]}, {"course_name": "ART 477: Curator's Workshop", "department": "Art (ART)", "credits": "3 Credits", "description": "In Curator's Workshop, students will gain valuable experience in curatorial practices, exhibition design, and arts administration. Focus topics include how to generate an effective exhibition concept; liaising with artists, institutions, and other curators; curatorial research in support of an exhibition concept; questions and concerns in spatial design; and the writing of didactic materials such as labels, wall texts, press releases, checklists, and others. Students will engage in a final project requiring them to generate a complete exhibition proposal, inclusive of a budget, written and visual support and documentation, and a clearly defined concept. Through field trips, readings, guest lectures, and research, students will gain a fuller understanding of the role of the curator in today's art world, relating their work back to their individual fields of study.", "prerequisite": "Fifth semester standing or above"}, {"course_name": "ART 480: Advanced Ceramic Arts", "department": "Art (ART)", "credits": "4 Credits/Maximum of 12", "description": "Individual exploration of ceramic materials and construction leading to graduate study or career development as a professional potter.", "prerequisite": "ART 280", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 490: View Camera Photography", "department": "Art (ART)", "credits": "4 Credits", "description": "Experience with diverse camera formats and applications; particular emphasis on view camera.  ART 490ART 490 View Camera Photography (4)(BA) This course meets the Bachelor of Arts degree requirements. ART 490 will provide students with experience in diverse camera formats and application with particular emphasis on view camera and its creative applications.The course will give students background in the history of large format photography and understanding of its application in specialized fields such as architectural photography, portraiture, and landscape photography. Students will gain experience in view camera operation and the creation of large format photographs in a variety of different applications.Grading will be based on a minimum of five projects that will account for 80% of the semester grade. The remaining 20% of the semester grade will be based on participation in class critiques. The final course grade will be dropped one full grade for each absence or late submission beginning with the second late submission or absence.ART 490 will be offered in the fall semester each year.", "prerequisite": "ART 390", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 494: Research Projects Courses", "department": "Art (ART)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "ART 495: Internship", "department": "Art (ART)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "Permission of Program", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 496: Independent Studies", "department": "Art (ART)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 496H: Independent Studies", "department": "Art (ART)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts", "Honors"]}, {"course_name": "ART 497: Special Topics", "department": "Art (ART)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ART 499: Foreign Studies--Art", "department": "Art (ART)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}]