[{"course_name": "BBH 48: Values and Health Behavior", "department": "Biobehavioral Health (BBH)", "credits": "1.5 Credits", "description": "Examination of issues that impact the social, emotional, and physical well-being of college students through a values and decision-making process.  BB H 048 Values and Health Behavior (1) (GHA) This is a 1credit course designed for non-BB H majors who want a greater understanding of concepts related to health and health promotion and who want to learn practical skills related to optimizing health and improving lifestyle behaviors. General health topics that are relevant to students as they adjust to the transition into--and through--college are introduced through a values and decision-making approach to learning. The course is designed to give students a broader understanding of both short-term and long-term wellness and how it is affected by behavior. Concepts regarding personal health and development are introduced using individual and group activities. To impact behavior, a model for decision-making that includes facts, risks, and consequences is utilized within an experiential learning approach. Students will work individually to perform self-assessment of health-related activities (e.g., nutrition, alcohol and drug-related knowledge and risk behaviors) and in small groups to further assess and describe the effects of health behaviors on short-term and long-term wellness. The course will be evaluated through completion of several short reaction papers to reading assignments and internet research, a group project on health promotion, completion of a health-related journal, and completion of a personal behavior change plan.", "other": ["General Education: Health and Wellness (GHW)"]}, {"course_name": "BBH 101: Introduction to Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "BBH 101 is an interdisciplinary study of health that emphasizes: (1) Conceptualization of health as being influenced by a variety of factors including biology, environment, psychology, and social influences; and (2) The concept of health as a state of physical, mental, and social well-being, and not just the absence of disease. The first section of the course is a study of the foundational principles of health including a basic overview of the nervous, endocrine, immune, cardiovascular, respiratory and digestive systems as well as basic principles of genetics and psychology. The second section of the course is focused on risk factors and health-related behaviors. The importance of nutrition, exercise, sleep, stress, and environmental risk factors are studied. The final component of the emphasizes population health by addressing relevant health conditions such as diabetes, substance abuse and addition, cardiovascular disease, cancer, HIV/AIDS, Parkinson's disease, and Alzheimer's disease.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BBH 101H: Introduction to Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This is an honors course, designed to provide students with the opportunity to engage with the material at a greater depth. BBH 101H is an interdisciplinary study of health that emphasizes: (1) Conceptualization of health as being influenced by a variety of factors including biology, environment, psychology, and social influences; and (2) The concept of health as a state of physical, mental, and social well-being, and not just the absence of disease. The first section of the course is a study of the foundational principles of health including a basic overview of the nervous, endocrine, immune, cardiovascular, respiratory and digestive systems as well as basic principles of genetics and psychology. The second section of the course is focused on risk factors and health-related behaviors. The importance of nutrition, exercise, sleep, stress, and environmental risk factors are studied. The final component of the course emphasizes population health by addressing relevant health conditions such as diabetes, substance abuse and addiction, cardiovascular disease, cancer, HIV/AIDS, Parkinson's disease, and Alzheimer's disease.", "other": ["General Education: Health and Wellness (GHW)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BBH 102S: Values, Health, & Academic Success", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course will simultaneously address concepts related to Health & Wellness as well as address areas of academic transition for first year students. Essentially this course was designed to address all areas of life that students will encounter during their first semester of school. This course will address several aspects of a first-year students' social wellness that includes healthy relationships, alcohol awareness, sexual ethics, sexual health, mental health, positive decision making, as well as bystander intervention. This course will also address the physical wellness of first year students by addressing alcohol consumption and the impact that it has on the body physically, healthy eating and food selection on a college campus, as well as learning how to be aware of their unconscious biases and how to live in society with people different than themselves. Additionally, this course will address the intellectual needs for enrolled students within their first academic year by outlining the academic expectations outlined by Penn State University. Students will understand how essential organization and time management is within higher education, the benefits of getting to know their professors, planning their paths to graduation, goal setting, financial literacy, resume' development as well as an extensive review of institutional academic integrity policies and its implications of academic violations. The course hopes to become an initial spring board, where students can use the information presented to guide them throughout the next 3 years of their undergraduate careers.", "other": ["First-Year Seminar", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BBH 119: Behavior, Health, and Disease", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course is designed for non-BB H majors who want a fundamental understanding of disease processes, disease states, and principles of disease prevention and health promotion. This course should help students in the biological and behavioral sciences better understand practical applications of theoretical approaches to health issues.The course will provide a broad understanding of the major human diseases underlying morbidity and mortality in America. The course will cover most major diseases using a variety of organizational schema including: (1) diseases according to organ systems, (2) diseases according to developmental and age-related processes, and (3) diseases according to causal factors including behavioral (lifestyle), environmental, and genetic factors. The course content is organized to encourage promotion of a healthy lifestyle, prevention of disease and understanding the causes and management of acute and chronic illness. The course includes information and assignments to allow the student to appropriately assess one's own health, estimate health trajectories, access and use the health care systems on campus and in their home communities, and develop a long-term health promotion plan. The student will also learn specific skills to find and evaluate traditional and non-traditional treatment processes when they or family members become sick with an acute illness or chronic disease, and to better engage with health care professionals and the health care system for management of illnesses that they or their family may have or develop. Students will also learn practical skills in being able to access a variety of sources to update knowledge about disease causality and treatment and to critically appraise these sources.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BBH 130: Strategies for Addressing the Obesity and Diabetes Epidemics", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "The purpose of this course is to broadly survey information and issues surrounding the development of and individual and community responses to the paired epidemics of obesity and diabetes. Students in the course will examine the biological, behavioral, and environmental factors that underlie the development of obesity and diabetes, including community level factors such as physical enviornment. The health consequences of both obesity and diabetes will be covered and students will explore the current science of both prevention efforts and effective treatment options. This course is designed as a general education offering and is appropriate for students with little background in biology.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BBH 143: Drugs, Behavior, and Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "The primary objective of this course is to review information related to the use of recreational and therapeutic drugs like alcohol, nicotine, opiates, caffeine, prescription drugs, etc. We will discuss the biological mechanisms of these substances and how the use of these substances impacts the health and well-being of the individual. We will explore how drug use affects society and will cover social norms related to drug use, laws pertaining to drug use, and the historic context of drug use. We will investigate underlying biological, psychological, and social reasons for drug use and misuse.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BBH 146: Introduction to Health and Human Sexuality", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course is designed to provide students with a solid introduction to human sexuality with an emphasis on sexual health issues. Through classroom lectures, as well as weekly smaller group meetings, students should gain both the knowledge and skills that will help to empower them to make better decisions about their sexual health practices and relationships. Fundamentals of human sexuality will be presented including: the myriad of influences that shape our sexuality, with particular emphasis on gender development, sexual orientation, health issues of the sexual female and male body, enhancements and inhibitors to sexual response, and enhancing sexual relationships. Specific sexual health issues will also be focused upon, including: unintended pregnancy, contraceptive methods, sexual assault, sexually transmitted infections, HIV disease, and safer sex strategies. Facilitated small group work will allow students to practice critical thinking, communication, and decision making skills through structured interactive activities. We are committed to creating a vibrant learning environment in this class.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BBH 148: Coping with College:  A First Year Transition Seminar", "department": "Biobehavioral Health (BBH)", "credits": "2 Credits", "description": "Exploration of effective learning strategies, university resources, academic requirements and planning, career development issues in discussion-centered environment.", "other": ["First-Year Seminar"]}, {"course_name": "BBH 150N: Safe and Sound: The Intersection of Criminal Justice and Public Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course will consider the overlapping responsibilities and epistemologies of criminal justice and public health. Both fields concerned with the promotion of population welfare, the public health and criminal justice systems nevertheless confront the same social problems from different ethical perspectives, research methodologies, and knowledge bases. Each may further mobilize different institutional actors driven by divergent political agendas. While we will discuss the productive collaboration between public health and public safety agencies, we will also consider ongoing ownership struggles over certain issues, behaviors, and even populations. Given its practical relevance to many ongoing social issues and controversies of general importance, this course is motivated by a commitment to community-engaged scholarship, and thus will include topics, readings, assignments, speakers, and field trips of local and state importance. At the same time, specific topics will be framed in terms of their national and international importance, and students will be encouraged to link micro-level problems to macro-level processes.", "other": ["Cross-listed with: CRIMJ 150N", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BBH 197: Special Topics", "department": "Biobehavioral Health (BBH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "BBH 199: Foreign Studies", "department": "Biobehavioral Health (BBH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BBH 201N: Health and the Media", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "The main purpose of this course is to prepare students for critically interpreting representations of health in the media. The course integrates media, social and cultural studies perspectives with health communication approaches in health promotion. The course will educate students about population level determinants of health and health communication interventions for health promotion and disease prevention. At the same time, students will be introduced to socio-cultural critiques of the media and to elements of critical textual and discourse analysis, with an emphasis on visual analyses. Based on these two sets of disciplinary exposures, students will be equipped to contextualize health contents in the media and to critically analyze media representations of health. Examples of health communication campaigns and of commercial messages targeting health consumers will be amply discussed, and general media effects on health communication will be analyzed. The course is designed for undergraduate students interested in developing their health and media literacies. The course stresses both integrative and critical thinking dimensions, and encourages students to confront important conceptual and moral issues in today's society such as over-representing individual determinants of health and obscuring social determinants of health in health communication. Students with an interest in civic engagement and in issues of individual and collective freedom and agency will find the course particularly relevant. Students pursuing careers in bio-behavioral health, health promotion, health communication, public health, medicine, nursing, psychology or other human and social services will benefit from the integrative character of the course and will acquire an understanding of the mediated nature of health concerns in society. The course offers students the opportunity to develop research in health communication or to create health communication materials.", "prerequisite": "ENGL 15", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BBH 203: Neurological Bases of Human Behavior", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "An introduction to biopsychology, emphasizing the structure and function of the human brain.  BB H (PSYCH 260) 203 Neurological Bases of Human Behavior (3) The nervous system provides the biological underpinning of behavior, and several scientific fields are concerned with the relationship between the nervous system and behavior. The goal of this course is to introduce the principle methods, findings, and theories of these scientific fields. Topics include (a) the anatomy and physiology of the nervous system, (b) how the nervous system gives rise to perception, action, language, memory, emotion and reproductive behavior, and (c) how drugs and mental illnesses affect the nervous system and alter normalperceptual, cognitive, and emotional behavior. The course prepares students for a number of more advanced courses in Psychology and Biobehavioral Health that address specialized topics in neuroscience, and may satisfy a requirement of these majors.", "other": ["Cross-listed with: PSYCH 260"]}, {"course_name": "BBH 210: Biobehavioral Aspects of Genetics", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "An individual's DNA is a key biological process involved in behavior, health, and disease. The goal of this course is to introduce the foundational concepts of genetics in a Biobehavioral Health framework. This course will examine how genes are encoded by DNA, how DNA is transcribed into RNA, and how RNA is translated into protein. Additionally, this course will cover DNA at the global level of the chromosome. Finally, variation across levels will be explored. For example, variation at the level of an individual DNA base pair or through alterations in chromosome structure. Application of these concepts to human health and disease will be highlighted throughout the course. The course prepares students for a more advanced course in Biobehavioral Health that address specialized topics in health and developmental genetics.", "prerequisite": "BIOL 110"}, {"course_name": "BBH 251: Straight Talks I: Advanced Sexual Orientation/Gender Identity Peer         Education", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Exploration of social justice issues, diversity leadership, and group facilitation skills related to lesbian, gay, bisexual, transgender, and ally issues.  BB H 251 Straight Talks I: Advanced Sexual Orientation/Gender Identity Peer Education (3) (US) Straight Talks I provides students an opportunity to explore various lesbian, gay, bisexual, transgender and allies (LGBTA) issues from an educational perspective. Students will be exposed to theories, terminology, and various speakers who will approach topics such as LGBTA history and multicultural issues. The course projects are designed to enhance both written and oral skills, and provide students an opportunity to work together. Finally, the course challenges students to think critically about the social, economic, and political cultures around them and how these cultures affect sexual and gender orientation issues.Course Objectives:Philosophical1. To think critically about your spiritual, social, economic, political and cultural existences and their relationship to your understanding of sexual and gender orientation issues.2. To develop a critical consciousness that will bring awareness of the ways custom, ritual and tradition helped shape and continue to shape our daily lives.3. To develop a fuller understanding of the way gender and sexual orientation are conceived of by other people and the ways in which these conceptions link with other elements of identity including ethnicity, class, gender, ability etc.4. To challenge you toconsiderthe following questions: a) What does it mean to provide educational programming? b) What does it mean to be a peer educator? c) How do I influence others by my involvement in this program? d) How do I what to influence others by my involvement in this program? e) How do I change the world so that it is a better place when I leave it? Praxis1. Develop facilitation and presentation skills 2. Obtain knowledge about LGBTA history and current issues and concerns. 3. Conceive of and articulate what it means to 'come out'. 4. Acquire information on sexual orientation, identity development and queer history. 5. Refine your ability to provide programming activities in the form of facilitation, discussion, skits, and exercises. 6. Develop a sense of community and rapport with other panelists through class discussions and projects.", "other": ["United States Cultures (US)"]}, {"course_name": "BBH 296: Independent Studies", "department": "Biobehavioral Health (BBH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "BBH 297: Special Topics", "department": "Biobehavioral Health (BBH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "BBH 299: Foreign Studies", "department": "Biobehavioral Health (BBH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BBH 301W: Values and Ethics in Biobehavioral Health Research and Practice", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits/Maximum of 3", "description": "Examines bases for choices among values in personal and professional relations in human development processes and supporting services. This class is meant to give students both background knowledge of and practice in the process of ethical decision making. Students will learn the historical, philosophical, and psychological concepts underlying the study of morality and ethics. Course content will include the history and rationale for regulations regarding the ethical practice of research, medicine, and public health.", "prerequisite": "BBH 101", "other": ["Writing Across the Curriculum"]}, {"course_name": "BBH 302: Diversity and Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Examines the relationship diverse personal and sociocultural factors (e.g., socioeconomic class, race-ethnicity, gender, age, and sexual orientation) have with health.  BBH 302 / AFAM 302 Diversity and Health (3) (US) is an introduction to the interdisciplinary study of the impact of diversity on health in America. The course is designed to provide an understanding of the complex interaction between concepts of diversity, including but not limited to race, ethnicity, culture, gender, age, socioeconomic status, and sexual orientation. The course will also consider and critique the methods used in the study of these concepts and issues related to the measurement of health among diverse groups. The ultimate goal of this examination is to assist students in developing an appreciation of diversity and the impact diversity has on assessments and study of health, health status, and health promotion in America. The course is also designed to integrate different sources of information about diversity by utilizing critical thinking skills for the consumption of health information. The educational objectives will be to enable students to: 1) Consider the implications of race, ethnicity, gender, age, socioeconomic status and sexual orientation on health/social policies in light of research findings, 2) Understand the legacies and historical events that have impacted our view, status, and treatment of diverse populations, 3) Appreciate the importance of understanding the origins of different health behaviors that impact biological processes, as well as the impact of biological processes in the context of social, environmental, and cultural influences when examining health issues.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: AFAM 302", "United States Cultures (US)"]}, {"course_name": "BBH 305: Introduction to Global Health Issues", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Course will develop awareness of contemporary issues in global health.  BB H 305 Introduction to Global Health Issues (3) This course is an introduction to health and related issues in the global context. It is intended to be an overview of fundamental perspectives about the historical, current, and future public health challenges facing developing and industrialized countries. The course will explore the interrelationships among social structure, culture, demography, health promotion/disease prevention, biology, ecology and health policy of various countries and international health organizations. This course will 1. present key issues related to the history, conceptual frameworks, economic conditions, and policy affecting public health in the global context, 2. examine reports and studies pertaining to major global health issues and comparative research, 3. discuss the role of social structure, culture, gender roles, government policies, and the increasing numbers of the elderly in preventive health behaviors and health promotion in the global context, and 4. critique theories and models used to inform health and development programs in non-Western nations.", "prerequisite": "BBH 101", "other": ["Cross-listed with: AFR 305", "International Cultures (IL)"]}, {"course_name": "BBH 310: Research Strategies for Studying Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "BBH 310 surveys the various research methodologies used in biomedical and behavioral research, including case, epidemiological, quasi-experimental and experimental approaches. The goals of this course are: (1) to provide students with a basic understanding in research methods; (2) to familiarize students with research strategies for studying Biobehavioral Health; (3) to develop critical thinkers and informed consumers of scientific research and health information; (4) to provide a basic understanding of the available approaches to research and interventions in order to address the complex set of determinants associated with public health problems that affect populations generally and those factors associated more specifically with racial and ethnic disparities in health. We will also talk about how research data are analyzed, interpreted, and translated into meaningful results in the form of a scientific paper, while addressing many of the important issues and concerns behind statistical assessments and outcomes. In addition, research ethics, responsibilities associated with conducting human research, and some of the perils of research, including issues associated with a study's method, design, and publication, will also be discussed.", "prerequisite": "STAT 200"}, {"course_name": "BBH 310H: Research Strategies for Studying Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course is designed for students working to earn honors in Biobehavioral Health to help them prepare for their thesis proposals. The course surveys the various research methodologies used in biomedical and behavioral research, including case, epidemiological, quasi approaches. The goals of this course are: (1) to provide students with a basic understanding in research methods; (2) to familiarize students with research strategies for studying Biobehavioral health; (3) to promote critical thinking of scientific research and health information; experimental and experimental (4) to develop a basic understanding of the available approaches to research and interventions that are needed in order to address the complex set of determinants associated with public health problems that affect populations; (5) to familiarize students with how research forms a critical component of BBH honors requirements.", "prerequisite": "BBH 101", "other": ["Honors"]}, {"course_name": "BBH 311: Interdisciplinary Integration in Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Interdisciplinary Integration in Biobehavioral Health explores the complex ways in which influences at different levels and across different domains come together to impact human health. The course will highlight the complex determinants of health by exploring diverse areas from a cellular to global level. Students will engage in a review of the literature relevant to the concepts and findings of different scientific domains as they apply to biobehavioral health. Accordingly, students will utilize literature from various domains, including human biology, sociology, psychology, and anthropology. This course will help students to synthesize and apply concepts learned in prerequisite courses in order to develop an in-depth understanding of fundamental topics in biobehavioral health.", "prerequisite": "BBH 101"}, {"course_name": "BBH 315: Gender and Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Interdisciplinary study of gender, examining the interaction of biological, behavioral, and sociocultural factors on health differentials throughout the lifespan.  BB H 315 Gender and Biobehavioral Health (3) (US) BB H 315 is an interdisciplinary study of the impact of gender differences (and similarities) in health in the United States and the world, examining the interaction of biological, behavioral, and sociocultural factors on health, morbidity, and mortality. The course will also consider and critique the methods used in the study of gender and concepts and issues related to the measurement of health in men and women. The ultimate goal of this course is to assist students in developing an appreciation of the diversity concept of gender, and the impact of this concept on assessments and study of health, health status, and health promotion in America and other nations. The course is also designed to integrate different sources of information about gender by utilizing critical thinking skills for the consumption of health information. The educational objectives will be to enable students to: 1) define the concepts of sex, gender, gender roles, and gender identity and how they contribute to differentials in morbidity and mortality at various life stages, based on epidemiological data and other research, in the United States and other countries; 2) describe biological (e.g., genetic and hormonal) factors that contribute to gender differences and similarities in health at different life stages; 3) describe behavioral factors, such as acquired risks, self-protective behavior, and stress, that contribute to gender differences and similarities in health at various life stages; 4) describe sociocultural factors, such as gender roles, class, race/ethnicity, and educational level that contribute to gender differences and similarities in health at various life stages; 5) describe and design gender-sensitive strategies for health research and health promotion; 6) examine gender differences in a specific illness, disease, or health issue experienced by women and/or men in this country and others, and the contributing factors (e.g., sociocultural) to the differences that may exist; and 7) critique gender research on particular health issues. To achieve these objectives, the course will involve open class discussions, small break-out group discussions with written assignments, short quizzes, a paper requiring the acquisition, utilization, and critical analysis of information/research from library and internet resources, and a group presentation that requires collaborative work.", "prerequisite": "BBH 101", "other": ["United States Cultures (US)"]}, {"course_name": "BBH 316: Foundations and Principles of Health Promotion", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Foundations of Health Promotion, is a 3-credit course required of all BBH majors and available to other students interested in developing a basic knowledge in health promotion interventions. The course is designed to provide students with the conceptual foundation necessary to develop health promotion programs and interventions. It will involve information on both theory and practice. The educational objectives are that students will be able to: 1) define the concepts and levels of health, health promotion, and prevention; 2) describe the variety of settings in which health promotion and preventive services exist 3) identify levels of intervention in planning health education and health promotion programs; 4) describe a rationale for health promotion programs; 5) address the role of culture, environment, and policy in health behavior; 6) explain why different levels of health promotion interventions should be planned using theoretical frameworks.", "prerequisite": "BBH 101"}, {"course_name": "BBH 324: HealthWorks Peer Education Training", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Designed to train new HealthWorks peer educators, this course addresses behavior theories, promotion strategies, and college health issues.  BB H 324 HealthWorks Peer Education Training (3)HealthWorks is a peer education/outreach group that aims to promote health among Penn State students. The mission of HealthWorks is to:-increase awareness and knowledge of health issues, such as sexual health, nutrition and fitness, wellness, alcohol, tobacco and other drugs, and body image and eating disorders,-promote healthy lifestyle choices,-provide health education programs, information, and materials to students, and-advocate for a healthy Penn State community. BB H 324 is designed to train students who have been accepted into University Health Services' HealthWorks program every fall semester. The course will address the topics of health behavior theories, health promotion strategies, and health issues relevant to college populations (i.e., alcohol, nutrition, physical activity, sexual health, sleep, stress, and tobacco). To ensure that new HealthWorks members are trained to effectively promote health, students will gain both knowledge and practical experience in this course. Students will learn about health behavior theories, health promotion strategies, and health topics relevant to college students through formal classroom lectures and examinations. Classroom technology will be utilized to examine campus and national health campaigns and messages, illustrating the theories and strategies discussed in class. To garner practical experience and application-based learning, students will assist with current HealthWorks programming. Members of this class will additionally apply and integrate their new understanding of class topics through a semester project. The small-group project will ask students to propose a future HealthWorks program focused on one or more health topics that is built upon at least one health behavior theory and utilizes evidence-based strategies. By the conclusion of this course, HealthWorks members will possess the knowledge and skills to effectively provide health-related outreach, advocacy, community development, and education opportunities to students on the Penn State campus."}, {"course_name": "BBH 325: Health Promotion Services Training", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course will provide students with the knowledge and professional skills to deliver peer-based individual health promotion services for the college population. The course will cover a variety of health issues that are relevant to college students, including nutrition, physical activity, sexual health, sleep, and stress (including mindfulness and time management). Students will be taught about each of the health topics over the course of two class sessions. Students will be taught information about how each health topic specifically relates to the college population. Current data about each topic will be included. These issues will be discussed in the context of health promotion principles and applicable health promotion theories. The class will provide an overview of the ecological perspective, but the focus will be on intrapersonal and interpersonal level theories, such as the Stages of Change (Transtheoretical) and Health Belief Models, as well as Social Cognitive Theory. Students will be taught the constructs for each model/theory. Students will be taught about how the theories/models apply to delivering individual health promotion interventions. Students will receive extensive training in motivational interviewing, an evidence-based strategy for promoting health behavior change. The content is designed to help students develop an understanding of the core concepts of motivational interviewing. Students will practice motivational interviewing techniques during class time. The students will deliver individual interventions during class time. Additionally, students will be given course assignments that require them to practice delivering the interventions. Students will learn about professionalism and ethics within the context of delivering individual interventions to college students.", "prerequisite": "PSYCH 100"}, {"course_name": "BBH 330: Clinic Intern Training", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits/Maximum of 6", "description": "The University Health Services (UHS) clinic intern training program provides students with the opportunity to interact professionally with patients in the health service and to work closely with members of the clinical and nursing staff at UHS. The training program teaches students to conduct initial intake screenings at UHS. This includes assessing vital signs (temperature, respirations, pulse, and blood pressure), determining the reason for the visit, entering patient information into an electronic medical record, and performing simple procedures such as testing visual acuity. Other topics covered include HIPAA training, common health concerns, patient confidentiality, and proper documentation. Enrollment in the course will involve an application and interview process; students must be willing to commit to two semesters of work to be enrolled."}, {"course_name": "BBH 368: Neuroanatomy, Behavior, and Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "The neuroanatomical bases of behavior, health, and disease.  BB H 368 Neuroanatomy, Behavior, and Health (3) BBH 368 will examine, in detail and in depth, the relationships between the multitudinous structures of the human nervous system and their roles in monitoring and controlling all functions of the body, in behavior and in health and disease. Because of the complexity of the anatomy of the nervous system, of necessity there will be an emphasis on each student developing a three-dimensional understanding of the brain's structures and their geographic relationships to each other. For students majoring in BBH, this course provides a foundation and preparation for BBH 469 & 470, the two semester Neurobiology/Integrative Neuroscience course sequence, which assumes that the student has a basic, but detailed knowledge of the nervous system. This course will count toward fulfilling the BBH major requirement, \"Take 15 credits in Biobehavioral Health.\" It will also count toward fulfilling the requirement of 9 credits of additional courses in the Neuroscience Minor. Upon successful completion of the course, the student should be able to: a)Identify on gross specimens and in slides of sections of the human nervous system the important nuclei, tracts and supporting structures. b)Describe the important pathways and circuits between the different components and nuclei of the human nervous system. c)Describe the role of each nucleus, tract, and circuit in controlling functions and behavior. d)Describe the expected deficits in function and behavior resulting from injury or disruption of each nucleus and tract.", "prerequisite": "BBH 101"}, {"course_name": "BBH 370: Environmental Health and Sustainability", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course explores the relationship of people to their environment; notably how the natural environment influences their physical, mental, and social well-being. This course also investigates the impact of environmental issues on community, regional and global health. Students will gain a basic understanding of how environmental factors impact the health of people and the community, and an overview of public health prevention efforts to minimize negative impacts.", "prerequisite": "BBH 101"}, {"course_name": "BBH 390A: Preparation for Global Health Field Experience", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Designed to help students prepare for the required field experience in the Global Health minor.  BB H 390A Preparation for Global Health Field Experience (3) This purpose of this course is to train students admitted to the Global Health (GLBHL) minor to plan and prepare for the required field experience in a global health setting. Students in the minor must take both this course, BB H 390A, and the subsequent field experience course, BB H 390B. This course includes an examination of both practical and academic issues related to successfully completing an appropriate field placement. Focus is given to encouraging students to become reflective global health practitioners who are able to adapt to and work through personally and professionally complex situations. Interactive class lectures, readings, case studies, discussions, assignments and projects/presentations will help students gain an awareness of the socio-cultural, economic, and political context of various kinds of global health professional settings, and to be sensitive to the constraints under which health professionals work in different parts of the world. To broaden their understanding of the realities of engaging in the field of global health, students will have opportunities to meet with individuals who have health work experience in a variety of low and middle-income settings.", "prerequisite": "BBH 305"}, {"course_name": "BBH 390B: Global Health Field Experience", "department": "Biobehavioral Health (BBH)", "credits": "6 Credits", "description": "Field experience in a global health setting.  BB H 390B Global Health Field Experience (6) The purpose of this course is to provide a supervised field experience in a global health setting for the students who have been admitted to the Global Health Minor (GLBHL). Students in this minor must take BBH 390A \"Preparation for Global Health Field Experience\" before scheduling this course. Students will spend 6 weeks in the summer working in one of several pre-approved international or domestic health care or public health settings under professional supervision.", "prerequisite": "BBH 390A"}, {"course_name": "BBH 397: Special Topics", "department": "Biobehavioral Health (BBH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "BBH 399: Foreign Studies", "department": "Biobehavioral Health (BBH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BBH 402: African Health & Development", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Course will address African health and development strategies in the context of health promotion programs.  BB H 402 African Health & Development (3) (IL)This course is designed to address African health and development strategies in the context of health promotion programs. Students will analyze the cultural, educational, social, economic, political and environmental impact of health and development in Africa. Emphasis will be on development of health promotion strategies that locate program implementation and evaluation within their cultural contexts. The objectives are to prepare students to:1. discuss and debate the roles of culture, social contexts, gender, and political economic impact on health behaviors in Africa;2. critique some of the theory and models used to inform public health programs in Africa;3. examine the role of historical, spiritual, linguistic, and political impacts on health projects in different countries in Africa; and4. analyze health priorities in Africa and their impacts on such global initiatives as the Millennium Development Goals;5. discuss issues related to human rights, population identities in the world and examine their impact on health in Africa. Attendance is required. Students will be expected to participate actively by critically reviewing assigned readings, engaging in class discussions, and preparing and delivering in-class presentations. Grading is based on attendance, participation, presentations, exams and a final research paper.", "prerequisite": "BBH 305", "other": ["International Cultures (IL)"]}, {"course_name": "BBH 407: Global Health Equity", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Health, social disparities, and equity in the global environment.  BB H 407 Global Health Equity (3) (IL) This course focuses on issues related to health, social disparities, and equity in the global environment. It examines the theories of health disparities and equity from the vantage point of Western and non-Western countries. It explores epidemiologic data and the relationships between social structure, culture, demography, health promotion/disease prevention, and health policy of various countries and international health organizations. The course objectives are to: 1. discuss and critique the history, conceptual frameworks, and policy implications of global health disparities and equity; 2. examine epidemiologic data and studies pertaining to major global health issues and cross-national and comparative research; 3. discuss the role of social structure, culture, gender roles, and government policies in preventive health behaviors and health promotion in the global context; 4. critique theories and models used to inform health and development programs in non-Western nations.", "prerequisite": "BBH 101", "other": ["International Cultures (IL)"]}, {"course_name": "BBH 410: Developmental and Health Genetics", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "The focus of this course is on genetic influences on complex traits that are relevant to health and development. In the first part of the course, aspects of basic genetics are reviewed from the perspective of how genes work in the context of complex traits. This background information is complemented in the second part by an introduction to basic study designs and experimental approaches in genetic epidemiology, molecular genetics, and quantitative genetics. The third part of the class focuses on the application of these concepts and methods to the investigation of the genetics of health-related conditions. At the end of the course, students will have a fundamental understanding of how multiple genetic and environmental influences interplay to influence health, and the ability to evaluate critically claims of identification of genes that influence complex traits.", "prerequisite": "BBH 210"}, {"course_name": "BBH 411W: Research and Applications in Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Research methods, multi-level analyses, and applications in biobehavioral health.  BB H 411W Research and Applications in Biobehavioral Health (3)This is an upper-division course on research and applications in Biobehavioral Health and is the designated writing intensive (W) course for the major. The primary goals of this course are to provide the student the ability to effectively: 1) find, organize, integrate, and critique existing knowledge and research in biobehavioral health; 2) generate and analyze new data related to a specific domain though the conduct of original research; 3) interpret, evaluate, and communicate --to both scientific and lay audiences--the results of the original research; and 4) integrate these findings--with due concern for strengths and limitations of the research--back into the body of knowledge on the biobehavioral health topic. In this course the instructor will first introduce the student into a body of knowledge related to a domain involving health and health-related behaviors. Example domains may include areas such as, stress and health, drug/alcohol addictions and health, hormonal impacts on health, smoking cessation programs, obesity and health, sexual behaviors and health, etc. Students will go through the steps involved in original research (e.g., Introduction, Methods and Procedures, Results, Discussion, Summary, Abstract, Bibliography) and written assignments will be involved for each step. Depending on the instructor, the original research may involve laboratory work, collection of survey data, analyses of publically available data, or existing data sets based on faculty's research program. Students will learn how to use available tools to descriptively summarize and analyze data using computer-assisted software. This is a required course in the Biobehavioral Health major. The course is designed to give skills to acquire, integrate, and critique health-related information and to communicate to professional and non-professional audiences. The course is appropriate for students intending to obtain positions in health promotion and disease prevention and to students seeking to advance to post-baccalaureate graduate and professional programs in medicine, public health, health policy and planning, and other health-related careers.", "prerequisite": "BBH 101", "other": ["Writing Across the Curriculum"]}, {"course_name": "BBH 416: Health Promotion II:  Planning, Implementation, and Evaluation", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Planning, implementation, and evaluation of health promotion, prevention, and intervention programs; emphasizing evaluation.", "prerequisite": "BBH 310"}, {"course_name": "BBH 417: Advanced Applications in Health Promotion", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Advanced learning experience in health promotion applications in which students will actively participate in planning, implementing, evaluating health programs.", "prerequisite": "BBH 416"}, {"course_name": "BBH 420: Developing Stress Management Programs", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Planning, developing, and implementing strategies for stress management programs for health education professionals in school, community, and corporate settings."}, {"course_name": "BBH 426: HealthWorks Peer Education Experience", "department": "Biobehavioral Health (BBH)", "credits": "1 Credits/Maximum of 5", "description": "BBH 426 is a one-credit course for students who have been trained to be peer educators in the HealthWorks program in Health Promotion and Wellness. Students will gain experience developing and implementing a range of college health promotion activities, including creating health communication materials, conducting outreach events, delivering educational workshops and delivering one-on-one wellness services. The course includes a substantial amount of small group work. Students are expected to attend weekly meetings and engage in additional service work every week.", "prerequisite": "BBH 324"}, {"course_name": "BBH 432: Biobehavioral Aspects of Stress", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course will cover the ways in which response to stress is related to human health. The course will explore the bidirectional relationship between dimensions of health and different types of stressors. Students will explore the effects of stress in different forms on physical, psychological, social, and cognitive outcomes. In addition, the course will examine how health status may change the way people respond to stressors. The course will cover the way stress response occurs in humans and how those responses can affect other aspects of physical, psychological, behavioral, and cognitive functioning.", "prerequisite": "BBH 101"}, {"course_name": "BBH 440: Principles of Epidemiology", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course is designed to provide students with a basic understanding of the principles of Epidemiology and to familiarize students with the methods and applications of epidemiology to understanding the bases for heterogeneity of disease and health among populations. The goals of the course are: 1) recognize and use basic principles, concepts, terminology, and techniques in Epidemiology as applied to the study of infectious disease, chronic diseases, and other health-related problems; 2) examine and understand measures of risk and burden of illness on populations defined in terms of age, race, gender, class, time, and other relevant socio-cultural and demographic factors; 3) be able to interpret and critique epidemiological research reports on the identification of risk factors and casual factors for diseases in populations; 4) assess the health status and burden of diseases and health problems of populations at multiple levels of analysis for the purpose of planning health promotion activities and health care services; 5) have a basic understanding of the epidemiology tools for disease screening and other methods for primary and secondary prevention of disease and health problems; 6) examine the validity and applicability of various health interventions used to improve health status and the barriers for successful interventions; and 7) have a basic understanding of the epidemiology of the major causes of morbidity and mortality in the U.S. and for other selected regions and nations of the world. This is a required course in the Biobehavioral Health major and an elective course in the Health Policy and Administration major. The course is also appropriate for students intending to advance to post-baccalaureate graduate and professional programs in medicine, public health, health policy and planning, and other health-related careers. Students will be evaluated based on their performance on a combination of written assignments, a term paper or project, and exams.", "prerequisite": "BBH 310", "other": ["Cross-listed with: HPA 440", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "BBH 446: Human Sexuality as a Health Concern", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Examination of human sexuality as a integral part of basic health education and health care for persons of all ages.", "prerequisite": "BBH 101"}, {"course_name": "BBH 451: Pharmacological Influences on Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Biological and behavioral aspects of therapeutic and recreational drug use and misuse, and their relationships to health.  BB H 451 Pharmacological Influences on Health (3) The primary theme of this course is to review and integrate information relevant to the actions, uses, and biobehavioral influences of psychoactive drugs. Concepts relevant to pharmacology, biobehavioral health, and drug use and abuse will be learned. The primary objectives of this course are:1. To provide an understanding of the concepts relevant to pharmacology, including: principles of drug action (pharmacokinetics, pharmacodynamics), drug safety, and drug effectiveness.2. To provide a descriptive representation of the breadth of topics relating to behavioral and biological influences of psychoactive (i.e., therapeutic, recreational) drugs on human health and disease.3. To provide exposure to and enhance critical thinking skills in current research related to the biobehavioral effects of psychoactive (i.e., therapeutic, recreational) drugs, including: psychoactive drug use and abuse, therapeutic drug use, and drug addiction treatments.", "prerequisite": "BBH 101"}, {"course_name": "BBH 452: Women's Health Issues", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Recommended Preparations: BIOL 141; PSYCH 100; WMNST 100  N452 examines major health issues concerning women today. The topics covered include, but are not limited to: developing a healthy life style--nutrition and exercise; family planning--birth control methods; violence against women--relationship rights and signs of a batterer; eating disorders--anorexia, bulimia, and binge eating; sexual wellness; substance abuse--alcohol, prescription drugs; menopause signs and symptoms, treatments; and medical conditions affecting women today such as cancer, arthritis, multiple sclerosis and heart disease. The course emphasizes that women's lives are influenced by social, economic, political, and cultural conditions.", "other": ["Cross-listed with: NURS 452, WMNST 452", "United States Cultures (US)"]}, {"course_name": "BBH 458: Critical Feminist Issues in Reproduction", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "This course examines women's reproductive health issues from a feminist perspective. Reproduction has always been thought of as 'women¿s work,' yet decisions about reproduction are rarely made by women. This course will focus on how various political institutions (e.g., religious, economic, governmental, legal, medical, etc.) influence all aspects of human reproduction, and how these influences affect women's reproductive health, both ideologically and practically, as well as how women's reproduction affects women's lives. This course will examine four aspects of reproduction from a feminist perspective: reproductive rights, including access to birth control and abortion along with the right to be free of forced sterilization; infertility and the new conceptive technologies; pregnancy, including screening, sex selection, maternal and 'fetal rights'; and childbirth options. Throughout the course, we will return to the question of the 'politics of reproduction' by asking ourselves which powerful institutions govern each particular aspect of reproduction and whether the decisions made are good for women. Using a feminist perspective, we'll focus on making women and their health needs the center of discussion and examining the relative lack of power held by women in decisions made about their reproductive health. In addition to class readings (which are both theoretical and applied in nature) students will learn through class discussions, films, and group projects.", "prerequisite": "WMNST 100", "other": ["Cross-listed with: WMNST 458", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BBH 468: Neuroanatomical Bases for Disorders of Behavior and Health", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "An examination of the anatomical/cellular/molecular bases for human central nervous system disorders and their impacts on victims/families/caregivers.  BB H 468 Neuroanatomical Bases for Disorders of Behavior and Health (3) This course will examine in detail and in depth the neuroanatomical and cellular/molecular/genetic bases for selected disorders of the human central nervous system (e.g. Parkinson's, Alzheimer's, stroke, etc.) and their impacts on the victim, his/her daily life and his/her family and care givers. Damage to, or malfunctions of, any part of the central nervous system causes specific and characteristic disruptions of normal processes, which manifest as abnormal and/or absent behaviors. Current research on the anatomical, cellular, molecular, and genetic bases for the disorders and the current/future trends in prevention/treatment of the disorders will be studied. Upon successful completion of the course, the student should be able to: a) describe the physical signs, symptoms, causes, effects on the patient and his/her family & care givers, prognoses, treatments, and support systems available to these patients, of the neurological disorders covered in this course; b) describe the neuroanatomical, cellular, and molecular bases for these conditions; c) describe the current research on these disorders and the new prevention/treatment approaches being developed. The evaluation of students' performances in the course will be typically based on multiple choice examinations and a library research paper. This course will count toward fulfilling the BB H major requirement, \"Take 15 credits in Biobehavioral Health.\"", "prerequisite": "BBH 368"}, {"course_name": "BBH 469: Neurobiology", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Students will acquire an understanding of basic neurobiology, the terminology of neuronal structures and functions, as well as experimental approaches designed to integrate the principles of neural cell biology, neurophysiology, neurochemistry, neuroendocrinology, neuropharmacology, genetics and molecular biology. The LEARNING OBJECTIVES of this course are to establish a working knowledge and understanding of: (I) the cellular structures, organelles and passive and active membrane properties important for neural function, (II) the neurotransmitters, receptors, ion channels and 2nd messenger systems underlying synaptic transmission and other forms of neural signaling, (III) the development of the nervous system including neurogenesis, neural maturation, apoptosis, synaptogenesis in both the developing and adult CNS, and (IV) the molecular mechanisms underlying synaptic plasticity and learning and memory. Lastly, (V) the course will demonstrate applications of above knowledge to select complex diseases of the central nervous system", "prerequisite": "BIOL 230W", "other": ["Cross-listed with: BIOL 469"]}, {"course_name": "BBH 470: Functional and Integrative Neuroscience", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Neurobiological function in motivated behaviors, motor and sensory function, learning and memory, development, sexual differentiation, and pathology.", "prerequisite": "BIOL 469", "other": ["Cross-listed with: BIOL 470"]}, {"course_name": "BBH 475H: Honors Biobehavioral Analysis of Addiction", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Addiction is a ubiquitous problem, yet understandings of addiction and opinions on the causes of addiction vary greatly. This course will apply a biobehavioral approach to examine addiction from historical, societal, behavioral, neurobiological, and genetic contexts to identify causes, challenges, and comorbidities that associated with addiction that affect individuals and populations. Some of the course topics will include: theories of addiction, the impact of developmental exposure to substances of abuse, comorbidity of substance abuse with other mental disorders, the role of genetics in addiction, the neural substrates of addiction, and treatments for addiction. Questions that will be raised include: Can addiction be cured? Is addiction one disorder or an amalgam of disorders? What is the impact of addiction? Learning objectives include: students will be able to locate, critique, and synthesize empirical research on topics related to addiction; students will engage in discussion on topics and theories of addiction and relate research to real world situations; Students will effectively communicate on a specific addiction-related topic and include research evidence, theories, and implications.", "other": ["Honors"]}, {"course_name": "BBH 490: Introduction to Internship Experience", "department": "Biobehavioral Health (BBH)", "credits": "3 Credits", "description": "Provide an integrative learning experience to develop professional skills encountered in an internship experience and future careers in biobehavioral health.  BB H 490 Introduction to Internship Experience (3) This course is a prerequisite for BB H 495, Internship Experience in Biobehavioral Health. This course will provide students with the professional and academic skills necessary to develop an internship, be successful in an internship and equip students with the tools necessary to launch a career within the field of BBH or enable students to prepare more competitive applications for entry into post baccalaureate programs in medical fields or graduate school. The primary goal of the course is to provide integrative learning experiences preparing students to be successful in their internship endeavor, while learning practical skills necessary to flourish in future career choices. Course topics include: professional self-assessment and critical reflection, experiential learning, person/environment fit, resume creation and professional writing criteria, practical skills related to securing an internship consistent with professional goals, interviewing skills, professionalism and ethics within the BBH field, effective communication and internship agreement guidelines. Through this practical application, students will gain the necessary proficiencies and awareness of career settings, protocols and contexts under which BBH specialists work and/or prepare for future educational opportunities.", "prerequisite": "BBH 101H"}, {"course_name": "BBH 494: Research Project", "department": "Biobehavioral Health (BBH)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "BBH 494H: Senior Honors Thesis", "department": "Biobehavioral Health (BBH)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study related to a student's interests directed by a faculty supervisor and culminating in the production of a thesis.", "prerequisite": "approval of honors thesis advisor", "other": ["Honors"]}, {"course_name": "BBH 495: Internship Experience in Biobehavioral Health", "department": "Biobehavioral Health (BBH)", "credits": "6-12 Credits", "description": "This course provides experiential learning in the field. Internship Supervision and support will be provided by site and university personnel.", "prerequisite": "BBH 490"}, {"course_name": "BBH 496: Independent Studies", "department": "Biobehavioral Health (BBH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "BBH 496H: Independent Honors Study in BB H", "department": "Biobehavioral Health (BBH)", "credits": "1-3 Credits/Maximum of 6", "description": "For non-thesis independent study/research by Schreyer Honors College scholars.", "other": ["Honors"]}, {"course_name": "BBH 497: Special Topics", "department": "Biobehavioral Health (BBH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "BBH 499: Foreign Studies", "department": "Biobehavioral Health (BBH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]