[{"course_name": "BE 1: Growing Your Future--First-Year Seminar", "department": "Biological Engineering (BE)", "credits": "1 Credits", "description": "First-year seminar to introduce students to the breadth of the agricultural and biological engineering profession, including bioprocessing, machinery, and natural resources.  B E 001S Growing Your Future--First-Year Seminar (1) This first-year seminar introduces students to the university in general and to the breadth of the agricultural and biological engineering profession. Students participate in hands-on lab activities in the focus areas of the profession, including machinery systems, food and biological processing, and natural resource engineering. Through these lab activities and a group project, students learn how the profession is critical to providing a growing world population with food, fiber, fuel, and water under increasing environmental constraints. In addition to being introduced to Penn State as an academic community, students also become familiar with the resources, tools, and opportunities available to them. Through the lab activities and in-class discussions on research, internship, and international opportunities, students meet and establish relationships with faculty, graduate students, and undergraduate students affiliated with the Biological Engineering and BioRenewable Systems programs.", "other": ["First-Year Seminar"]}, {"course_name": "BE 97: Special Topics", "department": "Biological Engineering (BE)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "BE 297: Special Topics", "department": "Biological Engineering (BE)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BE 299: Foreign Studies", "department": "Biological Engineering (BE)", "credits": "1-12 Credits/Maximum of 12", "description": "Course offered in foreign countries by individual or group instruction", "other": ["International Cultures (IL)"]}, {"course_name": "BE 301: Mathematical Modeling of Biological and Physical Systems", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "The ability to quantify relationships into mathematical models, and implement the models into the computer to find solutions, is essential for engineering analysis and design. This course provides the student with tools for modeling biological and physical systems. Upon completion of this course, the student will be able to: identify a process/system and represent that process/system mathematically; solve the mathematically-represented system using computer-based modeling tools, such as Excel and MATLAB; describe the emphasis areas offered in the Biological Engineering major; and be able to develop a systems model related to each area. The course includes engineering economics, matrix operations, curve fitting, numerical integration and differentiation, linear and non-linear systems of equations, and applications of these methods to biological and agricultural systems.", "prerequisite": "MATH 250"}, {"course_name": "BE 302: Heat and Mass Transfer in Biological Systems", "department": "Biological Engineering (BE)", "credits": "4 Credits", "description": "This course applies the principles of heat and mass transfer to natural and engineered biological systems, ranging from soil/water ecosystems to animal, plant, and microbial production systems. Heat transfer mechanisms (conduction, convection, and radiation) are covered, as well as analysis techniques for steady state and transient cases. Mass transfer mechanisms (diffusion, dispersion, and convection) are also covered followed by simultaneous heat and mass transfer, including psychrometrics, ventilation, and drying. Applications of heat and mass transfer to agricultural and biological engineering are interwoven throughout the course. These applications may include heat exchangers for hydraulic systems, flow through porous media, soil freezing and thawing, bioreactor design, post-harvest product storage, animal housing, and greenhouses.", "prerequisite": "BE 301"}, {"course_name": "BE 303: Structural Systems in Agriculture", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "The objective of this course is to provide the student with the essential skills necessary to engage in practical agricultural structure analysis and design. Topics include a review of shear, moment and deflection concepts; loading in agricultural structures including earth loads, grain loads and livestock loads; methods for the analysis of determinate and indeterminate beams, trusses and frames; the material properties of wood including impact of species, grain orientation, degree of hydration, etc., on member adequacy. The nano and molecular structure of wood is also discussed and how it impacts material properties. The course is focused on the practical application of basic engineering principles with examples. The course contains a design analysis project where a student team analyzes an industrially designed structure (typically a post-frame building containing a truss roof system), which has been designed for a specific area. The team then redesigns the structure for a different location with different snow and wind loadings as well as intended usage, and optimizes the structure for efficient design of the structural members. The design and analysis may be completed using a common industrial software package. The course will serve as a prerequisite for senior-level structural design courses.", "prerequisite": "EMCH 210"}, {"course_name": "BE 305: Agricultural Measurements and Control Systems", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "Principles of measurements, instruments, controls, and data acquisition systems, with emphasis on agricultural applications.  B E 305 Agricultural Measurements and Control Systems (3)Engineers and scientists are routinely required to measure or control parameters of physical systems. Frequently, these parameters are quantified electronically. This course prepares the student to solve fundamental engineering instrumentation and control problems with emphasis on agricultural and biological systems. Upon completion of this course, the student will be able to: select and apply electronic devices to solve basic engineering measurement and control problems; apply interference (noise) reduction techniques using sound engineering principles; demonstrate correct use of common electronic measurement tools including multimeters, oscilloscopes and others; demonstrate electrical construction techniques including cable preparation, soldering, crimping, circuit board fabrication, and others; explain simple measurement and control circuits represented by schematics or ladder diagrams; demonstrate the application of dataloggers, microcontrollers, programmable logic controllers, and computer software to collect data and/or control basic processes; explain the function of common circuit components such as resistors, capacitors, inductors, diodes, transistors, op-amps, and transformers in simple circuits. Students are evaluated on homework and lab worksheets, quizzes, an oral presentation, and a final project.", "prerequisite": "PHYS 212"}, {"course_name": "BE 306: Machines for Agricultural and Biological Processing", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "This course is designed to provide a broad foundation for understanding machine system design for Biological Engineering students. In addition, this course serves as a foundation for those wishing to develop a more focused understanding of agricultural and general machine systems, and is a prerequisite for ASM and BE 400 level courses. Machine systems are an integral part of many agricultural operations from field production to post-harvest processing, storage, transportation, and bio-based processing. Biomass feedstock logistics and bioenergy production systems are heavily relying on machine systems. Biological Engineers will likely encounter a wide range of powered and automated equipment in their careers. This course consists of lectures, labs, and open-ended design projects. The lab activities will focus on testing and evaluating of machine performance using prototype machines and instruments. Lab activities and design projects will be completed in the format of small groups. This course equips the students to: (1) describe operating characteristics of engines and motors and properly select models for different applications: (2) design machine elements and mechanical power transmission systems to accomplish a machine task: (3) apply basic physics and engineering principles in a variety of machine-product interaction situations: and (4) practice technical report writing and oral presentation.", "prerequisite": "EMCH 212"}, {"course_name": "BE 307: Principles of Soil and Water Engineering", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "BE 307 focuses on utilization and engineering of soil-water resources, including rainfall-runoff, soil-water movement, erosion/sediment transport and flow processes. For each topic, the significance, underlying principles and equations will be covered, along with further exploration in a practical and experiential mode with class participants sharing in problem formulation, team problem solving, discussions, lab activities, and explanations/presentations. Students will be exposed to map use, representative soil profiles, cropping-management systems, and watershed-scale settings. Lab activities will sequentially build from one lab period to the next, showing how each stage of soil and water engineering is used to develop a more complete watershed-type project. As appropriate, field trips will be scheduled so as to show course participants the practical settings in which basic soil and water engineering principles can be applied. The course will serve as preparation for the senior-level soil and water engineering design courses in the Natural Resources Engineering Option of the Biological Engineering (BE) major."}, {"course_name": "BE 308: Engineering Elements of Biochemistry and Microbiology", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "Introduction to basic biochemistry and microbiology as well as industrial and environmental applications.  B E 308 Engineering Elements of Biochemistry and Microbiology (3) B E 308 provides an introduction to microbiology, biochemistry, and major organic compounds found in living systems such as carbohydrates, lipids, proteins, and vitamins, as a package to engineering students. Energy calculations in microbial bioenergetics will be covered. Examples of industrial and environmental applications that build on the basic principles will be presented.", "prerequisite": "CHEM 110"}, {"course_name": "BE 391: Communication Skills for BE and BRS Students", "department": "Biological Engineering (BE)", "credits": "2 Credits", "description": "BE/BRS 391 is one part of a two-semester experience in discipline-specific communication and leadership skills training. A key facet of this training is contextual approach. To meet the needs of BE and BRS students, the course emphasizes communication skills that are critical for their professional development, appreciating the technical content of students' work and the industries within which the students will ultimately work. The primary focus for BE/BRS 391 is communication skills (oral and written) with a secondary focus on leadership and career skills. Students will be evaluated through various methods, such as writing and speaking projects, professional presentations, written homework and worksheets in class and out, creation of portfolios and reports, and in-class group and individual exercises. BE/BRS 391 provides a foundation in General Education, Writing and Speaking (GWS) for students in the Biological Engineering (BE and BioRenewable Systems (BRS) majors.", "prerequisite": "Fifth semester standing or higher", "other": ["Cross-listed with: BRS 391", "General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BE 392: Leadership Skills for BE and BRS Students", "department": "Biological Engineering (BE)", "credits": "2 Credits", "description": "B E/BRS 392 is one part of a two-semester experience indiscipline-specific communication and leadership skills training. A key facet of this training is the contextual approach. To meet the needs of BE and BRS students, the course emphasizes leadership skills that are critical for their professional development, appreciating the technical content of students' work and of the industries within which the students will ultimately work. The primary focus for BE/BRS 392 is leadership skills, supported by training in communication, ethical decision-making, and management. Students will be evaluated through various methods, such as writing and speaking projects, professional presentations, written homework and worksheets in class and out, creation of portfolios and reports, and in-class group and individual exercises. BE/BRS 392 provides a foundation in General Education, Writing and Speaking (GWS) for students in the Biological Engineering (BE) and BioRenewable Systems (BRS) majors.", "prerequisite": "Fifth semester standing or higher", "other": ["Cross-listed with: BRS 392", "General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BE 399: Foreign Studies", "department": "Biological Engineering (BE)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BE 404: Engineering Properties of Food and Biological Materials", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "Engineering properties play a crucial role during the analysis, design, and synthesis phases of problem solving. The accurate knowledge of properties is essential to the precise determination of the overall system and component responses. Due to the time-dependent and environmentally-sensitive nature of properties of the agricultural, food, and biological materials, the theory and measurement systems are different from those used for conventional engineering materials and their systems. Therefore, the focus of this course is to provide the students with sound bases of the theory and measurement methods that are used to quantify physical, mechanical, thermal, biological, and chemical properties of products and their systems. In addition, the significance and importance of the inherent variation in the property values of agricultural, food, and biological materials is emphasized."}, {"course_name": "BE 460W: Biological Engineering Design I", "department": "Biological Engineering (BE)", "credits": "2 Credits", "description": "BE 460 is part one of a two course sequence that provides a culminating design experience for students in the Biological Engineering major. Students will develop skills and techniques for managing and executing engineering design projects in the following fields: agricultural engineering, food and biological processing engineering, and/or natural resource engineering. Projects are sponsored by faculty, industry, or community initiatives and are structured to span two semesters. In the Fall semester, the emphasis is on classroom lectures, preliminary analyses, and project proposal development. In the Spring semester, the emphasis is on hands-on laboratory activities, project execution, and report preparation. Project teams perform all facets of the design process. This includes problem identification, planning of the project, formulation of design specifications, development and evaluation of alternative conceptual designs, development of detailed designs, consideration of safety and design optimization, design implementation, design testing, and analysis and documentation of results. Students improve their writing skills through preparation and refinement of various documents including a design notebook, proposal, statement of work, design specification report, status reports, and a final report. Students also present their results in other formats, including poster and oral presentations for both technical and non-technical audiences.", "prerequisite": "BE 391", "other": ["Writing Across the Curriculum"]}, {"course_name": "BE 461: Design of Fluid Power Systems", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "This course is designed to provide a solid foundation for understanding hydraulic and pneumatic systems for power transmission and motion control, including hydrostatic transmissions and electro-hydraulic systems. Applications include mobile and stationary equipment in agricultural production and processing systems. Biological Engineers (and other engineers as well) will likely encounter a wide range of powered and automated equipment in their careers. This course equips the students to: (1) understand the key operating characteristics of most fluid power system components including compressors, pumps, valves, cylinders, and motors, (2) design fluid power circuits, (3) mathematically model the steady state operation of fluid power systems, and (4) have sufficient knowledge to obtain the Hydraulic Specialist Certification offered by the Fluid Power Society. The course includes a hands-on laboratory offering the chance for students to construct circuits, see component cutaways, experience component and system performance demonstrations, and work with electronic control of hydraulic systems. Prerequisite knowledge includes fluid mechanics and familiarity with mechanical power transmission systems. Students may be evaluated based on homework assignments, laboratory reports, a design project, and exams.", "prerequisite": "BE 306"}, {"course_name": "BE 462: Design of Wood Structures", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "BE 462 covers structural properties of wood, design of wood structural elements, design of wood structural systems, and design of post-frame buildings. The course begins by defining the structural loads applicable to wood framed building systems. Them, students are introduced to the unique physical and structural characteristics of solid lumber and other wood products, such as plywood and other panel products and structural composite lumber, including laminated veneer lumber, parallel strand lumber and composite wood I-joists. The engineering principles and specifications for designing wood structural members, including tension members, beams, columns, and beam-columns are presented in detail using the National Design Specification for Wood Design. Design specifications for designing wood structural connections using dowels, such as nails, bolts and lag-screws, are presented. Design procedures for designing selected wood-frame systems, such as floors, trusses, structural diaphragms and shear walls, are also presented. Students are introduced to a computer program which is an invaluable aid for analyzing and designing wood framed structural systems. At the conclusion of the course students will be able to specify structural loads for wood framing systems and analyze and design wood beams, columns, beam-columns, typical wood diaphragms and shear walls, simple wood structural systems, and a range of wood structural connections. The course builds on engineering students' prior knowledge from strength of materials and elementary structural analysis. Students may be evaluated based on homework assignments, exams and a semester project.", "prerequisite": "BE 303"}, {"course_name": "BE 463: Design Principles of Mechatronics for Biosystems", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "This course applies the basics of mechatronic systems such as controller, sensor, and actuator theory to agricultural and biological systems. Applications in agricultural and biological systems will be covered throughout the semester such as developing mini-scale peach tree detector, apple harvester, animal body temperature sensing unit, nursery plant identifier, light sensor application for apple maturity evaluation, or similar topics. Students will gain hands-on experience with agricultural robotics and micro-controller programming through design and implementation of an embedded system based on microcontroller.", "prerequisite": "BE 305"}, {"course_name": "BE 464: Bioenergy Systems Engineering", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "In the coming decades biomass will play an increasing role in satisfying society's energy and material needs, providing a renewable alternative to fossil fuels. This course will cover the fundamental theories and applied technologies used in production and conversion of biomass into transportation fuels, heat, power, electricity, chemicals and other value-added products. Production strategies focus on sustainable cropping systems, harvest, storage, and pretreatment for diverse biomass feedstocks. Conversion technologies covered include ethanol fermentation, biodiesel catalysis, combustion, pyrolysis, gasification, anaerobic digestion, and emerging processes. System analysis will address worker safety and health, environmental impacts, policy, and economics. The course is recommended for students in engineering and science majors with a background in thermodynamics, chemistry, and biochemistry or microbiology. Evaluation may be based on class participation, homework, quizzes, exams, and a team design project. Students may take only one course from BE 464 and ABE 884 for credit.", "prerequisite": "EME 301"}, {"course_name": "BE 465: Food and Biological Process Engineering", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "Engineering principles of fluid flow, thermal processes and other topics will be applied to the design of systems for the food and biological process industry. Due to the focus on unit operations and material and energy balances, the examples used will be applicable to bioreactor production, food processing, pharmaceutical manufacture, etc. At the end of this course, students will be able to do the following: use and convert units and dimensions applicable to food processing; apply laws of conservation of mass and energy to unit operations; evaluate time and temperature profiles for food pasteurization and sterilization; design an aseptic processing system; describe operation of mechanical refrigeration systems; calculate freezing times; design a continuous air blast freezing system; compute the energy requirements in single and multiple effect evaporators; and use the psychrometric chart in relation to drying processes.", "prerequisite": "BE 302"}, {"course_name": "BE 466W: Biological Engineering Design II", "department": "Biological Engineering (BE)", "credits": "2 Credits", "description": "BE 466 is part two of a two course sequence that provides a culminating design experience for students in the Biological Engineering major. Students will develop skills and techniques for managing and executing engineering design projects in the following fields: agricultural engineering, food and biological processing engineering, and/or natural resource engineering. Projects are sponsored by faculty, industry, or community initiatives and are structured to span two semesters. In the Fall semester, the emphasis is on classroom lectures, preliminary analyses, and project proposal development. In the Spring semester, the emphasis is on hands-on laboratory activities, project execution, and report preparation. Project teams perform all facets of the design process. This includes problem identification, planning of the project, formulation of design specifications, development and evaluation of alternative conceptual designs, development of detailed designs, consideration of safety and design optimization, design implementation, design testing, and analysis and documentation of results. Students improve their writing skills through preparation and refinement of various documents including a design notebook, proposal, statement of work, design specification report, status reports, and a final report. Students also present their results in other formats, including poster and oral presentations for both technical and non-technical audiences.", "prerequisite": "BE 460W", "other": ["Writing Across the Curriculum"]}, {"course_name": "BE 467: Design of Stormwater and Erosion Control Facilities", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "This course equips students with the ability to design sediment and stormwater impoundments and erosion control structures used in agriculture and the development of the agricultural-urban interface. Predictive hydrology is presented along with an introduction to a hydrology-based model used in the land-development industry. Basins are presented as fundamental structures used to attenuate stormwater peaks as well as holding ponds to facilitate gravitational sediment removal from stormwater runoff. Various sediment traps are also included. Flood routing is developed so students understand and can design for flood peak attenuation. Low Impact Development (LID) practices such as green roofs, bioretention areas and vegetated filter strips are presented as infiltration-based alternatives to traditional stormwater management. Open channel design procedures including maximum permissible velocity and tractive force are reviewed. The course includes two design projects. Students are assigned a land parcel and the proposed development. Students are expected to develop an Erosion and Sedimentation Control Plan and a Post-Construction Stormwater Management Plan. Both projects are expected to be developed in compliance with state regulatory standards and to include LID practices as appropriate. In addition to the design projects, students may be evaluated on lab reports, in-class activities, and a mid-term exam.", "prerequisite": "BE 307"}, {"course_name": "BE 468: Microbiological Engineering", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "Microbiological engineering is the application of basic engineering principles and designs in biochemical and biological processes. The purpose of this course is to provide an understanding of conversions of raw agricultural materials into value-added products via microbial fermentation. This course presents all steps in this type of bioprocessing such as mutagenesis, genetic modification for microbial manipulation, enzyme and microbial kinetics, aeration, agitation for bioreactor design, and scale-up strategies, as well as various recovery methods for downstream processing.", "prerequisite": "BE 308"}, {"course_name": "BE 477: Land-Based Waste Disposal", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "The course focuses on exploration of the fundamental principles and processes that determine the fate of nutrients and pollutants in liquid and semi-solid wastes that are applied to the soil for recycling and disposal. These principles then serve as the basis for design of systems for application of livestock manures, biosolids, septage, wastewater effluents, and other residual materials. Relevant state and federal regulations will be covered to illustrate the impact of regulations and policies on engineering practice. The course culminates in a project for which students design a system to dispose of municipal, agricultural, or industrial byproduct or wastewater. Principles will be reinforced with several homework sets. Field trips will expose students to land-based waste disposal processes and systems. The course will serve as a senior-level engineering science/design course in Biological Engineering (BE).", "prerequisite": "BE 307"}, {"course_name": "BE 487: Simulation Modeling for Water Resources Management", "department": "Biological Engineering (BE)", "credits": "3 Credits", "description": "This course will provide hands-on experience of several commonly available simulation models for natural resources engineers for investigating water resources related issues. The models will serve as a base from which students can investigate the effects of different management design scenarios on watershed system responses. The course introduces general modeling concepts of data processing, model development, model calibration/validation and uncertainty analysis. Model development concepts will be introduced with data driven regression models for rainfall-runoff simulation. Then, students will work with a range of simulation models commonly used by industry or government agencies. One model might be used as an initial exploration of modeling for an entire watershed and to show the hydrologic responses for various subwatersheds (agriculturally dominated vs. urban dominated). A second model might be used to explore more in-depth modeling for an urban watershed. A third model might be used to introduce modeling concepts of demand driven closed conduit water systems in drinking water distribution systems. Students will select one of the three models to study in detail for a project where they evaluate a water management structure design or investigate a water resources related issue.", "prerequisite": "BE 307"}, {"course_name": "BE 494: Senior Thesis", "department": "Biological Engineering (BE)", "credits": "1-9 Credits/Maximum of 9", "description": "Students must have approval of a thesis adviser before scheduling this course."}, {"course_name": "BE 494H: Honors Thesis", "department": "Biological Engineering (BE)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by a faculty supervisor that culminates in the production of a Biological Engineering honors thesis", "prerequisite": "5th semester standing or higher in Schreyer Honors College and permission of BE honors advisor", "other": ["Honors"]}, {"course_name": "BE 495: Agricultural Engineering Internship", "department": "Biological Engineering (BE)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study and supervised cooperative education experience related to the student's career objective."}, {"course_name": "BE 496: Independent Studies", "department": "Biological Engineering (BE)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "BE 497: Special Topics", "department": "Biological Engineering (BE)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BE 499: Foreign Studies", "department": "Biological Engineering (BE)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]