[{"course_name": "BESC 395: Behavioral Science Internship", "department": "Behavioral Sciences - CA (BESC)", "credits": "3-12 Credits/Maximum of 12", "description": "Internship in human service organizations providing for application of academic knowledge, reading, and discussion.", "prerequisite": "90 credits with at least 16 credits in the major"}, {"course_name": "BESC 407: Small Groups Counseling", "department": "Behavioral Sciences - CA (BESC)", "credits": "3 Credits", "description": "Intensive survey of research and theory on behavior in small groups, with emphasis on interdependence, cooperation, and attitude change.", "prerequisite": "general psychology, general sociology, or general behavioral   science"}, {"course_name": "BESC 464: Feminine/Masculine", "department": "Behavioral Sciences - CA (BESC)", "credits": "3 Credits", "description": "Study of sex role learning; investigating feminine/masculine labeling; implications for contemporary society.  BE SC 464 BE SC (WMNST) 464 Feminine and Masculine (3) (US) This course provides a critical examination of the concepts of masculinity and femininity through a consideration of how these have shifted and changed historically and cross-culturally. It considers a variety of theories of gender difference. It investigates how gender is socially constructed and practiced. Thus, it examines how gender is enacted in interpersonal relationships and defined, reinforced, and challenged through processes of socialization as well as through the various institutional spheres of social life. The course addresses the diversity of masculinities and femininities within a single society. Thus, attention is given to race and class-based differences as well as to trans-genderism and homosexuality.", "prerequisite": "general psychology or general sociology", "other": ["Cross-listed with: WMNST 464", "United States Cultures (US)"]}, {"course_name": "BESC 494: Senior Thesis", "department": "Behavioral Sciences - CA (BESC)", "credits": "3-9 Credits/Maximum of 9", "description": "Problem formulation, literature search, research design, data collection, analysis of results, and final write-up of a substantial research project.", "prerequisite": "permission of program"}, {"course_name": "BESC 494H: Senior Thesis", "department": "Behavioral Sciences - CA (BESC)", "credits": "3-9 Credits/Maximum of 9", "description": "Problem formulation, literature search, research design, data collection, analysis of results, and final write-up of a substantial research project.", "prerequisite": "permission of program", "other": ["Honors"]}]