[{"course_name": "BIOTC 197: Special Topics", "department": "Biotechnology (BIOTC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BIOTC 297: Special Topics", "department": "Biotechnology (BIOTC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BIOTC 416: Microbial Biotechnology", "department": "Biotechnology (BIOTC)", "credits": "3 Credits", "description": "The overall goal of Microbial Biotechnology (3 cr.) is to provide students with an opportunity to apply their knowledge of microbiology and biotechnology to the synthesis of biologically important and industrially useful products. The course will focus on the application of the tools of Microbiology, Molecular Biology, Biochemistry, Forensics, Environmental Biology and Bioinformatics to exploit microbes as \"vessels\" to create an array of products to benefit humans, animals and the environment. For example, discussions may address the use of microbes in the cleanup of polluted environments (bioremediation) as well as their role in producing drugs (vaccines, antibiotics, etc.), industrially important enzymes (rennet, meat tenderizers, indigo production etc.), and biodegradable plastics. Furthermore, ethics and regulations surrounding the production, marketing, and distribution of these biologics will be discussed. Students in the course will also participate in a project wherein they conceive of an idea for a value-added product, research steps necessary to bring said product to market, investigate aspects related to intellectual property, and develop a marketing plan. The student project will culminate in a class competition where students will choose to invest their \"biotech bucks\" in a fellow student's proposed company. Throughout the entirety of the course, the concepts of entrepreneurship and innovation will be at the forefront of class discussions.", "prerequisite": "BMB 442", "other": ["Cross-listed with: MICRB 416"]}, {"course_name": "BIOTC 459: Plant Tissue Culture and Biotechnology", "department": "Biotechnology (BIOTC)", "credits": "3 Credits", "description": "The overall goal of this course is to provide a strong overview of the techniques used in plant biotechnology and the applications made possible by those techniques. The lecture topics will be used to introduce the principles of tissue culture and molecular biology, including how they are used to produce transgenic plants. Furthermore, the course will give students a broader and deeper knowledge in the field of Plant Biotechnology and provide a foundation for understanding the field as it changes in the future. Topics include the safety, legal and ethical issues surrounding GMOs and the study of the anti-GMO arguments surrounding each issue. In the laboratory component of the course, students will be introduced to the underlying principles of molecular biology techniques and aseptic culture of plant cells as well as the tissues and organs used to produce transgenic plants. In summary, through this course students will be introduced to many of the most important tools of the biotechnologist.", "prerequisite": "BMB 252", "other": ["Cross-listed with: BIOL 459, HORT 459"]}, {"course_name": "BIOTC 460: Advances and Applications of Plant Biotechnology", "department": "Biotechnology (BIOTC)", "credits": "3 Credits", "description": "This course provides a comprehensive overview and current status of plant biotech research. The course provides knowledge of plant systems that fall in the category of GMOs. BIOTC 460 / AGRO 460 Advances and Applications of Plant Biotechnology (3)This course will provide a comprehensive overview and status of current plant biotech research. The focus is on providing knowledge of the biology of plant systems. Consequences of development of a transgenic plant either for food (crops) or as a tool to understand molecular, genetic, and inheritance mechanisms of a trait will be discussed in detail. The course will deliver the current literature and understanding of mechanisms involved in herbicide resistance in transgenic plants. Specific topics that will be of interest to students from various disciplines include disease and insect resistance, quality traits, and secondary metabolites. Molecular biology of different pollination systems will be examined so that students will understand the concept of gene flow from transgenic to non-transgenic crops. Examples from recent developments on the beneficial use of transgenic plants as producers of modified compounds, starches, antibodies and their use in phytoremediation of toxic and organic pollutants will be discussed from the perspective of genetic and molecular plant systems. Gene expression of transgenic plant traits and the stability of an engineered crop will be discussed. Specific emphasis will be on different modes of inheritance that a transgenic plant can follow after its development and release into the environment. The course also prepares students for understanding the regulatory processes that are required for testing, moving, and environment release of transgenic crops. The laboratory component of the course will introduce students to the common technique of molecular biology that are used to detect expression in transgenic plants. Transgenic maize plants will be grown in a greenhouse and analyzed for expression of introduced genes.", "prerequisite": "BMB 251", "other": ["Cross-listed with: AGRO 460"]}, {"course_name": "BIOTC 479: Methods in Biofermentations", "department": "Biotechnology (BIOTC)", "credits": "3 Credits", "description": "The overall goal of this course is to enable students to plan and execute fermentation processes approaching industrial scale. Students will get hands-on experience setting up and monitoring fermenters, as well as conducting practical experiments that include: 1) the effects of medium components on cell density, mixing, aeration and oxygen mass transfer in fermentation systems 2) analysis and control of key parameters for product optimization and 3) computer control of fermentation processes. In addition, the student will learn to prepare and complete documentation to support project goals that will meet GLP (good laboratory practice) standards, take proper laboratory notes on all procedures which are carried out in the laboratory, and present results to a group orally. The laboratory work will be supported by presentations and discussions on the fundamentals of microbial culture, aseptic techniques, kinetics of fermentation, recombinant microorganisms, scale-up strategies, downstream processing, economic considerations, regulatory aspects and cGMP (current good manufacturing practices).", "prerequisite": "BMB 442"}, {"course_name": "BIOTC 489: Animal Cell Culture Methods", "department": "Biotechnology (BIOTC)", "credits": "3 Credits", "description": "The overall goal of this course is to introduce students to basic principles and techniques in animal cell culture. More specifically, the course outlines the importance of animal cell culture to the field of biotechnology as it applies to the pharmaceutical industry. Lecture discussions will be used to provide the necessary theoretical background in working with animal and insect cells, such as history of cell culture, media components, growth kinetics, principles of regulating biological products, cell line propagation, characterization, quality control and the complex issues of scale-up of cell culture from the research bench to larger reactors. Students will become familiar with the practical aspects of culturing and sub-culturing established cell lines and learn basic techniques such as creating a primary cell line, chromosome spreading and mycoplasma detection as well as maintaining insect cells. In addition to hands-on experiments, different methods and equipment employed in the scale-up of animal cell culture will be demonstrated and discussed in the laboratory.", "prerequisite": "MICRB 201"}, {"course_name": "BIOTC 497: Special Topics", "department": "Biotechnology (BIOTC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]