[{"course_name": "BLAW 199: Foreign Studies", "department": "Business Law (BLAW)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BLAW 243: Legal Environment of Business", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "Social control through law: courts, basic policies underlying individual and contractual rights in everyday society.  May not be used to satisfy Smeal College baccalaureate degree requirements. Not available to students who have taken B A 243.", "prerequisite": "third-semester standing"}, {"course_name": "BLAW 296: Independent Studies", "department": "Business Law (BLAW)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "BLAW 297: Special Topics", "department": "Business Law (BLAW)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BLAW 299: Foreign Studies", "department": "Business Law (BLAW)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BLAW 341: Business Law I: Introduction to Contracts, Liability Issues, and           Intellectual Property", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "An introduction to the business environment emphasizing business contracts, liability issues arising from business relations, including those in the internet realm and intellectual property issues.  Alternative dispute resolution and global perspectives will be integrated throughout.  B LAW 341 Business Law I: Introduction to Contracts, Liability Issues, and Intellectual Property (3) Business decisions have legal consequences. Such decisions can represent both legal risks and opportunities. It is important for one entering business to have a fundamental understanding of the governing legal principles. This course will provide an introduction to the U.S. legal system, coverage of the major components of contract law, and an examination of business liability issues under tort law. In addition, the intellectual property issues of trade secrets, trademarks, patents, and copyrights will be covered. The impact of digital technology and business globalization will be integrated into each topic discussed. The course will be taught in a lecture-discussion format to encourage interaction and exploration of difficult issues. The course text and materials will include key business legal cases.", "prerequisite": "MGMT 301"}, {"course_name": "BLAW 397: Special Topics", "department": "Business Law (BLAW)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BLAW 399: Foreign Studies", "department": "Business Law (BLAW)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BLAW 424: Real Estate Law", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "Analyze contemporary law applicable to various types of ownership interests and rights, methods of transferring ownership, and use of real property.  B LAW 424 B LAW (R M) 424 Real Estate Law (3) Analysis of contemporary law applicable to various types of ownership interests and rights, methods of transferring ownership, and use of real property. The objectives for this course are: (1) to provide students with an understanding of essential U.S. real estate property law, including the rights private property owners may obtain, how ownership and transfer are handled in view of present and future interests, constitutional issues that impact real estate ownership, and the legal aspects of modern real estate contractual transactions; (2) to teach students the ability to spot the legal issues arising from the above as future business leaders and (3) to introduce students to the legal reasoning process necessary to address and avoid the legal dilemmas presented by such issues. Instructional methods for the course will include detailed lectures and classroom discussion of readings and other materials. Student progress and mastery of the material will be evaluated through periodic examinations.", "prerequisite": "BLAW 341", "other": ["Cross-listed with: RM 424"]}, {"course_name": "BLAW 425: Business and Environmental Regulation", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "Examines the interplay between environmental regulation and commercial activities, including property interests.  B LAW (R M) 425 Business and Environmental Regulation (3) R M/B LAW 425 is an advanced business law course based on foundation knowledge in legal regulation, property rights, and enterprise. The course explores the interplay between environmental laws and property rights and includes topics such as; common law regulation of the environment, government power and private rights, zoning, protecting endangered species, regulating the transportation and storage of hazardous materials, and Federal regulation of water quality.Students will develop their comprehension and analysis of the legal reasoning processes along with the ability to identify legal issues from the perspectives of the government, property owners, and environmental interest groups. The instructional methods will include class discussions of readings and video presentations. To facilitate thorough analysis of the competing interests affecting environmental law, this course will employ the Socratic teaching method and place a special emphasis upon class discussion and interaction.", "prerequisite": "BLAW 341", "other": ["Cross-listed with: RM 425"]}, {"course_name": "BLAW 441: Business Law II: Agency, Employment and Business Structure", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "An examination of the laws governing agency relationships, employment, and the various structures of commercial enterprises.", "prerequisite": "BLAW 341"}, {"course_name": "BLAW 444: Advanced UCC and Commercial Transactions", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "All articles of the Uniform Commercial Code, banking relationships, debtor- creditor law, and bankruptcy law.  B LAW 444B LAW 444 Advanced UCC and Commercial Transactions (3) This course is designed to: (1) provide the student with a systematic study of the laws governing sales transactions, the instruments for financing those transactions and rights and liabilities of debtors and creditors (the Uniform Commercial Code governs these issues); (2) to explore current trends in the law affecting commercial transactions; (3) to develop further the student's legal reasoning processes; (4) to enhance the student's ability to identify legal issues from the business decision maker's and financial auditor's perspectives. Instructional methods will include lectures, readings, multimedia content, and class discussions. Student progress and mastery of the material will be evaluated through periodic examinations. Some state C.P.A. Boards require completion of this course as a prerequisite to obtaining certification as a public accountant. Completion of the course will be credited toward fulfillment of the requirements for the Legal Environment of Business Minor.", "prerequisite": "BLAW 341"}, {"course_name": "BLAW 445: Advanced Intellectual Property and Competition Law", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "Copyrights, trademarks, patents, and trade secrets followed by related topics in the regulation of competition.  B LAW 445 Intellectual Property & Competition Law (3) The objectives for this course are to (1) provide students with an understanding of U.S. and international law that supports the creation of beneficial information via intellectual property rights, allows government to regulate information property through antitrust and privacy statutes, and promotes business development by encouraging competitive uses of information; (2) teach students the ability to spot the legal issues arising from the above as future business leaders and (3) introduce students to the legal reasoning process necessary to address and avoid the legal dilemmas presented by such issues. Instructional methods for the course will include detailed lectures and classroom discussion of readings and other materials. The course builds on the introductory business law curriculum by providing an advanced and detailed study of specific areas of law that are highly valuable to modern, technology-driven businesses.", "prerequisite": "BLAW 441"}, {"course_name": "BLAW 446: Employment Law", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "Examines the legal and regulatory environment of employment relationships. Topics include anti-discrimination; worker health and safety; and labor relations laws.  B LAW 446 Employment Law (3) The course is designed for business students seeking a solid understanding of labor relations and employment law. It is not a general overview or introduction to law course for those seeking to enter law school. Labor and employment law has developed and changed over the past seven decades, and continues to evolve as the economic model and means of productions changes globally. With the passing of the National Labor Relations Act and subsequent amendments thereto, including development in the ability of public employees to engage in concerted activity, the understanding of the modifications in the employer-employee relationships is necessary for successful business executives and front-line managers. While a thorough understanding of the underpinnings of these laws is necessary, this is only a portion of the issues at hand. The ability to apply these laws in current working environments along with interpreting and critiquing these laws will assist in the preparation of future corporate managers. The course goes into detailed discussion regarding the employment at will doctrine, wrongful discharge, workplace torts, and employee privacy and monitoring. With this foundation, the course then covers civil rights and discrimination based on race, color, religion, gender, sexual orientation, family obligation, disability, and national origin are covered using Supreme Court cases that have tested the validity and soundness of our federal legislation. The closing part of the course focuses on organized labor through the process of unionizing and union membership, negotiations and economic pressure used to obtain concessions in collective agreements. Additionally, fair labor laws and occupational health and safety requirements to diminish workplace accidents and improve productivity is discussed. For each of the topics presented, detailed analysis of prominent cases will be discussed with the expectation that students can apply these case decisions to current employer/employee situations. Exposure to differing opinions, reversed rulings, and detailed legal processes will provide students with a broad understanding of the complex nature of legal proceedings and how these processes impact labor and employment relations in the United States. Content synthesis and critical analysis are the learning goals of the course.", "prerequisite": "BLAW 441"}, {"course_name": "BLAW 447: Entertainment Law", "department": "Business Law (BLAW)", "credits": "3 Credits", "description": "This course covers legal issues that arise in various entertainment industries through discussion of contemporary issues along with personality rights and intellectual property rights associated with entertainment assets. Issues will be covered within the context of business models, pervasive pop-culture influences affecting entrepreneurial activities, business transactions and contractual provisions unique to creative industries, commercialization of celebrity image, rights of privacy of public figures, defamation, related advanced copyright and trademark issues, ethics and fiduciary responsibilities, and other emerging topics. Students will be introduced to the legal reasoning process necessary to analyze these issues in context and compose creative solutions that both address and avoid the legal problems presented. Instructional methods for the course will include lecture and classroom discussion focused on readings and other materials. The course builds on the introductory business law curriculum by providing an advanced study of legal principles highly relevant to businesses that employ, promote, or monetize creative talent. Upon completion of the course, students should understand the legal concepts impacting the entertainment industry and the impact this has on talent, intellectual ownership, copyrights and trademarks.", "prerequisite": "BLAW 341"}, {"course_name": "BLAW 494: Research Project", "department": "Business Law (BLAW)", "credits": "1-12 Credits/Maximum of 999", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "BLAW 494H: Research Project", "department": "Business Law (BLAW)", "credits": "1-12 Credits/Maximum of 999", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "BLAW 496: Independent Studies", "department": "Business Law (BLAW)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "BLAW 497: Special Topics", "department": "Business Law (BLAW)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to exlore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BLAW 498: Special Topics", "department": "Business Law (BLAW)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BLAW 499: Foreign Studies", "department": "Business Law (BLAW)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]