[{"course_name": "BRASS 100: Trumpet: Secondary", "department": "Music-Brass (BRASS)", "credits": "1 Credits/Maximum of 8", "description": "Individual instruction in trumpet one-half hour per week. BRASS 100 Trumpet: Secondary (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the trumpet well in a variety of musical settings. The instrument is active in orchestral, band, jazz, chamber, and solo settings. Therefore, the basic goal for serious trumpet students as well as amateur trumpet students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-half hour lesson per week, presuming at least 5 hours of practice.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 101: French Horn: Secondary", "department": "Music-Brass (BRASS)", "credits": "1 Credits/Maximum of 8", "description": "Individual instruction in French horn one-half hour per week. For students who qualify. BRASS 101 French Horn: Secondary (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the French horn well in a variety of musical settings. The instrument is active in orchestral, band, chamber, and solo settings. Therefore, the basic goal for serious horn students as well as amateur horn students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-half hour lesson per week, assuming at least 5 hours of practice. Enrollment can range from 5-8 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 102: Trombone: Secondary", "department": "Music-Brass (BRASS)", "credits": "1 Credits/Maximum of 8", "description": "Individual instruction in trombone one-half hour per week. BRASS 102 Trombone: Secondary (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the trombone well in a variety of musical settings. The instrument is active in orchestral, band, jazz, chamber, and solo settings. Therefore, the basic goal for serious trombonists as well as amateur trombonists is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-half hour lesson per week, presuming at least 5 hours of practice. Enrollment can range from 10-15 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 103: Euphonium: Secondary", "department": "Music-Brass (BRASS)", "credits": "1 Credits/Maximum of 8", "description": "Individual instruction in euphonium/baritone one-half hour per week. BRASS 103 Euphonium: Secondary (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the euphonium well in a variety of musical settings. The instrument is active in orchestral, band, chamber, and solo settings. Therefore, the basic goal for serious euphonium students as well as amateur euphonium students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-half hour lesson per week, presuming at least 5 hours of practice. Enrollment can range from 12-15 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 104: Tuba: Secondary", "department": "Music-Brass (BRASS)", "credits": "1 Credits/Maximum of 8", "description": "Individual instruction in tuba one-half hour per week. BRASS 104 Tuba: Secondary (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the tuba well in a variety of musical settings. The instrument is active in orchestral, band, chamber, and solo settings. Therefore, the basic goal for serious tuba students as well as amateur tuba students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-half hour lesson per week, presuming at least 5 hours of practice per week. Enrollment can range from 8-1 0 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 110: Trumpet: Secondary", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 16", "description": "Individual instruction in trumpet one hour per week. BRASS 110 Trumpet: Secondary (2 per semester/maximum of 16) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the trumpet well in a variety of musical settings. The instrument is active in orchestral, band, jazz, chamber, and solo settings. Therefore, the basic goal for serious trumpet students as well as amateur trumpet students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-hour lesson per week, presuming at least 10 hours of practice.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 111: French Horn: Secondary", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 16", "description": "Individual instruction in French horn one hour per week. For students who qualify. BRASS 111 French Horn: Secondary (2 per semester/maximum of 16) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the horn well in a variety of musical settings. The instrument is active in orchestral, band, chamber, and solo settings. Therefore, the basic goal for serious horn students as well as amateur horn students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-hour lesson per week, presuming at least 10 hours of practice. Enrollment can range from 5-8 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 112: Trombone: Secondary", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 16", "description": "Individual instruction in trombone one hour per week. BRASS 112 Trombone: Secondary (2 per semester/maximum of 16) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the trombone well in a variety of musical settings. The instrument is active in orchestral, band, jazz, chamber, and solo settings. Therefore, the basic goal for serious trombonists as well as amateur trombonists is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-hour lesson per week, presuming at least 10 hours of practice. Enrollment can range from 10-15 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 113: Euphonium: Secondary", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 16", "description": "Individual instruction in euphonium/baritone one hour per week. BRASS 113 Euphonium: Secondary (2 per semester/maximum of 16) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and I skills required to play the euphonium well in a variety of musical settings. The instrument is active in orchestral, band, chamber, and solo settings. Therefore, goal for serious euphonium students as well as amateur euphonium students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-hour lesson per week, presuming at least 10 hours of practice. Enrollment can range from 12-15 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 114: Tuba: Secondary", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 16", "description": "Individual instruction in tuba one hour per week. BRASS 114 Tuba: Secondary (2 per semester/maximum of 16) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to introduce, define, and develop the musical and technical skills required to play the tuba well in a variety of musical settings. The instrument is active in orchestral, band, chamber, and solo settings. Therefore, the basic goal for serious tuba students as well as amateur tuba students is to be proficient and versatile. The repertoire studied includes a variety of musical genre including the use of technical etudes, lyrical studies and standard solo works in a variety of styles. This course directly affects the student's ability to participate and contribute in the various ensembles on campus. The teacher and the student evaluate the student's progress and performance. Suggestions for improvement are agreed upon and developed. The course is offered to both music majors and non-majors. Students receive a one-hour lesson per week, presuming at least 10 hours of practice. Enrollment can range from 8-10 per semester depending on the availability of staffing.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRASS 120: Trumpet: Primary I", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 121: French Horn: Primary I", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 121H: French Horn: Primary I", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 122: Trombone: Primary I", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 123: Euphonium: Primary I", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 124: Tuba: Primary I", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 130: Trumpet: Performance I", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 131: French Horn: Performance I", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in French horn one hour per week. For B.Mus. French horn performance majors."}, {"course_name": "BRASS 132: Trombone: Performance I", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 133: Euphonium: Performance I", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus. euphonium/baritone majors."}, {"course_name": "BRASS 134: Tuba: Performance I", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}, {"course_name": "BRASS 170: Trumpet: Primary II", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 171: French Horn: Primary II", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 172: Trombone: Primary II", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 173: Euphonium: Primary II", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 174: Tuba: Primary II", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 180: Trumpet: Performance II", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 181: French Horn: Performance II", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in French horn one hour per week. For B.Mus. French horn performance majors."}, {"course_name": "BRASS 182: Trombone: Performance II", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 183: Euphonium: Performance II", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus. euphonium/baritone majors."}, {"course_name": "BRASS 184: Tuba: Performance II", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}, {"course_name": "BRASS 220: Trumpet: Primary III", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 221: French Horn: Primary III", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 222: Trombone: Primary III", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 223: Euphonium: Primary III", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 224: Tuba: Primary III", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B. S. majors."}, {"course_name": "BRASS 230: Trumpet: Performance III", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 231: French Horn: Performance III", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in French horn one hour per week. For B.Mus. French horn performance majors."}, {"course_name": "BRASS 232: Trombone: Performance III", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 233: Euphonium: Performance III", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus. euphonium/baritone majors."}, {"course_name": "BRASS 234: Tuba: Performance III", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}, {"course_name": "BRASS 270: Trumpet: Primary IV", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 271: French Horn: Primary IV", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 272: Trombone: Primary IV", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 273: Euphonium: Primary IV", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 274: Tuba: Primary IV", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 280: Trumpet: Performance IV", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 281: French Horn: Performance IV", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in French Horn one hour per week. For B.Mus. French Horn performance majors."}, {"course_name": "BRASS 282: Trombone: Performance IV", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 283: Euphonium: Performance IV", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus euphonium/baritone majors."}, {"course_name": "BRASS 284: Tuba: Performance IV", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}, {"course_name": "BRASS 320: Trumpet: Primary V", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 321: French Horn: Primary V", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French Horn one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 322: Trombone: Primary V", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 323: Euphonium: Primary V", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 324: Tuba: Primary V", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 330: Trumpet: Performance V", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 331: French Horn: Performance V", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in French horn one hour per week. For B.Mus. French horn performance majors."}, {"course_name": "BRASS 332: Trombone: Performance V", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 333: Euphonium: Performance V", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus. euphonium/baritone majors."}, {"course_name": "BRASS 334: Tuba: Performance V", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}, {"course_name": "BRASS 370: Trumpet: Primary VI", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 371: French Horn: Primary VI", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 372: Trombone: Primary VI", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 373: Euphonium: Primary VI", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 374: Tuba: Primary VI", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 380: Trumpet: Performance VI", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 381: French Horn: Performance VI", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction of French horn one hour per week. For B.Mus. French horn performance majors."}, {"course_name": "BRASS 382: Trombone: Performance VI", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 383: Euphonium: Performance VI", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus. euphonium/baritone majors."}, {"course_name": "BRASS 384: Tuba: Performance VI", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}, {"course_name": "BRASS 420: Trumpet: Primary VII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 421: French Horn: Primary VII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 422: Trombone: Primary VII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 423: Euphonium: Primary VII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 424: Tuba: Primary VII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B.S. majors; other qualified students."}, {"course_name": "BRASS 430: Trumpet: Performance VII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 431: French Horn: Performance VII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in French horn one hour per week. For B.Mus. French horn performance majors."}, {"course_name": "BRASS 432: Trombone: Performance VII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 433: Euphonium: Performance VII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus. euphonium/baritone majors."}, {"course_name": "BRASS 434: Tuba: Performance VII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}, {"course_name": "BRASS 470: Trumpet: Primary VIII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trumpet one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 471: French Horn: Primary VIII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in French horn one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 472: Trombone: Primary VIII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in trombone one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 473: Euphonium: Primary VIII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in euphonium/baritone one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 474: Tuba: Primary VIII", "department": "Music-Brass (BRASS)", "credits": "2 Credits/Maximum of 2", "description": "Individual instruction in tuba one hour per week. For School of Music B.A. and B.S. majors."}, {"course_name": "BRASS 480: Trumpet: Performance VIII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trumpet one hour per week. For B.Mus. trumpet performance majors."}, {"course_name": "BRASS 481: French Horn: Performance VIII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in French horn one hour per week. For B.Mus. French horn performance majors."}, {"course_name": "BRASS 482: Trombone: Performance VIII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in trombone one hour per week. For B.Mus. trombone majors."}, {"course_name": "BRASS 483: Euphonium: Performance VIII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in euphonium/baritone one hour per week. For B.Mus. euphonium/baritone majors."}, {"course_name": "BRASS 484: Tuba: Performance VIII", "department": "Music-Brass (BRASS)", "credits": "3 Credits/Maximum of 3", "description": "Individual instruction in tuba one hour per week. For B.Mus. tuba majors."}]