[{"course_name": "CAP 100: Orientation to the Undergraduate Experience", "department": "First-Year Seminar (CAP)", "credits": "1 Credits", "description": "To facilitate transition of new students through active engagement and introduction to university and campus resources.  CAP 100s CAP 100S Orientation to the Undergraduate Experience (2)This course, CAP 100S, which is a one-credit course, completes the Penn State Capital College's first year seminar. The overarching goal of the FYS is to provide students with an introduction to Penn State culture and resources, information literacy and collaboration skills needed for academic success, as well as an introduction to majors and careers relevant to the discipline. These core elements of the FYS will aid students in the professional/academic community both inside and outside Penn State University. The instructor will place emphasis on having students work in collaborative groups on academically themed project(s) deemed relevant to the discipline.", "other": ["First-Year Seminar"]}, {"course_name": "CAP 110: First-Year Seminar for Capital College, The School of Behavioral Sciences  and Education", "department": "First-Year Seminar (CAP)", "credits": "1 Credits", "description": "Introduction to Penn State culture, information literacy and collaboration skills, and introduction to majors and careers relevant to the discipline.  CAP 110S CAP 110S First-Year Seminar for Capital College, The School of Behavioral Sciences and Education (1) This course is a one-credit course, completes Penn State Capital College's first-year seminar for The School of Behavioral Sciences and Education. The overarching goal of the FYS is to provide students with an introduction to Penn State culture and resources, information literacy, and collaboration skills needed for academic success, as well as an introduction to majors and careers relevant to the discipline. These core elements of the FYS will aid students in the professional/academic community both inside and outside Penn State. The instructor will place emphasis on having students work in collaborative groups on academically themed project(s) deemed relevant to the discipline.", "other": ["First-Year Seminar"]}, {"course_name": "CAP 120: First-Year Seminar for Business", "department": "First-Year Seminar (CAP)", "credits": "1 Credits", "description": "Introduction to Penn State culture, information literacy and collaboration skills, and introduction to majors and careers relevant to the discipline.  CAP 120S CAP 120S First-Year Seminar for Business (1) This course, which is a 1 credit course, completes the Penn State Capital College's first-year seminar for the School of Business Administration. The overarching goal of the FYS is to provide students with an introduction to Penn State culture and resources, information literacy and collaboration skills needed for academic success, as well as an introduction to majors and careers relevant to the discipline. These core elements of the FYS will aid students in the professional/academic community both inside and outside Penn State. The instructor will place emphasis on having student's work in collaborative groups on academically themed project(s) deemed relevant to the discipline.", "other": ["First-Year Seminar"]}, {"course_name": "CAP 140: First-Year Seminar for Humanities", "department": "First-Year Seminar (CAP)", "credits": "1 Credits", "description": "Introduction to the discipline including:  ethics, research methods, communications, career opportunities/issues and applied technology.", "other": ["First-Year Seminar"]}, {"course_name": "CAP 150: First-Year Seminar for Capital College, The School of Public Affairs", "department": "First-Year Seminar (CAP)", "credits": "1 Credits", "description": "Introduction to Penn State culture, information literacy and collaboration skills, and introduction to majors and careers relevant to the discipline.  CAP 150S CAP 150S First-Year Seminar for Capital College (1) This course, which is a 1 credit course, completes the Penn State Capital College's first-year seminar for the School of Public Affairs. The overarching goal of the FYS is to provide students with an introduction to Penn State culture and resources, information literacy and collaboration skills needed for academic success, as well as an introduction to majors and careers relevant to the discipline. These core elements of the FYS will aid students in the professional/academic community both inside and outside Penn State. The insturctor will place emphasis on having students work in collaborative groups on academically themed project(s) deemed relevant to the discipline.", "other": ["First-Year Seminar"]}, {"course_name": "CAP 160: First-Year Seminar for Capital College, The School of Science, Engineering and Technology", "department": "First-Year Seminar (CAP)", "credits": "1 Credits", "description": "Introduction to Penn State culture, information literacy and collaboration skills, and introduction to majors and careers relevant to the discipline.  Untitled DocumentCAP 160S First Year Seminar (1) This one-credit course, CAP 160S, is the Penn State Capital College's first year seminar for the School of Science, Engineering and Technology. The overarching goal of the FYS is to provide students with an introduction to Penn State culture and resources, information literacy and collaboration skills needed for academic success, as well as an introduction to majors and careers relevant to the discipline. These core elements of the FYS will aid students in the professional/academic community both inside and outside Penn State University. The instructor will place emphasis on having students work in collaborative groups on academically-themed project(s) deemed relevant to the discipline.", "other": ["First-Year Seminar"]}]