[{"course_name": "CED 102N: Wicked Problems Like Inequality, Sustainability & Climate Change: What's the Right Thing to Do?", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Many of the most pressing problems facing humankind, like inequality, sustainability & climate change, are known as Wicked Problems; they are complex with many interconnected components, are difficult to clarify or define, involve different stakeholders with very different views, and often are intertwined with other major problems. They require working within a social and ethical context because their resolution typically requires individual and institutional change, and they are relentless; Wicked Problems can't be solved \"once and for all.\" It is easy to feel overwhelmed by such problems, as if little can be done. Yet there are ways to work proactively and effectively on such problems, 'living your solutions locally.' This discussion-based interdomain course explores how people are addressing Wicked Problems, examining the 'Right Thing to Do' from several dimensions, including (1) what is ethically appropriate to do in response to a Wicked Problem (and how perspectives on this vary); and (2) the social and behavioral means people use to address such problems. In the course students explore the complex nature of Wicked Problems, including how these are shaped by social, political, and other factors. The rules matter. Students then learn major concepts of justice which commonly are applied to such issues, how these views vary across people affected by the problem, and the importance of recognizing other peoples' perspectives. Students use case studies to explore and critique strategies for engaging Wicked Problems, and how these are used by people working to address these issues. Finally, students work together in small learning teams to analyze a Wicked Problem of their choice, including how various stakeholders view the problem and its potential solutions, and how practitioners are addressing the problem through social and behavior means.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CED 152: Community Development Concepts and Practice", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Community development is broadly recognized as a process by which places (cities, small towns, neighborhoods) and the people in them, improve their economic and/or social well-being. Health of the environment and sustainable use of natural resources ensure the long-term well-being of human populations and so are central to sustainable community development. The practice of community development requires the ability to identify and understand the interrelationships of economy, society and environment locally, nationally and globally. Community development hinges on the capacity of local communities and residents to influence and determine their own futures. Students will gain an introduction to the concepts and models of community development and will become familiar with the roles of community development practitioners in developed and developing country settings. They will be able to identify the consequences of development strategies for social, economic and environmental well-being, focusing on the interrelationships of these aspects of development. Students will be introduced to strategies to identify capacity and resources available in communities and those that need to be enhanced. Models of decision-making will be introduced and students will work in teams in class with a focus on successful team functioning, identifying commonalities and shared interests to foster decision-making, and being able to extend that experience to working with groups in a community. Students will gain knowledge and understanding of the relevant concepts, processes and practice through readings and in-class lecture and discussion. Case studies of specific community development issues will give students the opportunity to apply the concepts and skills they learn in class, and to work in teams where students take on perspectives of different stakeholders and attempt to reach a resolution. Examples will be used throughout the course to portray important concepts. This knowledge and associated skills can be used to form the basis for further training and a career in community development or to provide a basic understanding for those interested in volunteering in their own community.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CED 155: Science, Technology and Public Policy", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "The overarching course objective is for students to understand the roles of science and technology in sustainable development, including public policy formation and implementation. The course consists of three parts. Part 1 is an introduction to how science has become such a powerful form of knowledge and how it informs public policy. The role of politics, skeptical scientists, media, and citizens on the science-policy interface are discussed as well. Part II deals in depth with theoretical concepts explaining the complex relationship between science, technology, and public policy. In part III we will discuss how researchers, policymakers and the 'public' can nevertheless work together to find solutions to actual sustainability problems. It is expected that after completing this course, students can critically review the factors which shape and constrain the use of science and policy in addressing pressing issues in their field of interest in an academic fashion.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CED 160: Introduction into Ethics and Issues in Agriculture", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This course covers ethics and the social contract to include substantive ethical theories focusing on rights-based ethical theories (libertarianism and egalitarian theories) and consequentialist theories (utilitarianism and axiology). These theories assist in conceptually defining levels of participation and consent in democracy. This course explores the circumstances in which rational persons and political groups historically agree to be bound in collective decision making. The primary focus by examines four separate ethical themes illustrating why and how individuals accept a variety of terms.The course highlights philosophical/ethical decisions related to agriculture issues during the history of the United States. Issues range from non-interference rights to opportunity rights dealing with food, fiber, natural resource and environmental issues. Procedural theory emphasizes the formation of legitimate and defensible rules rather than ethics. Policy choices are assumed to be legitimate and defensible as long as individuals follow the rules/procedures for decision making. The content of this course meshes the procedural and the substance theories found throughout historical debates in agriculture communities. The course identifies traditional agrarian problem identification, policy formation, policy adoption and funding, program implementation and program evaluation.How ethics figures historically in agriculture policy processes is applied in a variety of case studies and debates as well as selected readings. The course includes an examination of the ethics of when, how and where the policy process historically influenced agriculture public policies. The course emphasizes the need to critically think about various points of view expressed by various conflicting authors.", "other": ["Cross-listed with: AG 160", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CED 199: Foreign Studies", "department": "Community Environment and Development (CED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CED 201: Introductory Environmental and Resource Economics", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Apply principles of economics to analyze environmental protection policies and natural resource use decision. Examine contemporary policy issues.  E RRE (AG EC) 201 Introductory Environmental and Resource Economics (3) An introduction to the concepts, theories, and applied methods used in the economic analysis of environment and natural resource issues. The course covers topics such as the principles of market efficiency, why the market often fails where environmental and natural resource issues are concerned, and environmental policy prescriptions and tools designed to correct this market failure. These principles and tools are explored with respect to air and water pollution, management and use of renewable natural resources such as forests and fisheries, and the unique problems of managing nonrenewable resources such as minerals and oil. The course aims to give students an understanding of how traditional economic principles can be used to suggest and evaluate possible responses to the environmental and resource problems facing society."}, {"course_name": "CED 230: Development Issues in the Global Context", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Local communities - in both developed and developing countries -- are influenced by strong global forces that affect the well-being of their residents. Community economic development is one approach to enhance improve economic outcomes. This course will use an issue-oriented approach to help students understand economic development patterns and resultant issues in the U.S. as compared to what is observed and what is of critical concern in other places. Topics will include the concept of globalization, economic restructuring trends, investment in human capital and the ability to retain this often mobile form of capital, migration and change in patterns of migration, and environmental effects of development in different contexts. Each year that the course is taught, there will be a focus on patterns of economic development by region in the U.S. but with comparisons to three other selected countries -- one in Latin America, one in Asia and one in Africa. Students will be encouraged to compare and contrast economic and related social issues that arise in these contexts, with particular emphasis given to recent economic trends and events and to the rate of change compared to the past.", "prerequisite": "ECON 102"}, {"course_name": "CED 252: Anti-Racist Theory and Practice in Community Work", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "The career path for many students in the CED program will position them to work in neighborhoods and communities where people come from a diversity of backgrounds, often different from the students¿ own background. Without proper training in histories of racism and marginalization as well as how those practices continue today, students are likely to perpetuate those harms within the communities they intend to serve. This course addresses issues of race, racism, and privilege, helping students develop a critical lens on community development through exploring questions such as \"who is developed and by whom?\":, \"who has decision making power in the community development world?\" and \"what does sustainability mean, and whose experience or knowledge counts in working to build more sustainable futures?'' The broad theme of social justice is explored by critically analyzing current trends and ethical issues and their implications. Additional focus is directed towards how structural and institutional conditions affect the opportunities and well-being of different populations (advantaged and disadvantaged groups) in society. While this course is primarily focused on the US context, there is also discussion of international issues, especially how race and racism impact media coverage and societal responses to world events impacting different groups. Students will have the opportunity to learn about and engage with community development issues related to race, racism, oppression, and privilege in State College and/or in their home communities through different course assignments. After taking this course, students should feel better equipped to deploy an equity lens in their educational and community-based experiences and practices. The learning objectives and themes of this course are reinforced throughout upper level CED courses so students are able to carry this knowledge and skills into their future professional lives."}, {"course_name": "CED 275: Community, Environment and Development Professional Seminar", "department": "Community Environment and Development (CED)", "credits": "1 Credits", "description": "The CED Professional Seminar helps students learn how to be successful in the CED major and in their future professional careers. The emphasis is on career opportunities, important skills to learn and hone, and tailoring the major to fit their future professional interests. The course operates similar to a lab, with most work done in the classroom. It includes frequent interaction with CED professionals from a variety of organizations and topical areas, and hands-on skill training in facilitation and community-process techniques."}, {"course_name": "CED 297: Special Topics", "department": "Community Environment and Development (CED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "CED 299: Foreign Studies", "department": "Community Environment and Development (CED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CED 309: Land Economics and Policy", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Land is a key natural resource for society. This course uses economic analysis to examine land use and land use policy, considering how the spatial configuration of landscapes changes in response to changes in land prices, population growth, human preferences, the environment, markets, and institutions. Given current issues including the twin problems of urban sprawl and land abandonment, the course will also examine the role of land use policy and specific programs to guide and provide greater public control over land use decisions, taking into consideration environmental practicality, economic feasibility, and institutional acceptability. Students will gain an appreciation of the importance of land as a resource, and how to use economic tools to understand current land use issues. Knowledge will be gained of the relevant theories, trends and policies through readings and in-class lecture and discussion.", "prerequisite": "ECON 102"}, {"course_name": "CED 327: Environment and Society", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Environmental and natural resource problems are not only biophysical in nature but intersect with social, political, economic, belief, value, and knowledge systems. The goals of this course are to introduce students to sociological questions that address the sources and implications of environmental and natural resource problems. The course focuses on the ways that social and environmental systems intersect, and how they are mutually constitutive. The course introduces students to the societal systems that create and exacerbate environmental problems (such as market processes, consumption patterns, political institutions) and how people respond to these problems (environmental concern and beliefs, individual and organizational behavior, social movements, green markets, political change). After taking this course, students should be better prepared to identify core systemic causes and potential pathways to address complex environmental and natural resource problems from local to global scales.", "prerequisite": "RSOC 11"}, {"course_name": "CED 329H: Intermediate Environmental & Resource Economics (Honors)", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This Honors course focuses on intermediate principles of environmental and natural resource economics, with strong emphasis on policy analysis and applications. The central focus in any economics course is how best to allocate scarce resources and this holds true for this course as well. However, in this course the goods and services we will talk about differ from those in other economics courses in that there is typically no market in which to trade them - e.g., air and water quality or a scenic view. Thus, it may be the case that government policies are needed to maintain and enhance their quantity and/or quality. The course is structured around a number of broad thematic areas with individual book chapters, papers, class discussions, and assignments used to learn the material. The first two parts provide a review of micro and environmental economic theory, and an overview of how economists think about environmental issues. The third section focuses on benefit-cost analysis and valuation issues, and the fourth section looks at government intervention and policy. The final section(s) focus on specific topics in environmental and natural resource economics and related policy issues with the general goal being to provide students a better understanding of current issues related to the environment.", "prerequisite": "MATH 110", "other": ["Honors"]}, {"course_name": "CED 360: The Corporation and Social Responsibility", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "The corporation has emerged as perhaps the most powerful institution in the world in the 21st Century. A recent estimate listed 31 nations and 69 corporations among the 100 largest economies in the world. These circumstances lead reasonable people to ask how corporations can be held accountable when many of them command more resources and are nimbler than most of the world's governments. This course explores the historical and legal dimensions of the corporation and its contemporary social, environmental, and economic impacts and responsibilities. It further considers the internal and external factors that shape corporate decisions on social responsibility. The internal dimensions that will be discussed in the course include decisions made by top management, relationships between labor and management, and the capacity for lower management and laborers to influence company policies and practices. The external influences will include labor and community organizing, shareholder activism, government regulations, consumer activism, and various government entities to shape corporate policies and practices.", "prerequisite": "6 credits of CED coursework"}, {"course_name": "CED 375: Community, Local Knowledge, and Democracy", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Understanding community decision-making, citizen-expert interactions and methods for resolving seemingly intractable conflicts associated with public issues.  CED 375H Community, Local Knowledge, and Democracy (3) Decisions made in our communities have far reaching effects on individuals, families, neighborhoods, the local economy, the environment, the health and welfare of all citizens, and the community as a whole. These decisions or choices are the result of the collective action of community leaders and citizens, either through governmental, non-governmental, or community organizations. This course will familiarize students with principles, concepts and skills essential to understanding processes of community decision making and community development. These processes involve countless human interactions, which ultimately lead to choices that affect the future economic, environmental, political, and social viability of citizens, their families, and the sustainability of their communities. These interactions are central to community decision making and community development, and to the functioning of local democracy. The nature of these interactions and the way in which they take place determine if desired community outcomes occur or not. This course seeks to reveal important, sometimes neglected or underdeveloped, factors in community decision making, specifically issue framing, tensions between local and expert knowledge, methods for resolving seemingly intractable conflicts associated with public issues, and the nature and role of participatory processes in debate, deliberation, and doing public work. This course will enable students to use these factors for analyzing community decision making situations and as community development tools in professional practice. In addition, students will be challenged to examine ethical issues in community decision making and community development professional practice.", "prerequisite": "Prerequisite or concurrent: CED  152", "other": ["Honors"]}, {"course_name": "CED 399: Foreign Studies", "department": "Community Environment and Development (CED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CED 400N: Exploring Indigenous Ways of Knowing in Great Lakes Region: Lecture", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Exploring Indigenous Ways of Knowing in the Great Lakes Region explores concepts and values distinctive to indigenous ways of knowing (IK) in the Great Lakes Region through readings, video segments, and lectures. Five structural concepts or key themes - local knowledge, relational knowledge, empirical knowledge, spiritual knowledge, and traditional knowledge - provide a conceptual framework for understanding indigenous cultures and knowledge production and their unique contributions to western society in the 21st century. Students will be introduced to the Algonquian cultures of the Great Lakes Region and to the Ojibwe (Anishinaabeg), Odawa, and Potawatomi (Three Fires) cultures in particular. This course will introduce students to the distinctive ways indigenous people experience, understand, and know the world through their relationship with the land or region to which they belong. Too often, colonizers around the world have ignored indigenous knowledge systems even though these ways of knowing have sustained peoples, cultures, and environments for thousands of generations. Because these ways of knowing are generally preserved and transmitted through stories, music, ceremony, and embodied traditions, they are seldom understood and frequently dismissed by those who control the production of knowledge in the modern world. The knowledge of the indigenous peoples of the Great Lakes region will, in this course, be presented as an empirically grounded scientific body of knowledge and theory comparable and complementary to the European tradition and, in specific ways, enhancing the sustainability of western scientific knowledge and practice. This course is a prerequisite for the Maymester field experience - Exploring Indigenous Ways of Knowing among the Ojibwe CED 401 which offers students an opportunity to experience indigenous ways of knowing by engaging with Ojibwe educators, traditional knowledge holders, elders, and families in several of the three largest Ojibwe reservations in the US.", "prerequisite": "RSOC 11", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CED 401: Exploring Indigenous Ways of Knowing Among the Ojibwe", "department": "Community Environment and Development (CED)", "credits": "0.5 Credits", "description": "Through an intensive cultural engagement students will learn skills important to the pursuit of ethnographic research in cross-cultural contexts.  CED 401 Exploring Indigenous Ways of Knowing Among the Ojibwe (0.5) (US) Exploring Indigenous Ways of Knowing among the Ojibwe- CED 400B, a 2-3 week field experience, transports students from the classroom to the Red Lake, Leech Lake, and White Earth Nations in northern Minnesota. During travel, students will follow part of the 800 year Great Migration route of the Ojibwe from their ancestral home around the St. Lawrence River estuary to western Lake Superior and the headwaters of the Mississippi River. This field experience will immerse students in the Anishinaabeg community, the largest of the \"three fires\" (Ojibwe, Odawa, Potawatomi) of the Great Lakes region. While most Americans learn history facing west, history will be presented through the experiences and memories of people facing east. Early Ojibwe history will be outlined while the period of contact, colonization, and restoration (late 1700 to the present) will be covered in greater detail. Ojibwe cultural codes and spiritual values will be explored through \"the teachings\" and participation in important ceremonies (sweat lodge, pipe, big drum, wiping the tears, shake tent, intertribal traditional powwow). The political and social injustices of colonialism will be examined, including removal, allotment, religious oppression, and the boarding school era. To experience family and social life, students will live for two days with Ojibwe host families on the Red Lake Nation (one of 2 closed reservations in the US). Students will be introduced to indigenous science and environmental justice (climate change, water quality, biodiversity and endangered species, traditional and sustainable agriculture, fish and game, wild edible and medicinal plants, forest management, etc.). Finally, a canoe trip through the headwaters of the Mississippi River will focus on nature and environmental health. The five key IK themes explored in the classroom -Local knowledge, relational knowledge, empirical knowledge, spiritual knowledge, and traditional knowledge will provide a framework for engaging with and understanding Ojibwe culture and knowledge production and their unique contributions to western science and American culture. Students will meet and learn from more than 25 prominent Ojibwe elders, educators, scientists, political leaders, medicine men/women, environmentalists, ethnobotanists, storytellers, and host family members. Students will also learn listening, observing, attending, respecting, critical thinking, and recording skills, all important to the study of cultures and the pursuit of ethnological research in cross cultural contexts. Exploring Indigenous Ways of Knowing among the Ojibwe-CED 400A, offered during spring semester, is a prerequisite for this field experience.", "prerequisite": "CED  400A or comparable course", "other": ["United States Cultures (US)"]}, {"course_name": "CED 404: Community, Environment and Development Research Methods", "department": "Community Environment and Development (CED)", "credits": "4 Credits", "description": "CED 404 teaches students practical approaches to empirical research in the areas of community, environment, and development (CED). Through classroom work and the data lab, the course covers research tools commonly used by CED professionals at the local level, including secondary data analysis, surveys, focus groups, and participatory research. As importantly, students learn and practice the basic mindset required for developing and exploring research questions. Students discuss and practice appropriate methods for presenting research results, including writing for different genres. The course includes a weekly data lab for hands-on work.", "prerequisite": "STAT 200"}, {"course_name": "CED 409: Land Use Planning and Procedure", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This course provides students with an understanding of the legal and procedural aspects of land use planning as found in the United States. The emphasis of the course is to explain the sources of land use planning authority, the processes by which it is applied and the potential conflicts that arise in the application of this authority. As a result of taking this course, students will be expected to learn and explain a) the objectives of land use planning systems and a comparative analysis of these systems; b) the bases on which land use planning law and procedure is applied across the U.S.; c) policies, strategies and principles that can be applied to land use planning decisions; d) several land use planning models currently applied in American jurisdictions, including the structure of each land use planning system; e) the procedural steps used to engage the land use planning system by property owners and government officials; f) typical conflicts that arise in creating, changing or enforcing land use planning measures; g) how land use planning conflict is resolved in various systems.Student performance will be measured in two midterm exams and a final exam. The instructor reserves the right to give additional exams to aid in measuring student knowledge and understanding of course material. Each test will primarily be short essays questions that ask for an explanation, discussion, comparison or application of specific concepts and principles. Case studies also will be used to present students with situations to hone their analytical, organizational and problem solving skills on specific problem situations. This will ask students to analyze a given set of facts, assess the issues raised by the facts from the perspectives of individuals who are described in the situation and form and present a response that addresses a specific question posed to the student.", "prerequisite": "6 credits of CED"}, {"course_name": "CED 410: The Global Seminar", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Exploration of critical global issues relevant to sustainable development and the environment. Collaborative with other universities worldwide.  CED 410 The Global Seminar (3) The Global Seminar course will help students gain an understanding of the implications of global change in a world of limited natural resources. The course will help students to understand the difficulties that society faces in balancing the environment with human needs; appreciate the challenge of balancing competing needs at different levels (individuals, communities, organizations, governments); understand trade-offs and the role of policy; and explore and critically assess avenues for effectively dealing with global issues. Students participating in the Global Seminar have the opportunity of direct interaction with students from other universities and academic institutions who may have different perspectives on these issues. To allow this interaction, the Global Seminar is offered jointly with other universities from across the world, with students engaging in global videoconferences, virtual classroom discussions and group work with student peers at other universities. Case studies are used, with critical assessment of important global issues related to development and environment, with a particular focus on food production and natural resources. Specific cases vary by course offering but may include cases related to: population dynamics, biodiversity, water quality, waste management, GMOs, BSE, organic food production, novel protein foods, among others. Issues of long-term sustainability are explored to gain a better understanding of the implications of alternative choices. The course is offered in collaboration with Cornell University, with students using Cornell's Blackboard system. The course is intended to strengthen linkages for students with other universities for study and research."}, {"course_name": "CED 417: Power, Conflict, and Community Decision Making", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Community decision making and public choice is the result of collective action among individuals. The purpose of this course is to develop frameworks for analyzing conflict, power, and public choice. This course enables students to understand how culture and institutions affect the nature of human interdependence and behavior, shape patterns of influence and power, and impact community decision making and policy.", "prerequisite": "RSOC 11"}, {"course_name": "CED 420W: Gender and International Development", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This course examines gendered processes of economic and social change in the Global South in a context of rapid globalization. We will study how gender inequities and inequalities shape and are shaped by economic restructuring, environmental change, international migration, the global spread of ideas and culture, and the shifting goals of International Development agencies. Readings and discussions are organized around three main learning units: 1) Approaches to Gender in Development; 2) Gender, Work, and Identity in the Global Economy; and 3) Rights, Reproduction and the Body. Particular attention will be paid to representations of women and men by Western organizations acting in the name of Feminism and/or Development, and to the responses of feminist communities in the South to these portrayals. In studying these issues, we will resist the tendency to conflate \"gender\" with \"women\", instead looking comprehensively at the identities, rights, and lived experiences of diverse gendered identities. We will carefully consider differences using an intersectional frame that considers social factors such as sexuality, race, economic class, and legal status. Students will explore issues through diverse materials including reports, articles, book chapters, documentaries, presentations, and popular media.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: WMNST 420W", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "CED 425: International Community and Economic Development", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "International community and economic development.  CED 425 International Community and Economic Development (3) Eight of ten people on the planet live in developing countries where problems such as hunger, malnutrition, infant morality, inadequate housing, underemployment, over-urbanization, and environmental degradation often are severe. This class will focus on community and economic development in developing countries. Through lectures, readings, a series of topical videos, and in-depth class discussions, students will obtain a firm grounding in the ways development has been defined, the social and economic problems facing developing countries today, the basic ways in which economic development has been approached theoretically and empirically, the implications for developing countries of being embedded in a globalizing economy, the influence of multinational corporations, the policies that developing countries have followed to foster economic growth, the nature of foreign aid, the causes and consequences of Third World debt, the promise of micro-enterprise and the informal economy, rural development and land reform, and other topics.", "prerequisite": "CED  152 and CED  230"}, {"course_name": "CED 429: Natural Resource Economics", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Optimal management of resources; roles of markets and other institutions; resources and economic development; public policy.", "prerequisite": "ECON 302"}, {"course_name": "CED 430W: Principles of Community Economic Development", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This course is designed to introduce the issues giving rise to concern for rural and regional economies, and the theories, concepts and tools of rural and regional economic development. The goal is to integrate theory and practice and apply them to economic development problems. Tools are presented in a \"how to\" manner. Topics include what is meant by 'Economic Development' and how perspectives on it vary; national and state policies on economic development; economic development theory, including Economic Base, Product Cycle, Central Place Theory, and Attraction Models, and their implications; basic analytical tools for community economic development, including Location Quotients, Shift Share, and Input-Output analysis; business retention, expansion, and location; and economic development strategies, such as entrepreneurship, business development, locality development, and human resources. As a writing-intensive course, strong emphasis is placed on using the written word to apply these concepts and tools to real world situations, with most homework assignments modeled on the types of analysis and reports conducted by economic development practitioners.", "prerequisite": "(ENGL 15 or ENGL 30 or ENGL 137H or CAS 137H ) and 6 credits of CED", "other": ["Writing Across the Curriculum"]}, {"course_name": "CED 431W: Economic Analysis of Environmental and Resource Policies", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "In this course students learn economic analysis methods for understanding environmental and natural resource issues, and for analyzing environmental and natural resource policies. Methods considered include benefit-cost analysis, non-market valuation techniques, and resource damage assessments. As a writing-intensive course, students learn and practice professional-style writing appropriate for economic analysis, project findings, and policy papers. Homework assignments include a blend of analysis and written reports explaining findings.", "prerequisite": "ENGL 15", "other": ["Writing Across the Curriculum"]}, {"course_name": "CED 440: Labor in the Global Economy", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This course examines laborers in the global economy and the economic, political, and social forces that shape worker experiences of precarity and empowerment. We will study the global division of labor, experiences of work, and how workers claim rights. The course is divided into three main learning units. In Unit 1, Theorizing Labor in the Global Economy, we will discuss how the changing global political economy, including the consolidation of corporate power in global commodity chains, enables regimes of precarious work. In Unit 2, Vulnerable Workers, we will examine specific groups in different context across the globe and their experiences of both exploitation and empowerment in the workplace, including child workers, migrant workers, women, and agricultural workers. In Unit 3, Resistances and Solutions, we will examine and compare different proposed solutions to worker vulnerability, including 'top-down' initiatives such as corporate social responsibility campaigns and voluntary sustainability standards, and 'bottom-up' approaches such as workers' centers and worker-led social responsibility. Invited guest speakers who represent and work with workers around the world will provide their perspectives on key topics to enhance student learning of contemporary events in this field. Students will have the opportunity to deepen their knowledge through writing assignments including case studies of workers and worker movements, a blog connecting concepts learned in class to news stories from around the work about labor, and take-home essays. This is a discussion-based course and students are expected to contribute actively to the learning community. Many examples discussed in class will be from companies in the agri-food system.", "prerequisite": "6 credits of CED coursework"}, {"course_name": "CED 442: Changing Food Systems: Comparative Perspectives", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "The course begins with an overview of the scope of food systems and an orientation to interdisciplinary and community - based approaches for understanding and addressing social and ecological problems and potential changes in food systems. Two weeks are dedicated to reviewing selected challenges facing the food and agricultural system to underscore the complexity of these issues and illustrate how they have been approached and analyzed by different disciplinary fields. The next two weeks of the course are devoted to critical exploration of theoretical and policy models for understanding how food systems function and change. These conceptual and analytical tools are then applied in three subsequent course modules, focused on 1) Changing Agricultural Production Systems; 2) Changing Food and Farm Work; and 3) Changing Food Consumers and Eaters. Each of these three - week modules will focus on 3 - 4 cases of change efforts either led from \"above\" through government policies or business initiatives or from \"below\" by grassroots groups or social movements. Cases will be selected to compare and contrast U.S. contexts with other international contexts and to highlight the diverse experiences and perspectives across racial - ethnic, class, cultural and gender differences within the food and agricultural system. The course will conclude by synthesizing ideas and insights about the limitations and potentials of different approaches to food systems change. In the last week of class, students will also give \"lightning talks\" distilling their learning about food systems change through an individual semester long field - project with a local or regional community group, business, agency or farm.", "prerequisite": "AG BM 170", "other": ["Cross-listed with: FDSYS 442"]}, {"course_name": "CED 445: International Development Practice", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "The goal of this 400-level course is to facilitate students' development of the hands-on skills and practical knowledge needed to engage successfully in international development work in the public, private, and non-governmental sectors. The course emphasizes competencies needed to effectively secure employment and work in occupations and sub-fields of international development that are most related to the CED major. It is organized into a series of modules that correspond to the major phases of international development projects - design, implementation, and evaluation. Students will integrate these phases by working through a \"case study\" of a specific development project for each semester. The course includes guest lecturers and budget requests accordingly who are currently working in the international development sector.", "prerequisite": "CED 230"}, {"course_name": "CED 450: International Development, Renewable Resources, and the Environment", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Theories of agricultural and economic development, with particular attention to interactions between development, renewable resources, and the environment.  CED 450 International Development, Renewable Resources, and the Environment (3) (IL) This course introduces the key economic concepts and theories used to analyze agricultural and economic development in developing countries, with particular attention to interactions between development, natural resources, and the environment. The course examines how economic development can affect natural resources and the environment, and how resource and environmental conditions affect development. The course integrates theory with empirical evidence from developing countries, so that students gain an understanding of how different development strategies have actually fared in practice.", "prerequisite": "6 credits in Environmental Economics, Resource Economics or   Economics", "other": ["International Cultures (IL)"]}, {"course_name": "CED 452: Community Organization", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This course combines an introduction to the social theories of communities with real-life examples of applications to understanding community problems and concerns. The focus is on the circumstances facing the range of places from small towns and rural communities to urban neighborhoods and suburbs. Topics covered include local community in a global economy, power and decision-making, the role of governments and other social institutions, community development and sustainability, and the importance of social as well as economic and physical infrastructure. Those taking the class will gain experience in conducting a case study of a Pennsylvania community, build skills in working in a team, and gain understanding of the complexity of factors that influence community and individual well-being. If your future career involves working within a community setting, this course can give you insights into its dynamics. And, even if you don't plan on working with communities in your job, you will still be living in a community. This course can help you to understand the ways that you can contribute to improving your own quality of life by becoming involved in your community.", "prerequisite": "6 credits in RSOC or SOC or PSYCH"}, {"course_name": "CED 460W: Policy, Politics and Perspectives on Social & Environmental Responsibility", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "Social and environmental responsibility often is viewed very differently by various stakeholders, such as consumers, investors, businesses, labor government, and others. The elements and issues they consider as important elements within social and environmental justice, and how they weight each element, can vary significantly across stakeholders. The terminology used to describe this work similarly differs (i.e. sustainability, social responsibility, corporate citizenship, corporate social responsibility, etc.), which can lead to misunderstandings.  This course examines the differing perspectives that consumers, investors, businesses, labor, government, and others have towards social and environmental responsibility, and the differing roles that each stakeholder plays. Such roles can range from individual choices about what to purchase and consume, where to invest, and where to work, to collective and organizational choices, such as about what services or products to offer, how these are produced, and where/how supplies are obtained. The course uses institutional and behavioral economic concepts of the interdependent nature of the market, as a theoretical framework for understanding the interdependence of various stakeholders' opportunities and decisions, and the influence of the public policy.", "prerequisite": "6 credits of CED coursework", "other": ["Writing Across the Curriculum"]}, {"course_name": "CED 462: Corporate Social and Environmental Performance", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "This seminar-style course uses speakers from a range of stakeholder groups to highlight and discuss the performance of Corporate Social Responsibility (CSR) programs in industry. The influence of government, non-profits and selected activist's groups on CSR programs will be evaluated. Recognized speakers will discuss social and environmental issues in the supply chain related to land use, farm workers, farmers, women in agriculture, youth development, climate change, food security and water rights. Speakers from industry will highlight industry topics such as corporate governance, ethics, employee engagement and public policy. Students will write weekly reviews for each topic for discussion in class. They will complete two case studies over the course of the semester to better understand how CSR goals are accomplished in industry. To determine company performance, students will work in teams to evaluate the CSR program of a company and rank their performance relative to peers.", "prerequisite": "6 credits of AGBM or CED coursework"}, {"course_name": "CED 470: Participatory Research Methods", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "People generally describe sustainability as an ideal that encompasses three spheres: environmental, economic, and social. Often, however, the social component receives the least amount of attention. Many projects lauded for their sustainability benefit only a privileged few. Alternately, the framework of just sustainability places issues of equity and social justice at the center of the discussion. It requires that we ask, first and foremost, who wins, who loses, and who decides. As community development (CD) scholars and practitioners, we are in a position to integrate these questions-and a vision of just sustainability-into our work. Central to this task is working in partnership with community members to identify problems, to ask questions, and to develop solutions. All community change efforts need good information, and good information comes from research. This course introduces students to participatory research methods, placing special emphasis on research ethics, the positionality of the researcher, and embedding research within CD practice. We will focus on research design within the context of a community project, data collection, data analysis, and the dissemination of results. We will cover various approaches to measuring community phenomena, including basic interview techniques, focus groups, observation, surveys, participatory mapping, and other qualitative analytical methods", "prerequisite": "CED 230"}, {"course_name": "CED 475: CED Integrated Capstone Experience", "department": "Community Environment and Development (CED)", "credits": "3 Credits", "description": "A well-designed capstone experience provides students with a valuable reflective and integrative experience as they complete their baccalaureate degree programs. This course is designed to encourage students to reflect, integrate and apply the knowledge that they have learned in previous coursework for the CED major. The course is built on discussion and exercises that require integration. Like the CED program more generally, this course relies on case studies to help students apply the skills that they have learned to actual cases that challenge communities and regions in developed and developing areas of the world. The CED program is also designed to include experiential-learning exercises throughout the program; this course engages students in a significant in-depth experience or project that will vary year-by-year. The experience could be in the United States or in another country. The project will be hands-on and action-oriented. Evaluation is based on assessment of active participation in class discussions, papers that provide critical assessments of the case studies assigned to the class, and a final project conducted in the field, either in the U.S. or internationally.", "prerequisite": "7th semester standing or (18 credits of CED and 6th semester standing)"}, {"course_name": "CED 494: Undergraduate Research", "department": "Community Environment and Development (CED)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group bsis."}, {"course_name": "CED 494H: CED Honors Research Project", "department": "Community Environment and Development (CED)", "credits": "1-12 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "CED 495A: Internship in Community, Environment, and Development", "department": "Community Environment and Development (CED)", "credits": "1-15 Credits/Maximum of 15", "description": "Supervised field experience in an environmental setting.", "prerequisite": "prior approval of program", "other": ["Full-Time Equivalent Course"]}, {"course_name": "CED 496: Independent Studies", "department": "Community Environment and Development (CED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "CED 497: Special Topics", "department": "Community Environment and Development (CED)", "credits": "1-18 Credits/Maximum of 18", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "CED 499: Foreign Studies", "department": "Community Environment and Development (CED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]