[{"course_name": "CEDEV 430: Principles of Local Economic Development", "department": "Community and Economic Development (CEDEV)", "credits": "3 Credits", "description": "Concepts, strategies, and techniques of local economic analysis, planning, and development; case studies and decision-making exercises.  CEDEV 430 CEDEV (AG EC) 430 Principles of Economic Development Planning (3)This course is designed to introduce the issues giving rise to concern for rural and regional economies, and the theories, concepts and tools of rural and regional economic development. The goal is to integrate theory and practice and apply them to economic development problems. Tools are presented in a \"how to\" manner. Topics include current issues in rural economies, the economic view of rural development; business retention, expansion and location; entrepreneurship and its role in the economy; understanding the local economic structure and the forces of chance; introduction to economic growth theories; export base theory and economic base analysis; the role of labor and capital in development; techniques of market area, central place, shift-share and input-output analysis; policies of local economic development and growth.", "prerequisite": "introductory course in economics"}, {"course_name": "CEDEV 452: Community Structure, Processes and Capacity", "department": "Community and Economic Development (CEDEV)", "credits": "3 Credits", "description": "Social organization, processes and change in communities; use of sociological principles in analysis of community problems and development.  CEDEV 452 CEDEV (R SOC) 452 Rural Organization (3)This course combines an introduction to the social theories of communities with real-life examples of applications to understanding community problems and concerns. The focus is on the special circumstances facing small towns and rural communities, but the concepts are applicable in all communities, from urban neighborhoods to suburbs. Topics covered include local community in a global economy, power and decision-making, the role of governments and other social institutions, development of community and the importance of building social infrastructure as well as economic and physical infrastructure, multi community collaboration and building sustainable communities. Those taking the class will gain experience in conducting a case study of a small Pennsylvania community, build skills in working in a team, and gain understanding of the complexity of factors that influence community (and your own) well-being. If your future career involves operating within a community setting this course can increase your knowledge of that setting and how to function within it. And, even if you don't plan on working with communities in your job, you will be living in a community. This course can help you to understand the ways that you can contribute to improving your own quality of life by becoming involved in your community. Grades in this class are based on the community case study report, take-home mid-term and final exams, short team exercises, and class participation. Graduate students taking the course also are required to write reaction papers to three different topics during the semester.", "prerequisite": "6 credits in rural sociology, sociology, or psychology"}]