[{"course_name": "CET 308: Construction Methods and Materials", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "The study of the methods and materials used in the construction industry.", "prerequisite": "EDSGN 100"}, {"course_name": "CET 342: Civil Engineering Materials - Concrete and Bituminous", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "Properties and tests for aggregates, portland cement, fresh and hardened concrete, concrete mix designs. Bituminous Materials: properties, mixtures and tests.", "prerequisite": "MATH 022 , MATH 026"}, {"course_name": "CET 343: Soils Mechanics", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "This course presents the fundamentals of engineering soil mechanics related to civil engineering.  CET 343 Soil Mechanics (3) This course presents the fundamentals of engineering soil mechanics related to civil engineering. The course provides the initial exposure to soil mechanics, presenting the fundamentals essential to further study in foundation engineering and other advanced courses. The course begins with coverage of how soil properties influence the different types of structures or facilities built by structural and construction engineers. Students study the formation of natural soil deposits by the geological and biological events in the earth's history. The soil sampling procedures are briefly explained, and then various index properties of soils are determined, and utilized in engineering classifications of soils. Options available for compacting soils in the lab and field are studied. The laboratory tests for finding soil permeability are studied, followed by coverage of empirical equations for estimating the permeability. Simple cases of seepage are analyzed using graphical flow net method. Elastic half-space theories and approximate methods are used for estimating the stress distribution in soils. The concepts of pore water pressure and effective stress are introduced. The covered strength theories include the unconsolidated undrained shear strength parameters. Elastic compression and consolidation compression are covered in this course. The course ends with simple field soil investigation procedures.", "prerequisite": "MATH 140"}, {"course_name": "CET 361: Fluid Flow", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "Fluid flow theory; hydrostatics; dimensional analysis and similitude; pipe flow; flow measurement; open channels; flow forces; fluid machinery.", "prerequisite": "MATH 140"}, {"course_name": "CET 430: Structural Analysis", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "Analysis of determinate structures; use of influence lines; deflection of structures; classical methods of analysis of statically indeterminate structures.", "prerequisite": "MATH 140"}, {"course_name": "CET 431: Structural Design-Steel", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "Design of steel beams, columns, truss members, decks, bar joists and selected connections.", "prerequisite": "MATH 140"}, {"course_name": "CET 432: Structural Design-Reinforced Concrete", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "Design of reinforced concrete beams, columns, slabs, and selected framing systems for bending and shear.  Introduction to formwork design.", "prerequisite": "MATH 140"}, {"course_name": "CET 434: Foundations", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "Analysis and design of footings, piling, retaining walls; consideration of contruction problems involving soils and foundations of structures.", "prerequisite": "CET  343 , CET  430 , CET  432"}, {"course_name": "CET 435: Construction Estimating", "department": "Civil Engineering Technology (CET)", "credits": "3 Credits", "description": "Methods and techniques used in estimating construction cost; practice in takeoffs, costing and final bid preparation; microcomputer applications/class projects.", "prerequisite": "ED&G 100 , ET   200 , C E  333W"}]