[{"course_name": "CI 105N: Improv Theater, Curriculum & Instruction", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "This course will engage students in the study and practice of longform improv theatre in ways that will develop their knowledge of the field of curriculum and instruction. At Penn State, we are all familiar with the chant, \"We Are!\" and the purpose of this course is to learn together about ourselves and our collectiveness through creative performance. Improv theater is the performing art of spontaneous, collaborative, embodied story-telling. It is often presumed to be a comedic art form, and while it is true that there are often joyful moments that arise from shared experiences of surprise or upended expectations, we will be studying the disciplined practice of longform improvisational theater, which consists of more sustained, narrative constructions. In longform improv, creative outcomes are just as likely to be serious, or tragic, or thought-provoking, or any number of emotions, but in all cases: what we create together says something about who \"We Are!\" to each other as co-performers and as observers. The course will culminate with a public performance. Throughout the course, students will write and reflect on practitioner and academic readings from the field of curriculum and instruction, which are relevant not only to aspiring professionals in education (e.g., Educators preparing to teach in both formal and informal settings, Instructional Leaders, School Administrators, and Athletic Coaches), but also to university students who will benefit from more scholarly-informed reflection on their own educational experiences. In particular: we will draw from literature on learning theories and epistemologies; curricular approaches to diversity and inclusion; and improvisational pedagogies. We will learn improv theater exercises, but more importantly: we will practice the collective embodiment of an improvisational ethos, such that we develop our skills at affirming difference, embracing risk-taking, vulnerability, and uncertainty, listening without judgment, and attuning to our entanglements with one another. Participants will cultivate skills to be responsive to students and other populations for whom they may be providing care or leadership. These are the skills and practices that contribute to living a wholehearted life-as individuals and as communities.", "other": ["General Education: Arts (GA)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CI 185: Principles of Social Justice in Education", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "This course explores the foundations of equity-based educational practices and helps students construct individual working definitions of social justice. The course includes engagement with foundational, historical, and contemporary scholarly and popular literature; guest lecturers from the University and local communities; and multimedia. Students explore tensions between theory and practical application and begin developing a language of critique for considering issues within the world of education. Progress is assessed via a variety of artifacts including self-assessment, guided journal entries, reflection upon campus and community social justice events, and written and oral research reports on a social justice topic of choice. For students interested in the Social Justice in Education minor, the course provides a conceptual foundation and skill set.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CI 195: Early Observation Experience for Teacher Preparation", "department": "Curriculum and Instruction (CI)", "credits": "1-2 Credits/Maximum of 2", "description": "Early observational work in educational settings with a variety of age/grade levels."}, {"course_name": "CI 200: Peer Tutoring", "department": "Curriculum and Instruction (CI)", "credits": "1 Credits", "description": "Prepares students to develop successful practices as a peer tutor."}, {"course_name": "CI 210: Small Group & One-on-one Tutoring", "department": "Curriculum and Instruction (CI)", "credits": "1 Credits", "description": "The course gives students knowledge in one-on-one peer tutoring as well as in a small group setting."}, {"course_name": "CI 250: Education Research: Issues and Approaches", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "Introduction to frameworks and methods for education research, including classroom-based and non-classroom-based research.  C I 250H Education Research: Issues and Approaches (3) This course serves as an introduction to the major issues and traditions surrounding research in education. Educational research spans the full range of settings in which people learn and/or teach, including schools and classrooms but also non-school settings such as community, therapeutic, or workplace environments. This research is carried out within a broad range of intellectual traditions and using a diverse set of methodologies as well. Further, some educational research is carried out by practitioners as they engage in their daily work (such as teachers conducting classroom inquiry), while others study education from non-practitioner perspectives. This course will serve as an overview of major questions, frameworks, and methods that characterize educational inquiry, serving as an introduction to the broad set of frames for studying education. In addition, the course will address controversies surrounding the conduct and utility of educational research. The course is appropriate for undergraduate students interested in engaging in independent research, honors theses, or collaboration on faculty research projects - or those simply interested in becoming more informed consumers of research on education. Students will read examples of research in different education subfields, interact with faculty from various subfields in education, and consider how their own educational questions might be approached. Students will also learn about the dissemination of education research in journals and presentations. Upon finishing the course, students will be prepared to develop a research proposal suitable for an undergraduate project such as a thesis or capstone paper.", "other": ["Honors"]}, {"course_name": "CI 280: Introduction to Teaching English Language Learners", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "Introduction to language, culture, instruction, assessment, and professionalism as they relate to teaching English Language Learners in U.S. schools. C I 280 Introduction to Teaching English Language Learners (3) (GH) C I 280 focuses on the development of foundational knowledge to successfully assist English language learners in U.S. school contexts. The basic premise of the course is that teachers play an important role in creating a positive classroom learning environment and bringing school success for English language learners. This course is designed to develop essential dispositions, skills, and knowledge for teacher education students to fulfill their important role. Course objectives are to understand culture, language, learning contexts, and pedagogy. Culture focuses on a) sociocultural characteristics of English language learners, b) how English language learners' cultural communication and learning styles affect the learning process, c) how English language learners' cultural values affect their academic achievement and language development, d) negative effect of cultural bias in instruction, materials and assessments, and e) the importance of developing cross-cultural competence in interactions with colleagues, administrators, school and community specialists, students and their families.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CI 285: Active Engagement for Social Justice in Education", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "The course prepares students for pedagogical thinking and active engagement in social justice education in community and school-based contexts. This course is a core class of the Social Justice in Education minor and is taken either together with or subsequent to CI 185, Foundations of Social Justice in Education. It builds on the key theoretical content of the minor's Foundations course, introducing students to the major patterns of thought that have shaped the history of education and curriculum design in the United States, and guiding students through a process of curricular reasoning. Students will engage in argumentation to investigate ways in which theoretical concepts have implications for the design of curricular interventions. Case studies or 'live' examples of social justice-oriented advocacy or educational projects being implemented in the US and abroad will provide a space for analysis and discussion. Students will explore curricular assumptions, identify instructional objectives, and articulate learning outcomes based on the cases they explore. Additionally, an action research project conducted in a classroom or community group will ask students to identify and research a problem, and develop a preliminary plan of action in collaboration with community or school-based stakeholders. Students are introduced to ethnographic data gathering techniques, problem-posing, and pedagogical reasoning and documentation. Team-building, listening and communication skills, and reflective practices are emphasized. A final project encourages students to document and express their work through visual and digital technologies directed at both their peers and the community partners."}, {"course_name": "CI 295: Introductory Field Experience for Teacher Preparation", "department": "Curriculum and Instruction (CI)", "credits": "1-3 Credits/Maximum of 6", "description": "This introductory teacher preparation course utilizes a variety of field experiences (both observations within secondary school classrooms and individualized tutoring) to engage prospective education majors in issues related to teaching and learning. Students will learn about adolescent learners and elements of socially and emotionally safe classrooms. Inquiry into teacher beliefs as well as student diversity is a focus of the course. Students will be introduced to elements of teacher professionalism and professional identity.", "prerequisite": "2nd Semester Standing Recommended Preparation: Official Clearances Required. See: http://www.ed.psu.edu/preservice/clearance.htm"}, {"course_name": "CI 295A: Introductory Field Experience for Teacher Preparation", "department": "Curriculum and Instruction (CI)", "credits": "1-3 Credits", "description": "CI 295A is designed to enable students interested in early childhood education as a potential major and career to gain experience observing and assisting in a variety of school and community settings. Students will be engaged in observing as well as tutoring individual children and small groups of children in pre-kindergarten settings as well as in kindergarten through fourth grade settings. As students have not yet been exposed to methods of instructional planning and delivery, their tutoring of individuals and small groups will be carried out under the direct supervision of a professional teacher. Through their observation and participation in these educational settings, students will develop an awareness of observation as a tool for understanding and analyzing educational environments, teaching and learning. They will develop an understanding of the nature of participant observation as well as a variety of frameworks and strategies that can be used for observation as well as the skills necessary to communicate observations professionally and ethically. Engaging in extended observations in educational settings provides students with an opportunity to enrich and deepen their understanding of a variety of educational concepts that they will encounter in prerequisite or concurrent courses including child development, English language learning and development, principles of human learning, individual differences in human ability including special needs students, cultural diversity, and contemporary issues in education and their impact on childhood educational settings. Finally, CI 295A will provide an opportunity for students to examine childhood education as a future career. They will be introduced to notions of teaching in general as a career as well as to specialized aspects of teaching in both pre-kindergarten and elementary school settings. Students will examine their own biographies as learners and the implications of their biographies for the development of a teacher identity and the potential suitability of childhood education as a career. Students will also be engaged in examining a variety of codes for professional and ethical conduct for educators. Through examining, critiquing and synthesizing these various articulations of professionalism, students will begin the development of a personalized code of ethical, and professional conduct.", "prerequisite": "EDPSY 11"}, {"course_name": "CI 295B: Introductory Field Experience in Middle Level Education", "department": "Curriculum and Instruction (CI)", "credits": "1-3 Credits/Maximum of 3", "description": "C I 295B Introductory Field Experience for Middle Level Education (1-3)CI 295B is designed to enable students interested in middle level education (Grades 4 to 8) as a potential major and career to gain experience observing and assisting in a variety of school settings. Students will be engaged in observing as well as tutoring individual children and small groups of children in middle level educational settings. As students have not yet been exposed to methods of instructional planning and delivery, their tutoring of individuals and small groups will be carried out under the direct supervision of a professional teacher.Through their observation and participation in these educational settings, students will develop an awareness of observation as a tool for understanding and analyzing educational environments, teaching and learning. They will develop an understanding of the nature of participant observation as well as a variety of frameworks and strategies that can be used for observation as well as the skills necessary to communicate observations professionally and ethically.Engaging in extended observations in educational settings provides students with an opportunity to enrich and deepen their understanding of a variety of educational concepts that they will encounter in prerequisite or concurrent courses including child development, English language learning and development, principles of human learning, individual differences in human ability including special needs students, cultural diversity, and contemporary issues in education and their impact on middle level educational settings.Finally, CI 295B will provide an opportunity for students to examine middle level education as a future career. They will be introduced to notions of teaching in general as a career as well as to specialized aspects of teaching in both pre-kindergarten and elementary school settings. Students will examine their own biographies as learners and the implications of their biographies for the development of a teacher identity and the potential suitability of middle level education as a career. Students will also be engaged in examining a variety of codes for professional and ethical conduct for educators. Through examining, critiquing and synthesizing these various articulations of professionalism, students will begin the development of a personalized code of ethical, and professional conduct.", "prerequisite": "Second semester standing"}, {"course_name": "CI 295D: **SPECIAL TOPICS**", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits"}, {"course_name": "CI 296: Independent Studies", "department": "Curriculum and Instruction (CI)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CI 297: Special Topics", "department": "Curriculum and Instruction (CI)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CI 304N: Food, Farms & Justice: What's Education Got To Do With Them?", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "This course intends to unite students' minds, hearts, and bodies in an historical, sociological, and experiential exploration of food and farms and their educational possibilities. Students' minds will be engaged as they explore the 20th century history, contributions, and legacy of industrial agriculture and the emergence of alternative approaches related to food and farming in recent decades. Students' hearts will be engaged as they consider their own relationship to food, to soil and place, and to learning. Finally, students' bodies will be engaged as they directly participate in farming/gardening and communal meal preparation and enjoyment. The uniting of mind, heart and body culminates as students become teachers - applying their embodied knowledge in the creation of learning activities that are taught to others. Guiding questions for students' explorations include: (1) How is food - its cultivation, preparation and enjoyment - a cultural, ecological and moral activity? and (2) How might farm/garden based education cultivate abiding relationships between people and their places/communities, their soils, their bodies, and to more just and humane relationships to others? In the first half of the course, students will be introduced to influential writers representing diverse perspectives within the humanities.The aim is that students conduct a reckoning of industrial, large-scale and corporate orientations to agriculture. Why? To discern desirable alternatives that promote the health and well-being of people, soils, and communities. Students will discern a vision of a just, sustainable and meaningful life. In the second half of the course, students apply their understandings of food, farm, justice and sustainability to developing farm/garden based learning experiences for others. To this end students will be introduced to farm/garden based education; constructivist, student-centered learning theories; curriculum development approaches; and the design of performance assessments. Finally, having studied instructional/curricular theory and practice, students will apply their learning through a \"field-based\" teaching practicum, showcasing their skills in developing farm/garden based curriculum and instruction.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CI 333: Education and the Student in Recovery", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "This highly interdisciplinary course provides a broad exploration of how students accomplish abstinent recovery from Alcohol Use Disorders (AUDS) and other Substance Use Disorders (SUDs) in high-risk environments with the support of Recovery High Schools and Collegiate Recovery Program.s In particular, the course examines the problem posed by alcohol and substance use disorders on high school and college campuses, and explains the benefits of expanding the continuum of student health services to include ongoing support for the major lifestyle changes required to sustain recovery from chronic health conditions. Educational environments can pose challenges to students in recovery, and without proper support, students often return to active use of alcohol and other substances, which often invites disastrous life consequences, including educational failure. With the proper supports in place, students often thrive across multiple domains. Recovery High Schools provide access to social systems, coping mechanisms, recreational activities, and pro-recovery peer groups. Collegiate Recovery Programs are expanding rapidly: they are typically low-cost, featuring s small staff, a space on campus in which to meet, a peer-support community, and recovery-protective programming. A growing body of evidence suggests that these programs have very low relapse rates, low attrition, and higher GPAs than their host institutions. The course builds awareness of terminology, especially in relation to stigma-reduction and recovery messaging. It explores various theoretical contexts, including ecological theory and resiliency theory. It explores new paradigms in the management of chronic health conditions, through Recovery-oriented Systems of Care (ROSC) and the expansion of the continuum of care that colleges and universities offer their students to include ongoing support for recovery. Since participation in 12-step recovery programs is very high in RHSs and CRPs, we explore the known mechanisms of 12-step programs such as Alcoholics Anonymous and Narcotics Anonymous. Building on these insights, the role of narrative in making \"storied\" identity changes is also explored. The course also examines the way in which educational and recovery curricula complement one another to bring about lasting personal transformations. Students will apply their understandings in the course by completing a final project in which they demonstrate various ways that the course content might inform the work of practitioners who work with students in recovery in healthcare, education, and beyond. This course is especially suited for students intending to work in schools and other education-related settings, including Recovery High Schools and Collegiate Recovery Programs."}, {"course_name": "CI 385: DC Social Justice in Education: Empowering Communities through Transformative Teaching", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "CI 385 is the first course in a two-part sequence, the \"DC Social Justice in Education Experience.\" This course is ordinarily followed by a two-week teaching internship in Washington, DC (CI 395). Together, these courses aim to increase students' capacity to understand diversity issues, while living and working in diverse, multicultural residential settings and workplaces. The experience infuses diversity issues, topics, and perspectives into a sequence for undergraduates that focuses on the skill set necessary for advocacy in educational equity and social justice. It is a hands-on experience that delivers a service learning opportunity for Penn State students to work with diverse, underserved communities in the District of Columbia. CI 385 is a required preparatory course for students who want to participate in the Washington DC CI 395 internship, and students are expected to enroll in CI 395 upon successful completion (a grade of a C or better) of CI 385."}, {"course_name": "CI 387: Education, Culture, and Society in Brazil and Colombia", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "Given the increasing need to instill students with global perspectives, students from a range of backgrounds and academic majors will benefit from an in-depth exploration of the educational systems, cultures, and societies of Brazil and Colombia -- additionally, the course may also prepare students for (optional) summer travel to Brazil and/ or Colombia (provided they are interested in either of both of those opportunities). Students are invited to use their emerging understandings to reflect upon the U.S. educational system, its culture, and its society. Throughout the course, students will examine the structure of educational systems, educational policy, educational inequality across nations, education as a constitutional right, colonial histories, Dependency Theory, government corruption, urban and rural environments, labor issues, economics (i.e. Marxism, socialism, communism, inflation, currency devaluation, neoliberalism), politics, Colombia's ongoing civil war, and Brazilian culture (including music, beauty obsession, and sports). In addition, the course also provides a grounding in basic travel skills and basic Portuguese. Although the course's main emphasis is on education, students from a broad variety of backgrounds and educational interests are encouraged to enroll, since they are likely to find a broad array of topics that will increase their international acumen considerably.", "other": ["Honors"]}, {"course_name": "CI 395: Internship", "department": "Curriculum and Instruction (CI)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, non-group instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "CI 400: Introduction to Research Literature", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "Introduction to research literature and methodology; stress on interpretation, sources, and research reporting.", "prerequisite": "6th Semester standing or Graduate Status"}, {"course_name": "CI 405: Strategies in Classroom Management", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits/Maximum of 3", "description": "Managing and coping with disruptive student behavior in instructional settings so that they support the teaching/learning process. EDLDR 405 / CI 405 Strategies in Classroom Management (3)This course has been designed to engage students in in-depth examination of the process of creating and sustaining a classroom learning community that fosters and enables success for all children. Emphasis is placed on understanding a variety of theoretical models of classroom management as well as observing and studying individual children to develop a better understanding of their needs. The result should be the development of a coherent set of beliefs concerning the creation of classroom learning environments that support learners and meet their individual needs."}, {"course_name": "CI 444: Writing Support for IUG and Honors Scholars", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "he purpose of this course is to support IUG/Reading Specialist MEd students in writing their Master's papers as well as Schreyer Honors Scholars in The College of Education writing their Honors theses. The course provides an overview to the conventions of academic writing, and divides a major task into manageable sections. This class walks students through each section, provides models, and engages students in the actual practice of writing. Substantial working time is dedicated to writing the thesis. Students often have more faith in their ability to structure writing time into their week than is actually warranted. This course provides structured writing time, and students work in close proximity to other writers and to instructor feedback.", "prerequisite": "4th Semester Standing", "other": ["Honors"]}, {"course_name": "CI 460: The Creative Child", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "This course will explore the relationships among the various arts and material inquiries and learning for children in the preschool and elementary years via research, theory, and pedagogical application. CI 460 is one component in the PSU teacher education program that is unified by the basic set of principles supporting the development of a broader and more inclusive understanding of texts, art, children, and communities. Students will learn about theories of child art, creativity, and multimodal learning as they engage in their own creative processes and plan to integrate the creative arts in early childhood and elementary classrooms.", "prerequisite": "CI 295A"}, {"course_name": "CI 485: Social Justice in Education Capstone Course", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "This capstone course is a culminating experience taken at the end of the Social Justice in Education minor. In this course, students apply theory toward action and develop meaningful partnerships with an appropriate community. It provides students the opportunity to revisit major ideas and themes learned during minor coursework. In doing so, students reflect on their learning journeys, synthesize key understandings, and complete a community-oriented project. Key components of the capstone project include manifesting theories into action; developing meaningful partnerships with community stakeholders; advocating for educational equity; and designing and implementing justice-focused curriculum for schools, community-based educational programs, or other non-traditional educational settings. Students will assess community needs, while working collaboratively to prepare a civic action plan/local initiative. Upon completion of the capstone experience, students present their final reflections to colleagues - presentations that examine their growth throughout their studies and lay out their trajectories as advocates for social justice in education.", "prerequisite": "CI 185"}, {"course_name": "CI 492: Identities, Power and Perceptual Pedagogies in Teaching and Learning", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "Students will perform inquires into the intersections of identities, power, and pedagogical formations in relation to urban teaching/learning contexts. AFAM 492 / CI 492 / EDTHP 492 Identities, Power and Perceptual Pedagogies in Teaching and Learning (3) In this course, students will take part in inquiries into the intersections of identities, power, and perceptual pedagogies, particularly as these phenomena pertain to methods of teaching and learning in urban contexts. To develop new knowledge and analytic skills, students will be introduced to perceptual and conceptual frameworks that assist deep engagements with youth- and teacher-centered case studies. These cases will depict actual lived experiences among racially and economically diverse students and teachers in urban contexts.", "prerequisite": "5th semester standing", "other": ["Cross-listed with: AFAM 492, EDTHP 492"]}, {"course_name": "CI 495: Internship", "department": "Curriculum and Instruction (CI)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "7th Semester standing"}, {"course_name": "CI 495A: Clinical Application of Instruction - PK-4", "department": "Curriculum and Instruction (CI)", "credits": "1-6 Credits/Maximum of 6", "description": "Practicum situation for demonstration of selected instructional strategies and management skills acquired in professional training."}, {"course_name": "CI 495B: Clinical Application of Instruction - Middle Level Education", "department": "Curriculum and Instruction (CI)", "credits": "3-15 Credits/Maximum of 15", "description": "CI 495B Clinical Application of Instruction--Elementary and Kindergarten Education (3) CI 495B for Middle Level Education is a full-time teaching practicum. It provides an opportunity for teacher candidates to integrate concepts, theories, and ideas from their coursework. Specifically, CI 495B engages candidates in examining 1) what it means to be a professional and establish professional relationships with colleagues, students, and families, 2) how to use various tools (e.g., observation, writing, reflection, teaching, case studies, etc.) that are available to them in learning to be a teacher, 3) how to make connections across the various courses and experiences they are taking during the semester, and 4) how effectively they are developing their knowledge and skills as a beginning teacher and what sources of evidence they should use in judging their effectiveness. Teacher candidates in CI 495B are expected to achieve desired outcomes in four domains: 1) planning and preparing for student learning, 2) teacher, 3) inquiry and analysis of teaching and learning, and 4) fulfilling professional responsibilities. CI 495B is a part of a block of courses in a PSU teacher education program that is unified by a basic set of principles and a field experience component.", "prerequisite": "Admission to Middle Level Education Major"}, {"course_name": "CI 495C: Clinical Application of Instruction -- Secondary Education", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits", "description": "This is a pre-student teaching field experience and seminar for secondary education and world languages majors that is taken in the same semester with a discipline-specific methods class. The course takes place in 7th-12th grade classrooms and in seminars with university supervisors where students apply, extend, and reflect on concepts, questions, theories, and models of teaching studied in the university-based methods courses. Throughout the semester, students are engaged in weekly sessions on the university campus providing instructional support on professional behavior, ethics, school culture, time management, motivation, portfolio development, lesson planning, writing objectives, questioning techniques, formative and summative assessments, instructional strategies, differentiated instruction, and classroom management.", "prerequisite": "CI 295"}, {"course_name": "CI 495D: Practicum in Student Teaching--Childhood and Early Adolescent Education", "department": "Curriculum and Instruction (CI)", "credits": "12 Credits/Maximum of 12", "description": "Full-time classroom instruction in elementary and early childhood education. Students supervised by University personnel and practicing teachers. No corequisite courses other than C I 495F permitted.", "prerequisite": "CI 495A"}, {"course_name": "CI 495E: Practicum in Student Teaching--Secondary Education", "department": "Curriculum and Instruction (CI)", "credits": "15 Credits", "description": "Full-time classroom instruction in secondary education. Students supervised by university personnel and practicing teachers.", "prerequisite": "LLED 412W"}, {"course_name": "CI 495F: Professional Development Practicum", "department": "Curriculum and Instruction (CI)", "credits": "3 Credits/Maximum of 3", "description": "Instruction concurrent with student teaching practicum. Students focus on the solution of instructional problems identified at the practicum site.", "prerequisite": "CI 495D"}, {"course_name": "CI 496: Independent Studies", "department": "Curriculum and Instruction (CI)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CI 497: Special Topics", "department": "Curriculum and Instruction (CI)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CI 497I: Special Topics- Inter Domain", "department": "Curriculum and Instruction (CI)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest. Course is GH and GS.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain"]}]