[{"course_name": "CSD 100: Preventing Vocal Abuse, Misuse, and Disorders", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Preventing Vocal Abuse, Misuse, and Disorders is a 3 credit course intended to be the first course for all University students exploring communication sciences and disorders as a possible major, and students interested in learning specifically about vocal hygiene, voice use, vocal abuse and voice disorders. Principles of the voice mechanisms, preventing vocal abuse, and promoting vocal health across the life span are core principles of the course. The focus of this course is on preventing voice disorders and promoting activities that contribute to healthy vocal habits across the life span. The course is designed to integrate theoretical knowledge, practice-based, and measurement-focused activities to assist learners in understanding, achieving, maintaining, and promoting a lifetime of healthy vocal activities. Learning activities include use of specialized computer instrumentation for analyzing voice qualities. The educational objectives of the course are to: 1) develop a basic understanding of the normal and disordered vocal mechanism; 2) understand the need for maintaining and promoting lifetime wellness in your vocal activities and habits for any occupational choice; 3) learn about the prevention of vocal disorders across the life span from vocal nodules to laryngeal cancer; 4) understand the subjective and objective measures of vocal qualities to assist in changing and altering vocal abuses and misuses while improving and enhancing good vocal habits, and 5) developing an understanding of how vocal behaviors influence social behaviors, employment, and quality of life. The course includes an overview of the anatomy and physiology of the respiratory and vocal mechanisms, physics of voice production, development of vocal abuses and resulting pathologies, disorders including vocal growths, paralysis, voice disorders associated with cleft lip and cleft palate, syndromes, neurodegenerative disorders, aging and head and neck cancer.", "other": ["United States Cultures (US)", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CSD 101: Preventing Hearing Loss", "department": "Communication Sciences and Disorders (CSD)", "credits": "1.5 Credits", "description": "Assessment, intervention, and prevention of hearing loss caused by loud music and recreational and industrial noise.", "other": ["United States Cultures (US)", "General Education: Health and Wellness (GHW)"]}, {"course_name": "CSD 146: Introduction to Communication Sciences and Disorders", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Classification of speech, language, and hearing disorders, diagnostic and treatment procedures; skills and responsibilities of the speech-language pathologist and audiologist.  CSD 146CSD 146 Introduction to Communication Disorders (3) (US;IL) CSD 146, Introduction to Communication Sciences and Disorders (INTRO TO CSD), is a 3-credit course typically offered every semester. The course is intended as the first course for Communications Sciences and Disorders majors or for students exploring Communications Sciences and Disorders as a possible major. For Communications Sciences and Disorders majors, CSD 146 is a required course, requiring a grade of \"C\" or better, and should be taken during the first or second year (semester standing 1-4) since CSD 146 is a prerequisite for CSD 230, 245, 395W, 442, 444, 451, and 459W. The educational objectives of the course are to introduce students to speech, language, and hearing disorders and the professions of speech/language pathology and audiology. This is done by providing an overview of the normal aspects of speech, language, and hearing followed by an overview of speech, language, and hearing disorders with emphasis on assessment and intervention strategies. The course includes an overview of the anatomy and physiology of the speech and hearing mechanisms, physics of sound, and linguistic and psycholinguistic development. Students are required to complete several observations of speech, language, or hearing therapy or assessment in the Penn State Speech and Hearing Clinic and readings from a required text and Internet sites. Students are evaluated by three to four tests and their clinical observation reports.", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "CSD 218: American Sign Language I", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Introduction to sign language; provides basic receptive and expressive skills; includes out-of-class practice.  CSD 218CSD 218 American Sign Language I (3)CSD 218, American Sign Language I (AM SIGN LANG 1), is a 3-credit course that can be taken by any student interested in learning sign language. Several sections of the course are offered every semester. For Communications Sciences and Disorders majors, the course is highly recommended as an elective. The intent of the course is to provide students with a basic understanding of receptive and expressive sign language skills. The educational objectives are that students will (a) acquire a basic knowledge of expressive and receptive skills in American Sign Language (ASL), content variety signing, and finger spelling, (b) acquire a knowledge of the role of ASL in the lives of deaf people and to other cultural aspects of deafness, (c) develop and demonstrate a 600 word sign language vocabulary, and (d) demonstrate basic sign language communication skills. Students meet the educational objectives by attending class, completing reading assignments, observing video tapes, and practicing sign language inside and outside of class. Students will be evaluated using five tests. One test concerns aspects of the deaf culture as it pertains to the use of ASL and the grammatical structure of ASL. Four tests assess knowledge of vocabulary and communication skills by having the instructor sign vocabulary and questions and having students write down or sign back the answer. CSD 218 is a prerequisite for CSD 318, Sign Language II."}, {"course_name": "CSD 230: Introduction to Audiology", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Basic measurement procedures, evaluation, and screening of hearing loss using pure-tone and speech audiometry, immittance, and physiological measurements.  CSD 230CSD 230 Introduction to Audiology (3) CSD 230, Introduction to Audiology (INTRO TO AUDIOLOGY), is a 3-credit course typically offered during Fall semester. The course is prerequisited by Communications Sciences and Disorders 146, required for Communications Sciences and Disorders majors, and should be taken during the second or third year. The course can also be taken by students exploring CSD as a major. The intent of this course is to provide students with a basic understanding of hearing measurement procedures, screening for hearing loss, and the educational, social, and vocational problems of hearing impaired individuals across the age span. The educational objectives are that students will acquire an understanding of: 1) acoustics as related to hearing testing, 2) anatomy and physiology of the auditory system, 3) common disorders of the auditory system, 4) the basic principles of measuring hearing sensitivity, speech understanding ability, and middle ear function, 5) screening for hearing loss, and 6) the educational, social, and vocational problems caused by a hearing loss across the life span. Students meet the educational objectives by attending and participating in class discussions, completing assigned readings, participating in workshops, observing hearing testing, and completing several examinations."}, {"course_name": "CSD 240: Supporting Communication Through The Performing Arts", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "This course will allow students to acquire skills, knowledge, and experiences about the ways in which performance activities such as improvisation, vocal performance, and dance can promote valued communication and developmental outcomes for individuals with and without developmental and intellectual disabilities. The course is explicitly designed to include students from the Lifelink PSU program who have intellectual disabilities, who learn with and alongside enrolled students. This structure directly emphasizes the interconnections between students with and without disabilities, as well as between the knowledge bases and theoretical approaches brought by specialists in the performing arts and in diverse areas of disability services. The course will emphasize the pluralistic nature of knowledge in the social and behavioral sciences by incorporating the pedagogy and knowledge of experts from the performing arts with the empirical scientific approach taken in diverse disciplines dedicated to disability services and rehabilitation, including but not limited to Communication Sciences and Disorders, Education and Special Education, Psychology, Music Therapy, and Rehabilitation. Students will collaborate to analyze both in the empirical research literature as well as in their classroom experiences with the Lifelink students the specific ways in which various performing arts offer opportunities for growth in self-expression, interpersonal understanding, and other important communication skills.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CSD 269: Deaf Culture", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Explores the economic, social, psychological, and political aspects of the deaf culture and its interaction with the majority hearing culture.  CSD 269 CSD 269 Deafness and Society (3) (GS;US;IL) explore this community as being a distinct culture having its own rules of social interaction, values, group norms, and identity. The educational objectives are that the student will acquire an understanding of: 1) the development of the American Deaf Community, 2) factors affecting an individual's choice to affiliate with the Deaf Community, 3) history and current trends in deaf education, 4) American Sign Language (ASL) and other forms of communication used by Deaf Americans, 5) social, emotional, and psychological aspects of deafness, 6) diversity with the Deaf Community, and 7) deafness in the literature, media, and the arts.", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "CSD 296: Independent Studies", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CSD 297: Special Topics", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CSD 300: Developmental Considerations in the Assessment and Treatment of Language   Disorders", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Using a developmental framework to interpret problems in child language acquisition.  CSD 300 Developmental Considerations in the Assessment and Treatment of Language Disorders (3) (US;IL) CSD 300, Developmental Considerations in the Assessment and Treatment of Language Disorders (DEV OF LANG DIS), is a 3-credit course typically offered every Fall semester. For Communications Sciences and Disorders majors, CSD 300 is a required course, requiring a grade of 'C' or better, and should be taken during the second or third year (semester standing 3-6). The course is oriented toward students who intend to pursue a career in speech-language pathology and provides the foundation for higher level speech and language courses in Communications Sciences and Disorders. The overall educational objective of the course is to introduce students to child language development as the foundation for assessing and treating children with language disorders. This is done by lecture and active learning experiences so that students understand (a) several theories and information concerning the relations between normal and abnormal language development in children, (b) how individual, cultural, and linguistic differences contribute to language development, (c) the relations between theories of language development and empirical research, and (d) the interaction between normal and abnormal language development in children. Students are required to complete reading assignments and participate in group activities.", "prerequisite": "CSD 146", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "CSD 311: Clinical Phonetics", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Introducton to phonetic transcription of speech emphasizing articulatory phonetics of American English, its dialects, and disordered speech; extensive transcription experiences.  CSD 311 Clinical Phonetics (3) For Communications Sciences and Disorders majors, CSD 311 is a required course, requiring a grade of \"C\" or better, and should be taken during the second or third year (semester standing 3-6). The educational objectives of this course are to introduce students to the phonetic transcription of speech sounds using the Internal Phonetic Alphabet, provide an overview of articulatory phonetics, describe representative sounds from languages of the world with primary emphasis on American English and its dialects, and the transcription of disordered speech production. Students will be expected to read and transcribe broad and narrow phonetic symbols, become familiar with sociolinguistic factors and non-organic and organic speech disorders that affect pronunciation. In addition, students will be expected to describe the phonetic capabilities of humans including the articulary basis of speech sounds, aspects of speech production, and speech sounds produced by the world's languages and disordered speakers. Recitation and extensive practice in transcription of live speech are integral parts of the course.", "prerequisite": "CSD 146"}, {"course_name": "CSD 318: American Sign Language II", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Review of basic signing, plus continued development of signing skills.  CSD 318 American Sign Language II ( 3)CSD 318, American Sign Language II (AM SIGN LANG II), is a 3-credit course that can be taken by any student interested in learning sign language provided they have taken CSD 218, Sign Language I. The course is offered every semester. For Communications Sciences and Disorders major's, the course is highly recommended as an elective. The intent of the course is to provide students with an intermediate and some advanced understanding of receptive and expressive sign language skills. The educational objectives are that students will: 1) acquire intermediate and some advanced knowledge of expressive and receptive skills in American Sign Language (ASL) and content variety signing, 2) acquire conversational skills for interaction with members of the Deaf community, and 3) continue to develop signed vocabulary, ASL grammar, fluency in the use of signs and finger spelling, and knowledge of the Deaf culture. Speech is not permitted in the classroom. Students meet the educational objectives by attending class, completing reading assignments, observing video tapes, practicing sign language inside and outside of class, and spending at least 10 hours outside of class conversing in ASL with others who sign.", "prerequisite": "CSD 218"}, {"course_name": "CSD 331: Anatomy and Physiology for Speech and Hearing", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Structure and function of the physical systems involved in speech and hearing, including respiration, phonation, articulation, perception, and neurology.  CSD 331 Anatomy and Physiology for Speech and Hearing (3) For Communications Sciences and Disorders majors, CSD 331 is a required course, requiring a grade of \"C\" or better, and should be taken during the second or third year (semester standing 3-6). The overarching goal of this course is to provide a comprehensive foundation for understanding normal anatomy and physiology of the speech and hearing mechanisms (respiration, phonation, articulation, neurology, and perception), which is essential for evaluating and treating individuals with speech, language, or hearing disorders. Through lectures and active learning experiences, students will be expected to (a) distinguish between principles of anatomy and physiology, (b) demonstrate knowledge of terminology, concepts, and theories related to anatomy and physiology of the speech and hearing mechanism, and (c) understand how normal anatomy and physiology of the speech and hearing mechanism relates to understanding communication disorders.", "prerequisite": "CSD 146"}, {"course_name": "CSD 341: Acoustic Principles in Communication Sciences and Disorders", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Explores the fundamental concepts of acoustics as applied to individuals with communicative disabilities; special emphasis is placed on the acoustic analysis of speech.  CSD 301CSD 301 Acoustic Principles in Communication Sciences and Disorders (3) For Communications Sciences and Disorders majors, CSD 301 is a required course, requiring a grade of \"C\" or better, and should be taken during the second or third year (semester standing 3-6). The educational objectives of the course are to introduce students to fundamental concepts of acoustics and to apply those concepts to individuals with communicative disabilities and to the acoustic analysis of speech. The course includes a detailed overview of the physics of sound, sound propagation, sound measurement, the generation, acoustic principles, measurement of speech sounds, and the acoustical analysis of speech for normal and disordered speakers. Students are required to have a scientific calculator capable of exponentiation, logarithms, and trigonometric functions.", "prerequisite": "CSD 311"}, {"course_name": "CSD 397: Special Topics", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-3 Credits/Maximum of 3", "description": "Formal Courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CSD 418: American Sign Language III", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "In this course, the students will continue to further development of comprehension and production abilities in American Sign Language (ASL). Emphasis will be on recognition and demonstration of more sophisticated grammatical features of ASL with focus on increasing fluency and accuracy. The primary components of this course will be to practice what students are learning in this language class including, vocabulary development, grammatical features, conversational and communication skills, and cultural awareness. Speech will not be permitted in the classroom; communication will be in American Sign Language. When possible, classroom instruction will be augmented with guest speakers and videos. Class attendance and outside practice with other people who know or are studying ASL are essential in this course.", "prerequisite": "CSD 318"}, {"course_name": "CSD 431: Neuroanatomical and Neurophysiological Foundations of Communication Disabilities", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "This course discusses various modes of communication, including speech perception, speech production, reading, writing, and sign language. All levels of language processing are discussed, from the morpheme level (smallest unit of meaning) to the discourse level, including prosody. The major psycholinguistic and neurolinguistic models of and the basic neuroanatomy responsible for the major aspects of linguistic communication are investigated. For all modes and levels of communication, examples from both normal and disordered language processing perspectives are included. Patterns of disordered language that result from neurological insult or neurodegeneration are discussed. To facilitate understanding, neuroanatomy, brain mapping methods, and the aphasias are the first topics of discussion.", "prerequisite": "CSD 331"}, {"course_name": "CSD 433: Aural Rehabilitation", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Methods for improving receptive skills of persons with hearing impairments; clinical observation and practice.  CSD 433 Aural Rehabilitation (3) Students will gain a basic understanding of the principles of aural rehabilitation for hearing impaired (HI) and deaf infants, children, and adults. Specifically, students will gain an understanding of: 1) hearing loss and hearing handicap in relation to speech understanding and communication, 2) the principles of amplification systems and assistive listening and alerting devices, 3) assessment of communication and communication strategies, 4) auditory training, 5) speech reading, 6) aural rehabilitation for adults, and 7) aural rehabilitation for infants/children. In addition, students will also acquire knowledge concerning the roles and work-sites of professionals working with HI and deaf individuals, and the impact of hearing loss and deafness on the individual, family, and society.", "prerequisite": "CSD 146"}, {"course_name": "CSD 433H: Aural Rehabilitation", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Methods for improving receptive skills of persons with hearing impairments; clinical observation and practice.", "other": ["Honors"]}, {"course_name": "CSD 442: Introduction to Disorders of Articulation and Phonology", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "This course is required for Communications Sciences and Disorders majors and should be taken during the third or fourth year. The intent of this course is to provide students with a basic understanding of the etiology, diagnosis, and treatment of children having articulatory and phonological disorders. The course is designed to facilitate critical thinking through problem solving. The educational objectives are that students will acquire an understanding of: 1) the theoretical and practical bases of language and dialectal variations, 2) normal and abnormal articulatory and phonological acquisition, 3) factors related to phonological disorders, 4) assessment procedures and analysis and interpretation of assessment results, and 5) remediation concepts, principles, and methodologies.", "prerequisite": "CSD 311"}, {"course_name": "CSD 444: Introduction to Organic Disorders of Speech and Language", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "The profession of speech-language pathology and audiology deals with varied disorders of communication and swallowing. Many clients demonstrate communication challenges due to acquired disorders such as stroke, traumatic brain injury, dementia, laryngeal cancer, stuttering and various voice disorders. This course will introduce basic concepts and pathophysiology of selected organic disorders and the role of the speech-language pathologist in treating organic disorders in adults. Students will gain basic knowledge in the pathophysiology, assessment, and treatment related to a variety of acquired disorders in field of Communication Sciences and Disorders.", "prerequisite": "CSD 300"}, {"course_name": "CSD 451: An Introduction to Augmentative and Alternative Communication", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "Examination of assessment and intervention issues in augmentative and alternative communication techniques with persons with severe communication disorders.  The course is required for Communications Sciences and Disorders majors, and should be taken during the third or fourth year. The intent of this course is to examine assessment and intervention issues in augmentative and alternative communication (AAC) techniques for persons having severe communication disorders. Students will be expected to spend outside of class time becoming familiar with common AAC devices located in the department's AAC laboratory. The educational objectives are that students will acquire an understanding of: 1) persons with severe communication disorders who may require AAC, 2) terminology and principles of AAC applications, 3) types and evaluation of existing AAC systems and emerging technology, 4) assessment issues for children and adults concerning the use of AAC devices, 5) intervention, learning, and therapy issues for children and adults who use AAC, 6) research in AAC, and 7) theoretical issues. Although the course will focus on non-electronic AAC applications, students will be expected to spend time in or outside of class becoming familiar with common electronic AAC devices located in the department's AAC laboratory.", "prerequisite": "CSD 300"}, {"course_name": "CSD 459W: Principles of Clinical Management in Communication Disorders", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "CSD 459, Principles of Clinical Management in Communication Disorders (PRIN CLIN MGMT), is a 3-credit writing-intensive course required for Communications Sciences and Disorders majors, and should be taken during the final year of their undergraduate curriculum. The intent of this course is to closely review the principles and practices for assessing and treating people across the life span who have a communication disorder as well as reviewing, interviewing, counseling, and report writing skills. Overall, this \"how-to\" course is designed to provide students with practical solutions and methods when serving persons with communication disorders. The educational objectives are that students will acquire an understanding of: 1) report writing with emphasis on different styles and the need for clear documentation and explanations, 2) assessment with emphasis on interviewing skills, preparation and test administration, interpretation of the results, and oral and written presentation, 3) therapy practices with emphasis on task analysis, behavioral objectives, and implementation, 4) documentation with emphasis on lesson plans, mid and final reports, documentation specific to school versus medical settings, and billing, and 5) client and family counseling and group sessions.", "prerequisite": "CSD 300", "other": ["Writing Across the Curriculum"]}, {"course_name": "CSD 462: Clinical Bases of Language Disorders", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits/Maximum of 3", "description": "The course is required for Communications Sciences and Disorders majors. The course is designed to be an overview of language disorders with emphasis given to child language disorders. Specifically, the course provides information with a wide range of language disorders that affect individuals having different disabilities such as autism spectrum disorder, deaf and hard of hearing, intellectual disability, cerebral palsy, specific language impairment, learning disabilities, and traumatic brain injury. Through lecture, active learning experiences, and out-of-class assignments, students will learn to differentiate communication characteristics and associated problems for specific populations and become familiar with basic assessment and intervention principles. In addition, students will gain information of associated educational and medical problems common to individuals with language disorders.", "prerequisite": "CSD 300", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "CSD 494: Senior Honors Thesis", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study related to a student's interests directed by a faculty super supervisor and culminating in the production of a thesis.", "other": ["Honors"]}, {"course_name": "CSD 495A: Speech Therapy Practicum", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-6 Credits/Maximum of 6", "description": "CSD 495A, Speech Therapy Practicum (SPCH THPY PRACT), is a variable credit (1-6 credit) course offered every semester, The course is not required for Communications Sciences and Disorders majors. Fourth year Communications Sciences and Disorders students having a GPA of 3.0 can apply to take this course by contacting the Penn State Speech and Hearing Clinic, Coordinator of Clinical Services; however, Communications Sciences and Disorders graduate students are given priority. Typically, undergraduate students enroll in this course for 1-2 credits. Students enrolled in this course are student clinicians and provide assessment and treatment to clients of the Penn State Speech and Hearing Clinic. Students are highly supervised by Communications Sciences and Disorders clinical faculty and may be paired with Communications Sciences and Disorders graduate students. Students must adhere to all of the policies and procedures stated in the Penn State Speech and Hearing Clinical Policy Manual. Students are evaluated using outcome-based competency measures that includes oral and written reports skills.", "other": ["Enforced Prerequisite at Enrollment CSD 442"]}, {"course_name": "CSD 495B: Audiology Practicum", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-5 Credits/Maximum of 5", "description": "CSD 495B, Audiology Practicum (AUDIOLOGY PRACT), is a variable credit (1-5 credit) course offered every semester. The course is not required for Communications Sciences and Disorders majors. Fourth year Communications Sciences and Disorders students having a GPA of 3.0 and an interest in Audiology can apply to take this course by contacting the Penn State Speech and Hearing Clinic, Coordinator of Audiological Services; however, Communications Sciences and Disorders graduate students are given priority. Typically, under-graduate students enroll in this course for 1-2 credits. Students enrolled in this course are student clinicians and provide hearing assessment and treatment to clients of the Penn State Speech and Hearing Clinic. Students are highly supervised by Communications Sciences and Disorders clinical faculty and may be paired with Communications Sciences and Disorders graduate students. Students must adhere to all of the policies and procedures stated in the Penn State Audiology Clinic Policy Manual. Students are evaluated using outcome-based competency measures that includes oral and written reports skills.", "other": ["Enforced Prerequisite at Enrollment CSD 433"]}, {"course_name": "CSD 496: Independent Studies", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CSD 497: Special Topics", "department": "Communication Sciences and Disorders (CSD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CSD 497A: Neuro Foundation", "department": "Communication Sciences and Disorders (CSD)", "credits": "3 Credits", "description": "This course will introduce students to the underlying neuroanatomy and neuroph, ysiology of communication and social disabilities focus will be on the role, of the nervous system plays in communication (e.g., speaking, listening,    ,writing). This course will prepare CSD majors for higher level course, dealing with assessment and treatment of individuals who suffer from, neurological insult, injury, lesions, as well as congential and degenerative, disorders.                                                                    ,"}]