[{"course_name": "DMD 100: Digital Multimedia Design Foundations", "department": "Digital Multimedia Design (DMD)", "credits": "3 Credits", "description": "This course introduces students to concepts, skills, language and principles of practice in art and design, communication, and information sciences. DMD 100 Digital Multimedia Design Foundations sets a strong foundation of design process and thinking skills to support and facilitate creative and reasoned approaches to ambiguous and ill-defined problem spaces related to the fields of art and design, communication, and information sciences. Design leadership balances design management with creative vision to guide creative teams, frame complex issues, and effectively communicate. To prepare students for transformative design leadership roles, students will think, evaluate, and respond to local and global issues leveraging the digital medium and peer collaboration. In this course, students are exposed to basic concepts, skills, ethics, language, and other principles of practice by engaging in critical discussions, activities, projects, writing, and work presentation. Students will be introduced to a basic historical perspective of art and design, technology, and communications through case studies and readings. They will write critical reflections on current and historical issues, ethical quandaries, and social impacts in blog posts to generate peer discussion. Independent and collaborative activities will guide students through skill mastery and research-based design projects will reinforce a breadth of concepts including universal design principles, research methods, reasoning and decision making strategies, speculative design and forecasting, curation and remix, narrative and communication, community, tools and technology, and professionalism."}, {"course_name": "DMD 300: Digital Multimedia Design Studio", "department": "Digital Multimedia Design (DMD)", "credits": "3 Credits", "description": "Students adapt skills and knowledge of digital media to solve problems and communicate ideas in producing collaborative multimedia projects.  In DMD 300 Digital Multimedia Design Studio, students synthesize the concepts, theories, and applications acquired in the introductory courses and begin to think critically about their professional objectives. Students will work on projects aimed to help them understand available learning pathways and real world applications based on their scholarly and professional interests. Students will work collaboratively to investigate a problem space, conduct a needs assessment, write a design plan or proposal, develop deliverables, and implement and evaluate the final product(s). Students will develop a sense of stewardship over the project development process by completing project milestones that reinforce time management behaviors, participating in team building activities that facilitate discussion and interaction, co-authoring project proposals that prompt critical analysis, and distributing production tasks to encourage ownership in completing both defined and open-ended assignments. Students will also be required to thoroughly document and reflect on the production process and project impact through blogging and discussions. Through the duration of the course, students are encouraged to interact with industry advisors for feedback and direction as they work through real-world challenges in their selected digital tools and methodologies.", "prerequisite": "DMD 100"}, {"course_name": "DMD 400: Digital Multimedia Design Capstone", "department": "Digital Multimedia Design (DMD)", "credits": "3 Credits", "description": "In this capstone, students develop portfolio projects by applying creative production concepts, tools, and approaches to a contemporary issue.  DMD 400 Digital Multimedia Design Capstone is an advanced, senior-level capstone experience, students will synthesize the concepts, tools, and approaches learned throughout their studies and demonstrate competencies in creative and technical production in an applied human-centered thesis project. Students will work as change agents to address a critical, real-world, local or global issue or challenge and work through the design process to complete a capstone project. Students will explore processes in interdisciplinary problem spaces and connect to broader context of design decisions promoting agency over project outcomes, applications, deliverables, and knowledge-sharing. Student projects will include design proposals and/or implementations for digital or physical products and systems. To examine their understanding of design leadership, students will practice design thinking and production methods to generate project ideas, discover opportunities, and communicate intent; practice systems thinking to define the boundaries and impact of a problem space; and practice critical thinking to evaluate research issues, develop meaning, and inspire creative output. Students will be able to deploy project management skills to ensure on-time delivery of final project, communicate project concepts through visual models, and will leverage a variety of digital resources and methods to disseminate work in online contexts including social media, websites, and others.", "prerequisite": "DMD 100"}]