[{"course_name": "EBF 200: Introduction to Energy and Earth Sciences Economics", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "Resource use decisions and their effect on local, national, and global development. EBF 200 Introduction to Energy and Earth Sciences Economics (3) (GS)(BA) This course meets the Bachelor of Arts degree requirements. Facing the challenge of ever-increasing demand for energy, and limited energy resources to meet those demands, will be one of the great problems/opportunities of the 21st century. This class will help students understand and discuss the current event items you hear about every day, and help to prepare many of you to work to address this challenge. This class introduces the economic method of analysis to the environmental and resource questions facing society. It introduces a \"paradigm,\" a way of thinking, that has four elements : What advantages can be gained by using market forces? What are the drawbacks of the market (\"market failures\") that may lead to a rationale for government intervention? What are the drawbacks of using government intervention (\"government failure\")? How do you apply these three concepts to real-world situations?Examples are drawn from both the United State economy and from the worldwide community. Both analytical and quantitative methods are used to understand the environmental and resource challenges faced by modern society.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "EBF 301: Global Finance for the Earth, Energy, and Materials Industries", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "The aim of this course is to introduce fundamental concepts of financial management and illustrate their global applications."}, {"course_name": "EBF 304W: Global Management for the Earth, Energy, and Materials Industries", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "The real world is often complex and unstructured. A major goal of this course is to teach you how to structure \"real-world\" environmental and energy problems that involve business decisions in the face of uncertainty. The focus of this course is problems in environmental and resource management, but rather than teaching you specific facts, the goal of this course is to teach you how to think systematically about problems at the interface between business, society, and the environment. The course develops a number of tools for analyzing decision problems where impacts on the environment or human health and safety are important components. These tools include benefit-cost analysis, technological and environmental risk assessment, decision-making under uncertainty (perfect and imperfect information), and Monte Carlo analysis. Students will then use these models in the homework assignments and projects to solve a number of different decision problems.", "prerequisite": "EBF 200", "other": ["Writing Across the Curriculum"]}, {"course_name": "EBF 306W: Energy Land Contracts", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "In almost every country in the world, governments own the mineral resources under the ground. The United States is the exception to this rule. In the U.S. landowners are free to extract value resources beneath the soil. In addition, the \"rule of capture\" applies, so landowners do not have to worry about where particular resources that they have extracted were located originally. This combination of property rights and the legal rule of capture as led the creation of the field of energy land law in the U.S. For petroleum and natural gas firms, especially in Pennsylvania, understanding these legal rules and what they imply are crucial to the success of drilling operations. This course addresses three areas of energy land law. In the first, using the law and economics approach, it examines the economics of energy land law contracts. It first examines the rule of capture and the challenges to that rule in Pennsylvania law. It then focuses specifically on the use of contracts to protect the sunk costs inherent in investment in energy production. The second part of the course addresses the negotiation questions that are imbedded in energy land law. Students are taught the fundamentals of negotiation through classroom simulations that model energy negotiation challenges. Classroom simulations include negotiations dealing with common pool problems, acquiring energy leases, and recontracting among production companies. The third part of the class examines the ethical issues related to energy land contracts. These problems are generally addressed to questions of who owns pieces of information and who has the authority to release that information. Students are also taught the importance of establishing a strong reputation for honesty for themselves. The writing component of this class requires students to compose essays on a series of classroom experiment that are designed to replicate challenges in the area of energy land contracts. Students will be required to write essays that show that they understand the underlying economics of the various challenges in negotiating these contracts. In the course final project, students will be required to create and describe their own classroom experiment.", "prerequisite": "BLAW 243", "other": ["Writing Across the Curriculum"]}, {"course_name": "EBF 401: Strategic Corporate Finance for the Earth, Energy, and Materials Industries", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "The objective of this course is to give students a working knowledge of the major tools used by financial managers for making investment and financing decisions. Topics include, but are not limited to: time value of money, trade-off between risk and expected return, Capital Asset Pricing Model, valuation and role of debt and equity, capital budgeting/project evaluation techniques, cost of capital, cash flow estimation, real and financial options, company valuation, and capital structure decisions. As an illustration of the theory, we will discuss examples and cases, with a focus on the energy industry. Students will learn the fundamentals of capital budgeting and structure analysis; how capital structure decisions affect the value of the firm; and how to develop financial statements for energy projects.", "prerequisite": "EBF 200"}, {"course_name": "EBF 402: Energy Law and Contracts", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "An examination of the law that applies to acquiring the property rights for exploration and drilling of energy sources. This course examines the area of energy law and contracts, which is crucial to successful drilling in natural gas and oil properties. The course begins with a description of ownership and rights in the mineral estate, and how those rights have evolved over time. Students will be instructed in the how different types of land affect legal rights, and the details of the law of capture. They will also review the Statute of Frauds and examine how it applies to land drilling contracts. The second part of the course presents the basic tenents of real estate law, examining the seminal cases in this area. It will review the standard oil and gas lease used in the United States. Issues reviewed will include the nature of lease clauses and implied covenants, as well as farmout and joint operating agreements. It will also examine how royalty payments can be structured. Environmental regulation is a critical component of energy exploration. To address this topic, students will be introduced to the regulatory process. They will study regulatory compliance and how to deal with government officials. They will also be instructed in corporate liability for property clean up and pollution, and in strategies for minimizing both that liability and harm to the environment. In addition, the course will review topics of environmental due diligence and the joint and several nature of environmental liability.", "prerequisite": "BLAW 243"}, {"course_name": "EBF 410: Petroleum and Natural Gas Operations", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "The course is designed to instruct energy land management option students of the EBF major in the drilling of petroleum and natural gas wells and the challenges in that process.  E B F 410 Petroleum and Natural Gas Operations (3) Energy landmen graduating from the energy land management option (ELMO will work directly with natural gas and petroleum engineers on drilling projects. This course will present the basics of natural gas and petroleum operations, so that ELM graduates will be able to assist engineering and other personnel in solving drilling operating problems. After taking this course, ELM students will have the background to move to a production company and start their training in assisting at a well site. The challenges students will be introduced to include (i) being able to develop plans for oil and gas field drilling, as well as for product recovery and treatment, (ii) coordinating the installation, maintenance, and operation of mining and oil field equipment, (iii) assessing costs and estimating production capabilities and economic value of oil and gas wells, (iv) evaluating the economic viability of potential drilling sites, and (v) participating in the completion and evaluation of wells, well testing, or well surveys.Students will also have an understanding of several other important facets of drilling operations, including (i) maintaining records of drilling and production operations, (ii) writing reports on the success or lack thereof of particular wells, and (iii) becoming aware of the challenges involved in the removal of drilling equipment, the removal of any waste, and the safe return of land to structural stability when wells are exhausted.", "prerequisite": "PHYS 211"}, {"course_name": "EBF 411: Petroleum and Natural Gas Geology for Land Professionals", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "This course provides energy land students with a knowledge base, as well as a set of notes and references, that they can draw on during a career in the petroleum industry.  E B F 411 Petroleum and Natural Gas Geology for Land Professionals (3) The aim of this course is to provide students with a knowledge base, as well as a set of notes and references,that they can draw on during a career in the petroleum industry. This course will cover most aspects of geology and petroleum geology that students are likely to encounter in their professional endeavors. Open note examinations will encourage students to take well organized and thorough notes that can be used as a future reference. Two class projects are designed to reinforce the petroleum systems concept, which is probably the single most important concept in this course. Throughout the course, key concepts will be illustrated with examples from the Pennsylvania portion of the Appalachian Basin. This is an active petroleum province, and many oil and gas companies in the Pittsburgh area are involved in exploration and production in this field setting. This course does not cover petroleum engineering.The course begins with an overview the geologic subdisciplines that are most pertinent to petroleum geology. In the second part of the course, the petroleum system is reviewed. The third part of the course is designed to introduce students to the various roles that geologists play at petroleum companies. Finally, the concept of the petroleum system is extended to unconventional plays, which will play an increasingly large role in the petroleum industry in the coming decades. Depending on time constraints, the course may include some discussion of the world's remaining petroleum reserves.", "prerequisite": "GEOSC001"}, {"course_name": "EBF 472: Quantitative Analysis in Earth Sciences", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "Quantitative analysis of decision making in atmospheric/geophysical sciences: exploratory data analysis, quantification of uncertainty, parametric/non- parametric testing, forecasting, time series analysis.", "prerequisite": "MATH 110"}, {"course_name": "EBF 473: Risk Management in Energy Industries", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "All major firms engage in financial risk management. In this course, we will learn quantitative techniques for describing of how firms can use financial instruments to manage their financial risk. In particular, we will focus on risk management with respect to threats to financial viability from the weather. The course takes a highly statistical approach to the valuation and analysis of financial derivatives such as futures and options. Specific topics to be covered include the structure and pricing of options, the theory of arbitrage, financial statistics and the use of options to hedge financial risk. Students will gain experience using the Black-Scholes equation to value financial options, and will also learn strategies for hedging financial exposure to large commodity price variations. The techniques discussed in this class will be primarily illustrated using weather and energy commodity derivatives, but can be applied to a large variety of different commodity markets.", "prerequisite": "EBF 200"}, {"course_name": "EBF 483: Introduction to Electricity Markets", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "This course is designed to teach students about the structure of the electricity industry, the regulatory institutions that oversee the industry, and the new market institutions that have been put into place since electricity restructuring. Much of the focus will be on the U.S. electricity industry. Since Pennsylvania has been a national leader in electricity restructuring, we will place particular emphasis on events in the Mid-Atlantic region, but will also discuss other market structures in the U.S. and in other countries. Specific topics covered will include cost models for power generation, transmission and distribution; rate of return regulation for electric utilities; the process of electricity restructuring and creation of electricity markets; Locational Marginal Pricing of electric energy; financial risk management in electric power; and detecting and mitigating market power.", "prerequisite": "EBF 200"}, {"course_name": "EBF 484: Energy Economics", "department": "Energy Business and Finance (EBF)", "credits": "3 Credits", "description": "What is the role of energy in the economic system? What are the implications of the energy transformation on economic welfare? How can we efficiently meet new demand while also addressing the myriad social, environmental, and regulatory challenges related to the energy system? This course will examine these questions from an intermediate microeconomics perspective. The course covers topics in the organization and conduct of firms operating in energy markets, measuring and detecting the manipulation of energy markets, and regulating the environmental impacts of energy production, delivery and consumption.", "prerequisite": "MATH 110"}, {"course_name": "EBF 497: Special Topics", "department": "Energy Business and Finance (EBF)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "EBF 499: Foreign Study", "department": "Energy Business and Finance (EBF)", "credits": "1-15 Credits/Maximum of 15", "description": "This course is designed to enable students to study in EBF study abroad programs.", "other": ["International Cultures (IL)"]}]