[{"course_name": "EDUC 99: Foreign Studies", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDUC 100: First-Year Seminar in Education", "department": "Education (EDUC)", "credits": "1-3 Credits", "description": "This seminar explores theories of teaching and learning, the education of teachers and other school employees, issues of professional practice, and selected topics in national educational policy. The seminar also supports students' transition to college through small group discussions and other activities. Class sizes are limited; the frequency of offering and evaluation methods vary by location and instructor.", "other": ["First-Year Seminar"]}, {"course_name": "EDUC 197: Special Topics", "department": "Education (EDUC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EDUC 199: Foreign Studies", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Study of educational topics in a country other than the United States.", "other": ["International Cultures (IL)"]}, {"course_name": "EDUC 205N: Critical Race Theory in the Humanities and Social Sciences", "department": "Education (EDUC)", "credits": "3 Credits", "description": "This course closely examines the place and power of race in America. By tracing the history of how race works in particular American institutions, such as public education, criminal justice, and federal housing, students will gain a deep sense of how social categories and understandings shape material conditions and human welfare. Through the study of policies, court cases, memoirs, documentary films, and freedom struggles, this course will interrogate the many Americas that race has created and their implications for democracy and justice. Not only will this course focus on making race visible, but also the many ways that race intersects with class, gender, and sexuality and how these concepts empower and marginalize at the same time. All the while, students will use Critical Race Theory methods to reach empathy and strengthen social (GS) and historical (GH) literacies. Discussion, writing, critical reading, and primary source analysis will be integral to this class. Class sessions will include whole- and small-group discussion where active listening and thoughtful participation will be taught and required. Students will be encouraged to explore their own conceptions of race and how those ideas shape knowledge and experience. Ultimately, this is a course that will weave data, theory, and story as we encourage students to move toward empathy through comprehensive understandings of race. This course therefore examines race as both deeply personal and structural.", "other": ["Cross-listed with: CRIMJ 205N, SOC 205N", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EDUC 294: Research Project Courses", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "EDUC 295: Internship", "department": "Education (EDUC)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, non-group instruction including field experience, practica, or internships."}, {"course_name": "EDUC 297: Special Topics", "department": "Education (EDUC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EDUC 299: Foreign Studies", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDUC 302: Basic Preparation for Teaching", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Philosophical, psychological issues in education; instructional objectives, lesson planning; evaluation, grading procedures; assessment, instruction of individual children. Field experience.", "prerequisite": "admission into Elementary Education Major"}, {"course_name": "EDUC 303: Inclusive Practices in General Education Classrooms", "department": "Education (EDUC)", "credits": "3 Credits", "description": "This course is designed to examine the procedures, characteristics and strategies for working with special learners in the elementary school.  EDUC 303 Inclusive Practices in General Education Classrooms (3) This course examines the foundations and strategies for educating exceptional learners and for including students with disabilities in general education classrooms /inclusive settings, grades PK-4 and 4-8. Students will gain the knowledge and skills to respond effectively to learners with varying abilities and diverse needs in inclusive classrooms. Course content will address the following: foundations for inclusive education including legal provisions, ethical principles and policies; characteristics of various disabilities; the special education process including evaluation, IEP and service delivery models; assessment of student learning in a standards aligned system including diagnostic, formative, benchmark and summative assessment; pre-referral intervention, including universal screening and response to intervention; evidence-based instructional strategies that are effective in meeting the needs of students with disabilities in inclusive settings including universal design, accommodations, modifications and adaptations of curriculum and instruction, differentiated instruction, improving memory, attention and independent learning; and partnerships including effective communication and collaboration, teaming, co-teaching and communication with families. The course format will include discussion, collaborative group work, student presentations, simulations, classroom observations, case studies, online activities, review of research and some lectures.", "prerequisite": "seventh-semester standing in Elementary Education Major"}, {"course_name": "EDUC 304: Classroom Organization and Management", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Organization, integration of the elementary school day; classroom management, control techniques; audio-visual techniques.", "prerequisite": "sixth-semester standing in Elementary Education Major"}, {"course_name": "EDUC 305: Creative Arts", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Experiences in self-expression through a variety of visual and performing arts. Techniques for guiding school children in artistic expression.  EDUC 305 Creative Arts (3) This is an arts education course for elementary education majors. The course is designed to provide pre-service teachers with knowledge of the elements of the performing arts and the visual arts. Today's public school population is diverse, and teachers encounter heterogeneous groups of students with unique interests, distinctive strengths, special needs, and varied languages. The arts provide a beneficial bridge to assist teachers in connecting with all persons. Not only do the arts enhance the quality and depth of lesson content, each of the arts contains the possibility of reaching students of all levels and backgrounds no matter what their cognitive ability, learning style, or native language. The purpose of this course is to equip students with the necessary tools to implement meaningful and effective arts education into the regular education curriculum.", "prerequisite": "Admission to ED program"}, {"course_name": "EDUC 306: Physical Education, Health, and Safety in Elementary Schools", "department": "Education (EDUC)", "credits": "2 Credits", "description": "A study of appropriate activities for elementary-age children. Student participation in physical activities is required. This course is designed to prepare elementary classroom teachers to provide age appropriate instruction related to issues of health and safety encountered in the school, home, and community. Understanding and demonstrating a knowledge of foundations, lesson planning, instructional strategies, and assessment is a key component of the program. In addition, the pre-service teachers are prepared to organize and implement physical education activities that may be carried out in the classroom, playground and/or appropriate indoor facilities. The physical education aspects of the program are generally provided as ancillary activities to the program provided under the guidance and direction of a certified Health and Physical Education instructor.", "prerequisite": "5th semester standing"}, {"course_name": "EDUC 313: Field Observation", "department": "Education (EDUC)", "credits": "2 Credits", "description": "Observation techniques; classroom observation and participation.", "prerequisite": "EDUC 314"}, {"course_name": "EDUC 314: Learning Theory and Instructional Procedures", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Theories of learning in relation to instructional practices. Analysis of motivation, transfer of learning, and retention. Field practicum.", "prerequisite": "EDUC 313"}, {"course_name": "EDUC 315Y: Social and Cultural Factors in Education", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Critical examination of how different experiences linked to race, ethnicity, religion, gender, and sexual orientation influence education.", "prerequisite": "admission into Elementary Education Major or Secondary Teacher   Certification Program", "other": ["United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "EDUC 320: Methods in Teaching Beginning Readers", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Concepts, methods, and materials for developing beginning reading abilities, with emphasis on personalized instruction through diagnostic teaching.", "prerequisite": "sixth-semester standing in Elementary Education Major"}, {"course_name": "EDUC 321: Methods in Teaching Intermediate and Advanced Readers", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Concepts, methods, and materials for personalizing reading instruction with emphasis on extending personal and functional reading abilities beyond beginning reading.", "prerequisite": "EDUC 320"}, {"course_name": "EDUC 322: Adolescent Literature and Developmental Reading", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Adolescent literature materials, reading principles, and practices suitable for an English class.  EDUC 322 Adolescent Literature and Developmental Reading (3) This course is designed to prepare candidates with the objectives, content, methods and knowledge necessary to teach adolescent literature in today's secondary language arts classrooms in middle and high schools. Candidates will gain understandings of adolescent literature in contemporary sociocultural life and how it can be used to develop critical literacy perspectives, reading strategies, and communication that is developmentally appropriate for 21st century literacy. Particular emphasis will be placed on instructional methods to comprehend, interpret, evaluate, integrate prior experience, and apply a range of texts (print, non-print, digital, and multimodal) in authentic contexts; developing and struggling adolescent readers will be highlighted. Course readings include research-based, adolescent literacy publications as well as a selection of adolescent literature. Adolescent literature selections include social and cultural issues relevant to adolescent development and diverse student populations. Candidates will compose and discuss critical responses to readings, participate in and contribute to the design of literature circles to discuss adolescent literature selections, and develop research-based lesson plans consistent with Commonwealth of Pennsylvania Common Core standards (PACC) and NCTE/IRA Standards for the English Language Arts. This course adheres to professional and content area standards and practices from: National Council of Teachers of English (NCTE), the National Writing Project (NWP), International Reading Association (IRA), and National Center for Literacy Education (NCLE).", "prerequisite": "Admission to ED program"}, {"course_name": "EDUC 352: Teaching Language Arts", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Teaching the writing process, including speaking and listening skills in relation to oral and written composition.", "prerequisite": "sixth-semester standing in Elementary Education Major"}, {"course_name": "EDUC 353: Teaching Elementary Social Studies", "department": "Education (EDUC)", "credits": "3 Credits", "description": "The theory and practice of elementary social studies instruction.", "prerequisite": "seventh-semester standing in Elementary Education Major"}, {"course_name": "EDUC 371: Teaching Music in the Elementary School", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Music methods course for elementary education majors; students will learn elements of music, and instructional techniques.", "prerequisite": "seventh-semester standing in Elementary Education Major"}, {"course_name": "EDUC 385: Professional Development in Teaching", "department": "Education (EDUC)", "credits": "3 Credits", "description": "This course addresses practical issues central to the profession of teaching and, in some cases, specific to Pennsylvania.", "prerequisite": "eight-semester standing, approval of program"}, {"course_name": "EDUC 395: Internship", "department": "Education (EDUC)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, non-group instruction including field experiences, practica, or internships. Written and oral critique of activity required. A specific title may be used in each instance and will be entered on the student's transcript."}, {"course_name": "EDUC 397: Special Topics", "department": "Education (EDUC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EDUC 399: Foreign Studies", "department": "Education (EDUC)", "credits": "1-12 Credits", "description": "Courses offered in foreign countries by individual or group instruction", "other": ["International Cultures (IL)"]}, {"course_name": "EDUC 400: Diversity and Cultural Awareness Practices in the K-12 Classroom", "department": "Education (EDUC)", "credits": "3 Credits", "description": "This course addresses diversity, cultural awareness and sensitivity about cultures, concepts and methods in society, communities and educational settings.  EDUC 400 Diversity and Cultural Awareness Practices in the K-12 Classroom (3)This course is an examination of diverse cultures, stereotypes, concepts and issues that impact the way individuals interact with one another in society. In relation to EDUC 315, it takes students to the next level as they experience cultural attributes from a media perspective, as well as being immersed into diverse settings throughout the course. It is designed for students to develop sensitivity and awareness of cultural influences in America and the public school systems. An emphasis is placed on sociopolitical aspects of the United States and other world cultures, sources of cross-cultural conflict, and approaches to cross-cultural conflict resolution as they relate to P-12 settings, their communities and the communities in which they teach. Cultural awareness is concrete and/or visible in society and is necessary for promoting sensitivity and respect of cultural beliefs and values amongst teachers, administrators and students. Course participants will be required to demonstrate knowledge of with regard to developing sensitivity and awareness of cultural influences on behavior as these relate to the community, society and schooling processes. Course participants will be required to analyze methods of teaching Multicultural Education and its various camps including: Culturally Responsive Pedagogy, Critical Multiculturalism, and Anti-Racist Pedagogy. The creative tension between dominant and subordinate voices will lead to both visual and written responses. The major goal of the course is to help students identify their diversity in American society and to develop their own creative voices, while drawing on issues of race, ethnicity, gender, geographical location, sexual identity, age, ability, social class, social status and other cultural attributes that make individuals uniquely diverse."}, {"course_name": "EDUC 402: Early Learning: Language and Concept Development", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Examining the development of language and self-expression in young children, and the role of children's literature in facilitating development.  EDUC 402 Early Learning: Language and Concept Development (3) This course examines foundations and strategies related to encouraging language development and concept acquisition of young children infant through age five. Students will gain the knowledge and skills to design relationships, environments, activities, and responses to young children at varying stages of early language and conceptual development. Course content will address the following: foundations for approaches to early learning including young children's characteristics, multiple factors that influence child construction of language and concept development, the importance of teacher child relationships, the emerging nature of children's learning patterns, and the benefits of providing books and experiences that support present knowledge levels while challenging new learning. Students will gain knowledge to use to design supportive relationships, documentation of observation, other assessment tools, and intentional instructional strategies that encourage early development of vocabulary and content concepts.Students will design instruction that encourages child awareness of concepts of receptive language, such as phonemic awareness; concepts of self-expression, such as vocabulary, concepts of comprehension, such as read aloud recall; concepts of early writing, such as alphabet and phonics; and concepts related to reading, such as illustrations and meaning. In science, students will design instruction that encourages child awareness of the value of questioning, observing and experimenting for answers about life science, earth science and physical science issues. In mathematics, students will design instruction that encourages child awareness of numbers, operations, geometry, measurement, patterns, and data representation. In social studies, students will design instruction that encourages child awareness of concepts related to families, communities, early economics, and local geographical characteristics. In the arts, students will design instruction that encourages child awareness of ways to express self with drawings, paintings, sculpture, drama, music and dance. In the areas of social and emotional skills, students will design instruction that encourages child sensitivity to social and emotional skills that do and do not work well in group settings. Emphasis will be placed on the need to differentiate instruction for each young learner and the need to differentiate relationship interactions with each family. The course format will include discussion, collaborative group work, student presentations, simulations, child care classroom observations, case studies, online activities, review of research and some lectures. In addition, each student will design and complete a teacher inquiry."}, {"course_name": "EDUC 403: Curriculum for Early Childhood", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Examining early childhood programs and methodology, focusing on areas of social studies, mathematics, and science."}, {"course_name": "EDUC 404: Young Children's Behavior: Observation and Evaluation", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Observation, recording and evaluation of student behaviors, and the use of prescription techniques for early childhood students with special needs."}, {"course_name": "EDUC 408: Administration of Early Childhood Education Programs", "department": "Education (EDUC)", "credits": "3 Credits", "description": "The role of the early childhood administrator as it relates to regulations, staffing, management, funding and curriculum.", "prerequisite": "EDUC 401"}, {"course_name": "EDUC 410: The Child and Social Institutions", "department": "Education (EDUC)", "credits": "3 Credits", "description": "The effects of the family on a child's development, especially in the infancy and preschool years."}, {"course_name": "EDUC 414: Teaching Secondary Science", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Study of the objectives, content, methods, and evaluation procedures of science. This course is designed to prepare students with the knowledge and methods necessary to teach secondary science in authentic integrative contexts. Teaching science with integrative concepts requires educators to be proficient in integrating various technologies and highlighting interdisciplinary connections to other disciplines such as engineering (the national and state standards for science call for science educators to teach both science and engineering concepts). Science pedagogies, strategies, approaches, content knowledge, and practices needed to teach with a focus on building students' problem-solving skills and understanding will be highlighted. Research-based learning theories and their role in science classrooms/labs are discussed and sample teaching strategies are safely modeled. Discussions are also based on prior and/or current field experiences and case study analyses. State and national science, technology, and engineering standards emphasized and demonstrated throughout the course. Long- and short- range planning of teaching units and lesson plans address disciplinary core content, practices, assessment, technological integration, historical connections and current trends in science and engineering education disciplines, equity for all students, English learners, and adaptations or modifications for students with special needs. A problem-solving/constructivist approach to learning and assessment is emphasized. Students are engaged in cooperative learning experiences, using lab equipment/materials and technology such as spreadsheets, statistical simulation and analysis software, and probeware. They are assessed through both formative and summative evaluations, including the creation of an interdisciplinary secondary science unit plan. The content and processes of scientific inquire and engineering design emphasized throughout this course are presented with three principal goals in mind: (1) to inform students about current research related to teaching science and engineering, (2) to enhance students' pedagogical scientific and engineering knowledge and skills, and (3) to help students develop as competent secondary science teaching professionals.", "prerequisite": "EDUC 314"}, {"course_name": "EDUC 415: Teaching Secondary Social Studies", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Study of the objectives, content, methods, and evaluation of procedures of social studies. Students design units and lesson plans.  EDUC 415 Teaching Secondary Social Studies (3) This course is designed to prepare social studies candidates with the teaching methods and content knowledge required to teach the many social studies subjects at the middle and high school level. Stressing a constructivist approach, students learn to utilize various instructional strategies to meet learning goals and objectives based on the National Council for the Social Studies (NCSS) thematic strands and relevant PA Academic and Core Standards. Long and short range planning of teaching units address content, assessment, technological integration, historical connections, equity for all students, ELL, and adaptations for special needs students. Students engage in focused classroom discussions on assigned readings and analyze critical issues in teaching social studies in order to develop a coherent and relevant social studies teaching and assessment philosophy. Students are evaluated based on lesson planning competence, the knowledge of and ability to promote NCSS thematic strands and PA standards in both planning and teaching, leading discussions on relevant social studies topics and readings, implementing a preplanned lesson to the class, and the development of a complete middle level or high school level unit of study.", "prerequisite": "EDUC 315Y"}, {"course_name": "EDUC 416: Teaching Secondary English and the Humanities", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Study of the objectives, content, and methods of English and humanities courses.  EDUC 416 Teaching Secondary English and the Humanities (3) This course is designed to prepare candidates with the objectives, content, methods and knowledge necessary to teach English in today's secondary classrooms in middle and high schools. The pedagogical approaches, dispositions, and skills appropriate for adolescent learners will be highlighted. Instructional strategies include multiple types of texts, genres, and modes to address diverse learners' needs and 21st century literacies in society and the workplace. Developmentally appropriate practices and theories will be discussed and modeled. Course content, strategies, and dispositions are consistent with literacy research, adolescent development, best practice pedagogy, and content and professional standards appropriate for English language arts candidate preparation. This course adheres to professional and content area standards and practices from: National Council of Teachers of English (NCTE), the National Writing Project (NWP), International Reading Association (IRA), and National Center for Literacy Education (NCLE). Candidates will design a range of learning experiences for their future students consistent with Commonwealth of Pennsylvania Common Core standards (PACC) and NCTE/IRA Standards for the English Language Arts. Candidates will engage with constructivist learning practices that center on collaboration, authentic learning, critical reflective practice, ongoing assessment, instructor coaching, and peer review.", "prerequisite": "EDUC 315Y"}, {"course_name": "EDUC 417: Teaching Secondary Mathematics", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Study of the objectives, content, methods, and evaluation procedures of mathematics.  EDUC 417 Teaching Secondary Mathematics (3) This course is designed to prepare students with the methods and knowledge necessary to teach mathematics in today's middle level and secondary classrooms. The pedagogical approaches and content needed to teach with a focus on understanding will be highlighted. Learning theories and their role in the mathematics classroom will be discussed and sample teaching strategies will be modeled. Discussions will also be based on field experiences and case study analyses. The National Council of Teachers of Mathematics standards addressed in the Principles and Standards for School Mathematics (2000), the Common Core State Standards for Mathematics (2010), the PA Core Standards in Mathematics (2013), as well as the Pennsylvania Standards Aligned System will be emphasized and demonstrated throughout the course. Long and short range planning of teaching units will address content, assessment, technological integration, historical connections, equity for all students, ELL, and adaptations for special needs students. A problem solving/constructivist approach to learning and assessment will be emphasized. Students will be engaged in cooperative learning experiences, use manipulatives and technology, and will be assessed through both formative and summative evaluations. The content and processes of mathematics emphasized throughout this course will be presented with three principal goals in mind: to inform students about current research related to teaching mathematics, to enhance students' pedagogical mathematical knowledge and skills, and to help students develop as competent mathematics teaching professionals.", "prerequisite": "EDUC 315Y"}, {"course_name": "EDUC 418: Positive Classroom Climate for Positive Attitudes About Learning", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Participants will learn strategies for creating classroom climates which encourage positive attitudes toward learning while preventing and correcting student misbehavior.", "prerequisite": "permission of program"}, {"course_name": "EDUC 421: Children's Literature", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Knowledge of literature appropriate for elementary school children and utilization of literature-related activities in teaching reading.", "prerequisite": "admission into Elementary Education Major"}, {"course_name": "EDUC 422: Literature for Children and Adolescents", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Literature for children and adolescents, approaches for using such literature in the school curriculum.  EDUC 422 Literature for Children and Adolescents (3)This course, which is required for students enrolled in the Reading Specialist Program and those who wish to complete the language arts option in the Teaching and Curriculum Program, is designed to assist Pre-K through grade 12 educators who are interested in incorporating children's and/or adolescent literature into the curriculum. The course will focus on an in-depth exploration of selecting, evaluating, and using a wide range of contemporary (published in the last ten years) literature for children and young adults. This course will provide participants the opportunity to explore reader response theory and its relationship to classroom teaching practices, in particular to reading and literacy instruction. The study and application of principles and techniques of integrating literature circles, discussion strategies and literature extension projects will be addressed."}, {"course_name": "EDUC 425: Literacy Assessment", "department": "Education (EDUC)", "credits": "3 Credits", "description": "This course emphasizes alternative literacy measures focusing on portfolio assessment and performance assessments.", "prerequisite": "permission of the program"}, {"course_name": "EDUC 432: Children's Literature in Teaching Writing", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Introduction to introduces methods for transferring writing skills and literary devices from literature to student writing in all subject areas."}, {"course_name": "EDUC 435: Addressing the Needs of Special Learners", "department": "Education (EDUC)", "credits": "1 Credits", "description": "An examination of attitudes toward, barriers experienced by, and special needs of special learners in the schools.", "prerequisite": "eighth-semester standing in Secondary Teacher Certification   Program"}, {"course_name": "EDUC 436: Inclusion Practices in Education", "department": "Education (EDUC)", "credits": "3 Credits", "description": "The educational, social, and political foundations for inclusion practices in public education.", "prerequisite": "permission of program"}, {"course_name": "EDUC 440: Educational Statistics and Measurements", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Descriptive statistics, correlation, reliability, validity, scaling techniques, and introduction to item analysis."}, {"course_name": "EDUC 450: Current Topics in Education", "department": "Education (EDUC)", "credits": "1-15 Credits/Maximum of 15", "description": "No description."}, {"course_name": "EDUC 452: Teaching Writing", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Techniques for teaching the writing process, kindergarten through grade 12, including writing in content areas; workshop format."}, {"course_name": "EDUC 454: Modern Elementary Science Education", "department": "Education (EDUC)", "credits": "3 Credits", "description": "This course exposes candidates to content, knowledge and teaching pedagogy as they relate to science and science education. The science content knowledge is primarily focused on Biological Sciences, Physical Sciences and Earth and Space Sciences at the K-5 level. Current research is sued to ensure that the best practices in teaching and learning K-5 Sciences are explored. At the conclusion of this course, all candidates should have a strong understanding of the best practices in teaching and learning K-5 science. Candidates should have an awareness of the Physical Sciences, Biological Sciences, and Earth Space Sciences taught at the K-5 level. They should be able to utilize best practices in the teaching of these sciences.", "prerequisite": "Admission to ED program"}, {"course_name": "EDUC 458: Behavior Management Strategies for Inclusive Classrooms", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Provides knowledge and skills essential for designing positive learning environments in secondary classrooms with the inclusion of exceptional learners.  EDUC 458 Behavior Management Strategies for Inclusive Classrooms (3)Well-organized and effectively managed classrooms provide task-focused instructional environments where students are actively engaged in learning. The inclusion of exceptional learners in the general education classroom has brought the need for a unique set of knowledge and skills to promote student task engagement and prosocial behavior. Topics to be addressed include: characteristics and specific (or unique) needs of exceptional learners and their effect on student learning; components of effective classroom organization and management; principles of applied behavior analysis and research-based behavior management strategies appropriate for use with exceptional learners in the secondary classroom. This course will be a required course for all Secondary English, Math, and Social Studies students seeking initial certification. Course delivery methods will include lectures, reflections, online discussions, projects, class presentations, library research, and other relevant media", "prerequisite": "admission to teacher education"}, {"course_name": "EDUC 459: Strategies for Effective Teaching in Inclusive Classrooms", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Course examines effective strategies for accommodating and adapting instruction for exceptional learners in secondary classrooms.  EDUC 459 Strategies for Effective Teaching in Inclusive Classrooms (3)This course will examine strategies for teaching exceptional students in inclusive secondary classrooms. The course will focus on academic assessment; instructional planning, development and implementation; and strategies for making the curriculum more accessible, flexible and supportive for diverse learners. Topics to be addressed include the following: multidisciplinary evaluation and programming for exceptional learners; designing instruction based on assessment data; progress monitoring; technology for teaching and learning as a way to promote access to curriculum; designing appropriate and legally acceptable accommodations and/or modifications to promote access to the standards-based curriculum for students with exceptional learning needs; research-based instructional strategies to facilitate literacy development and instruction across academic content areas and collaborative structures to support exceptional learners in general education classrooms. This course will be required for all Secondary English, Math, and Social Studies Education students seeking initial certification and will be offered during the 8th semester (student teaching) to optimize performance of students during their student teaching experience. Course delivery methods will include lectures, reflections, online discussions, projects, class presentations, case studies, and other relevant forms of media.", "prerequisite": "admission to Teacher Certification Program or Approval of program"}, {"course_name": "EDUC 463: Teaching With Modern Web Technologies", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Relates educational theory and practice to applications of the modern Web, applying content from educational foundations, curriculum, and research.  EDUC 463 Teaching With Modern Web Technologies (3) This course focuses on the World Wide Web as a valuable resource for P-12 education. Designed for teachers, curriculum supervisors, and building administrators, this course relates educational theory and practice to applications of the Web and Web 2.0 technologies in classrooms and schools. Class participants apply resources available through the Web to content from the fields of educational foundations, learning theories, curriculum development, educational assessment and evaluation, and educational research. The impact that the Web and technology in general has had on the educational experience of both teachers and students, including the working relationship between the two, is also a main focus. Students maintain a documentation of weekly assignments that form the basis for the final project: the development of a web-based teaching portfolio. Students also complete a mid-term project that entails the design of an online learning activity for students that utilizes Web technologies. This activity requires the student to apply principles of learning theory to web-based resources identified and evaluated to support an identified classroom learning objective or set of objectives. The final project consists of a technology-based teaching portfolio, demonstrating application of the key concepts covered in the course."}, {"course_name": "EDUC 464: Technology and the Learning Process", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Evaluates the relationship between technology-based resources and learning theories through design, implementation, and evaluation of online instructional modules.  EDUC 464 Technology and the Learning Process (3)Designed for teachers, curriculum supervisors, and building administrators, this course examines and evaluates the relationship between technology-based resources and learning theories. Students explore learning theories in terms of how technology may or may not support implementation of those theories in the classroom. Students also examine problem-based learning approaches and how they can be combined with technology, resulting in what has been defined by Dr. Bernie Dodge as a 'WebQuest' for classroom use. In the WebQuest development process, students identify a real life problem for their students to solve. They correlate that problem to their academic standards and district curriculum. They then design, implement, and evaluate instructional modules with integrated technology resources designed to lead to a solution of the identified problem, while promoting student acquisition of higher order thinking skills. Through this experience, students must plan for their students' learning tasks and activities, resource needs, performance evaluation and rubrics. As a culminating experience, students design an action research project related to the implementation of their learning module in the classroom setting.", "prerequisite": "EDUC 463"}, {"course_name": "EDUC 465: Serving Culturally and Linguistically Diverse (CLD) Learners", "department": "Education (EDUC)", "credits": "3 Credits", "description": "The course provides teachers with knowledge, understandings, and skills to engage culturally and linguistically diverse (CLD) students in mainstream classrooms.  EDUC 465 Serving Culturally and Linguistically Diverse (CLD) Learners (3)This course is designed to encourage understandings and appreciation for linguistic and cultural diversity, and to enhance the knowledge and skills of teachers working with culturally and linguistically diverse learners, their families, and their communities. The six areas of emphasis within EDUC 465 are as follows: a) the legal, historical, and cultural implications of ESL, which explores the legal and historical bases of ESL and analyzes the differences among home and school cultures, especially as they relate to language; b) multicultural education, which focuses on helping teachers acquire knowledge, develop cultural sensitivity, and identify educational strategies that address the needs of multilingual and multicultural learners and their families; c) a brief overview of first and second language acquisition theories; d) developmentally appropriate teaching strategies for culturally and linguistically diverse learners specifically related to their speaking, listening, reading, and writing skill development; e) Pennsylvania and TESOL standards and the Pennsylvania ELL assessment systems; and f) the integration of language components across the curriculum. This course aims to provide theoretical understandings of culturally responsive teaching and pedagogical strategies for CLD learners."}, {"course_name": "EDUC 466N: Foundations of Teaching English as a Second Language", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Overview of various legal, historical, and socio-cultural implications of teaching and learning English as a Second Language. This course is the first course in a five-course sequence designed to meet the Pennsylvania Department of Education's (PDE) requirements for the ESL Program Specialist endorsement. EDUC 466 addresses the legal, historicalm, and socio-cultural issues related to non-native speakers of English, and the implications for ESL curriculum, instruction, and assessment within the K-12 school setting. The course is designed: (1) to encourage understanding and appreciation for language diversity and culture, and (2) to enhance the knowledge and skills of teachers working with culturally and linguistically diverse learners, their families, and their communities. The course specifically addresses two of the PDE competencies necessary for a teacher to acquire in order to be endorsed as an ESL Program Specialist: PDE Competency IV-Developing cultural awareness/sensitivity. The four areas of emphasis within EDUC 466 are: a)The legal, historical, and cultural implications of English as a Second Language, which explores the legal and historical bases of ESL and analyzes the differences among home and school cultures, especially as they relate to language; b)Fundamentals of developing English language skills, which provides an introduction to the structure of the English language, grammar, and pronunciation, including lexical, morphological, syntactical, and phonological components; c) An overview of second language acquisition, which introduces the topics of linguistic skill development, and first and second language acquisition; and d) Multicultural education, which focuses on helping teachers acquire knowledge, develop cultural sensitivity, and identify educational strategies that address the needs of multilingual and multicultural learners and their families.", "prerequisite": "EDPSY 10", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EDUC 467: English Language Structure for English as a Second Language Teachers", "department": "Education (EDUC)", "credits": "3 Credits", "description": "An in-depth study and review of general linguistic concepts and their application to ESL pedagogy.  EDUC 467 English Language Structure for ESL Teachers (3) EDUC 467 is the second course in a four-course, 12-credit sequence designed to meet the Pennsylvania Department of Education's (PDE) requirements for an ESL Program Specialist Certificate. The 12-credit sequence which has previously been approved by PDE has been offered as 'Special Topics' courses. The 12-credit sequence is consistent with other approved ESL certificate programs. EDUC 467 introduces students to general linguistic concepts and their application to ESL pedagogy and practice. The course provides an intensive study and review of major linguistic concepts and issues, including but not limited to: phonetics, phonology, morphology, syntax, semantics, pragmatics and discourse analysis, sociolinguistics and dialectology, historical linguistics and world languages, and writing systems. The course specifically addresses two of the PDE competencies necessary for a teacher to acquire to meet the minimum requirements as an ESL Program Specialist: PDE Competency I-English usage and developing linguistic awareness; and PDE Competency III-English language learners [ELLS] language and language services knowledge. The three areas of emphasis within EDUC 467 are:a)Language and communication , which explores the use of dictionaries, English use and usage, social conventions and English usage, American English variations, meaning and significance. b)Grammar, pronunciation, literacy development for second language learners,which focuses on the significance of these areas for ESL learners; and c)Evaluative classroom instruments to measure student progress in grammar, pronunciation and English language structure,which highlights the incorporation of linguistic tools in the assessment of ESL learners' language skills and needs.", "prerequisite": "EDUC 100"}, {"course_name": "EDUC 468: Language Acquisition for English as a Second Language Teachers", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Study of the theory, research, and processes involved in first and second language development, acquisition, and assessment.  EDUC 468 Language Acquisition for ESL Teachers (3) EDUC 468 is the third course in a four-course sequence designed to meet the Pennsylvania Department of Education's (PDE) requirements for an ESL Program Specialist Certificate. The 12-credit sequence has previously been approved by PDE. The 12-credit sequence is consistent with what other PDE-approved ESL certificate programs offer. This course builds upon EDUC 466, Foundations of Teaching English as a Second Language, and EDUC 467, English Language Structure for Teachers, with an emphasis on the processes involved in second language acquisition. EDUC 468 explores first and second language learning, socio-cultural contexts and learner variables, and the issues related to cognition and developmental psycholinguistics. The course specifically addresses two of the PDE competencies necessary for a teacher to acquire to meet the minimum requirements as an ESL Program Specialist: PDE Competency I-English usage and developing linguistic awareness; and PDE Competency III-English language learners [ELLS] language and language services knowledge. The four areas of emphasis within EDUC 468 are:a)Learning a first language,which provides an in-depth study of the process involved in the acquisition and development of first language interrelations between psycholinguistics and cognition, as well as understanding of the processes involved in the acquisition and development of language in human species. b)Learning a second language , which explores the interrelationships between psycholinguistics and cognition, and first and second language acquisition, as well as identifying issues related to developmental psycholinguistics? c)Differences in how children, adolescents and adults learn language , major contributions of leaders in the field of the psychology of language learning. d)Evaluative classroom instruments to measure student progress in listening, speaking, reading and writing,which identifies linguistic tools that can be used to assess the language skills and needs of ESL learners.", "prerequisite": "EDUC 100"}, {"course_name": "EDUC 469: Teaching Methods and Assessment of English as a Second Language", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Integration of theory, research, and practice about ESL curriculum, instructional methods, assessment, and literacy development.  EDUC 469 Teaching Methods and Assessment of English as a Second Language (3) EDUC 469 is the fourth and final course in a four-course sequence designed to meet the Pennsylvania Department of Education's (PDE) requirements for an ESL Program Specialist Certificate. The 12-credit sequence has previously been approved by PDE. The 12-credit sequence is consistent with what other PDE-approved ESL certificate programs offer. The emphasis in EDUC 469 is to learn and integrate curricular, instructional, and assessment theories and practices into the K-12 classroom setting to promote language and literacy development. The course specifically addresses three of the PDE competencies necessary for a teacher to acquire to meet the minimum requirements as an ESL Program Specialist: PDE Competency I-English usage and developing linguistic awareness; PDE Competency II-English as a Second Language-instructional materials/development; and PDE Competency III-English language learners [ELLS] language and language services knowledge. The three areas of emphasis within EDUC 469 are:a.English as a Second Language methods and collaboration with academic content areas,which focuses on: the preparation for ESL teaching by exploring trends, major theories, methodologies, and assessment in second language learning; the study of second language teaching approaches applicable to elementary and secondary students; materials development and evaluation; and the development of a broad base of knowledge and skills that will enhance teacher effectiveness in meeting the needs of diverse learners through appropriate instructional, curricular, and behavioral strategies; b.Assessment and evaluation of English Language Learners (ELLs),which explores: the use of multiple measures of assessment to evaluate academic achievement; the development and implementation of authentic assessment tools; and various approaches and challenges to classroom assessment; and c.Literacy development,which focuses on elementary and secondary ESL students by exploring ways in which to enhance English language learning in elementary students and to enrich content-area instruction for secondary ESL students.", "prerequisite": "EDUC 468"}, {"course_name": "EDUC 470W: Higher-Order Thinking for Educators", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Presentation of strategies, techniques, and principles of higher-order thinking which are grounded in relevant research and practice will be presented.  EDUC 470W Higher Order Thinking for Educators (3)This required course for elementary education majors focuses on three primary objectives. The first objective is to develop students' metacognitive, critical thinking, creative thinking, decision making, problem solving and reflection skills. A second objective is for students to become aware of ways to increase the higher order thinking of children in the elementary classroom. The third objective is to improve the students' ability to write critical thinking/reflection papers on educational problems and issues. This course serves as one of the foundation courses for the Elementary Education Program as one of the goals of the program is to develop reflective practitioners. Students are evaluated on the quality of eight writing samples, the quality and quantity of their contributions during whole class discussions, and the quality of their performance during cooperative group activities.", "prerequisite": "admission into Elementary Education Major", "other": ["Writing Across the Curriculum"]}, {"course_name": "EDUC 471: Best Practices in Literacy", "department": "Education (EDUC)", "credits": "3 Credits", "description": "An application of best literacy practices to classroom instruction and assessment of reading, writing, listening, and speaking.  EDUC 471 Best Practices in Literacy (3) This course is offered to support the Masters of Education degree in Teaching and Curriculum at Penn State Harrisburg by providing an application of research in best language arts It is a required course in the Reading Specialist Certification Program. The course acquaints students with an instructional and assessment framework that has been embraced by the educational community on a nationwide basis. Objectives for the course include the following: (1) Students will demonstrate an understanding of the theoretical underpinnings of the established best practices in literacy. (2) Students will demonstrate the ability to implement effective literacy practices. (3) Students will be able to assess and evaluate student performance according to established best practices. Evaluation methods will include: (1) attendance and participation in class discussion and exercises (10%); (2) a 5-7 page paper dealing with the use of children's books to teach reading and writing (25%); (3) a 5-7 page paper on the most current methods of assessing students' reading, writing, speaking, and listening skills (25%); and (4) the creation of an integrated Thematic Unit for instruction (40%).", "prerequisite": "EDUC 320"}, {"course_name": "EDUC 472: Teaching Reading Through the Content Areas", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Designed to enable teachers of content areas to improve the reading/study skills needed by their students."}, {"course_name": "EDUC 475: ESL Leadership, Research and Advocacy", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Teachers will develop their skills as instructional leaders and researchers by conducting school-based action research projects.  EDUC 475 ESL Leadership, Research and Advocacy (3)EDUC 475, the capstone course in the ESL Specialist and Leadership Certificate program (now the online SCOPE program), is a hybrid course involving online readings and discussions and field-based action research in PreK-12 educational settings with English Language Learners. ESL faculty will provide mentoring/coaching in the field. This course is designed to familiarize ESL candidates with the processes for developing, implementing, and evaluating action research projects. The ESL candidates will explore best practices in ESL pedagogy through implementation of various models of action research. The four areas of emphasis within EDUC 475 are as follows: a) the principles of ethical and methodologically sound action research related to ELLs; b) culturally and linguistically inclusive best practices supported by ESL research; c) collaborative partnerships between school and community to advocate for ELLs and their families; and d) ESL research, evaluation, and assessment for dissemination of research findings, professional development, and continuous quality improvement within ESL programs. ESL faculty will coach and mentor ESL candidates in the field while they conduct action research. By the conclusion of this course, ESL candidates will have gathered, analyzed, and summarized their data into a research paper for potential publication, as well as developed either: a) a workshop training presentation for their school or district; or b) a draft of a conference proposal for a national, regional, or state conference.By conducting action research projects and subsequently disseminating the results of their research through professional development presentations and potential publications, candidates are expected to become instructional leaders in the ESL field. This course is the final capstone 3-credit ESL course for the ESL Specialist and Leadership Certificate program.", "prerequisite": "EDUC 469"}, {"course_name": "EDUC 477: Literacy Instruction and Evidence-Based Interventions", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Students in this course will demonstrate knowledge of multi-tiered comprehensive literacy programs that incorporate all essential elements of reading: vocabulary development, early intervention, early literacy, assessment, phonological awareness, phonics, phonemic awareness, comprehension, fluency, and literacy grouping and instruction. Students will also be able to determine appropriate literacy screening, diagnostic, and progress monitoring assessments and align evidence-based instruction to identified student needs."}, {"course_name": "EDUC 478: Secondary Transition for Students with Disabilities", "department": "Education (EDUC)", "credits": "3 Credits", "description": "Process and procedures for successful transition of secondary students with disabilities.", "prerequisite": "EDUC 459"}, {"course_name": "EDUC 484: School Law for Teachers", "department": "Education (EDUC)", "credits": "3 Credits", "description": "This course will focus on increasing teacher awareness of law and how it impacts on daily performance and job security.", "prerequisite": "permission of program"}, {"course_name": "EDUC 490: Student Teaching", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Observation and teaching in selected elementary or secondary schools under direction of cooperating classroom teachers and University supervisors. Regular seminars. GPA 3.0 or higher. Passing scores on required Praxis I tests.  EDUC 490 Student Teaching (1-12) This course fulfills one of the certification requirements established by the Commonwealth of Pennsylvania. Students are assigned for a period of twelve weeks to teach in either an elementary or secondary school. Students have the option of selecting either the primary or intermediate level in elementary education, or the middle or high school level in secondary education. Cooperating classroom teachers provide the day-to-day direction, evaluation and mentoring, and an assigned university supervisor makes weekly visits and observations. Students are phased into the full responsibilities of a classroom teacher, with the ultimate goal being, the assumption of all duties and responsibilities for a period of several weeks. Students plan, implement, evaluate and reflect on a variety of instructional activities throughout their experience. In addition to planning and implementing instruction, students assume responsibilities for classroom management, assessing student progress, communicating with all stakeholders, and participating in professional and co-curricular activities. Student teacher evaluations are based on clearly defined expectations and criteria. The assessment criteria are linked to Commonwealth and national standards.", "prerequisite": "eight semester standing, approval of program"}, {"course_name": "EDUC 494: Research Project", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "EDUC 494H: Research Project", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "EDUC 495: Internship", "department": "Education (EDUC)", "credits": "1-15 Credits/Maximum of 15", "description": "Supervised off-campus, non-group instruction including individual field experiences, practicums or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "EDUC 495A: Junior Field Experience", "department": "Education (EDUC)", "credits": "1 Credits", "description": "EDUC 495A Junior Field Experience (1) This course is designed to provide Elementary Education majors with an intensive field experience that acquaints the student with the 'real' world of elementary education in a suburban setting. The experience will be under the direction of a certified elementary teacher in a suburban Harrisburg setting. Students will have an opportunity to actively work at the primary (K-3) and/or the intermediate (4-5) level, and will be directed to accomplish specific field tasks assigned by their course instructors. These tasks are directly related to each course in which the student is enrolled. Students are assigned a university supervisor who observes and consults with the students throughout the experience. Specific activities will vary depending on the grade level and the school district's curriculum. Students are evaluated by both the cooperating teacher and the university supervisor, and the evaluations are based on classroom observations. This course is offered each semester and is required of all students enrolled in the Elementary Education program.", "prerequisite": "prior approval of proposed placement by instructor."}, {"course_name": "EDUC 495B: Senior Field Experience", "department": "Education (EDUC)", "credits": "3 Credits", "description": "EDUC 495B Senior Field Experience (1) This course is designed to provide Elementary and Middle-Level Education majors with an intensive field experience that acquaints the student with the `real¿ world of elementary education in an urban or suburban setting. The experience will be under the direction of a certified elementary and middle-level teacher in a school setting in the Harrisburg area. Students will have an opportunity to actively work at the K-4 or the middle (4-8) level, and will be directed to accomplish specific field tasks assigned by their course instructors. These tasks are directly related to each course in which the student is enrolled. Students are assigned a university supervisor who observes and consults with the students throughout the experience. Specific activities will vary depending on the grade level and the school district¿s curriculum. Students are evaluated by both the cooperating teacher and the university supervisor, and tile evaluations are based on classroom observations. This course is offered each semester and is required of all students enrolled in the Elementary Education program.", "prerequisite": "prior approval of proposed placement by instructor."}, {"course_name": "EDUC 495C: Early Childhood Field Experience", "department": "Education (EDUC)", "credits": "1 Credits", "description": "EDUC 495C Early Childhood Field Experience (1) This course is designed to provide Early Childhood Education majors with an intensive field experience that acquaints the student with the, \"real\" world of early childhood education in an urban setting. The experience will be under the direction of a certified elementary teacher in an urban Harrisburg setting. Students will have an opportunity to actively work at the primary (K-3) level and will be directed to accomplish specific field tasks assigned by their course instructor. These tasks are directly related to early childhood courses in which the student was previously enrolled. Students are assigned a university supervisor who observes and consults with the students throughout the experience. Students are evaluated by both the cooperating teacher and the university supervisor. The evaluations are based on classroom observations and the completion of learning activities correlated with the required text. This course is offered each semester and is required of all students enrolled in the Early Childhood Education program.", "prerequisite": "prior approval of proposed placement by instructor and   completion of all four early childhood prerequisite courses."}, {"course_name": "EDUC 496: Independent Studies", "department": "Education (EDUC)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "EDUC 497: Special Topics", "department": "Education (EDUC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EDUC 499: Foreign Studies", "department": "Education (EDUC)", "credits": "1-12 Credits/Maximum of 12", "description": "Study of educational topics in a country other than the United States.", "prerequisite": "permission of instructor", "other": ["International Cultures (IL)"]}]