[{"course_name": "EGEE 12: Energy Science and Engineering Lectures", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1 Credits", "description": "Lectures and discussion by faculty and visiting scientists/engineers on energy science and engineering, job selection, patents, licensing, ethics, and other professional issues and challenges.  EGEE 012 Energy Science and Engineering Lectures (1) The objective of the course is to expose students through a lecture or seminar format to a wide range of topics on energy science and engineering. The lectures would be presented by faculty and visiting scientists. Occasionally, students may be asked to make presentations. Students would be required to write a short summary of each presentation and provide a critique of the presentation. Seminar topics will cover aspects of energy production, processing, utilization, and conservation, and the associated environmental, health and safety, and policy, economics, and management issues. Students are expected to keep up with current developments on each topic and to actively participate in the discussions. Students will be evaluated based on their class participation, and written summary and critique of each presentation. This is a required course in the energy engineering major.", "prerequisite": "fifth-semester standing in Energy Engineering major or Energy and   Fuels Engineering Option in Chemical Engineering"}, {"course_name": "EGEE 101: Energy and the Environment", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Energy utilization and technological development, energy resources, conversion and consequences on the local and global environment, and future energy alternatives. EGEE (MATSC) 101 Energy and the Environment (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Energy is the life-blood of any society. The information and principles learnt in this course will allow the students to make sound judgments in the area of personal energy choices; There is increasing concern about the influence of human activities, particularly energy use, on global climate change. This has an impact on global business aspects. Students in all walks of life need to be exposed to the basic concepts to appreciate the positions of policymakers, scientists, and industry over the interrelationship between greenhouse gas emissions and global climate change. The students will acquire knowledge, which will enable them to critically evaluate any energy-related concerns of the society. This is important for any college graduate for responsible citizenship and stewardship. The main objectives of this course are to: provide basic understanding and appreciation of energy and environmental concepts and interconnectedness; analyze energy consumption patterns; discuss various energy resources that power the modern society; examine the energy conversion processes; explore interrelationships between energy use and industrial progress and environmental consequences; discuss future energy alternatives. Student performance will be evaluated continuously through homework assignments, exams, group activities, class participation and a final examination. Position papers or term papers may be used in lieu of homework assignments in some sections. This course is a stand-alone General Education course.", "other": ["Cross-listed with: MATSE 101", "Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "EGEE 101A: Energy and the Environment", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Energy utilization and technological development, energy resources, conversion and consequences on the local and global environment, and future energy alternatives.  EGEE (MATSC) 101A Energy and the Environment (3) (GN;IL)(BA) This course meets the Bachelor of Arts degree requirements. Energy is the life-blood of any society. The information and principles learnt in this course will allow the students to make sound judgments in the area of 'personal energy choices.' There is increasing concern about the influence of human activities, particularly energy use, on global climate change. This has an impact on global business aspects. Students in all walks of life need to be exposed to the basic concepts to appreciate the positions of policymakers, scientists, and industry over the interrelationship between greenhouse gas emissions and global climate change. The students will acquire knowledge, which will enable them to critically evaluate any energy-related concerns of the society. This is important for any college graduate for responsible citizenship and stewardship.The main objectives of this course are to: provide basic understanding and appreciation of energy and environmental concepts and interconnectedness; analyze energy consumption patterns; discuss various energy resources that power the modern society; examine the energy conversion processes; explore interrelationships between energy use and industrial progress and environmental consequences; discuss future energy alternatives.Student performance will be evaluated continuously through homework assignments, exams, group activities, class participation and a final examination. Position papers or term papers may be used in lieu of homework assignments in some sections. This course is a stand-alone General Education course. The course is currently offered in four sections every semester (Spring and Fall) with a total target enrollment of approximately 200-250 students per semester.", "other": ["Cross-listed with: MATSE 101A", "Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)"]}, {"course_name": "EGEE 101H: Energy and the Environment", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Energy utilization and technological development, energy resources, conversion and consequences on the local and global environment, and future energy alternatives.  EGEE 101H Energy and the Environment (3) (GN)Energy is the life-blood of any society. The information and principles learnt in this course will allow the students to make sound judgments in the area of 'personal energy choices.' There is increasing concern about the influence of human activities, particularly energy use, on global climate change. This has an impact on global business aspects. Students in all walks of life need to be exposed to the basic concepts to appreciate the positions of policymakers, scientists, and industry over the interrelationship between greenhouse gas emissions and global climate change. The students will acquire knowledge, which will enable them to critically evaluate any energy-related concerns of the society. This is important for any college graduate for responsible citizenship and stewardship. The main objectives of this course are to: provide basic understanding and appreciation of energy and environmental concepts and interconnectedness; analyze energy consumption patterns; discuss various energy resources that power the modern society; examine the energy conversion processes; explore interrelationships between energy use and industrial progress and environmental consequences; discuss future energy alternatives.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "EGEE 102: Energy Conservation for Environmental Protection", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Exposure to energy efficiency in day-to-day life to save money and energy, and thereby protect the environment.  EGEE 102EGEE 102 Energy Conservation for Environmental Protection (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Energy is a vital component of modern society. Much of the general population believes that the energy sources we depend on are perpetual. While people believe that the energy use is the culprit for environmental damage, they are not aware of the methods and principles by which energy conversion devices operate. This general education course provides students with necessary knowledge and information on the main operating principles of devices/appliances that are in common use and information on which to make the right decision in selecting the most energy efficient and economical choice. These devices are day-to-day appliances such as refrigerators, washers and dryers, ovens, etc., and home heating or cooling and transportation choices. The course also provides necessary information on heating furnaces, insulation, doors and windows, lighting, and air conditioning principles. The objective of the course is to expose students to energy efficiency in day to day life in order to save money and energy and thereby protect the environment. This education is very important for all college students to turn them into environmentally-responsible individuals of this Global Village.The course entails various simple but important group-activities/projects to reinforce the information taught through formal lectures. This is not meant to be a laboratory course or a research project. The group activities include conducting a set experiments and/or gathering and analyzing the data informally (at home) and formally presenting the observations to their peers both in writing and orally. Examples of group activities (fun) are: 1) conducting a home energy audit while walking around a house, apartment, trailer, etc. and taking notes on the cracks openings, caulking condition, insulating materials used, data on heating system, windows etc., and suggesting specific ways to conserve energy in the residence and 2) Energy usage analysis- involves analysis of home utility bills and energy consumption patterns and costs related to those for a year.Student performance will be evaluated continuously through group activities, one mid-term exam, class participation and a final examination. Collaborative-activities are used in lieu of homework assignments. This course is a stand-alone General-Education course. The course is currently offered every Fall and Spring semesters with a total target enrollment of approximately 40 students per semester.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "EGEE 102H: Energy Conservation for Environmental Protection", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Exposure to energy efficiency in day-to-day life to save money and energy, and thereby protect the environment.  EGEE 102H Energy Conservation for Environmental Protection (3) (GN)Energy is a vital component of modern society. Much of the general population believes that the energy sources we depend on are perpetual. While people believe that the energy use is the culprit for environmental damage, they are not aware of the methods and principles by which energy conversion devices operate. This honors level general education course provides students with necessary knowledge and information on the main operating principles of devices/applications that are in common use and information on which to make the right decision in selecting the most energy efficient and economical choice. These devices are day-to-day appliances such as refrigerators, washers and dryers, ovens, etc.,, and home heating or cooling and transportation choices. The course also provides necessary information on heating furnaces, insulation, doors and windows, lighting, and air conditioning principles. The objective of the course is to expose students to energy efficiency in day to day life in order to save money and energy and thereby protect the environment. This education is very important for all college students to turn them into environmentally-responsible individuals of this Global Village. Students will be doing two energy related projects and one presentation in class. This honors course also requires two additional home activities compared to a regular course. This honors class is designed to be more discussion based.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "EGEE 110N: Environmental Health and Safety Science", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "EGEE 110 Environmental Health and Safety Science (3) (GN) (GS). Environmental Health and Safety is an applied field with many aspects. It has engineering, science, psychology, and management components. For an understanding of how humans interact with their working and living environment, one has to understand basic sciences such as physics, biology, chemistry, mathematics, and psychology as well as some of the traditional engineering disciplines. This general education course is intended to provide students with a basic understanding of how these science and engineering principles are applied in an environmental health and safety context to topics and hazards commonly encountered in our lives. At the conclusion of the course, participants should be able to: 1) Demonstrate an understanding of how the dynamic processes of both the natural and man-made world impact the health, safety, and well-being of all of us in our daily lives; 2) Identify and understand common hazards inherent in industries, residences, transportation systems, and natural environments; 3) Explain the definition of risk including the concepts of probability, severity, presence of a hazard, and exposure to a hazard: 4) Recognize and understand ways of quantitatively expressing risk; 5) Explain risk perception and some of the factors that influence it; 6) Understand and apply control strategies and protective measures to hazards and risks to self, family, friends, and co-workers throughout daily activities;", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "EGEE 120: Oil: International Evolution", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Oil is the world¿s most important commodity. Access to oil was decisive in the great military struggles of the 20th century. The economic and strategic value of oil has led to the evolution of a fascinating array of business, political, and strategic alliances around the world. The objective of this course is to describe this evolution and the technological, commercial, and political innovations shaping its current face. This knowledge is vital in achieving a more complete understanding of the role of oil in international affairs and economic development. The course begins with a discussion of the development of the American and European oil industries during the 19th century and the formation of the first great industrial oil monopolies. The emergence of oil as a strategic commodity prior to and during World War I will then be discussed. The economic and technological reasons for the recurring boom-bust cycles of oil markets and the political arrangements developed to cope with their effects is the third major topic of the course. The focus then shifts back to military affairs with a discussion of the role of oil in the battles of World War II. We then examine the social and cultural roots of the post-war dissolution of company ownership and the nationalization of oil reserves. Also in the policy arena is a discussion of the policy response of western governments to a growing dependence upon low-cost oil from the Middle East, Africa, and South America. The analysis then focuses on the ideology and strategy behind the formation of the Organization of Petroleum Exporting Countries (OPEC) and the motivations and execution of their strategies to drive up oil prices during the 1970s and early 1980s. The last part of the course discusses the emergency of oil as a commodity traded in open commodity market exchanges, the development of reserves in deep water and in Africa, and the relationship between oil policy and the war on international terrorism. Allowing students to gain a new perspective on global relations, and domestic politics. By the end of the semester, students will have broad understanding of oil and its pervasive impact on society over the years, better writing ability, and improved critical reading and thinking skills. This general education course will provide a multi-disciplinary approach to understanding how oil affects international relations and commerce. The relationships between oil technology, social and political institutions, and the unique cultures in oil-producing regions.", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning"]}, {"course_name": "EGEE 199: Foreign Studies", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EGEE 210: Technological Legacy of Pennsylvania Coal", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Survey of coal technologies with a review of scientific principles and economic, social, and political impacts.  EGEE 210 Technological Legacy of Pennsylvania Coal (3) (GN) Pennsylvania Coal, a natural resource, has touched many lives from past to present with profound influence on employment, economic growth, social and political relationships, culture, and the natural environment in the state. The heritage and legacy of Pennsylvania coal weave the story of the Industrial Revolution in the U.S., including technological, social, and environmental aspects. Coal continues to be an important natural resource for electricity generation and metallurgical coke production to manufacture iron and steel. In 2000, approximately 80 million tons of coal was mined in Pennsylvania, most of which was used to generate electricity (approximately 62% of total electricity generated in Pennsylvania). Development of new technologies addresses the challenges of preserving and protecting the environment while mining and burning large quantities of coal. Health and safety of U.S. coal miners have been improved significantly over the past century. However, the recent Quecreek Coal Mine incident in Somerset, Pennsylvania reminded that underground coal mining is still a dangerous profession. Many PSU students have personal links to the coal industry through family members who have been engaged in coal related careers over several generations. This course will provide an opportunity to study coal mining practices in Pennsylvania that their parents and previous generations experienced with a review of recent improvements in these practices.This course will survey the development of the science and technologies (utilizing a multi-disciplinary approach) of coal formation, coal mining, coal transportation, and coal utilization. The integrated EGEE 211 course will study the social and environmental aspects of coal technologies to focus on labor-management relationships, immigration, culture, and environmental pollution. EGEE 210 and EGEE 211 will be held in the same classroom to integrate natural science and social science education.This course will be offered during both fall and spring semesters and will include a field trip to the Pennsylvania anthracite region. There are no in-class exams. Evaluation and assessment of student performance will rely on grading minute papers, analytical and reflective essays, individual and team papers, on-line quizzes/assignments, team presentations/discussions, and on-line learning portfolios.", "other": ["General Education:  Natural Sciences (GN)"]}, {"course_name": "EGEE 211: Social Legacy of Pennsylvania Coal", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Survey of coal technologies with economic, social, and political impacts discussed with historical, cultural, and international perspectives.  EGEE 211 Social Legacy of Pennsylvania Coal (3) (GS;US) Pennsylvania Coal, a natural resource, has touched many lives from past to present with profound influence on employment, economic growth, social and political relationships, culture, and the natural environment in the state. The heritage and legacy of Pennsylvania coal weave the story of the Industrial Revolution in the U.S., including technological, social, and environmental aspects. Coal continues to be an important natural resource for electricity generation and metallurgical coke production to manufacture iron and steel. In 2000, approximately 80 million tons of coal was mined in Pennsylvania, most of which was used to generate electricity (approximately 62% of total electricity generated in Pennsylvania). Development of new technologies addresses the challenges of preserving and protecting the enviroment while mining and burning large quantities of coal. Health and safety of U.S. coal miners have been improved significantly over the past century. However, the recent Quecreek Coal Mine incident in Somerset, Pennsylvania reminded that underground coal mining is still a dangerous profession. Many PSU students have personal links to the coal industry through family members who have been engaged in coal related careers over several generations. This course will provide an opportunity to study coal mining practices in Pennsylvania that their parents and previous generations experienced with a review of recent improvements in these practices. This course will survey the development of the science and technologies (utilizing a multi-disciplinary approach) of coal formation, coal mining, coal transportation, and coal utilization. The integrated EGEE 211 GS course will study the social and environmental aspects of coal technologies to focus on labor- management relationships, immigration, culture, and environmental pollution. EGEE 210 GN and EGEE 211 GS will be held in the same classroom to integrate natural science and social science education. This course will be offered at the University Park campus during both the Fall and Spring semesters and will include a field trip to the Pennsylvania anthracite region. There are no in-class exams. Evaluation and assessment of student performance will rely on grading minute papers, analytical and reflective essays, individual and team papers, on-line quizzes/assignments, team presentations/discussions, and on-line learning portfolios.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "EGEE 295: Internship", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "EGEE 299: Foreign Studies", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EGEE 302: Principles of Energy Engineering", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Basic engineering calculations and mathematical methodologies on material and energy balances and reaction rates during chemical transformations in energy systems.  EGEE 302 Principles of Energy Engineering (3) This introductory energy engineering course enables students to identify and apply fundamental principles of chemistry and physics, as they pertain to energy and fuels, and mathematics to describe materials and energy flow through a process. Examples of the processes studied will include stoichiometry in combustion and other reactions and material flows with recycle streams. This course also enables students to describe the energy transformations in energy systems. The examples of the processes we would be applying energy conservation principles to include calculation of adiabatic flame temperature during combustion of fuels. In addition, the course will present an introduction to chemical kinetics with an overview of solid, liquid and gaseous fuel transformations. This is a required introductory course to the BS in Energy Engineering degree program. It will be a prerequisite to several of the 400 level energy engineering curriculum courses. Students will be evaluated based on homework, projects, class participation, and mid term and final exams.", "prerequisite": "CHEM 112"}, {"course_name": "EGEE 304: Heat and Mass Transfer", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Introduces the fundamentals of heat and mass transfer.  Conduction, convection, radiation, and diffusion mass transfer will be emphasized.  EGEE 304 Heat and Mass Transfer (3) This course will emphasize the modes of heat and mass transport in energy engineering systems. Students will know, understand, and solve heat transfer problems that involve conduction, convection, and radiation. The course will provide an integrated treatment of heat, mass and momentum transfer by convection and mass transfer by diffusion. Students will also learn and use software that will enable them to solve problems that involve exploratory, what-if, and parameter sensitivity considerations. The course will also assist students to understand the design and operation of different types of heat exchangers. This course also enables students to identify and describe the energy transformations in energy systems. The examples of the processes we would be applying energy conservation principles to include power plant, geothermal energy systems, and industrial reactors and combustors. This is an essential and required thermal science course in the BS in Energy Engineering degree program. Students will be evaluated based on homework, projects, class participation, and mid term and final exams.", "prerequisite": "EGEE 302"}, {"course_name": "EGEE 395: Internship", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "EGEE 397: Special Topics", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EGEE 399: Foreign Studies", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EGEE 401: Energy in a Changing World", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Energy is in transition, with increased international energy demand and increasing environmental pressures.  Energy transitions, approaches, and outcomes are addressed.  EGEE 401 Energy in a Changing World (3) The role of energy is increasingly important with increasing environmental constraints, transitioning energy policies, supply disruption, international pressure on climate change compliance and competition for energy. This course evaluates the existing energy infrastructure and energy/fuel use, both domestic and international, along with evolving technologies, implementation and challenges in meeting energy demands. The class provides a holistic view and serves all students interested in an energy or energy-related career. Students will understand the interrelationship between legislative, technology, environmental, and international factors associated with energy production, processing, distribution and utilization.", "prerequisite": "EGEE 101"}, {"course_name": "EGEE 405: Renewable Energy in Electricity Markets", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "This course covers the structure and economics of the power grid in the US and the role played by renewable generation on the existing system. The course begins by introducing students to the structure of the power grid and teaches them to use typical analysis methods that are used to describe power transmission. The regulatory structure of US electricity markets is described to develop the framework for interpreting electricity pricing. Power analyses are used in conjunction with economic analyses to describe the interplay between transmission and cost of electricity to consumers. Unique aspects of renewable generation are introduced to this established context to begin to describe future drivers in the marketplace. Specific challenges associated with renewables are discussed, including the need for power system reserves, flexibility, the potential for overgeneration and the need for frequency and demand response. Methods to manage or overcome these challenges will also be discussed. Finally, this knowledge will be applied via discussion of several case studies of real power generation and transmission systems in the world.", "prerequisite": "EE 210"}, {"course_name": "EGEE 411W: Energy Science and Engineering Lab", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "A comprehensive introduction to classic and modern laboratory skills and experimentation of relevance to energy science and engineering practice.", "prerequisite": "SC 401", "other": ["Writing Across the Curriculum"]}, {"course_name": "EGEE 412: Green Engineering & Environmental Compliance", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Material and energy flows as they relate to industrial systems, environmental concerns, pollution prevention, and the development of clean technologies.  EGEE 412 Green Engineering & Environmental Compliance (3) The primary objective of EGEE 412 is to introduce students to how engineering and industrial decisions affect the environment and how clean technologies can reduce environmental impact. Students will also be exposed to global mass and energy flows from an environmental perspective that relate to both industrial and natural systems. Students will be exposed to environmental concepts, principles, and evaluation techniques within the framework of green engineering, pollution prevention, and environmental sustainability. The course is for students with a general science or engineering background.By examining mass and energy flows on the unit operation, plant-wide, local and regional scale, students will understand the interaction of anthropogenic flows with natural cycles of materials and energy. Students will understand how environmental concerns and regulations provide the motivation and incentive behind reducing pollution during the design phase rather than as an 'add-on' or 'end of pipe' treatment technology. Students will evaluate plant flow sheets to identify engineering means by which to reduce plant-wide environmental impact.", "prerequisite": "EGEE 302"}, {"course_name": "EGEE 420: Hydrogen and Fuel Cells", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Course will cover the fundamental principles of electrochemical engineering, hydrogen production and storage, and the design and application of the main types of fuel cells.  EGEE 420 Hydrogen and Fuel Cells (3) The primary objective of the course is to help students understand the fundamental principles of electrochemistry, the production and storage of hydrogen from biomass and fossil fuels, and the design and operation of different types of fuel cells. Students will begin with electrochemistry and electrochemical engineering systems including fuel cells. The chemical and biochemical methods used for producing hydrogen for fuel cells applications and the current technologies available for hydrogen storage will follow next. Students are expected to be able to apply their knowledge and understanding in the analysis of fuel cell systems. Students are also expected to be able to distinguish between the design, operation, and advantages and disadvantages of the different types of fuel cells available. This is an elective course for the energy engineering major. It complements the required course on electrochemical energy conversion in the energy engineering curriculum.", "prerequisite": "EME  301"}, {"course_name": "EGEE 430: Introduction to Combustion", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Concepts related to laminar and turbulent premixed and nonpremixed combustion with applications to propulsion and stationary systems.  EGEE (M E) 430 Introduction to Combustion (3) This course provides an introductory treatment of combustion science. The objectives of the course are to develop in the students an understanding of combustion kinetics, combustion thermochemistry, flame dynamics, flame stability, and pollutant formation. Coverage includes laminar and turbulent flames, premixed and diffusion flames, and detonations. Emphasis is placed on the role that Kinetics, heat transfer, mass transfer, and fluid dynamics have on flame structure and flame stability. The course includes some laboratory demonstrations of flat flame and diffusion flame burners, and incorporates numerical calculations of thermodynamic and kinetic combustion phenomena. The course begins with a review of transport phenomena, physical gas dynamics, and thermochemistry. Then, the concept of the laminar flame speed is introduced in the context of a one-dimensional flame and a propagating chemical wave. Issues of premixed flame structure and stability are presented along with a discussion of flammability limits. Next, laminar diffusion flames are presented via the Burke-Schumann analysis. From laminar flames, the emphasis shifts to turbulent premixed and diffusion flames, and the concepts of flame stretch and strain. Detonations are considered, with emphasis on thermodynamic analysis of the detonation and the structure of the detonation wave. Details of chemical kinetics for the hydrogen-oxygen and hydrocarbon-air reaction systems are presented, with linkage back to earlier topics such as flame stabilization and flammability limits. After kinetic phenomena, the course then considers pollutant formation focusing on soot and NOx. The fundamental aspects of combustion are applied to analysis of the combustion process and pollutant formation in international combustion engines and catalytic combustors. The course wraps up with discussion of atmospheric chemistry, the fate of pollutants, and the formation of secondary pollutants.", "prerequisite": "ME 201", "other": ["Cross-listed with: ME 430"]}, {"course_name": "EGEE 433: Physical Processes in Energy Engineering", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Introduces fluid flow, heat transfer, phase equilibrium and mass transport phenomena in energy separation processes.  EGEE 433 Physical Processes in Energy Engineering (3) The objective of the course is to expose students to the physical flow and separation processes that occur in energy engineering systems. Students will be exposed to gas, liquid and solid phase separation processes. The heat, mass and momentum phenomena involved will be discussed. In particular, phase equilibria and mass transfer in the behavior and performance of gas, liquid and solid fuels will be emphasized. Students will be exposed in the class to the operation and design of absorption, adsorption, fluidization, size reduction, filtration, dissolution, entrainment, and heat exchange units. Students will understand the differences between chemical processes that involve chemical reactions and transformations and physical processes that involve mainly phase changes and separation. This is an elective course for the energy engineering major. It will be offered once per year in the spring semester with an estimated enrollment of 40. Assessment of student performance will be based on homework, student projects, mid-term exams, class participation, and final exam.", "prerequisite": "EGEE 304"}, {"course_name": "EGEE 436: Modern Thermodynamics for Energy Systems", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Thermodynamics of external fields, theory of stability and fluctuations, irreversible and non-linear thermodynamics, and bifurcation theory and their applications in energy and environmental processes are discussed.  This course will be an advanced thermodynamics class that will expose students to the thermodynamics of irreversible processes and the thermodynamic analysis of dynamic systems. Students will learn to analyze the thermodynamics of conductivity, diffusion, gravitation, electrochemical systems, stability, fluctuations and critical phenomena. Students are expected to be able to understand and apply their knowledge to analyze problems involving fuel cells, membrane potential in electrolysis systems for hydrogen production, and other energy and environmental processes. This is an elective course in the energy engineering major and will be offered once a year in the spring semester to about 40 students. Student performance will be evaluated based on homework, mid term exams, class participation, project, and final exams.", "prerequisite": "EME 301"}, {"course_name": "EGEE 437: Design of Solar Energy Conversion Systems", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "A review of fundamental concepts in solar energy conversion including photovoltaic (PV) and solar thermal conversion systems. EGEE 437 Design of Solar Energy Conversion Systems (3)The course examines the principles of solar energy conversion to build a foundation for explaining the basic concepts and implementation of conversion processes. It reviews the properties and availability of solar radiation and geometric relationship of sun/collector, principles of photovoltaic conversion and properties of materials used in PV systems, designing PV systems, procedures for solar thermal engineering calculations, and thermal power plants for electricity generation. This course will complement the existing courses on fossil fuels and other renewable energy sources. Students will be engaged to actively participate in learning through team projects, semester papers, class presentations, and field trips.", "prerequisite": "EGEE 304"}, {"course_name": "EGEE 438: Wind and Hydropower Energy Conversion", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Principles of sustainability and renewable energy conversion with emphasis on wind and hydrokinetic energy resources.  EGEE 438 Wind and Hydropower Energy Conversion (3) This course examines the principles of sustainability and renewable energy conversion with emphasis on wind and hydrokinetic energy resources. Concentration is placed on the relationships between the renewable resources, conversion technology and economic feasibility along with consideration of the associated risks and environmental impacts. It will complement existing energy engineering courses on fossil fuel and solar energy conversion. Students will actively participate in learning through team projects, semester papers, class presentations, and field trips. This is a required course in the energy engineering major. The course will be offered every spring with an expected enrollment of 60 students.", "prerequisite": "EGEE 302"}, {"course_name": "EGEE 439: Alternative Fuels from Biomass Sources", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits/Maximum of 3", "description": "This course will examine the chemistry of technologies of bio-based sources for power generation and transportation fuels.", "prerequisite": "CHEM 110"}, {"course_name": "EGEE 441: Electrochemical Engineering Fundamentals", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Course covers fundamental principles of electrochemistry, including electrochemical thermodynamics, kinetics, catalysis, and corrosion and focuses on applications such as fuel cells, batteries, and photovoltaics. Each application covers: principles of method, criteria determining performance, present state of development, and advantages/disadvantages. Laboratory demonstration of the performance (current-voltage) measurements of an electrochemical converter is scheduled in this course.  EGEE 441 Electrochemical Engineering Fundamentals (3) The course will cover the fundamental principles of electrochemistry, including electrochemical thermodynamics, kinetics, catalysis, and corrosion. Students will be exposed to the application of these principles in fuel cells, batteries, and photovoltaics. Students will be able to perform efficiency analysis in these systems. They will also be able to understand the differences between types of fuel cells and distinguish between electrochemical and chemical energy systems. For each of the above application areas students will learn the criteria used to determine their performance, their current state of development, and their advantages/disadvantages. Laboratory demonstration will help to enhance student knowledge and understanding. Student performance will be evaluated through problem sets, quizzes, midterm, project papers, class participation, and final examination. This is a required course in the energy engineering major.", "prerequisite": "EME  301 and EME  303 or CH E 220 and CH E 330 or M E  300 and M E  320 , or MATSE401 and MATSE402"}, {"course_name": "EGEE 442: Electrochemical Methods", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "This course is for senior undergraduates, graduate students and professionals to learn electrochemical techniques and data analysis.  EGEE 442 Electrochemical Methods (3) This course is (1) for undergraduate and graduate students in engineering who have already knowledge of electrochemical engineering/electrochemistry fundamentals but would like to understand how the electrochemical techniques can be used, and (2) for professionals who would like to be trained in electrochemical methods and learn how to correctly treat the obtained data.", "prerequisite": "EGEE 441"}, {"course_name": "EGEE 451: Energy Conversion Processes", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Emphasizes processes for conversion of fossil fuels, nuclear and biomass to other fuel forms as transportation fuels and electricity.  EGEE 451 Energy Conversion Processes (3) The primary objective of this course is to expose students to the principles of chemical and nuclear reactions that underlie most major energy conversion processes, particularly with reference to the conversion of energy resources such as fossil and nuclear energy to fuels and electric power. The emphasis of the first major unit of the course is on fundamental reaction chemistry including nuclear. The second objective is to connect chemical and nuclear principles to practical energy conversion processes by an analysis of case studies used as examples of such processes as ethanol via fermentation, biodiesel via transesterification, formation of light liquids by pyrolysis, coal gasification and Fischer-Tropsch synthesis, direct coal liquefaction, fissionable and fertile isotopes chain reactions, breeding cycles and reactors, and electric power from nuclear reactions. This is a required course for the energy engineering major and will be offered in fall semester with an enrollment of about 50. Student performance will be assessed through weekly homework, mid-term tests, student projects and final exam.", "prerequisite": "F SC 431"}, {"course_name": "EGEE 455: Materials for Energy Applications", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Overview of key principles and technologies for materials relevant to energy applications, including membranes, catalysis, supercapacitors, adsorbents, and semi-conductors.  EGEE 455 Materials for Energy Applications (3) The primary objective of this course is to introduce engineers and scientists to key principles in the design of materials relevant to energy applications. Application areas will include separations, catalysis, adsorption, semi-conductors, and photovoltaics. Students will be able to understand and apply principles in solid state chemistry/physics, material science and engineering, adsorption, surface science, and catalysis in analyzing materials for energy applications. Introductory information will be followed by case studies, state of the art review of current materials, and research needs for development. Students will be evaluated on their ability to understand and apply basic concepts in material science, solid state chemistry, and surface chemistry; report on an in depth study of one surface characterization technique; perform literature search and understand basic technical concepts in one application area. Term projects will provide an opportunity to apply concepts and skills to real world applications, and require students to report on current 'state of the art' technology and research needs. Groups of three or four students will be asked to choose from a variety of applications and then asked to present their findings. This is an elective course for energy engineering majors with particular interest in materials for energy applications.", "prerequisite": "EGEE 302"}, {"course_name": "EGEE 456: Introduction to Neural Networks", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Artificial Neural Networks as a solving tool for difficult problems for which conventional methods are not applicable.  E E (E SC/EGEE) 456 Introduction to Neural Networks (3) This course is in response to students needs to learn Artificial Neural Networks (ANN) as a solving tool for difficult problems for which conventional methods are not available. The objective of this course is to give students hands-on experiences in identifying the best types of ANN, plus developing and applying ANN to solve difficult problems. Students will be introduced to a variety of ANN and will use their training skills to solve their own applications. During this course the students will develop a final project, in which they will apply ANN to widely varied problems.Examples: I) students from E E may be interested in applying ANN to solve control problems; II ) students from Material Sciences may be interested in applying ANN to predict the pitting corrosion of components; III) students from Petroleum Engineering may be interested in applying ANN to characterize the life of a reservoir; IV ) students from Agricultural Engineering may be interested in applying ANN to sort apples automatically, etc.", "prerequisite": "CMPSC 201", "other": ["Cross-listed with: EE 456, ESC 456"]}, {"course_name": "EGEE 464W: Energy Design Project", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "A team and capstone design project on an industrial energy-related problem.", "prerequisite": "ENGL 202C", "other": ["Writing Across the Curriculum"]}, {"course_name": "EGEE 470: Air Pollutants from Combustion Sources", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "3 Credits", "description": "Generation of pollutants in combustion chambers; reduction by combustion control; pre- and post-combustion treatment of fuels and effluents.", "prerequisite": "EME  301"}, {"course_name": "EGEE 494: Research Project", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "EGEE 495: Internship", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "EGEE 496: Independent Studies", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "EGEE 497: Special Topics", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EGEE 499: Foreign Studies", "department": "Energy and Geo-Environmental Engineering (EGEE)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]