[{"course_name": "EME 301: Thermodynamics in Energy and Mineral Engineering", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "Treatment of classical thermodynamics targeted to the needs of students in the Department of Energy and Mineral Engineering.", "prerequisite": "CHEM 112"}, {"course_name": "EME 303: Fluid Mechanics in Energy and Mineral Engineering", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "Treatment of fluid mechanics targeted to the needs of students in the Department of EME.", "prerequisite": "MATH 250"}, {"course_name": "EME 407: Electrochemical Energy Storage", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "Electrochemical concepts in energy storage devices, cell construction and materials involved in batteries and capacitors, electrochemical testing methods and applications.", "prerequisite": "EME  301 or M E  300 or CH E 220 and EME  303 or M E  320 or CH E 330 or their equivalent"}, {"course_name": "EME 432: Energy Policy", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "Analysis, formulation, implementation, and impacts of energy-related policies, regulations, and initiatives.", "prerequisite": "EGEE 120", "other": ["Cross-listed with: GEOG 432"]}, {"course_name": "EME 444: Global Energy Enterprise", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "Global Energy Enterprise provides in-depth insight into the role that public and private nonmarket actors and actions play in contemporary energy markets through a variety of artifacts and case studies. Students perform a nonmarket analysis of a current energy policy case study through series of guided steps using a well-regarded analytical framework. The course also provides an overview of technical, environmental, economic, and sociopolitical aspects of modern energy sources, as well as an overview of international energy and policy regimes.", "prerequisite": "ECON 104"}, {"course_name": "EME 450: Energy Crisis Leadership", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "Energy Crisis Leadership prepares students to lead in high-pressure, high-stakes environments. This is an interactive class that utilizes case studies to help students solve open-ended and complex problems. The case studies are from rare, but significant events with challenges that students are likely to experience someday in the energy and natural resource industries. In addition to the case studies, we will have guest speakers from the energy industry discuss their experiences with various operational upsets and their roles in addressing them. The culmination of the class is a competition where teams of students must formulate a plan to deal with a major crisis.", "prerequisite": "7th Semester standing"}, {"course_name": "EME 460: Geo-resource Evaluation and Investment Analysis", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "The course covers engineering evaluation of geo-resources, present value and rate of return analysis, mineral property and reserve estimation, and cost estimation and engineering economy concepts applied to geo-resources including energy and minerals.", "prerequisite": "5th semester or higher"}, {"course_name": "EME 466: Energy and Sustainability in Society", "department": "Energy and Mineral Engineering (EME)", "credits": "3 Credits", "description": "EME 466 provides the culminating experience for Energy and Sustainability Policy majors through an individualized inquiry-based capstone project in which students tackle the wicked problems of sustainability they see and experience in their own communities. Students identify, organize, execute, and reflect on a local issue related to energy, the environment, or sustainability with particular emphasis on policy-based solutions.", "prerequisite": "GEOG 30N"}]