[{"course_name": "ENVSE 400: Safety Engineering", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits/Maximum of 3", "description": "An introduction to the application of engineering principles for the promotion of safety for workers, consumers, and the public.", "prerequisite": "CHEM 110"}, {"course_name": "ENVSE 404W: Surface and Interfacial Phenomena in Environmental Systems", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "Principles underlying surface and interfacial phenomena with application to mineral processing and environmental systems.", "prerequisite": "CHEM 110", "other": ["Writing Across the Curriculum"]}, {"course_name": "ENVSE 406: Sampling and Monitoring of the Geo-Environment", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "Issues of sampling, analysis, monitoring and control techniques for effective environmental management in the extractive industries.", "prerequisite": "MNPR 301"}, {"course_name": "ENVSE 408: Contaminant Hydrology", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "Mobility of contaminants in aquifers; multiphase flow, transport, retardation and attenuation, vapor mobility, aquifer characterization, mathematical models and aquifer remediation.", "prerequisite": "GEOSC 452"}, {"course_name": "ENVSE 412: Environmental Systems Engineering Laboratory", "department": "Environmental Systems Engineering (ENVSE)", "credits": "1 Credits", "description": "A laboratory study of the principles involved in the characterization and remediation of process wastes with an emphasis on physical separations.", "prerequisite": "MNPR 301"}, {"course_name": "ENVSE 420: Fire Safety Engineering", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "Overview of the history and behavior of fire, hazards and risk identification, detection and suppression systems, and emergency evacuation procedures.", "prerequisite": "CHEM 110"}, {"course_name": "ENVSE 427: Pollution Control in the Process Industries", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "The major objective of this course is to teach the design principles for different unit operations commonly employed in environmental pollution control in the mineral, energy, and chemical process industries. The course is required of all ENVSE students, who must score at least a grade of C to graduate. Students will develop the ability to identify, formulate, and solve complex engineering problems by applying principles of engineering, science, and mathematics. Fundamental principles covered in earlier courses (math, physics and chemistry) will be applied to derive design equations for different unit operations (e.g. sedimentation basins, activated sludge processes, dissolved air flotation, gas absorption and stripping, and precipitation). Students will develop engineering design solutions that meet specified needs with consideration of public health, safety, and welfare, as well as global, cultural, social, environmental, and economic factors. Student evaluation will be based upon homework assignments, quizzes, in-class tests, and design projects. Some assignments may require students to work in teams.", "prerequisite": "CHEM 110"}, {"course_name": "ENVSE 440: Industrial Ventilation for Contaminant Control", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "Ventilation system design and analysis for control of industrial contaminants; measurements, dilution and local exhaust ventilation strategies; laboratory demonstrations included.", "prerequisite": "MATH 141"}, {"course_name": "ENVSE 450: Environmental Health and Safety", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "Overview of toxicology, epidemiology, exposure assessment, industrial hygiene, environmental laws, and engineering approaches to protecting workers and the environment.", "prerequisite": "CHEM 110"}, {"course_name": "ENVSE 457: Industrial Hygiene Measurements", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "Industrial hygiene is the discipline devoted to the anticipation, recognition, evaluation, and control of hazards in the workplace. This course provides an overview of the most common industrial hygiene measurement techniques used to evaluate exposure to chemical, physical, and biological agents in the workplace. Topics will include coverage of basic definitions, exposure standards, and guidelines, and an introduction to the different types of sampling equipment and analytical methods used most often in the evaluation of airborne exposure to gases, vapors, and aerosols. Interpretation of quantitative sample results will be an area of emphasis and students will become familiar with different types of exposure distributions, appropriate sampling strategies, and different statistical tools available for making decisions in occupational exposure assessment.", "prerequisite": "CHEM 110"}, {"course_name": "ENVSE 458: Industrial Hygiene Measurements Laboratory", "department": "Environmental Systems Engineering (ENVSE)", "credits": "1 Credits", "description": "Industrial hygiene is the discipline devoted to the anticipation, recognition, evaluation, and control of hazards in the workplace. This course provides an overview of the most common industrial hygiene measurement techniques used to evaluate exposure to chemical, physical, and biological agents in the workplace. Topics will include coverage of basic definitions, exposure standards, and guidelines, and an introduction to the different types of sampling equipment and analytical methods used most often in the evaluation of airborne exposure to gases, vapors, aerosols, and physical agents (noise, heat, ergonomics). Interpretation of quantitative sample results will be an area of emphasis and students will become familiar with different types of exposure distributions, appropriate sampling strategies, and different statistical tools available for making decisions in occupational exposure assessment."}, {"course_name": "ENVSE 470: Engineering Risk Analysis", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits/Maximum of 3", "description": "Quantitative methods of systems analysis, probabilistic risk and reliability analysis, as well cost-benefit, and value of information analysis.", "prerequisite": "MATH 251"}, {"course_name": "ENVSE 480: Environmental Systems Engineering Process Design", "department": "Environmental Systems Engineering (ENVSE)", "credits": "3 Credits", "description": "ENVSE 480 provides a culminating design experience for students in the Environmental Systems Engineering major. Students develop the skills and techniques for managing and executing engineering design projects with an emphasis on treatment and remediation processes of the basic industries including those involved in the extraction, conversion, and utilization of energy and mineral resources. Engineering science and design skills will be integrated and applied to the solution of realistic open-ended environmental systems engineering problems such as: flue gas desulphurization and mercury removal; treatment of hydraulic fracturing wastewater (produced water); acid mine drainage treatment; phytoremediation of heavy metals; and treatment of industry-specific wastes such as pharmaceutical and refinery wastewater. Students completing this course will have the ability to apply engineering design to develop solutions that meet specified needs while also satisfying constraints related to public health, safety, and welfare, as well as economic, environmental, and social factors. Students will work together in teams to provide leadership in a collaborative and inclusive environment, while establishing goals, planning tasks, and meeting project objectives. The ability to communicate effectively to a range of audiences will be demonstrated through the preparation and delivery of written reports and presentations to peers, faculty, and other project stakeholders.", "prerequisite": "ENVSE 427"}, {"course_name": "ENVSE 494: Senior Thesis", "department": "Environmental Systems Engineering (ENVSE)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent research and/or design projects under the supervision of the Environmental Systems Engineering program.", "prerequisite": "Seventh semester standing or higher in Environmental Systems Engineering (ENVSE_BS) major", "other": ["Honors"]}, {"course_name": "ENVSE 495: Environmental Health and Safety Engineering Internship", "department": "Environmental Systems Engineering (ENVSE)", "credits": "2 Credits", "description": "Students work with an advisor to prepare technical memos and a final report summarizing the experiential education gained through employment in inudstry.", "prerequisite": "Fifth semester standing or higher"}, {"course_name": "ENVSE 496: Independent Studies", "department": "Environmental Systems Engineering (ENVSE)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design,that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "ENVSE 497: Special Topics", "department": "Environmental Systems Engineering (ENVSE)", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]