[{"course_name": "FIN 100: Introduction to Finance", "department": "Finance (FIN)", "credits": "3 Credits", "description": "The nature, scope, and interdependence of the institutional and individual participants in the financial system. May not be used to satisfy Penn State Business baccalaureate degree requirements.  Not available to students who have taken B A 301 or FIN 301.", "prerequisite": "third-semester standing"}, {"course_name": "FIN 108: Personal Finance", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Personal management of budgets, bank accounts, loans, credit buying, insurance, real estate and security buying. May not be used to satisfy Smeal College baccalaureate degree requirements.", "prerequisite": "third-semester standing"}, {"course_name": "FIN 199: Foreign Studies", "department": "Finance (FIN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "FIN 296: Independent Studies", "department": "Finance (FIN)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "FIN 297: Special Topics", "department": "Finance (FIN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "FIN 299: Foreign Studies", "department": "Finance (FIN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "FIN 301: Corporation Finance", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This course provides a basic understanding and framework of how firms acquire, allocate, and control their financial resources. It covers the acquisition and management of corporate capital; analysis of operations, forecasting capital requirements, raising capital, and planning profits. This is a core finance course focusing on basic financial principles and practices essential to managing a business. In addition, this course also covers financial markets, institutions, organizational forms and investments. It relies heavily on accounting and economic principles with a strong emphasis on problem solving and decision making. One objective of this course is to be able to assess the past and present performance of the firm. This can be achieved through vertical and horizontal analysis of the financial statements as well as ratio analysis. Another aspect of this course is the financial planning process. This includes concepts such as pro forma statements, developing the statement of cash flows, as well as the budgeting process through the preparation of the cash budget. Another facet of this class is to understand how financing and investment decisions are made. Students will learn about the time value of money as well as fundamental techniques for valuing financial assets such as stocks and bonds. Additionally, capital budgeting techniques such as the net present value and internal rate of return are explained. Other important objectives include the management of working capital, the determination of the cost of capital, operating and financial leverage, and risk and return. The concepts and tools covered in this class allow the student to gain a fundamental understanding of how the finance function works within the business environment. The course promotes critical thinking and will enable the student to better integrate the individual functions of a business in order to make good business decisions. A student may receive credit toward graduation for only one of the following; BA 301, FIN 100, FIN 301, or FIN 301H.", "prerequisite": "ENGL 15"}, {"course_name": "FIN 301H: Corporation Finance (Honors)", "department": "Finance (FIN)", "credits": "3 Credits", "description": "FIN 301H honors course provides insight into real world issues that are needed to effectively run a business. Students will utilize the fundamental concepts learned in finance (integrated with accounting, marketing, management, logistics, operations, and business law/ethics) as a foundation for running a business in the classroom. The \"product\" in this business will be a comprehensive strategic business plan for a real, live local, state, national, or international business that will serve not only as an articulation of understanding of core course concepts, but also as a supplement to the existing core package of introductory business courses. The honor students in this course will be building their strategic business plan products in electronic format in closely-knit, high performance teams. The strategic plan product development process in this course inherently involves integration across the functional areas of business: marketing, logistics, finance, and management. There is also inclusion and integration of courses in accounting, business law, management information systems, and statistics as applicable. Each student team will allocate product development responsibilities according to areas of expertise and interest. An appropriate balance of students from several majors will be assigned to each group. Class time will involve exchanging information within and across groups and coordinating activities between groups where necessary. Students will periodically meet with individual and team-based corporate mentors who will provide one-on-one advice on an as-needed basis. Students will also receive specialized training in team-based processes, leadership, and technology tools required to implement the products under development. Select members of the Penn State faculty and Smeal College alumni will be on hand at times to provide this specialized training and consulting expertise. Company owners and principals will provide periodic (monthly) reviews of honor students' work to assist them in the development of a first-class, professional business plan product.", "prerequisite": "ENGL 15", "other": ["Honors"]}, {"course_name": "FIN 302: Introductory Financial Modeling", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This course applies spreadsheets to build financial models and solve numerically intensive problems in finance.  FIN 302 Introductory Financial Modeling (3)This course is designed to provide students with an understanding and practical application of spreadsheet skills needed in Finance. The course will introduce students to spreadsheet models and tools to solve finance problems. It will also introduce students to finance databases and data preparation for analysis. These technical skills are necessary for Finance majors to effectively apply concepts learned in advanced finance courses and be successful in their careers. The course is intended to be an introductory level so that students can apply the skills in other courses.", "prerequisite": "ACCTG 211"}, {"course_name": "FIN 305: Financial Management of the Business Enterprise", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Development of advanced practices of financial management and their application to decision making in business firm.  FIN 305 Financial Management of the Business Enterprise (3) The objective of this course is to give students an understanding, and working knowledge of the major decisions faced by corporate financial managers. In general, the course will emphasize three major areas: investment and capital budgeting, financing and capital structure, dividend policy and corporate growth. A basic understanding of financial analysis and valuation will be provided. Basic corporate securities markets will be described. Determinants of securities prices, yields, and returns will be discussed. Special emphasis is placed on the role of the capital markets in financing corporate operations and investment, in facilitating corporate reorganizations and financial restructuring, and in reflecting owners wealth and evaluating the performance of corporate management. Within the general framework, a number of special topics will be covered, including mergers and acquisitions and the market for corporate control, international financial management, derivative instruments and their applications to corporate risk management. Students taking, the course should have a working knowledge of elementary statistics, and a basic understanding of accounting and financial statements.", "prerequisite": "BA 301"}, {"course_name": "FIN 305M: Financial Management of the Business Enterprise (Honors)", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Development of advanced practices of financial management and their application to decision making in a business firm.  FIN 305M Financial Management of the Business Enterprise (Honors ) (3) The objective of this course is to give students an understanding, and working knowledge of the major decisions faced by corporate financial managers. In general, the course will emphasize three major areas: investment and capital budgeting, financing and capital structure, dividend policy and corporate growth. A basic understanding of financial analysis and valuation will be provided. Basic corporate securities markets will be described. Determinants of securities prices, yields, and returns will be discussed. Special emphasis is placed on the role of the capital markets in financing corporate operations and investment, in facilitating corporate reorganizations and financial restructuring, and in reflecting owner's wealth and evaluating the performance of corporate management. Students taking, the course should have a working knowledge of elementary statistics, and a basic understanding of accounting and financial statements. As an Honors course, students will study the impact of corporate activities on the market value of its stock, so a common stock pricing model is needed that accounts for factors that matter to investors. FIN 305M looks at these issues through topics such as, time value of money, risk and return, and valuation of stocks and bonds. The course concludes with topics related to specific business activities, such as capital budgeting, capital markets, capital structure, and dividend policy. The level of discussion and critical analysis expected in FIN 305M compliments the expected level of performance for honors students.", "prerequisite": "BA 301", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "FIN 305W: Financial Management of the Business Enterprise", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Development of advanced practices of financial management and their application to decision making in a business firm.", "prerequisite": "BA 301", "other": ["Writing Across the Curriculum"]}, {"course_name": "FIN 306W: Investment Valuation", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Approaches to investment strategy, investment decisions; valuation of corporate securities, including the impact of dividend policy and capital structure.", "prerequisite": "FIN 301", "other": ["Writing Across the Curriculum"]}, {"course_name": "FIN 330: Personal Financial Planning", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Developing financial plans including cash budgets, credit purchases, investments, and insurance.", "prerequisite": "third-semester standing or permission of instructor"}, {"course_name": "FIN 362: Intrieri Family Student Managed Fund - Associate Analyst Practicum", "department": "Finance (FIN)", "credits": "1-4 Credits/Maximum of 4", "description": "In this course, students will provide research support for the Officers and Lead Analyst for the Intrieri Family Student Managed Fund, an actual investment fund that currently holds a stock portfolio of approximately $250,000. The student will serve as economic, industry, and security financial analysts and portfolio managers in concert with the Standards of Practice Handbook from the CFA Institute. These standards are integral to the curriculum for all three levels of the Chartered Financial Analyst exam."}, {"course_name": "FIN 395A: Nittany Lion Fund - Associate Fund Manager Practicum", "department": "Finance (FIN)", "credits": "3 Credits/Maximum of 6", "description": "FIN 395A Nittany Lion Fund - Associate Fund Manager Practicum (3 per semester/maximum of 6) While the Lead Fund Manager is accountable for all work done by a given sector, an Associate Manager often does much of the behind the scenes work. Specific assignments include: putting together the weekly reports for investors, creating reports that are sent out to the Nittany Lion Fund (NLF), and providing assistance with pitches. In general, an Associate Manager is supposed to be well informed about the sector's current holdings and with that, an Associate should be able to provide support for the Lead Manager during a stock pitch or class discussion. Although Associate Fund Managers are the workhorses of the fund, often performing some of the more tedious tasks, the position offers the opportunity to learn from the Lead Managers as well as make an impression by delivering quality work. While Lead Managers are responsible for and have the final say in stock pitches and sector strategies, it is highly encouraged that the Associates provide their Lead Managers with pitch ideas as well as inform them of their opinions about current market trends. Ultimately, the Associate Manager position is more detail and task oriented than the Lead Fund Manager position. However, there is always room to provide high quality insight into the market by asking thought provoking questions during pitches and staying current on market news. Students use financial software, such as Bloomberg Professional, Reuters Station, TradeStation, and FactSet, and must have working knowledge of various forms of financial modeling. The Penn State Investment Association (PSIA), which co-exists with the Nittany Lion Fund, LLC (NLF) assists the NLF in ensuring students are appropriately trained in these skills. The PSIA is open to students of all majors and experience levels and is the starting point for students interested in participating in the NLF.", "prerequisite": "permission of program"}, {"course_name": "FIN 397: Special Topics", "department": "Finance (FIN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "FIN 399: Foreign Studies", "department": "Finance (FIN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "FIN 405: Advanced Financial Management", "department": "Finance (FIN)", "credits": "3 Credits", "description": "An examination of the development and application of decision rules for major long-term financial and investment problems of the firm.", "prerequisite": "FIN 305W"}, {"course_name": "FIN 406: Security Analysis and Portfolio Management", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Advanced valuation theory; fundamentals of security analysis; portfolio construction and management.", "prerequisite": "BA 301"}, {"course_name": "FIN 406H: Security Analysis and Portfolio Management (Honors)", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Advanced valuation theory; fundamentals of security analysis; portfolio construction and management.  FIN 406H - Security Analysis and Portfolio Management (Honors)(3) Finance 406 is about how to invest money in stocks, bonds and derivative securities. The course focus is on creating portfolios of assets rather than on picking individual assets for investment. To create a portfolio of assets, the portfolio manager must have knowledge of the assets available for purchase, the markets the assets are traded in, and the statistical and mathematical techniques needed to assign weights to the assets within the portfolio. The manager must also be able to predict changes in the economy that justify changes in the portfolio, as well as be able to evaluate the performance of the portfolio relative to standard benchmark portfolios such as the S&P500.The course begins with a review of the structure of the asset markets, basic pricing formulas, fundamental and technical analysis, and the tools from previous statistics, economics, and calculus classes needed. Different models relating risk and return such as the CAPM and arbitrage pricing model are covered. These models exemplify how investors are willing to trade-off the variance in returns from investments with the expected value of the investment. The students then learn how to choose the weights to assign to each asset available to maximize the expected return while minimizing risk of the portfolio using the portfolio theory of Markowitz. While the focus of this section of the class is on investing in equities, the portfolio theory learned is applicable to all types of assets. Because there are important differences between stocks and bonds, the next section of the class focuses on the unique characteristics of fixed income securities. Models explaining the different risk and return characteristics of bonds are examined. Because fixed income securities prices and returns are directly linked to changes in interest rates, theories of what determines interest rates are presented and applied to evaluating the performance of portfolios including fixed income securities. The course concludes with an overview of investment in options and futures contracts. The basic pricing models for these types of assets are reviewed as well as practical concepts of investing in derivatives such as margin accounts and creating synthetic returns using combinations of different types of options.As an Honors course, the level of research and academic investigation is enhanced with outside journal readings in topics such as portfolio theory, anomalies and market efficiency, overpricing, and current topics in Portfolio Management as material is published. This material is incorporated into class discussions and course exams beyond what is covered in the standard version of the class.", "prerequisite": "BA 301", "other": ["Honors"]}, {"course_name": "FIN 407: Multinational Financial Management", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Analysis of the international aspects of managerial finance; emphasis on the impact of the international financial environment on firm operations.", "prerequisite": "FIN 305W"}, {"course_name": "FIN 408: Financial Markets and Institutions", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Functional analysis of major credit institutions; sources and uses of funds; impact of government regulation.", "prerequisite": "BA 301"}, {"course_name": "FIN 408H: Financial Markets and Institutions (Honors)", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Introduction to bonds, equities, derivatives, and financial institutions including insurance, pension funds and mutual funds.  FIN 408H - Financial Markets and Institutions (Honors) (3) Finance 408H is about financial institutions and markets. The markets section will include approximately 9 classes on debt markets, and another nine classes on equity markets (e.g. NYSE, NASDAQ) and derivatives (options and futures). The primary institutions covered in this course include insurance companies, mutual funds, pension funds, securities firms, and investment banks. We hope to include an analysis of personal financial planning issues as well. Reading assignments at various web sites will be made. The course will include weekly spreadsheet assignments that focus on the course concepts presented in class. These assignments ought to provide a rigorous understanding of the concepts recently presented in class and they will develop and improve the students' Excel skills. The overarching objective is for each student to develop an understanding of markets and institutions that will provide lifetime enjoyment.", "prerequisite": "BA 301", "other": ["Honors"]}, {"course_name": "FIN 409: Real Estate Finance and Investment", "department": "Finance (FIN)", "credits": "3 Credits", "description": "The sources and uses of credit; instruments and methods of financing; the theory and practice or real estate investment analysis.  FIN (R EST) 409 Real Estate Finance and Investment (3) Real Estate financial markets are rapidly changing, with new instruments and ideas introduced every day. Therefore, the emphasis of this class will be on preparing the students to tackle any new instrument that might be introduced to the market, understanding why and how people make money in the field, and be able to understand and utilize the innovations that have been introduced and are still being developed. The course will provide a broad coverage of real estate investment, finance, and valuation. We will study different measures of investment performance, the impact of the financing decision on real estate investment risks and return, and various real estate financing techniques. Specific topics include: legal considerations in real estate finance, present value concepts, fixed rate mortgage loans, adjustable rate and variable payment mortgages, underwriting and financing residential properties, income-producing properties and valuation fundamentals, leases, projecting cash flows, investment value, investment and risk analysis, financial leverage and financing alternatives, disposition and renovation of income properties, financing corporate real estate, real estate capital markets, the secondary mortgage market and REITS.", "prerequisite": "BA 301"}, {"course_name": "FIN 410: Derivative Markets", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Functions, techniques, and impact of speculation conducted through forward markets; the nature of speculative transactions, pricing, and methods of trading.", "prerequisite": "FIN 406"}, {"course_name": "FIN 413: Risk Management of Financial Institutions", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Measuring and managing risk faced by financial institutions.  FIN 413 Risk Management of Financial Institutions (3) This course focuses on measurement and management of risk faced by managers of modern financial institutions. Students will be introduced to various tools and techniques used to measure and analyze risk from traditional balance sheet activities (such as credit risk, liquidity risk, indolvency risk, interest rate risk and market risk) and from off-balance sheet activities. In addition, students will learn strategies for controlling and managing the risks to achieve the best risk-return outcome. This course is designed to be an upper level, undergraduate course. Students will have opportunities to apply fundamental concepts learned in other finance classes. It is recommended for business students, especially finance majors, who wish to have careers in financial service firms or non-financial firms that use financial assets.", "prerequisite": "BA 301"}, {"course_name": "FIN 414: Financial Trading and Applications", "department": "Finance (FIN)", "credits": "3 Credits", "description": "The focus of this course is the application of financial theory and technology to the practice of financial trading. The first half of the class examines tools for constructing and evaluating trading strategies. After a short review of probability and statistics, attention turns to the analysis of models for valuing options, credit default swaps, and other financial instruments. Emphasis is placed on the assumptions underlying these models and the application of these models in the real-world. This discussion includes approaches for estimating volatility and the use of the models when underlying assumptions do not hold. The first half of the course concludes with a discussion of value-at-risk and tools for evaluating performance. The analysis of these topics highlights commonly used measures of performance and the potential pitfalls using these measures. The second half of the class examines trading strategies commonly used be hedge funds. Strategies discussed include merger arbitrage, relative value, momentum, index arbitrage, and other quantitative based strategies. Students also study accounting based and fundamentally based trading strategies. Application of these strategies in both the equity and fixed income markets is examined. Attention is also paid to the impact of trading on market prices and other aspects of market microstructure. Throughout the second half of the course, students participate in a project in which they form into teams of fund managers who analyze market data with the purpose of constructing and managing a portfolio that applies various trading strategies. The fund is managed using market simulation software that allows students to execute all trades using real-time market prices and allows them to go long or short equity, commodity, fixed income, and foreign exchange instruments, as well as derivative securities. Upon completion of the project, students make a pitch to a group of potential investors (the class) in which they summarize the themes underlying their strategies, provide performance metrics for their fund, and discuss their primary trading strategies if they were to continue as fund managers.The course pedagogy is lectures, case assignments, trading and valuation simulations, and a trading project. The class will make extensive use of Bloomberg, Reuters, trading software, basic programming languages for financial software, and other technology available.", "prerequisite": "FIN 305W"}, {"course_name": "FIN 414H: Financial Trading and Applications", "department": "Finance (FIN)", "credits": "3 Credits/Maximum of 3", "description": "This course focuses on financial modeling and analysis of trading strategies. Bloomberg, Reuters, spreadsheets and trading simulations are used extensively.", "other": ["Honors"]}, {"course_name": "FIN 415: Advanced Financial Modeling", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Develop financial models using spreadsheets, VBA programming, and trading room applications such as Bloomberg and @Risk.  FIN 415 Advanced Financial Modeling (3) Students will develop financial models using spreadsheets, VBA programs, and trading room applications such as Bloomberg and @Risk. Students learn Excel's financial functions, shortcuts, web queries, data analysis capabilities, and optimization techniques. Students use @Risk software to define variable distributions and correlations to run Monte Carlo simulations to evaluate stochastic processes. Students access market data through the internet and proprietary providers such as Bloomberg. Students build models to construct optimal portfolios of securities and asset classes. Students estimate asset returns using CAPM, multi-factor models, and fundamental analysis. Students estimate asset volatility using exponential weighting, GARCH, and Black-Scholes implied volatility. Students model and optimize bond portfolios using portfolio duration, convexity, leverage, and income. Students value options using Monte Carlo, Black-Scholes, and binomial option pricing models. Students learn to apply Brownian motion models to asset returns and prices. Students construct and test delta-hedging strategies for option portfolios. Students use matrix algebra and Excel matrix functions to compute portfolio return and volatility. Students write VBA functions and macros using VBA code, objects, array functions, loops, matrix operations, and data types. Achievement is measured by assignments, computer-based exams, and a final assignment.", "prerequisite": "FIN 406"}, {"course_name": "FIN 416: Intermediate Financial Modeling", "department": "Finance (FIN)", "credits": "3 Credits", "description": "The topics covered in this course build on the foundations of corporate finance presented in FIN 301, Corporate Finance. Specifically, the course focuses primarily on the development of spreadsheet applications and the use of the case method to apply decisionmaking procedures to real-world problems in finance areas. The primary objective of this course is to \"marry\" corporate finance theory with practice. Students should develop the ability to use finance concepts to solve practical finance problems. Throughout the course, students will be exposed to spreadsheets (e.g., Microsoft Excel) to develop models used in the financial decision-making process. The course will enable students to build a firm foundation in the principles of financial management and an understanding of how to apply concepts in financial management for the valuation process. Students will work as a group for a semester-long project, which will expose students to critical topics such as financial ratio analysis, financial forecasting, regression analysis, portfolio management, asset valuation, capital budgeting decisions via spreadsheets. Students will access market data through the internet and proprietary providers such as Bloomberg and Y-Charts.", "prerequisite": "FIN 301"}, {"course_name": "FIN 418: Energy Finance", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This course offers an exploration into energy finance through an examination of the oil, gas, and coal commodity markets, as well as global electricity markets and renewable generation. The course addresses fundamental concepts associated with the complex physical and financial risks faced by firms in the energy industry. Students gain the ability to think critically about the entire energy value chain through an overview of the fundamental practices used by firms in the exploration, production, storage, refining, and processing of hydrocarbon-based energy commodities and the development and distribution of renewable energy and clean-air technologies.", "prerequisite": "FIN 301"}, {"course_name": "FIN 419: Advanced Energy Finance", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This course provides an investigation of energy products; energy commodity price formation; credit, counterparty, country risk assessment, and ethics.", "prerequisite": "FIN 418"}, {"course_name": "FIN 420: Investment and Portfolio Analysis", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Investment and risk, types of security investments, sources of investment information, the broker, the stock market, portfolio management.", "prerequisite": "FIN 301"}, {"course_name": "FIN 426: Analysis of Interest Rates and Debt Markets", "department": "Finance (FIN)", "credits": "3 Credits", "description": "The course starts off with a review of the time value of money concepts and the pricing of standard cash flows such as annuities, perpetuities. Next, an overview of the Treasury markets is provided with emphasis on both the primary and the secondary markets. In particular, the economics of the Treasury auctions, on-the-run/off-the-run liquidity issues, the presence of the zero lower bound, the economics of inflation-protected bonds, and other topics will be discussed at length. Students will also learn how to interpret the shapes of the nominal and the real yield curves, how to forecast short/long term future directions of rates as well as how to forecast future inflations based on nominal-real rate differentials.  The course then moves on to non-Treasury segments of the fixed income markets: forward contracts, repurchasing agreements, floating rate notes, swaps, single stock futures, corporate bonds. For each topic, standard pricing techniques and relevant practical issues will be discussed. For example, how can a fixed income investor price a bond newly issued by a corporation based on their past equity market performance, using techniques typically employed by Moody's KMV? How does an investor gauge the potential illiquidity of a bond when transaction data are sparse? Or how one can extract a measure of the London Inter-bank Offered Rate (LIBOR) from the single stock futures markets? Or how a Chief Financial Officer (CFO) could hedge interest rate risks using standard duration and convexity hedging techniques even in a quick moving environment when assumptions underlying these techniques are likely, to varying degrees, violated.  The final third of the course deals with relatively more advanced topics. Students are introduced to the use of risk-neutral probability measures in pricing fixedincome derivative products (callable bonds, treasury futures, swaptions) in the context of a binomial tree. For example, students learn how to use calibrated binomial trees of interest rates to accommodate bonds¿ callable features, how to compute/interpret the options-adjusted spreads, how to account for various institutional features of the Treasury bonds futures markets and why futures and forward prices may differ when bonds are the underlying assets. The class finishes with a topic on Collateralized Debt Obligations (CDOs) and the economics of their mispricing prior to the Great Recession.", "prerequisite": "FIN 406"}, {"course_name": "FIN 427: Derivative Securities", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Introduction to futures contracts and options, leading to a working understanding of their importance in financial management applications.", "prerequisite": "FIN 420"}, {"course_name": "FIN 428: Fixed Income Securities", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This course develops a framework for the analysis of fixed income securities, one of the largest segments of global financial markets. Valuation and risk-return characteristics of these instruments are examined, in addition to trading and portfolio strategies for bonds, forwards, swaps, and repurchase agreements. Students examine these securities with regard to duration, convexity, credit risk, and formal term structure models. Various data sources and financial software, including Bloomberg Professional ®, are used to integrate theoretical concepts with practical applications. The aim of this course is to provide you with an introduction to the valuation of fixed income securities and the management of fixed income investment portfolios. In their simplest form, fixed income securities are characterized by pre-determined cash-flows that occur at fixed points in time, thus the term \"fixed income\". Coupon bonds are the most widely recognized fixed income securities. We will start with the basics of bond pricing - the relationship between the price of a bond, measures of return on the bond, and measures of risk. The tools for the valuation of bonds, fixed income derivatives and credit derivatives will be covered. With these building blocks in place, we will discuss bond portfolio management and construction.", "prerequisite": "FIN 301"}, {"course_name": "FIN 430: Estate Planning", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Liquidity planning, titling and transfer of property, trusts, federal unified tax system, gifting, incapacity planning, legal documents.  FIN 430 Estate Planning (3) This course addresses estate planning issues for individuals as part of an overall personal financial plan. Personal financial planning encompasses budgeting, credit management, insurance, taxes, investments and retirement planning in addition to estate planning. The objective of this course is identifying and quantifying the goals of an individual regarding their final wishes and determining how best to meet those goals given the current applicable laws and the individual's situation. The estate administration and probate process are discussed along with common estate documents. The titling and transfer of assets as well as asset valuation are covered. Methods used to provide estate liquidity are presented. Common forms of trusts that are used in estate planning are introduced along with an overview of basic methods of transferring family owned businesses. Case studies are emphasized since estate planning is unique to each individual's situation. Some legal research is commonly incorporated into the course because estate planning is based on federal and state law. Student evaluation generally consists of examinations, individual and group assignments, quizzes, and case studies. Students desiring a career in financial services, law, or tax accounting should consider incorporating this course into their program of study.", "prerequisite": "FIN 330"}, {"course_name": "FIN 450: Retirement Planning", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Retirement planning: qualified and non-qualified plans, characteristics, provisions, regulations administration, application approach with case studies.  FIN 450 Retirement Planning (3) This course presents retirement planning from the perspective of a financial services practitioner. Students will develop a working knowledge of both qualified and non-qualified company retirement plans including plan characteristics, provisions, applications, and qualifications. Individual retirement plans will also be covered. Exposure to the regulatory and legal basis for plans will be provided. Application case studies will be integrated throughout the course. Emphasis will be placed on designing an appropriate plan given either an individual or a company situation."}, {"course_name": "FIN 451: Intermediate Financial Management", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Case studies are used to develop skills in solving a variety of financial management problems.  FIN 451 Intermediate Financial Management (3)This course is designed to reinforce and extend the principles from its prerequisite, FIN 301, Corporation Finance. It is a required course for the Finance major. It will also serve as a business supporting course for students in other School of Business majors. Students will develop skills necessary to solve a variety of complex financial problems by applying statistical and analytical techniques and utilizing electronic spreadsheets. The course will enable students to develop a firm foundation in the principles of financial management and an understanding of how concepts in financial management are used in the valuation process. The topics are consistent with the knowledge required to prepare students for the relevant portions of Level I of the Chartered Financial Analysts (CFA) Exam. The course will address important financial management topics, including the methods of analyzing capital budgeting decisions and the unique problems they pose, long-term capital structure and dividend policy decisions, corporate financial analysis and forecasting, working capital management, and additional special topics in financial management.", "prerequisite": "FIN 301"}, {"course_name": "FIN 456: International Capital Markets", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This course develops understanding of international capital markets by striking a balance between institutional details, theoretical foundation and practical application.  FIN 456 International Capital Markets (3) (IL) This course extends the issues of international finance into a framework for international investing. It is designed for students aspiring to be money managers and investors operating across national boundaries.Foreign travel enables students to contrast the micro-structure of financial markets in the United States. with those in other centers that play important roles in our global financial system.Students are also are given an opportunity to learn about business, cultural, and political aspects of international investment. Besides class meetings on campus, students are assigned readings, videos, and research projects to be completed before the foreign experience component of the course. While abroad, students visit specific sites and attend specific lectures that will enable them to complete further course work upon their return to the United States. Topics include the case for international asset diversification, international asset pricing, international stock, fixed-income, and derivative markets, and the process of international investing. Other materials will be specific to the foreign business center visited during the course.(The initial offering of this course included a visit to London where students toured the stock exchange and financial firms, attended lectures, and met with financial executives; this gave students exposure to a major international financial institution and the largest currency market in the world.) The travel portion requires additional costs to the student beyond tuition.", "prerequisite": "FIN 301", "other": ["International Cultures (IL)"]}, {"course_name": "FIN 460: Real Estate Financial Analysis", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Debt and equity financing, capital structure, \"creative financing,\" risk analysis, corporate asset management.  FIN (R M) 460 Real Estate Financial Analysis (3) The objective of this course is to provide in-depth coverage of real estate investment and financing decisions. The focus is on the private market, including corporate asset management. Investment analysis moves from the basics of forecasting cash flows, through advanced topics including the impact of real option value on investment and development decisions. Risk measurement is given particular attention with a focus on sensitivity and simulation analysis. There is some coverage of asset pricing models like the Capital Asset Pricing Model, which is critically analyzed with respect to its applicability in real estate markets. The impact of illiquidity, management costs, and the suspicion of non-normally distributed returns are explored, as are the implications of relative market inefficiency. The financing module begins with the basics of mortgage debt mathematics, which is then extended to include comparisons of various repayment programs. Included are interest-only, balloon, shared appreciation, growing equity, graduated payment and reverse annuity loans, as well as various creative financing of commercial properties.The latter include participating mortgages, convertible mortgages, and mezzanine debt. Featured in the corporate asset management section is the lease/buy decision. Other topics may be addresses based on current events. It is anticipated that guest speakers will be invited where appropriate.", "prerequisite": "FIN 305W", "other": ["Cross-listed with: RM 460"]}, {"course_name": "FIN 461: Portfolio Management and Analysis", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Investement policy and process, modern portfolio theory, portfolio construction, and portfolio performance measurement and evaluation.  FIN 461 Portfolio Management and Analysis (3) The course provides a mix between theories and applications of portfolio management. The content is divided into five sections: (1) implications of the efficient market hypothesis and behavior finance in portfolio management, (2) investment policy and process, (3) diversification and modern portfolio theory, (4) portfolio performance measurement and evaluation and (5) bond portfolio management. After completing the course, students are expected to (1) demonstrate the importance of portfolio management under the efficient market hypothesis and behavior finance, (2) write an investment policy statement, (3) create an optimal portfolio, (4) manage bond and equity portfolios, and (5) measure and evaluate portfolio performance.", "prerequisite": "FIN 420"}, {"course_name": "FIN 462: Intrieri Family Student Managed Fund - Fund Officer / Lead Analyst Practicum", "department": "Finance (FIN)", "credits": "1-3 Credits/Maximum of 4", "description": "Students provide leadership as an Officer or Lead Analyst for the Intrieri Family Student Managed Fund. Students conduct economic, industry, and company financial analysis to recommend investment portfolio decisions. In this course, students will provide leadership as an Officer and/or Lead Analyst for the Intrieri Family Student Managed Fund, an actual investment fund that currently holds a stock portfolio of approximately $250,000. The student will serve as economic, industry, and security financial analysts and portfolio managers in concert with the Standards of Practice Handbook from the CFA Institute. These standards are integral to the curriculum for all three levels of the Chartered Financial Analyst exam.", "prerequisite": "FIN 461"}, {"course_name": "FIN 470: Real Estate and Capital Markets", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Analysis of publicly-traded real estate of both the equity, (REITs) and debt (MBSs) sides.  The course also provides international perspectives. FIN 470 / RM 470 Real Estate and Capital Markets (3) The objectives of this course are to expose the student and explore the issues associated with the analysis of \"public\" (\"Wall Street\") real estate, including both equities (such as Real Estate Investment Trusts or REITs) and debt vehicles (such as Mortgage-Backed Securities or MBSs). In addition, the course will focus on the increasingly globalization of real estate capital markets as the real estate sector becomes integrated into the global financial system. The differences between private and public real estate analysis will also be explored, including the suitability of traditional asset pricing models for real estate analysis. Topics include the growing impact of institutional real estate forces on the real estate sector, the use of modern financial economics methods to real estate including the concept of market efficiency, modern portfolio theory applications, market measures of risk and return, the use of option-based models, and other advances. The rise of Wall Street's interest in real estate securities is an important institutional development and serves as the underlying background for the analysis of MBSs using fixed-income security techniques. As globalization has spread, the real estate sector has moved with these changes and prospects for a global real estate market are examined and evaluated. This course serves as a compliment to FIN 460, which emphasizes traditional financial analyses of individual real estate projects. In FIN 470, real estate securities are viewed as a natural extension towards the complete integration of real estate and capital markets. In this sense, these courses will enable traditional and modern analyses of the real estate sector for years to come.", "prerequisite": "FIN 305W", "other": ["Cross-listed with: RM 470"]}, {"course_name": "FIN 471: International Finance", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Financial decision making in an international environment.  Emphasis on topics relevant to small businesses and entrepreneurs.  FIN 471 International Finance (3)This course provides an understanding of the basic terminology, structure, and importance of international finance for corporations. It will also help enhance analytical and critical thinking skills. Topics of study include foreign exchange (FX), FX markets, FX instruments, FX risk, hedging of these risks, international debt and equity markets, etc.", "prerequisite": "FIN 301"}, {"course_name": "FIN 475: Financial Decision Making", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Problems and cases in financial decision making for non-financial corporations and financial institutions.  FIN 475 Financial Decision Making (3)The objective of this course is to tie together the various topics in finance such as corporate finance, investments, and financial institutions & markets. Using the variety of different analytical tools and techniques that students have been exposed to, they will - Evaluate the relationship between profitability and solvency of a firm. - Project the need for short term and long term financing. - Evaluate the various sources of financing and recommend the optimal. - Budget the capital that is raised to identify the profitable projects that capital should be invested in. - Evaluate different dividend policies to maximize value of a firm. - Carefully examine the risk-return tradeoff that portfolio managers face. - Study the relationship between assets and liabilities of financial institutions. - Critically evaluate synergies that are created in mergers and acquisitions.", "prerequisite": "FIN 302"}, {"course_name": "FIN 476: Financial Ethics", "department": "Finance (FIN)", "credits": "1 Credits", "description": "In this one credit course, we explore ethical standards for financial analysts and portfolio managers as a part of the Standards of Practice Handbook from the CFA Institute. In this one credit course, we explore ethical standards for financial analysts and portfolio managers as a part of the Standards of Practice Handbook from the CFA Institute, which also serves as a part of the curriculum for all three levels of the Chartered Financial Analyst exams and both levels of the Chartered Alternative Investment Analyst (CAIA) exams.", "prerequisite": "FIN 301"}, {"course_name": "FIN 477: Behavioral Finance", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This course will introduce students to behavioral finance, which is the intersection of psychology, economics, and finance. They will learn how individuals and firms make financial decisions and how these decisions might deviate from perceived rational or traditional choices. Students will explore the existence of psychological biases in financial decision-making and examine their impact on financial markets. The course will also explore the interplay of biases through a stock trading simulation.", "prerequisite": "ECON 102"}, {"course_name": "FIN 478: Advanced Financial Analysis", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This seminar course covers the investment tools necessary to prepare junior professionals in the investment management industry. Students are exposed to economic foundations that underpin financial statement analysis, corporate finance, and portfolio management. The course focuses on advanced applications in traditional asset classes (such as equity and fixed income investments) and alternative investments (such as private equity and hedge funds).", "prerequisite": "FIN 301"}, {"course_name": "FIN 480: Alternative Investments", "department": "Finance (FIN)", "credits": "3 Credits", "description": "This seminar course covers topics necessary for junior professionals to understand how alternative investments operate on a stand\u0002alone and portfolio basis. Students are exposed to economic foundations and statistical properties common in non-traditional investments, the role of asset pricing and risk management, and advanced applications in real assets, commodities, real estate, hedge funds and managed funds, private equity, and structured products.", "prerequisite": "FIN 301"}, {"course_name": "FIN 491: Financial Planning Capstone", "department": "Finance (FIN)", "credits": "3 Credits", "description": "Critical thinking and decision-making about personal financial planning topics in the context of the financial planning process.  FIN 491 Financial Planning Capstone (3) This capstone course is designed to reinforce and extend the principles from each of its prerequisite courses. The CFP Board of Directors are requiring the addition of this financial plan course as a requirement to CFP Board's educational standards to enhance the knowledge, skills and abilities of individuals seeking to attain the CFP&reg; certification to deliver professional and competent financial planning services to the public. This course will engage the student in critical thinking and decision-making about personal financial planning topics in the context of the financial planning process. The purpose of this course is to both refine and develop the skills needed to become successful financial planners when working with individuals, families, and business owners in helping them to meet their financial needs and goals. This course will address the important financial planning topics listed in the previous section.", "prerequisite": "FIN 330"}, {"course_name": "FIN 494: Research Projects", "department": "Finance (FIN)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "FIN 494H: Research Projects", "department": "Finance (FIN)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "FIN 495: Internship", "department": "Finance (FIN)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "FIN 495A: Lead Fund Manager Practicum", "department": "Finance (FIN)", "credits": "3 Credits/Maximum of 6", "description": "FIN 495A Nittany Lion Fund -- Lead Fund Manager Practicum (3 per semester/maximum of 6) A Lead Fund Manager is accountable for sector performance as well as sector output. This means that while the Lead Fund Manager has to be an effective delegator of work to his or her Associate(s), the manager must also have great attention to detail when reviewing all aspects of pitches, weekly reports, and earnings reports. A Lead Fund Manager focuses more on knowing the big trends in his or her overall sector and in each subsector. The Lead is the strategist for the sector. He or she has the responsibility of choosing what stocks to pitch in class and at PSIA meetings. This means that the Leads must constantly reevaluate not only their current portfolio, but the sector as a whole, in order to find where to best allocate their respective funds. Another major responsibility that a Lead Fund Manager has is to lead a group of anywhere from 10-50 PSIA members. While there are weekly educations for the PSIA analysts, it is one of the most important responsibilities of a Lead Fund Manager to provide support for the PSIA analysts to help them with their PSIA certification assignments. In addition to helping the analysts understand their weekly assignments, the Lead Fund Managers are also responsible for holding weekly sector meetings to give sector-specific educations to a smaller group of PSIA analysts. The goal for any Lead should be to get as many PSIA analysts as involved and interested as possible in PSIA. The interest generated should draw PSIA analysts to apply for entrance into the Nittany Lion Fund. PSIA is the feeder system for the NLF and making sure there are intelligent and motivated applicants each semester ensures that the investment group will continue to have a strong class going forward. Consequently, once the Lead Manager has developed analysts' interest in applying for the NLF, it is an unwritten responsibility of the Lead to help the applicants to become as best prepared as possible for the interviews (Associates are encouraged to help new applicants as well). In total, the role that the Lead plays is not just that of a figurehead, the Lead must be well informed of current events and trends within their sector, and they must be able to speak eloquently of their investment strategy when speaking in class, at PSIA meetings, or to investors at the yearly investment meeting.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "FIN 495B: Nittany Lion Fund - Executive Board Practicum", "department": "Finance (FIN)", "credits": "3 Credits/Maximum of 6", "description": "FIN 495B - Nittany Lion Fund - Executive Board Practicum (3 per semester/maximum of 6) The Executive Board practicum affords students with intense practical experience in oversight and performance of the Nittany Lion Fund (NLF). Executive Board members and Directors are accountable for all aspects of the NLF. An Associate Fund Manager is responsible for all work that is presented to his or her Lead Fund Manager and in turn, a Lead Fund Manager is responsible for all work that is submitted for the Nittany Lion Fund (NLF) to view. While those are certainly tremendous responsibilities, an Executive Board Member is ultimately responsible for any and every document that leaves the Nittany Lion Fund, most of which are delivered to investors. It is the responsibility of the Executive Board to make sure that both the weekly news, and quarterly performance releases are flawless. Additionally, although the Lead Fund Managers are responsible for their individual sector's performance, the Executive Board is held responsible for the overall performance of the Nittany Lion Fund. This means that the Executive Board must do a number of things to keep performance awareness and accountability at high levels. Students in these executive positions are expected to ask excellent questions during stock pitches and be, in a sense, a devil's advocate for each pitch, making sure that there was proper due diligence and thought put into the strategy of the pitch. With regard to being accountable to investors, the Executive Board is responsible for conducting weekly conference calls with the NLF's investment committee as well as leading the yearly investor meeting. As for the PSIA, the Executive Board is responsible for booking locations for meetings, handling the funds for all club transactions, and developing and implementing the education for the analysts to become PSIA certified. Education is a very large part of the Nittany Lion Fund. An Executive Board Member is expected to utilize their past experience to provide helpful influence to other members of the Nittany Lion Fund as well as the large group of PSIA members. While the members of the Executive Board all have different responsibilities, in aggregate the group is responsible for the performance of Nittany Lion Fund as a whole, as well as being individual figureheads and spokesmen for the NLF."}, {"course_name": "FIN 496: Independent Studies", "department": "Finance (FIN)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "FIN 496A: **SPECIAL TOPICS**", "department": "Finance (FIN)", "credits": "1-6 Credits"}, {"course_name": "FIN 497: Special Topics", "department": "Finance (FIN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "FIN 499: Foreign Studies", "department": "Finance (FIN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]