[{"course_name": "FOR 150S: First-Year Seminar", "department": "Forestry (FOR)", "credits": "2 Credits", "description": "The objectives of this first-year seminar course are to: (1) Engage and prepare first-year college students for academic success by orienting them to the scholarly community and introducing them to available academic resources. (2) Introduce students to Pennsylvania's forests and some of the research and other activities currently underway at Penn State that supports the conservation and management of these resources. (3) Introduce students to strategies they can use while at Penn State to prepare for careers related to forestry, wildlife/fisheries, and other natural resources disciplines.", "other": ["First-Year Seminar"]}, {"course_name": "FOR 200: The Profession of Forestry", "department": "Forestry (FOR)", "credits": "1 Credits", "description": "Introduction to the profession of forestry and related career opportunities."}, {"course_name": "FOR 201: Global Change and Ecosystems", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "This course will provide students with an understanding of the climate system, ecosystems, and feedbacks between the two.  FOR 201 Global Change and Ecosystems (3) (GN) Ecosystems across the planet are facing unprecedented pressures and changes as society seeks to support continued population growth and increasing standards of living. Understanding how ecosystems in Earth's biosphere interact with the climate system and how feedbacks alter the services that ecosystems provide is necessary to meet society's demands. Global Change and Ecosystems is designed to provide students with a general understanding of the climate system, ecosystems, and feedbacks between the two. The goal of this course is to develop critical thinking skills related to understanding the many relationships between society and natural systems. In this course students are encouraged to think critically about these relationships and the information used to develop assessments. This course broadly covers: 1) global change factors, including climate change, land-use change, and pollution, 2) life on land, where we will explore the diversity of Earth's ecosystems, 3) global change impacts, where we will identify how global change factors are impacting our ecosystems, and 4) ecosystem services, where we will examine the coupling of human and natural systems. Students will complete this class with the ability to: 1) interpret scientific figures, 2) critically evaluate information about global change and ecosystems, 3)define what constitutes an ecosystem and the controlling factors, 4) describe Earth's biomes and major ecosystems, and 5) describe the impacts of global change factors on ecosystems.", "prerequisite": "3 credits of science", "other": ["General Education:  Natural Sciences (GN)"]}, {"course_name": "FOR 203: Field Dendrology", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Field identification of native and introduced trees and shrubs.  FOR 203 Field Dendrology (3) This course establishes the basic skills of woody plant and tree species identification necessary for students of natural resource management, ecology, and natural history. The objectives of the course are for students to 1) recognize many of the common woody plant species encountered in Pennsylvania (and the region) and the taxonomic traits used in their identification, 2) employ the diagnostic skills useful for woody plant identification, including the use of dichotomous keys, and 3) identify resources for identification and continued study of woody plants in Pennsylvania and the region. This field-based course introduces native, ornamental, and invasive woody plant species in a diversity of landscapes including forested, urban, suburban, and riparian areas."}, {"course_name": "FOR 204: Dendrology", "department": "Forestry (FOR)", "credits": "2 Credits", "description": "Taxonomic and silvical characteristics, ranges, genetic relationships, and uses of important forest tree species.", "prerequisite": "FOR 203"}, {"course_name": "FOR 228: Chainsaw Safety, Maintenance, and Operation in Forest Management", "department": "Forestry (FOR)", "credits": "1 Credits", "description": "This course covers the detailed use of the modern chainsaw. The course begins with safety and personal protective equipment (PPE), Occupational Safety and Health Agency (OSHA) regulations, saw selection, and an introduction into safe saw handling skills and techniques. The course then transitions to saw maintenance and proper care of the chainsaw, and then to a hazard recognition, mitigation, and avoidance component that addresses both the work site and the resource being harvested and processed. Once these objectives have been understood, the remaining two-thirds of the course focuses on the practice of chainsaw handling skills and techniques that are necessary for safe operation. This course has an extensive hands-on, experiential learning component in actual tree-felling and processing in the forest, including on-site discussion of harvesting as a forest management tool. The course concludes with training in proper log manufacturing, including scaling and grading of the harvested resource. Efficient recovery of the timber resource that minimize damage on the residual stand is emphasized. (In the B.S. program in Forest Ecosystem Management, this course counts only as an Elective.)"}, {"course_name": "FOR 242: Elements of Project Supervision in Forestry", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Supervisory techniques developed through an understanding of the behavioral sciences applied to field forestry personnel management."}, {"course_name": "FOR 255: GPS and GIS Applications for Natural Resources Professionals", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "FOR 255 GPS and GIS Applications for Natural Resources Professionals (3) FOR 255, GPS and GIS Applications for Natural Resources Professionals, teaches students to apply Global Positioning Systems (GPS) and Geographical Information Systems (GIS) in the management of natural resources. Students learn how GPS works and how to use GPS to find locations in the field and to capture spatial data and transfer it to a GIS system. Students learn how GIS data are structured and how to find, use and edit existing GIS databases and to create new ones. They learn to use various software applications to work with and analyze GIS databases, including both spatial and non-spatial data, to address a variety of natural resources management questions and issues. Finally, they learn to present spatial information in a map that effectively communicates information relevant to a variety of natural resources situations."}, {"course_name": "FOR 266: Forest Resources Measurements", "department": "Forestry (FOR)", "credits": "4 Credits", "description": "This course focuses on the collection, analysis, and presentation of quantitative and qualitative data that describe forest resources and are used in the management and stewardship of forest resources. Sampling techniques, procedures, and equipment used to measure trees and forest parameters, including various forest products, are covered, as is statistical analysis of data. Students learn how the data provides the basis for making informed, science-based management decisions concerning the growth, health, and/or volume of forest resources.", "prerequisite": "FOR 203"}, {"course_name": "FOR 295: Forestry Internship", "department": "Forestry (FOR)", "credits": "1-4 Credits/Maximum of 4", "description": "Supervised field experience related to the student's major.", "prerequisite": "Permission of program"}, {"course_name": "FOR 296: Independent Studies", "department": "Forestry (FOR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "FOR 297: Special Topics", "department": "Forestry (FOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "FOR 299: Foreign Studies", "department": "Forestry (FOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "FOR 303: Herbaceous Forest Plant Identification and Ecology", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "This course focuses on developing herbaceous plant identification skills with emphasis on important plant structural features, common taxonomic terms, dichotomous keys, and botanical nomenclature. This course provides a practical, applied approach to understanding biological and ecological concepts relevant to plants occurring in forested environments. Human dimensions and ethnobotany, and relevant economic, management, and conservation issues are also included, along with the methods by which botanists collect and preserve plant specimens for historical documentation and research purposes.", "prerequisite": "3 credits in BIOL or BISC or FOR or FORT or HORT or PLANT"}, {"course_name": "FOR 308: Forest Ecology", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "FOR 308 FOR 308 Forest Ecology (3)This class will provide the basic concepts of forest ecology and silvics. The class will emphasize (a) community concepts such as sampling, succession, productivity, disturbance, and animal factors, (b) ecosystem concepts such as nutrient and energy cycles and plant-soil relationships, and (c) environmental factors such as light, temperature, moisture, and pollution, and their effects on individual tree species and community structure and function. Other special topics of interest (allelopathy, seed behavior, tropical forests, etc.) will be included as time permits. The class will also include a field component that allows students to observe the effects of various conditions or treatments on forest community structure and growth, and to practice field methods commonly used to measure site factors and environmental processes in forest communities."}, {"course_name": "FOR 320: Forest Fire Management", "department": "Forestry (FOR)", "credits": "2 Credits", "description": "This course will cover the principles and concepts involved in managing forest ecosystems in regard to fire. It will enable students to think analytically and operationally about fire in forested landscapes, taking into account a complex of physical/biological factors, management objectives, and public interest. Fire behavior, fire ecology, and environmental impacts of fire will be studied. This course includes concepts behind both wildfire suppression and prescribed fire planning."}, {"course_name": "FOR 350: Forest Ecosystem Monitoring and Data Analysis", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Quantitative approaches for characterization, monitoring, and comparison of forest ecosystems.  FOR 350 Forest Ecosystem Monitoring and Data Analysis (3) The overall goal of this course is to provide students with opportunities to develop a quantitative approach to the management and conservation of forest ecosystems. The course Comprises three sections, each of a different length. The first section reviews descriptive statistics and basic concepts needed to understand sampling design in the context of forest ecosystem monitoring and data analysis. The second section addresses concepts and steps for designing a monitoring plan, and sampling designs for forest ecosystem monitoring. Sampling designs discussed include (but are not limited to): simple and stratified random sampling, double sampling, and cluster sampling. The third section covers data analysis and modeling tools. Students are expected to know two-sample inference, correlation analysis, analysis of variance and linear regression. The focus of this third section is on the application of these to forest ecosystem issues. The course also covers concepts of statistical model development, selection, and evaluation. Students will develop an understanding of strengths and limitations of using statistical models for forest ecosystem management and conservation. Finally, a broad overview of spatial statistical analysis will be offered. The objective is for the students to know about available tools and be able to look for more information. Major emphasis is placed on case studies and real-world data.", "prerequisite": "STAT 200"}, {"course_name": "FOR 397: Special Topics", "department": "Forestry (FOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "FOR 400: Senior Forest Practicum", "department": "Forestry (FOR)", "credits": "2 Credits", "description": "Application of forest management concepts and principles. Students will collect, analyze, and interpret forest management data and present project solutions.", "prerequisite": "ECON 102"}, {"course_name": "FOR 401: Urban Forest Management", "department": "Forestry (FOR)", "credits": "3 Credits/Maximum of 3", "description": "Nature's role in community development, landscapes, arboriculture, administering urban forestry programs, land-use planning and regulatory policy, open-space conservation, civic environmentalism. The purpose of this course is to provide a broad exploration of planning for and managing trees and natural landscapes to support development of community. Healthy natural resources such as air, water, soil, and vegetation are critical components of community development. Students will explore arboriculture practices, goal-oriented urban forest management, land use planning and regulatory policy, and civic environmentalism. They will learn about ecosystem services of trees and landscapes; arboricultural practices including tree planting in urban areas, tree pruning, tree risk assessment, and amenity tree valuation; policy development and analysis including street tree ordinances and municipal tree commissions; street and park tree assessments and inventories; development of community tree plans and goal oriented urban forest management; land use planning and regulatory policy to conserve natural resources including zoning, subdivision and land development ordinances, comprehensive plans, and open space conservation; civic environmentalism and volunteerism; and conflict resolution. This course will provide students a practical understanding of planning for, and managing, trees and other natural resources associated with human communities.", "prerequisite": "Fifth-semester standing"}, {"course_name": "FOR 403: Invasive Forest Plants: Identification, Ecology, and Management", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "This course addresses the impacts and challenges associated with \"exotic\" plant invasions in eastern North American forests through an interdisciplinary exploration of topics including invasive plant identification and management, ecological interactions and impacts, human roles and influences, and management and policy options. Students are also exposed to a variety of scientific and societal perspectives related to monitoring, managing, and controlling invasive plants.", "prerequisite": "6 credits in BIOL or BISC or FOR or FORT or HORT or PLANT"}, {"course_name": "FOR 409: Tree Physiology", "department": "Forestry (FOR)", "credits": "2 Credits/Maximum of 2", "description": "Fundamentals of the relationship of the basic physiological functions of forest trees to form. Tree Physiology is the study of how trees grow and develop in terms of genetics; biochemistry; cellular, tissue, and organ functions; and interaction with environmental factors. While many physiological processes are similar in trees and other plants, trees possess unique properties that help determine their outward appearance. These processes include carbon relations (photosynthesis, carbohydrate allocation), cold and drought resistance, water relations, and mineral nutrition. The characteristics of trees that define their physiology are longevity, height, and simultaneous reproductive and vegetative growth. Trees have physiological processes that are more adaptable than those in other plants. Height allows trees to successfully compete for light, but also creates transport and support problems. This course investigates the anatomy, morphology and physiology of growth, development, and responses of woody plants with particular consideration of the influence of environmental factors on physiological processes. To develop an understanding of tree physiology the following topics will be presented: Organization, development, and function of woody plant tissues Photosynthesis, respiration, and assimilation in forest trees Water relations and mineral nutrition. Tree growth responses to atmospheric and soil condition. Physiology variation among tree species. Herbicides and tree physiology. Methods and tools of tree physiology research.", "prerequisite": "BIOL 110"}, {"course_name": "FOR 410: Elements of Forest Ecosystem Management", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Changing public attitudes towards the environment during the last several decades have led to a philosophical shift in how we manage our forests. The primary focus of a sound stewardship of many of our public forests has now shifted to the recognition that sustaining ecological integrity of forest ecosystems, including the maintenance and restoration of native biological diversity, may be more important than focusing primarily on commodity production. Ecosystem management has become policy on national forests managed by the U.S. Forest Service and Pennsylvania state forests managed by the Pennsylvania Department of Natural Resources. This course invites students to critically examine the concept of ecosystem management from an ecological, economic, and social perspective, Students will review the evolution of ecosystem management and learn how it is being implemented. Basic questions addressed in this course include: What is ecosystem management? How can concepts such as biodiversity preservation, ecosystem integrity, sustainability, and forest health be achieved in forested landscapes? How can human needs be balanced with ecological goals? How can competing societal goals be balanced? This course is designed for forestry majors and places contemporary management approaches into the larger ecosystem context that uses knowledge of forest history, landscape ecology, conservation biology, forest restoration, and forest certification requirements to develop management solutions that pay particular attention to the maintenance of biodiversity (habitat) and soils. Forest management approaches are investigated with regards to the issue of long-term sustainability, recognizing the often challenging and conflicting demands on forestry to satisfy a diverse set of values given ecological, social, and economic constraints."}, {"course_name": "FOR 418: Agroforestry: Science, Design, and Practice", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Agroforestry integrates trees in agricultural landscapes, and/or agriculture products into forested areas for multiple benefits.  FOR 418 Agroforestry: Science, Design, and Practice (3) (US;IL) Agroforestry is the intentional design of land use systems that combine tree crops with plants and/or animals in a manner that seeks to promote ecological and economic benefits within the landscape. Two possible arrangements for such systems are (1) the integration of trees within non-forested settings; and/or (2) the introduction of high value 'crop' species into existing forestlands. The objective of the course is to foster a practical working knowledge of agroforestry as it is experienced both in Pennsylvania and throughout the world, so that students from a variety of backgrounds can integrate agroforestry practices and thinking into their own disciplines, interests, and lives. Although agroforestry is an ancient land use approach, it is new in many places, and improvements and adaptations to traditional practices are needed to meet local circumstances. This course will provide a framework for critical assessment and implementation within this context.One of the fundamental aspects of agroforestry is that it is a land use system that operates at a landscape or ecosystem scale. For agroforestry to succeed, many factors, including ones external to the agroforestry practice itself must be considered. Therefore the course is interdisciplinary in nature and topics in ecology, economics, sociology, and policy that are related to agroforestry practices will be discussed. In evaluating the students, the primary emphasis is on class discussion. Students will be expected to review and discuss papers and contribute to the ongoing dialogue and debate about agroforestry as a sustainable land use. Students will be required to carry out critical reviews of agroforestry papers and publications as well as design and develop an agroforestry project pertinent to their individual field of interest and expertise. The course will be offered every Spring semester.", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "FOR 421: Silviculture: Applied Forest Ecology", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "This course explores the methods available to apply ecological concepts to actively manage forested ecosystems for a variety of societal objectives. It addresses methods used to blend the maintenance of biodiversity in forest ecosystems with extraction of commodities under the paradigms of Ecosystem Management and Ecological Forestry. Course objectives include gaining the ability to 1) apply silvicultural terminology and basic ecological concepts as they relate to forest development and silvicultural practices, 2) predict how silvicultural practices influence soil resources, water issues, forest health, timber production, wildlife habitat, and biodiversity, 3) integrate ecological and social considerations into silvicultural practices, and 4) employ silvicultural concepts to actual forest stands by developing silvicultural prescriptions. Topics include silvicultural systems, silvics, cover types, soil, habitat types, ecological classification systems, growth and yield, stand descriptions, crown classes, the site index, release, precommercial thinning, wood quality and pruning, herbicides and vegetation management, commercial thinning, crop tree management, stocking charts, maintaining forest health, natural and anthropogenic disturbances, forest stand dynamics, succession, regeneration inventories, managing for complexity, natural regeneration, seed-tree and shelterwood methods, uneven aged silviculture (selection and control methods), coppice, irregular shelterwood, deer browsing, clearcutting, site preparation, direct seeding, planting, ecosystem management across different scales, prescribed fire, and management techniques that maintain critical ecosystem processes and components such as soil, water, and wildlife. This is a core course in forestry, although it is also designed for wildlife professionals, conservation biologists, and natural resource professionals interested in the scientific foundation and practical application and implementation of forest management techniques. Whereas the disciplines of ecology and conservation biology help us understand the biological consequences of human manipulation, it falls upon the field of silviculture to balance the often conflicting demands between ecological integrity and society's demand for forest products in practice.", "prerequisite": "FOR 266"}, {"course_name": "FOR 430: Conservation Biology", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "The application of biological principles to issues in the conservation of biodiversity.  FOR (W F S) 430 Conservation Biology (3) This course applies basic principles of ecology and genetics to issues regarding the conservation forested ecosystems and their associated fisheries and wildlife. The objective of this course is to provide a broad appreciation of the concepts in conservation biology that are important to solving contemporary natural resources problems. Students will be exposed to the history of conservation biology, values of biodiversity, definitions of species concepts, protecting the genetic structure of species, extinction as a natural process, vulnerability to extinction, biodiversity at the community, ecosystem, and landscape levels, habitat fragmentation, metapopulations, legal aspects of conservation, ecosystem management, exotic species, pollution, human population issues, measuring genetic diversity, attitudes towards nature, ex-situ conservation, and ecosystem restoration.", "prerequisite": "BIOL 220W", "other": ["Cross-listed with: WFS 430"]}, {"course_name": "FOR 439: Timber Sale Administration", "department": "Forestry (FOR)", "credits": "3 Credits/Maximum of 3", "description": "This course provides hands-on experience with all of the activities associated with overseeing a timber sale, including the legal aspects of arranging a sale, marking timber and calculating volume, road and sale layout, best management practices, inspections, harvesting equipment, working with contractors and loggers, and liability issues. The objectives of the course are to 1) obtain and translate a property deed onto the ground and create a professional map of the timber sale area; 2) design a timber sale, including cutting boundaries, skid trails, haul roads, and landings such that site impact is minimized, harvesting efficiency and safety is maximized and productivity is maintained; 3) collect sufficient information for a professional timbersale prospectus, including which harvesting systems would be best suited to the situation; 4) complete an erosion and sedimentation plan, a stream crossing permit, and local harvesting ordinance requirements; 5) develop a timber sale contract and a landowner-consultant contract to protect all parties and address all possible legal scenarios; 6) work with, inspect, supervise and provide meaningful feedback to harvesting, road building, and herbicide application contractors; 7) retire a timber sale area to prevent erosion, create habitat variety and/or recreational opportunities, and maintain aesthetic qualities.", "prerequisite": "FOR 203"}, {"course_name": "FOR 440: Forest and Conservation Economics", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "This course focuses on economic and financial concepts and tools used in managing forests and natural resources. Specifically, students will: a) use financial tools including cost-benefit analysis to analyze forest investments, b) recognize forest-related business operations and management issues, c) apply economic principles to forest and natural resource management decisions including environmental and nonmarket valuation methods, and d) discuss current issues in forest management and economics such as climate change, bioenergy and tropical deforestation. Students will carry out a case study of a forest-related business.", "prerequisite": "AGBM 101"}, {"course_name": "FOR 450W: Human Dimensions of Natural Resources", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Addresses human needs and desires, from individuals to nations, for social, ecological, and economic benefits derived from natural resource decisions.", "prerequisite": "6 credits of social and behavioral sciences", "other": ["Writing Across the Curriculum"]}, {"course_name": "FOR 455: Remote Sensing and Spatial Data Handling", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "FOR 455 is an advanced remote sensing and geospatial technology course emphasizing the use of remote sensors and geographic information systems to study the Earth's land surface. The course emphasizes the use of these technologies primarily in the context of forestry but also in the broader context of natural resources management. Remote sensing technologies that are emphasized include aircraft and satellite-borne sensors in the visible and near-infrared portions of the electromagnetic spectrum, as well as active sensing devices like lidar (Light-detection and Ranging) technology. Students gain proficiency in the use of advanced remote sensing/image processing and geographic information systems (GIS) software to display, analyze, and map land surface features.", "prerequisite": "FOR 255"}, {"course_name": "FOR 466W: Forest Management and Planning", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Students learn the rationale, processes, and tools for forest management decision-making and planning. Developing and communicating forest plans for forested properties. FOR 466W Forest Management and Planning (3) Students learn the rationale, processes, and tools for forest management decision-making and planning. They learn to identify and obtain information needed for management decision-making and planning. They learn to develop management alternatives and to use appropriate data and tools to evaluate those alternatives. Students learn to apply financial analysis to evaluate the financial viability of stand-level forest management activities. Students develop and write forest management plans for small (< 250 acres) and large (> 250 acres) forested properties. Students identify how alternative forest management objectives are balanced in developing management plans. Students evaluate and critique public agency forest management plans.", "prerequisite": "FOR 255", "other": ["Writing Across the Curriculum"]}, {"course_name": "FOR 470: Watershed Management", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Management of wild land watersheds for control of the amount and timing of water yield, water quality, erosion, and sedimentation. FOR 470 Watershed Management (3)  In FOR 470 Watershed Management students are expected to learn the fundamentals of watershed hydrology and how management of natural resources, especially forest resources, can be adapted to protect and enhance the natural flow, quantity and quality of water resources.Emphasis is placed on acquisition of available hydrologic and climatic data over the internet, solving basic hydrologic problems using the proper units, writing short essays summarizing assigned papers or lectures, and in-class tests on managing impacts of timber harvesting, road construction, application of forest chemicals, and other land uses activities. The course is primarily, but not exclusively, intended as a course for upper-level undergraduate and graduate students in forest resources and wildlife and fisheries majors or other majors such as ERM with related natural resources backgrounds and interests.The course is a Prescribed Course for Forest Resources undergraduates in the Forest Management and Watershed Management options and is a Water Science breadth course for students in the Graduate Option in Watershed Stewardship. A companion one-credit course FOR 471 -Watershed Management Laboratory - may be taken concurrently with or following FOR 470. This course is offered each Spring Semester and generally has an enrollment of about 80-90 students.", "prerequisite": "3 credits in Soils"}, {"course_name": "FOR 471: Watershed Management Laboratory", "department": "Forestry (FOR)", "credits": "1 Credits", "description": "Introduction to hydrologic and climatic measurements and computations useful in watershed management.", "prerequisite": "or concurrent: FOR  470"}, {"course_name": "FOR 475: Principles of Forest Soils Management", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Effect of current forest management practices on the properties and productive capacity of forest soils.", "prerequisite": "FOR  308 , 3 credits in soils"}, {"course_name": "FOR 480: Policy and Administration", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Forest resources policy objectives; criteria and goals of society; policy implementation by ownership classes; planning, administration, and evaluation of programs.", "prerequisite": "3 credits of social or behavioral science"}, {"course_name": "FOR 488Y: Global Forest Conservation", "department": "Forestry (FOR)", "credits": "3 Credits", "description": "Ecological, economic, technological, and political aspects of forested ecosystems in a global context, emphasizing tropical and developing countries.  FOR 488Y Global Forest Conservation (3) Forested ecosystems cover one third of world's land area, and about two billion people depend on forest products for their livelihood. Students in this course will learn about trends in global forest cover, human demands on forests in different parts of the world, and how national and international institutions and policies regulate forest use. Topics covered include tropical deforestation, biodiversity, climate change, poverty, forest production and trade. Students come away from the course with an understanding of the diversity of forestry practices around the globe.", "prerequisite": "3 credits in natural sciences, and 3 credits in social and   behavioral sciences", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "FOR 489: Supervised Experience in College Teaching", "department": "Forestry (FOR)", "credits": "1-3 Credits/Maximum of 3", "description": "The Supervised Experience in College Teaching course provides select undergraduate students with formal, supervised teaching experience in a Forestry (FOR) course. Faculty recruit students who excel in a particular course to serve as undergraduate teaching assistants for subsequent offerings of that course. Duties may include serving as peer tutors, teaching assistants, or laboratory assistants, and developing and/or evaluating course activities and materials. Students participating in this course will develop a deeper understanding of the focus course material by actively helping to teach the material. The course is only available to students who are invited to serve as teaching assistants for a Forestry course and enrollment is by permission of the instructor.", "prerequisite": "Permission of program"}, {"course_name": "FOR 494: Undergraduate Research", "department": "Forestry (FOR)", "credits": "1-12 Credits/Maximum of 999", "description": "Supervised student activities on research projects identified on an individual or small group basis.", "prerequisite": "Permission of the Forest Ecosystem Management Program"}, {"course_name": "FOR 494H: Honors Thesis Research", "department": "Forestry (FOR)", "credits": "1-6 Credits/Maximum of 999", "description": "Independent study directed by a faculty supervisor that culminates in the production of a Forestry honors thesis. This course is the means by which Forest Ecosystem Management honors students receive credit for thesis research. The course involves research and other scholarly activities (such as writing) necessary for completion of an approved honors thesis.", "prerequisite": "Enrollment in the Schreyer Honors College and permission of a Forest Ecosystem Management honors adviser", "other": ["Honors"]}, {"course_name": "FOR 495: Forestry Internship", "department": "Forestry (FOR)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised field experience related to the student's major.", "prerequisite": "approval of proposed assignment by instructor prior to   registration.", "other": ["Full-Time Equivalent Course"]}, {"course_name": "FOR 496: Independent Studies", "department": "Forestry (FOR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "FOR 497: Special Topics", "department": "Forestry (FOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "FOR 499: Foreign Studies", "department": "Forestry (FOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]