[{"course_name": "GEOG 1N: Global Parks and Sustainability", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course uses parks and protected areas - both in the U.S. and globally - as a framework for exploring broad themes of sustainability, conservation, and socio-ecological systems. Case studies that exemplify U.S. and international parkscapes (i.e., parks and protected areas embedded within complex landscapes) are used to convey stories of evolving attitudes and approaches toward conservation and sustainability. These stories help explain the historical, transitioning, and future role of conservation in societies shaped by local ecologies, conflict, and change. The unique geographies of conservation parkscapes- past and future -reinforce and challenge a globally dynamic conservation discourse. Examining the sustainability of conservation activities themselves, as well as the socio-ecological systems in which they are embedded, can provide a lens through which we can begin to understand other cultures, aesthetic values and value systems, and the diverse ecologies of Earth. In this course, we will: - Explore the history of parks and protected areas globally, including the development of the U.S. National Park system, and the globalization of conservation and sustainability policies and approaches - Examine globally representative case-studies to assess how parks and protected areas are part of both social and ecological landscapes (\"parkscapes\") - Assess new challenges and opportunities for conservation in an era of rapid change and conflict - Evaluate the history, current socio-ecological condition, and future approaches in sustainability for a particular global parkscape By the end of the course students should be able to: - Describe why the idea of `wilderness' is both influential and contested - Explain temporal and spatial trends in national and international conservation management - Compare and contrast contemporary conservation approaches - Illustrate a parkscape as a coupled socio-ecological system - Identify key drivers of future ecological change affecting conservation management", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 2N: Apocalyptic Geographies: How can we prevent the end of the world?", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course explores various visions of the apocalypse and their relevance for addressing major contemporary social, ecological, and economic issues. These issues include global climate change, nuclear war, the growing refugee crisis, the breakdown of democratic governance, economic recession and forms of everyday violence and social fracture. Students will develop and employ critical and analytical thinking skills to engage a diversity of texts from the humanities (e.g., historical and literary accounts, graphic novels, films and other historical and contemporary media) and contemporary popular culture in order to situate these apocalyptic visions in particular historical, cultural, and political contexts. Students will utilize integrative thinking skills and an interdisciplinary geographic approach to connect these visions with contemporary social issues in order to consider how we might address these complex problems while imagining and actualizing alternative futures. Students will practice global learning, drawing on course material that engages U.S. and cross-cultural perspectives in recognition of the global reach of the interconnected social, economic, political, and cultural systems that shape humanity's shared fate.", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "GEOG 3N: Food and the Future Environment", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "GEOG 3 introduces students to the multiple connections of people and the environment through the dynamics of food and the places where it is produced, processed, and consumed. It introduces an integrated human-environment perspective on food systems in the United States, with emphasis on the Northeast and Western U.S., as well as in diverse locations around the world. The course offers a global perspective on the major challenges and opportunities facing food systems, including the sustainability of agriculture, organization of global food systems and local food initiatives, food insecurity, and the influence of modern diets on human health. This course promotes critical thinking regarding key concepts in Environment and Society Geography such as coupled human-environment systems, the Anthropocene; anthropogenic landscapes and domestication; carrying capacity; ecological footprint; life-cycle analysis; globalization; urbanization, dietary change and land use; soils and society; environmental and social justice; climate change and resilience; agrobiodiversity and adaptive capacity; human-environment interactions involving vulnerability; regional analysis; geography and culture of food systems; development and food security; and social-ecological systems. Students are encouraged to examine their role and responsibilities for the sustainability of the social-ecological systems we inhabit and to take action in their own lives to contribute to a more equitable and sustainable environment. The course will provide students with the opportunity to read, learn, and debate the ways in which humans value, use, affect, and are affected by small-scale and large-scale human-environment interactions. It will provide skills for the critical analysis and evaluation of the ways in which humans have transformed the environment in different parts of the world. Students will also learn how to assess what future pathways are sustainable and ethically sound. One key course goal is to help students increase their sensitivity, awareness, and knowledge concerning the global and international context of human interactions with nature. Upon completion of this course, students will be able to: 1. Survey and analyze environmental resources in relation to systems of food production, land use, and consumption; 2. Survey and analyze how human food systems significantly alter the earth's environmental systems and landscapes; 3. Use environment and society geography to understand the resilience of agri-food systems in contexts of climate change, human population changes, and socioeconomic, cultural and policy factors.", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "GEOG 4: Earth and Environmental Systems Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Earth and Environmental Systems Geography provides a means for understanding how Earth operates naturally and in response to human action. This course takes a holistic, interdisciplinary approach, focusing on the Earth as a series of components that dynamically interact with one another via fluxes of energy and matter, biogeochemical cycles, and feedbacks. Together, the geosphere, atmosphere, hydrosphere, biosphere, and the anthroposphere (humans), make up the Earth system. This course explores these systems individually as well as their interconnections from the perspective of geography, and thus touches upon aspects of more traditional disciplines including atmospheric science, geosciences, hydrology, biology, and ecology. By studying the Earth as an assemblage of interacting parts and processes, this course will provide students with a critical scientific foundation and geographical perspective for understanding some of the most pressing human-environmental issues of the 21st century, including global climate change, environmental degradation, and loss of natural biodiversity.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOG 6N: Maps and the Geospatial Revolution", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "The rapid evolution of digital mapping technology via personalized digital mapping applications and location-aware devices has completely transformed how we use place and space to make decisions about human and environmental problems. This course introduces the fundamentals of cartography, geographic information science, and associated technologies through mapping and spatial analysis to answer key human and environmental problems. The class explores the power and utility of geographic information to transform how we navigate, tell stories about data, and make decisions that impact people and the planet. The course also encourages students to become knowledgeable, critical, and ethical consumers of maps and geographic data produced by government agencies, industry, and the media. Hands-on laboratory exercises, individual creative mapping projects, and course lecture contents are designed to reveal the many ways in which geographic information can play a role in shaping contemporary society. In addition, key course elements focus on the diversity and growth associated with the geospatial industry, an industry that is expected to grow rapidly over the next twenty years. Students who successfully complete Geography 6N will be able to: - Describe and explain fundamental concepts in Geographic Information Science (GIScience) and related technologies for making maps and solving spatial analysis problems; - Explain how and why organizations create and use geographic data, including reference, thematic, and imagery sources - Demonstrate geographic information literacy to identify the kinds of geographic information needed for a particular task, determine whether needed data are available, use relevant technologies to acquire data, and to interpret and explain maps of the data critically; - Create digital thematic maps to tell stories about geographic phenomena", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 10: Physical Geography:  An Introduction", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "Survey and synthesis of processes creating geographical patterns of natural resources, with application of basic environmental processes in resource management.  GEOG 010GEOG 010 Introduction to Physical Geography (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements.Introduction to Physical Geographysystematically examines the spatial patterns and interrelationships among physical elements at the earth's surface. Particular emphasis is given to developing an integrative view of how atmospheric, hydrologic, geomorphic, and biotic processes control the patterns of climate, water, landforms, soils, and biota across a local-to-global continuum. Those physical elements that influence and/or are influenced by people are the primary focus of study.Physical geography does not simply discuss the atmosphere, hydrosphere, lithosphere, and biosphere in isolation; instead, it concentrates on understanding theintegrationof these realms of the natural world. For example, the study of weathering processes demonstrates how the physical and chemical breakdown of Earth's surface material depends on the interaction of air, water, and biota with rock.The focus of physical geography is unlike the component disciplines from which it draws. On the one, hand, meteorology focuses on the atmosphere above our heads. Hydrology focuses on water in isolation from people. Geology and soil science focus on the Earth beneath our feet. Biology and ecology focus on the plants, animals, and ecosystems in isolation from people. One the other hand, physical geography concentrates on the surface of the Earth where the atmosphere, hydrosphere, lithosphere, and biosphere intersect.Introduction to Physical Geographyis concerned with the human habitat-the life layer in which humans interact with their natural world.Like all geography, five recurring themes permeateIntroduction to Physical Geography : location, place, regions, movement, and human-environment relationships. Physical geographers not only are interested in where natural phenomena are located on Earth's surface, but also they want to know the answers to such questions as:1. What is special about the physical processes that take place in a location? 2. How does the physical geography of a place relate to other places in the region? 3. How does energy and mass flow into and out of a region? 4. How do biophysical processes change as we move up and down spatial scales? 5. How do people influence natural processes? How do these processes influence people?Other disciplines typically do not cover these spatial and nature-society themes systematically.Physical geographers have developed and adopted many tools to address these themes. Maps are obvious choices, but geographers also use a wide array of photographic and imaging technologies to study the distribution of Earth processes and the processes themselves. They use geographic information systems and computer models to manipulate, display, and analyze spatial data.Introduction to Physical Geographyacquaints students with many of these tools.When the above points are taken together, physical geography emerges as a unique field of science.Introduction to Physical Geographyprovides a learning experience that students can get in no other discipline-one that takes an integrated view that makes the nature environment relevant.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "GEOG 10H: Physical Geography:  An Introduction", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Survey and synthesis of processes creating geographical patterns of natural resources, with application of basic environmental processes in resource management.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "GEOG 20: Human Geography:  An Introduction", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "Spatial perspective on human societies in a modernizing world; regional examples; use of space and environmental resources; elements of geographic planning.  GEOG 020", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "GEOG 20U: Human Geography:  An Introduction", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Spatial perspective on human societies in a modernizing world; regional examples; use of space and environmental resources; elements of geographic planning.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "Honors"]}, {"course_name": "GEOG 30N: Environment and Society in a Changing World", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "GEOG 30N \"Environment and Society in a Changing World\" introduces students to the relationships between humans and the natural environment, in addition to the theories and methods that geographers employ in addressing them. The course begins with an overview of theories and key concepts to examine the interactions between social and ecological systems, across settings in the United States and globally. The course will provide students with the opportunity to read and learn about the ways in which humans think about, use, and are affected by the natural environment. It will also provide skills for analyzing and evaluating the ways in which humans have transformed the environment in different parts of the world through the integration of knowledge from the natural and social sciences. This class is designed to address big questions in human-environment interactions at the present time, while drawing upon their histories and key conceptual ideas. 1. What is a human-environment system? How does the geographic discipline contribute towards understanding human-environment systems and sustainability? 2. Why do we conserve what we conserve? Is it possible to conserve natural resources and also meet human needs? 3. What are ways to manage the effects of economic development upon the natural environment? Is sustainable development possible? 4. How is climate change impacting social and ecological systems? Can we adapt to the impacts of climate change? One of the hallmarks of the discipline of geography is attention to how social and ecological processes interact and spread across spatial scales. This means that specific events, such as the consumption of particular product or the emission of greenhouse gases, connect sites within countries and across the globe. GEOG 30N meets the definition for both a US and international cultures course by emphasizing how current human-environment systems developed over time in the U.S. and internationally. GEOG 30N examines how various political, economic, and cultural factors influenced the creation of the different forms of human-environment systems that exist today. Further, it teaches students to see nations, cultures, and social identities in relation to one another, exploring how decisions made in relation to a human-environment system in one place or by one group can impact other people or places.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 40: World Regional Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "World Regional Geography examines a world that is undergoing political, economic, social, and environmental transformations at many different spatial scales. Viewing content through the lens of the Six Essential Elements of Geography (National Geographic Society) and other geographic concepts such as scale, place, and human-environment interaction, this course examines international linkages, such as economic globalization, which help to forge a world community. The course also examines more regional and localized manifestations that contradict our understanding of a global community and examines a variety of regions' physical systems, cultures, economic systems, environmental challenges, and political realities. Larger concepts such as North and South, developed and developing, and environmental degradation and climate change, take on new meaning when they are explored at a regional level.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "GEOG 97: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "GEOG 107N: Immersive Technologies - Transforming Society Through Digital Innovation", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "Immersive technologies are an emerging field. Although envisioned and available for several decades, technological challenges of the past made their application in education, research, and everyday life a rather specialized endeavor, restricted to research labs rather than being open to communities. This is changing with the advent of consumer grade VR headsets offered essentially by every major tech company and smartphones becoming devices to augment any physical reality. We refer to these technologies as xR as they comprise everything from augmented to virtual reality. This development is occurring at an incredible pace and is opening new opportunities for the integration of this technology into every aspect of human life. xR is revolutionizing how humans communicate, how we experience spatially and temporally remote places, how we are able to view, understand, and analyze data, and how we train people. Instead of interacting with data on a 2D desktop screen, researchers and decision makers can immerse themselves in virtual environments where geospatial data are represented in intuitive, immersive, and flexible ways. In parallel to developments in xR we are witnessing an incredible increase in creating content for immersive experiences; with the ready availability of massive amounts of environmental data (e.g., LiDAR) and efficient 3D modeling technologies (e.g., SketchUp, CityEngine), realistic immersive scenarios are easier to create than ever before. We are seeing a paradigm shift which enables new methods of environmental decision making from urban planning to climate change. The combination of xR and automated 3D modeling enables models of real-world places to be integrated within data visualization workbenches. This course will provide students with the basics of what xR technologies are and what their history is, it will connect xR to recent developments in 3D modeling and environmental sensing as two sides of the same coin in that one is focusing on content creation and the other on accessing content. The course will theoretically address what the key features of xR are and introduce students to core concepts such as immersion, presence, and reality-trade off. Furthermore, the course will provide students with hands on experiences to create their own xR experiences focusing on entry level technologies such as 360 cameras, modeling using SketchUp, photogrammetry techniques such as structure from motion mapping, and Unity, a game engine flexible to cater to a broad range of needs.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 110: Climates of the World", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "Introduction to climatology, including principal processes of the global climatic system and their variation over space and time.  GEOG 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "GEOG 110H: Climates of the World", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Introduction to climatology, including principal processes of the global climatic system and their variation over space and time.  GEOG 110"}, {"course_name": "GEOG 115: Landforms of the World", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "Geography 115 World Landforms (GN) provides an introduction to the modern geologic study of landforms and the Earth processes responsible for their creation and modification. Emphasis is placed on internal geophysical processes and external landscape responses to tectonic and climatic forcing. The course is structured into three units. The first unit introduces Earth's atmospheric processes. The second unit examines the relationship of water, weather and climate change to the dynamic equilibrium of landforms. The final and largest unit covers tectonics, weathering, mass movement, and fluvial, coastal and glacial processes and their role in shaping the large-scale details of Earth's topography and the geographic distribution of resources. This course includes 2 lecture discussions and weekly laboratory practicums with emphasis on terrain analysis, natural hazards and human adaptation and contribution to landscape change.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOG 122: The American Scene", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Historical perspectives on the social and cultural forces associated with the production of distinctive American landscapes.  GEOG 122 The American Scene (3)(GH;US)(BA) This course meets the Bachelor of Arts degree requirements. The American Scene offers a broad introduction to the historical geography of the United States through analysis of distinctive elements of regional landscapes. Archival evidence and contemporary photo graphy are utilized to assist in an understanding of 'landscape,' 'place' and 'region', each important frames for geographical inquiry. It offers a humanistic perspective on the transformation of the United States from a land first occupied by Indian groups, then colonists from specific European realms, some supported by indentured or enslaved labor, as well as later immigrants in the national period, that pursue agricultural economies in an array of rural and urban settlement systems. Landscapes of modernity, associated with manufacturing, urban growth and new transportation systems, are also considered, as well as landscapes now emerging in the post-industrial era. At the conclusion of the course, students should have a deeper understanding of some of the issues involved in the analysis of place at a variety of spatial scales, and a better sense of the historical layering in the landscapes that they encounter each day and on their travels. The course is organized regionally and temporally. Case studies are drawn from a dozen regions, each emphasizing a different historical moment in the transformation of landscape since the end of the last Ice Age. Some examples draw on material at the scale of a single house or farm and others at the level of a multi-state industrial corporation such as US Steel in the early twentieth century. Any student interested in how the distinctive landscapes of the United States evolved to this point should enroll in The American Scene. It draws on scholarship in historical and cultural geography, as well as architectural history and art history.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"course_name": "GEOG 123: Geography of Developing World", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Patterns of poverty in poor countries; conventional and non-conventional explanations; focus on solutions; case studies of specific regions.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "GEOG 124: Elements of Cultural Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Locational analysis of changes in non-Western cultures. Problems of plural societies, economic development, population growth, and settlement.  GEOG 124 Elements of Cultural Geography (3) (GS;IL)(BA) This course meets the Bachelor of Arts degree requirements. Elements of Cultural Geography, provides an overview of the impact of cultural processes at multiple scales, from the global to the local. Class time will include lectures and discussions in relation to how social identities, such as race and class, just to name a few, impact and are impacted by geographic concepts such as landscape, place and space. The course aims to survey and explore a range of perspectives on the nature of human integration with the environment and the manifestation of human culture on the landscape. The course will engage philosophical and metaphysical questions in addition to those of landscapes and place. The ultimate objective is for participants to develop a deep and multidimensional understanding of how social identities and the environment are inter-related. This course is a selection for majors; it has no prerequisites and is not a prerequisite for any other course. It provides a foundation for understanding human-environment interactions at a global scale, including the regional interactions involved.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "GEOG 124H: Elements of Cultural Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Locational analysis of changes in non-Western cultures. Problems of plural societies, economic development, population growth, and settlement.", "other": ["General Education: Social and Behavioral Scien (GS)", "Honors"]}, {"course_name": "GEOG 126: Economic Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course is an introductory course on economic geography and serves as background for any course on international economics, economic development, international political economy, and international business management. GEOG 126 promotes the study of national and international macroeconomic concepts and principles through a geographic and geospatial lens, uncovering how physical and human systems influence economic decision-making and behavior around the globe. GEOG 126 provides a balanced view of contemporary globalization processes across the world, focusing on a wide range of topics including the history of globalization, spatial structures of firms and business, international trade, and state interventions based on detailed case studies.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 128: Geography of International Affairs", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Contemporary international affairs in their geographical setting; geographic elements in the development of national power, political groupings, and international disputes. GEOG 128 Geography of International Affairs (3) (GS;IL)(BA) This course meets the Bachelor of Arts degree requirements. Geography of International Affairs uses the organizing principle of geographic scale to examine the spatial patterns of and interrelationships among political processes and institutions. Particular emphasis is given to developing an integrative view of how global, national, local and individual scale processes interact to produce patterns of peace and conflict. The course analyzes how the actions of individuals, states and other political actors are influenced by their dynamic geographical contexts. The political geography approach does not simply discuss the war, peace, nationalism, terrorism, and religious organizations in isolation; instead, it concentrates on understanding the integration of these processes, and how their integration mediates political decisions and outcomes. Geography of International Affairs is concerned with the geopolitical context, broadly defined - the manner in which spaces and places are combinations of the political and the social, the domestic and the international, the global and the local - and how it partially determines the form and outcomes of politics. As a course in geography, Geography of International Affairs encourages students to interpret political problems, actions, and disputes through the lens of the Six Essential Elements of Geography (National Geographic): Places and Regions; Physical Systems; Human Systems: Environment and Society; the World in Spatial Terms; and Uses of Geography. Further, this course also encourages students to examine and interpret international affairs through the lens of different geopolitical theories, developed by the likes of Ratzel, Mahan, Mackinder, Spykman, Kissinger, Wallerstein, and others. In this sense, students are encouraged to adopt the role of political geographers. Political geographers have developed and adopted many tools to address these themes. Maps are obvious choices, but geographers also use a wide array of statistical and qualitative techniques to study the distribution of political processes and the processes themselves. They use geographic information systems and computer models to manipulate, display, and analyze spatial data. Geography of International Affairs acquaints students with many of these tools. When the above points are taken together, political geography emerges as a unique field of social science. Geography of International Affairs provides a learning experience that students can get in no other discipline - one that takes an integrated view that makes contemporary international affairs relevant and understandable.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 160: Mapping Our Changing World", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Fundamental concepts of GIS, cartography, remote sensing, and GPS in the context of environmental and social problems.  GEOG 160 Mapping Our Changing World (3) (GS)(BA) This course meets the Bachelor of Arts degree requirements. Mapping involves producing and using geographic data. Geographic data specify the locations and characteristics of people, the objects people create, and the various phenomena of the natural environment with which people interact. Geographic data are produced by several methods, including land surveying, aerial photography and photo grammetry, satellite remote sensing and positioning systems, and social surveys such as those conducted by the U.S. Census Bureau. Geographic information systems (GIS) and related technologies are used to turn data into maps, tables, and other kinds of information people need to make informed decisions. In a rapidly changing world, detailed, up-to-date geographic data are indispensable for governance, for commerce, and for research intended to improve our understanding of social and environmental systems. GEOG 160 helps students begin to develop the knowledge, skills, and dispositions that constitute geographic information literacy - the ability to 'recognize when information is needed and ... to locate, evaluate, and use effectively the needed information' (ALA 1989). Geographic information science (GIScience) is are search enterprise concerned with the design, development, and use of geographic information technologies to help institutions and individuals not only respond to, but ideally to predict, environmental and social change. GEOG 160 is an introduction to GI Science that provides students with the technical and contextual knowledge they need to become knowledgeable consumers of geographic data and information produced by government agencies, industry, and popular media. The course is intended to be of value not only to future specialists in the geographic information enterprise, but also to every student who is concerned with social and environmental research and policy-making. Like other information technologies, GIS is evolving rapidly. People who work with GIS understand that learning is a way of life, not just a prelude to a career. With this in mind, GEOG 160 aims not only to help students learn about geography and GIS, but also to develop the disposition to become effective lifelong learners.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "GEOG 161: Applied Geographic Information Systems", "department": "Geography (GEOG)", "credits": "1 Credits", "description": "An introduction to GIS (Geographic Information Systems) with emphasis on applications and analysis.  GEOG 161GEOG 161 Applied Geographic Information Systems (1) GEOG 161 is a one-credit two-hour laboratory course to be taken concurrently with GEOG 160, Mapping Our Changing World. GEOG 160 and GEOG 161 will be offered concurrently as a required course pair for the proposed Environmental Studies Option within the B.S. Science major (SCNBD) at Behrend College. The courses can also be choices in the 'Supporting Courses and Related Areas' list for the B.S. Science major's General, General Pre-certification, and Earth & Space Science Pre-certification options. The purpose of the course is to familiarize students with GIS and provide them with the ability to use GIS software commonly used by industry, academia, and government agencies. GEOG 161 will provide students with training and experience in computer-based practical applications of concepts and theory learned in GEOG 160. They will analyze and solve 'real-world' problems using hands-on, problem-solving, and inquiry-based approaches to learning. Students will work individually and in small teams in a GIS software-equipped computer laboratory. Students will be evaluated based on the quality of laboratory reports/assignments and on a larger research project with a presentation conducted during the final five weeks of the semester. GEOG161 will be offered at least once per year. Enrollment is expected to be 8-20 students.", "prerequisite": "GEOG 160"}, {"course_name": "GEOG 197: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "GEOG 199: Foreign Studies", "department": "Geography (GEOG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "prior approval of program", "other": ["International Cultures (IL)"]}, {"course_name": "GEOG 210: Geographic Perspectives on Environmental Systems Science", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This lecture, lab and field-based course explores Earth's physical environment and its interactions with human activities. While it is intended primarily for Geography majors and minors, the subject matter and approach are sufficiently broad to be relevant to any student with interests in the environmental and natural sciences. We survey the geographic patterns and physical processes attending Earth's environmental and landscape systems; its climate, hydrology, landforms, soils and vegetation, and their mutual interactions of energy and mass (water, sediment). We adopt both spatial 'map-able' and temporal perspectives; for example, the evidence for, causes of, and impacts from, past and contemporary environmental changes such as glaciations, pluvials (wet periods), and warming. An important emphasis involves human interactions with the natural environment; how human activities are constrained by, yet also constrain processes and alter features of, the physical landscape across spatial and temporal scales. Representative topics include the burning of fossil fuels and emissions of greenhouse gases and particulates into the atmosphere, natural gas fracking and earthquakes, river diversion and dam construction, ground-water withdrawal and land subsidence, urbanization and the 'heat island' effect, land clearance and deforestation, irrigated agriculture, wildland fire, the introduction of invasive species, and coastal over-development. Our examples will come from across the globe, from areas as diverse as tropical oceans to the polar deserts. An important outcome of the course is that students become better scientific observers of Earth's environmental system and its spatio-temporal variations.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOG 220: Perspectives on Human Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Why are some countries richer than others? How do consumption patterns in one part of the world affect `far flung' peoples and environments? How does global warming shape land use patterns and rates of hunger across different regions, and what are the political implications of these patterns? Why do rich economies around the world increasingly depend on the recruitment of low-wage immigrant workers, both \"legal\" and \"illegal\"? How do race and gender shape access to services, housing and employment in many large cities? In what ways does drone warfare change the nature of state power in the 21st century? These kinds of questions are ones that animate the work of human geographers. The purpose of this course is to introduce you to the breadth of contemporary human geography. We will explore both the range of topics that geographers study, and some of the key concepts and methods used to study geographic topics. Major themes will investigate how cultural, economic, political, and environmental interactions relate to geographic processes. These general topics will be explored through a detailed examination of case studies in the United States and across the globe", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 230: Geographic Perspectives on Environment, Society and Sustainability", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Recommended Preparations: Completion of a basic rhetoric and composition course ( ENGL 15; ENGL 30 ENG 137 CAS 137 ESL 15 ) OR completion of College of Earth and Mineral Sciences First-Year Seminar EMSC 100 is recommended. A major theme in the discipline of geography is the study of the relationships between humans and the natural environment. GEOG 230 introduces students to the multiple ways in which people and the environment are interconnected. From a dynamic systems perspective, we refer to this interconnectedness as 'coupled social-ecological systems.' The course uses a geographic perspective to understand how differently these linkages are shaped in various ecological and cultural settings around the globe. The course follows an interdisciplinary approach, exploring from multiple angles major environmental and societal challenges such as climate change, genetically-modified food, over-consumption, disease, and environmental service provision in the industrialized North and the Global South. It promotes critical thinking regarding key concepts such as carrying capacity, ecological footprints, feedback, stability domains, and resilience. Students are encouraged to examine their role and responsibilities for the sustainability of the social- ecological systems we inhabit and to take action in their own lives to contribute to a more equitable and sustainable environment. The course will provide students with the opportunity to read, learn, and debate about the ways in which humans value, use, affect, and are affected by small-scale and large-scale human-environment interactions. It will provide them with skills for critically analyzing and evaluating the ways in which humans have transformed the environment in different parts of the world. They will also learn how to assess what future pathways are sustainable and ethically sound. One key goal of the course will be to help students increase their sensitivity to the global and international context of human interactions with nature. A discussion section allows students to explore controversial issues such as biotechnology, nature as a commodity, and global warming, and to develop critical positions on such issues. Through attendance of lectures, participation in discussion sections, and completion of reading and writing assignments, successful students will:  -build an interdisciplinary understanding of how biophysical and social environments are intertwined and shape one another -comprehend the range and importance of different disciplinary approaches to researching human-environment systems - develop a toolkit of key concepts and theories for understanding human-environment systems and evaluating questions of sustainability - evaluate and critique different perspectives for intervening in human-environment interactions, including sustainable development, deep ecology and degrowth."}, {"course_name": "GEOG 260: Geographic Information in a Changing World: Introduction to GIScience", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "In a rapidly changing world, detailed, up-to-date geographic data are indispensable ingovernance, commerce, security, public health, and many other domains. These data are also needed to support research intended to improve our understanding of social and environmental systems. Making data useful in these domains requires methods and tools that transform data to information and that make that information accessible where and when it is needed. Geographic data specify the locations and characteristics of people, and objects both natural and anthropogenic in nature. Geographic data are produced by several formal methods, including land surveying, aerial photography and photogrammetry, satellite remote sensing and positioning systems, and social surveys such as those conducted by the U.S. Census Bureau. They also are derived through informal methods that rely on the vast and growing array of location-enabled devices including cell phones, smart watches, credit card transaction records, and RFID tags on packages, along with volunteers compiling input to projects such as the Open Street Map. Geographic informationsystems (GIS) and related technologies are used to turn those data into the information people need to make informed decisions. Maps and related graphics generated on a wide array of devices from cell phones to large touch-screen displays then make the information more accessible and by doing so enable those decisions.Geographic Information Science (GIScience) is concerned with the design, development, and use of geographic information and technologies (also called geospatial technologies) to help institutions and individuals respond to, and ideally to predict, environmental and social change. This course provides a broad, practical foundation of Geographic Information Science methods and technologies for aspiring Geography majors and students pursuing the Geographic Information Science minor or undergraduate certificate, as well as students whose academic programs utilize geospatial information and analysis. Course Objectives The overall objectives of GEOG 260 are that students will: 1. gain a broad perspective on geographic information science and related technologies and how those technologies are used to collect, process, and provide access to geographic data; 2. be prepared for more advanced study of GIS, remote sensing, cartography, and spatial analysis. After the course, students will be prepared to demonstrate: 1. Familiarity with the professional, academic, and industry-specific competencies (Positioning & Data Acquisition; Analysis & Modeling; Software & Application Development) specified in the U.S. Department of Labor's Geospatial Technology Competency Model (GTCM). 2. How to appropriately acquire, apply, and communicate geographic data and information 3. Lifelong learning skills, including the ability to investigate topics independently, the ability to work in teams, and the ability to communicate effectively. 4. The ability to use maps and geospatial technology as a story-telling medium. 5. How and why Geographic Information Science matters in a changing world.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOG 293: Honors Experiences in International Service Learning", "department": "Geography (GEOG)", "credits": "1-3 Credits/Maximum of 3", "description": "Classroom instruction with supervised student activity on an honors international community service project.  GEOG 293HGEOG 293H Honors Experiences in International Service Learning (1-3) GEOG 293H provides students with activities that integrate academic study with community service in an international context. The aim of service learning is to enrich traditional classroom-based education by getting students into a community, thereby engendering civic responsibility and simultaneously strengthening communities. GEOG 293H has five objectives: (1) to develop understanding of a set of issues in community development; (2) to learn and apply skills associated with those issues; (3) to develop and apply communication skills by speaking, writing, and/or desktop publishing; (4) to gain international experience at the community level; and (5) to reflect on personal and career interests in international development, science, the environment, public policy, or related areas. Thus, students will read, write, and talk about a set of issues of importance to a foreign community and engage in a project in that community.The specific service-learning projects will change each semester, although some projects will be ongoing and offered multiple times. Students can take GEOG 293H in ore than one semester, to a maximum of four offerings.Depending on the topic of the international service-learning project, GEOG 293H can complement courses in most colleges and their majors. The course is available to all Geography majors as elective credits; it is also available to all Geography Minors for credit toward the minor.Students will be evaluated on three of the five course objectives: (1) understanding of the issues, (2) learning and application of skills, and (3) application of communication skills. Although exact procedures for determining grades will vary with instructor and service-learning project, the basis for grades will include a combination of written work, oral presentations, in-class participation, and outside-class participation.", "prerequisite": "sophomore standing", "other": ["Honors"]}, {"course_name": "GEOG 294: Research Project", "department": "Geography (GEOG)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "GEOG 296: Independent Studies", "department": "Geography (GEOG)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "GEOG 297: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 298: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 299: Foreign Studies", "department": "Geography (GEOG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "prior approval of program", "other": ["International Cultures (IL)"]}, {"course_name": "GEOG 301: Thinking Geographically", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Learning to think geographically.  GEOG 3GEOG 301 Thinking Geographically (3) The course explores the process of thinking geographically. As a discipline that draws on elements of four intellectual traditions - the physical sciences, the social sciences, the information sciences, and the humanities - geography offers an extensive palette of approaches to the study of the interactions among people, places, and environments. In addition to those traditions, geography also draws on key themes: setting events and activities into multiple spatial and temporal contexts; setting events and activities into multiple spatial scales from the local to the global; seeing complex, multi-way interactions between human and physical systems; recognizing the interconnectedness between places. In terms of methods, the fundamental building block is the idea of geospatial location and the associated spatially- or geo-referenced data. Data, both quantitative and qualitative in character, is increasingly available in terms of amounts and quality. Students must come to appreciate and be able to use this powerful way of thinking about the world. GEOG 301 assumes a beginning understanding of geography, in terms of basic content knowledge, and builds an understanding of how to think geographically, how to ask geographic questions, how to find geographic answers, how to assess the quality of those answers, and how to present and communicate those answers convincingly and compelling in multiple formats. Students will learn how to think geographically and to appreciate the power, applicability, and limitations of the geographic approach. Each year the course is organized around a significant contemporary problem as a commonly shared case study. Students will work in small groups to analyze the case study, presenting their own portfolio of work for 60% of the course grade and collaborating with group colleagues for a collective presentation for 40% of the grade. Work will be submitted in stages through ANGEL. GEOG 301 is required of all geography majors and will be offered Fall and Spring of each academic year with an annual enrollment of approximately 120 students. Preference will be given first to declared Geography majors, then to Geography minors, before places are offered to students from other programs. Geography 301 is a bridge between the knowledge that comes from the broad-based introductory geography courses and the detailed understanding that comes from the focused, advanced-level geography courses. It enables students to learn about and to practice geographical thinking in real-world contexts.", "prerequisite": "GEOG 160"}, {"course_name": "GEOG 308: Research and Qualitative Inquiry in Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course examines the theory and practice of research in geography, with particular emphasis on qualitative inquiry commonly used by human as well as environment-society geographers. Students will explore fundamental debates regarding methods and knowledge claims that underlie the research process. Students will also gain hands-on experience developing research questions and using secondary scholarly literature and primary data to explore their question(s) in written and oral formats. Particular emphasis will be paid to the ethics and practices associated with qualitative methods, including the approaches taken by geographers in the collection and analysis of interview, observational, and textual data. Course Objectives and Learning Outcomes By the end of this course students will be able to: - Explain and compare models of knowledge underlying distinct methodological approaches in Geography - Describe research design principles commonly used in qualitative research - Evaluate the appropriate use of interview, observational and textual sources of primary data - Employ qualitative data collection methods to collect interview, observational and textual data. - Explain the ethical dimensions of qualitative research and assess strategies to navigate these constraints both practically and ethically - Find and appraise scholarly, peer-reviewed literature in relation to the student's research topic - Develop a research question, justify it in relation to scholarly literature, and mobilize primary data to provide evidence for your analysis of the question. - Communicate research and analysis in written and oral formats."}, {"course_name": "GEOG 310: Introduction to Global Climatic Systems", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This intermediate-level course in Climatology emphasizes geographic patterns of interannual climate variability (climate variations) and physical processes responsible for those variations (climate dynamics). Interannual climate variations include regional- to large-scale anomalies of temperature, precipitation, cloud cover, etc., that may manifest as extreme weather (drought, floods, heat and cold waves, etc.). The physical processes associated with these fluctuations include the following: interactions among climate-system components (atmosphere, biosphere, cryosphere, hydrosphere); external forcing (e.g., solar variations, volcanic activity); and long-distance interactions involving coupled atmospheric-ocean circulations, or teleconnections (El Niño Southern Oscillation (ENSO), the North Atlantic Oscillation (NAO), the Arctic Oscillation (AO), and the Pacific-North America (PNA) pattern). Climatic teleconnections manifest shifts in the atmospheric pressure \"centers of action\", storm tracks, long waves, jet stream positions, etc. We study the patterns and processes of regional climate features such as the South Asian and West African monsoons, \"nor-easter\" snow storms, Arctic/Antarctic sea ice variations, the summer/winter transition in Mediterranean-type climates, the role of \"blocking\" in middle-latitude climate variations, etc. Also, the course examines the role of human activities in climate, particularly the \"global warming\" related to increases in greenhouse gases, biomass burning, desertification, deforestation and afforestation, urbanization, irrigation for agriculture, and jet aviation. A key issue addressed is the role of human activities in possibly altering the frequency and intensity of teleconnections, especially ENSO, and of severe storms (thunderstorms, tornadoes) and hurricanes. The possibilities for geo-engineering the climate are also considered. In understanding the physical processes of climate, students are better able to assess the extent humans are a factor in contemporary climate changes. Course Objectives: 1. Understand how climate variables depict the characteristic patterns of climate and its variations on local/regional to hemispheric/global scales (climate diagnostics); 2. Evaluate the physical processes responsible for those climate and weather variations and their role in regional-scale phenomena (climate dynamics); 3. Assess the role of human activities in contemporary climate changes, on scales of the urban heat island to global warming (human impacts on climate); Upon completing this course, students will understand the geographic patterns (regional to global) and physical processes associated with climate variations, trends and changes on seasonal through interannual to decadal/multi-decadal temporal scales.", "prerequisite": "GEOG 210"}, {"course_name": "GEOG 310W: Introduction to Global Climatic Systems", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Introduction to global atmospheric circulation, including tropical, midlatitude and polar subsystems; ocean, land, cryospheric and urban climatic systems and interactions.  GEOG 310W GEOG 310W Introduction to Global Climatic Systems (3) Geography 310W is an advanced undergraduate course in Climatology that emphasizes study of the patterns of interannual climate variability ( climate fluctuations ) and the physical processes responsible for those variations ( climate dynamics ). Interannual climate variations include regional- to large-scale anomalies of temperature, precipitation, cloud cover, etc., that become manifest as drought, floods, heat and cold waves, etc. The physical processes associated with climate fluctuations include the following: interactions among the climate-system components (atmosphere, biosphere, cryosphere, hydrosphere); external forcing (e.g., solar variations, volcanic activity); and long-distance interactions involving the coupled atmospheric-ocean circulations, orteleconnections(El Ni�o Southern Oscillation (ENSO), the North Atlantic Oscillation (NAO), the Arctic Oscillation (AO), and the Pacific-North America (PNA) pattern). Climatic teleconnections manifest shifts in the atmospheric pressure \"centers of action\", storm tracks, jet stream positions, etc. In addition to the study of these climate patterns and processes, the course examines the role of human activities in climate, particularly \"global warming\", desertification, deforestation and afforestation, urbanization, irrigation for agriculture, and aviation impacts. In this regard, a key issue that is addressed is the potential role of human activities on the frequency and intensity of teleconnections, such as ENSO, and of severe storms (thunderstorms, tornadoes) and hurricanes; possibly the result of modifications to the oceanic Thermo-Haline Circulation. Students write a term paper, as well as critiques of a number of published articles relating to the above topics in climate dynamics. There is a mid-term (essay) exam but no final exam.", "prerequisite": "GEOG 010 or METEO003", "other": ["Writing Across the Curriculum"]}, {"course_name": "GEOG 313: Introduction to Field Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Introduction to the methods and techniques for collecting spatial and environmental data for physical geography and ecological studies.  GEOG 313GEOG 313 Introduction to Field Geography (3) This course explores a variety of methods used to acquire primary data from field locations. Aspects of physical, chemical, biological, and cultural factors are examined. Fieldwork is often an important component of research and it involves collecting and analyzing data, handling logistical concerns, developing sampling strategies and techniques, and addressing quality assurance and archiving issues. The course objectives are: to explore methods used to collect, analyze, and interpret field data; to expose students to techniques for sampling physical (geomorphologic, topographic, hydrologic), chemical (water and soil), and biological (flora and fauna) factors; and to explore ways to use field data to interpret geographical and ecological questions and hypotheses. Evaluation involves preparation of written laboratory reports, assignments, and tests. The course is offered every Fall semester with enrollment limited to the number of students supported in a laboratory section.", "prerequisite": "GEOG 160", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 314: Biogeography and Global Ecology", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Dynamics of plant and animal distributions on global, regional, and local scales; their causes and consequences.", "prerequisite": "BIOL 110", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "GEOG 315: Landforms and Geomorphic Systems in the Anthropocene", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Geography 315 builds on concepts presented in the introductory physical geography course to explore the subfield of geomorphology from a geographic perspective. It surveys the various processes shaping Earth's surface and the landforms resulting from those processes. The course relates these processes and landforms and their connection to human activity on Earth's surface. By taking this course, students will be able to: 1. recognize basic geomorphic processes and the resulting landforms and landscapes; 2. identify the observations and measurements used to understand geomorphic processes and landforms; 3. explain the implications for human use and livelihood on Earth's landforms and landscapes For students who are not geography majors, GEOG 315 may satisfy a General Education Natural Science requirement or may be used as a Natural Sciences selection for students pursuing a Bachelor of Arts degree.", "prerequisite": "GEOG 210", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "GEOG 320: Urban Geography: A Global Perspective", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "For the first time in human history, urban dwellers came to outnumber rural residents in the year 2000. The influence of cities extends to nearly every point on the globe. Urban areas, however, differ dramatically in their physical structure, economic base, governance patterns and the lived experiences of their residents with diverse work patterns, striking inequalities in living conditions and varied cultural expression. In short, contemporary cities are vibrant and complex phenomenon formed by conflicting social forces and economic processes. This course examines urban settlements and analyzes the processes of urbanization from a global perspective.", "prerequisite": "GEOG 20", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "GEOG 324: Place, Space and Culture", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "What is culture? Is it good literature, music, art and food? Or is it a full range of learned human behavior? Culture is in itself a very exciting topic; it invokes diverse imaginaries of life, livelihoods, ways of living, languages, and forms of entertaining, consuming, playing, and eating. In this course, we will delve deep to understand the 'how' and 'why' of culture, that is, how is a particular cultural landscape, a mode of living, produced and why? Most importantly, this course will examine how culture is not a stand-alone concept but rather a phenomenon that intersects with other social processes such as politics and economics. This course aims to survey and explore a range of perspectives on the nature of human integration with the environment and the manifestation of human culture on the landscape. The course will engage philosophical and metaphysical questions in addition to those of landscapes and place. The ultimate objective is for participants to develop a deep and multidimensional understanding of human-environment relations, and the manifestation of human activity on the landscape. Learning Outcomes: Through taking this course, students will be able to:  1. analyze the major themes and debates within cultural geography; 2. interpret representations of landscape, space and place in a variety of textual materials, such as academic readings, films, novels, newspaper articles and art; 3. evaluate the landscape, space and place as an expression of cultural forces.", "prerequisite": "GEOG 220", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 326: Geographic Perspectives on Economic Systems", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course builds on concepts presented in the introductory human geography course to explore the subfield of economic geography. It serves as a foundation for courses on economic development, political economy, and other offerings in geography. It will provide a balanced view of contemporary economic processes across the world through a geographical lens, focusing on a wide range of topics including the history of globalization, spatial structures of firms and businesses, international trade, and state interventions. The main objective of this course is to give students access to a geographer's lens for analyzing, interpreting, and critiquing information related to the economy. By the end of the course, students should be able to evaluate the role of different abstract principles in the creation of the economic landscape and to incorporate important critiques of these abstractions into their understanding of how and why uneven development is produced in economic systems. This course will also develop students' skills in formulating and presenting written and oral arguments based on their own knowledge in conjunction with various reference materials.", "prerequisite": "GEOG 220", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 328: War, Peace, and Diplomacy: Understanding Contemporary Geopolitics", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course expands on concepts presented in the introductory human geography course, understanding geopolitics and international relations through an examination of the spatial relationships among political processes and institutions. It explores the problems, promises and paradoxes of international violence and the efforts to address violence through human rights initiatives and international peace movements. Particular emphasis is given to developing an integrative view of how global, national and local scale processes interact to produce patterns of peace and conflict. The course analyzes how individuals, the state and other political actors engage with geography to produce violent or peaceful outcomes. GEOG 328 does not simply explore issues of violence and peace from a \"top-down\" perspective that focuses on the nation-state and international, state actors. Rather, it focuses on the multiplicity of perspectives and actors that come together to create violent or peaceful conditions. As a result, this course explores violence and the broader movement to address violence through human rights initiatives. We will explore violence and peace in the 20th and 21st centuries, the ways the organization of space and place is linked to violence and peace, and how international efforts to address violence and war are linked through time and space. This course also dissects the definition of human rights, the idea of 'just war' and the way peace movements may both sustain and undermine efforts at ending violence. Course Objectives: The overarching goal of this course is to educate us about the legacies of violence and the struggle to construct a more just and peaceful world. At the end of the semester students should be able to: 1) Define and articulate different notions of violence and recognize how the definition of violence is related to diplomatic efforts at addressing human rights violations. 2) Understand the relationship between violence in one area of the world and resulting broader geopolitical power dynamics, especially the human-territorial considerations of violence and peace. Learning Outcomes: At the end of this course students should be able to: 1) Identify and define structural violence. 2) Explain the differences between positive and negative peace. 3) Define human rights, and explain their connection to geopolitics. 4) Explain how truth processes work, and identify their strengths and limitations. 5) Identify how the definition of peace changes at different scales.", "prerequisite": "GEOG 220"}, {"course_name": "GEOG 330N: Political Ecology", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course introduces students to political ecology as one approach to advanced human-environment studies in geography. Political ecology is an interdisciplinary approach that combines environmental justice, cultural ecology, and other related approaches to undertake an integrated, holistic assessment of the relationships between social and ecological change. In particular, it analyzes the power dynamics at play in social and ecological marginalization and change; the social issues surrounding conservation of protected natural areas and species and conflicts over natural resources; the underlying causes of environmental conflicts; and issues of justice and distribution as they relate to the production and consumption of environmental goods and services. Students will gain familiarity with a wide range of theories and methods central to contemporary human-environment geography, such as Marxist political economy, Foucauldian governmentality, feminist intersectionality, ethnography, and land change science. Students will increase their knowledge of the world in general, and of approaches to the challenges of environmental policy in particular, by learning how these theories and methods have been put to use in the analysis of case studies from many different countries and continents. They will develop their ability to conduct independent research, work collaboratively, and present their thinking verbally and in writing through a variety of exercises and assignments. Upon completing this course, students will be able to: 1. understand key theories in political ecology 2. evaluate contemporary debates in human-environment studies using political ecology thinking 3. apply political ecology theories and concepts to relevant topics 4. use integrated thinking across the natural and social sciences to analyze and produce possible solutions to complex human-environment challenges", "prerequisite": "GEOG 230", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOG 332N: Science and policy of global greenhouse gas emissions and management", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This interdomain course introduces students to the science and policy of greenhouse gas emissions. The course focuses on emissions from natural sources, energy production and food production. Policy components will introduce students to the fundamentals of environmental policy and examine key policy options for mitigating and managing emissions. Global in scope, the course will also address how emissions and policy options differ in developed and developing countries. Topics will include overviews of the global carbon cycle, agriculture and land use change emissions, history of global energy use and production, overview of global climate change policy, frontiers in climate, energy and agriculture policy, amongst others.", "prerequisite": "ENGL 015.", "other": ["Cross-listed with: ANSC 332N, METEO 332N", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "GEOG 333: Human Dimensions of Natural Hazards", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "An introduction to natural hazards, integrating physical and social science perspectives.  GEOG 333 Human Dimensions of Natural Hazards (3)(BA) This course meets the Bachelor of Arts degree requirements. Natural hazards -such as earthquakes, tsunami, volcanoes, and floods  are not simply forces of nature. Their impacts depend on the interaction between the hazardous events and the characteristics of people, their communities, and the human systems in which they operate. The physical dimensions of natural hazards require knowledge of physical science, and the human dimensions of natural hazards call for knowledge of social science. Nevertheless, understanding natural hazards means not only that students know the physical and social sciences, but also that they know how nature and society work together to increase or decrease potential harm posed by these phenomena. This course introduces students to the topic by surveying the range of natural hazards and by applying important social science perspectives, such as risk, vulnerability, and the true costs of hazards, to each of the hazards. Because the study of natural hazards is interdisciplinary, readings, lectures, and discussions address crucial aspects of both natural and social sciences. GEOG 333 has two goals: (1) to develop understanding of a set of issues related to the human dimensions of natural hazards; (2) to develop and apply communication skills by discussing, writing about, and presenting on natural hazards. The specific content of the course will change with the instructor, but the focus on interactions between the natural and human worlds and on skill-development in writing and speaking will be constant. Students will be evaluated on both the course goals: (1) understanding of the human dimensions of natural hazards; (2) application of communication skills. Although exact procedures for determining grades will vary with instructor, the basis for grades will always include a combination of written exams based on lectures and readings, oral presentations and papers, and in-class discussion and participation.", "prerequisite": "junior or senior standing", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 361: Cartography--Maps and Map Construction", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "The art and science of creating small-scale maps as a medium for communication and research.  GEOG 361GEOG 361 Cartography - Maps and Map Construction (3)(BA) This course meets the Bachelor of Arts degree requirements. Mapping is crucial to exploring and understanding distributions of geographic phenomena. It is also an important phase of many database-intensive analyses because a map is often the best way to visualize results and show them to others. Emphases in this course will be on designing and producing both thematic and reference maps that use symbols and visual hierarchies which allow the content of the maps to be readily understood. In addition to principles of graphic design, students learn about map projections, generalization, and data classification, with the objective of becoming proficient mapmakers. Hands-on computer work for lab sections will involve working with varied digital data sources using GIS software. Maps are often built from existing data created by government mapping agencies, stored as geographic information systems (GIS) databases, and based on remotely-sensing imagery. The prerequisite for GEOG 361 is the 100-level mapping course covering basic principles of these technologies and data sources. The course is typically offered once a year. Evaluation is based on written exams and mapping projects that students produce to map location information and represent social and environmental data.", "prerequisite": "GEOG 160", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 362: Image Analysis", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "Introduction to the basic principles of remote sensing, and the analysis of aerial and satellite data.  GEOG 362 GEOG 362 Image Analysis (3)(BA) This course meets the Bachelor of Arts degree requirements. Geography 362 is a course designed to introduce students to the field of remote sensing. Modern remote sensing is a multi-disciplinary and many-faceted subject encompassing knowledge from a broad array of areas. Remote sensing has steadily grown in importance since the early 1970s and continues to expand as sensing technology improves, as imagery becomes cheaper, as coverage becomes more widespread and as good software for processing the data become readily available. This course is not meant to be an exhaustive treatment of remote sensing. Rather, it is designed to provide an overview of the field.The field of remote sensing is vast and includes several inter-related themes. Remote Sensing as a science primarily involves the extraction of information contained within energy. The engineering component of remote sensing involves the design and construction of instruments and systems capable of capturing and recording energy from a target. Remote Sensing as a vital tool is expressed in myriad applications, from land cover change analysis to weather forecasting.This course will be administered in two parts -The first seven weeks of the semester will focus on three broad topics (Fundamental Principals of Radiative Transfer and Energy-Matter, Remote Sensing Systems, and Applications). This part of the course will expect student to grasp the major laws describing the energy-matter interactions. Recitations will be devoted to reviewing homework problems designed to solidify understanding of radiation concepts central to the construction of remote sensing imagery. -The remainder of the semester will be devoted to image analysis with an emphasis on digital remote sensing, i.e. analyzing data in digital form using computer software. This aspect of the course will have a practical focus on using imagery to analyze land cover and to construct land cover maps, with the expectation that students will be able to become proficient in the handling and processing of remote sensing imagery. Consequently, laboratory work will play a major role in this component of the course.", "prerequisite": "GEOG 160", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 363: Geographic Information Systems", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course describes and explains the principles of Geographic Information Systems (GIS). Building on the overall introduction in the prerequisite course on the special characteristics of spatial data and how our earth is measured an mapped, Geography 363 focuses on ho to use data to develop solutions for geographic representation and analysis tasks using GIS software. Students learn the basics of GIS data acquisition, manipulation, and analysis. Students will learn to gather or create relevant spatial data, clean/recertify/bring the data into the GIS, perform GIS operations, visualize and communicate results in an informative way, and sufficiently answer basic research questions.  Upon completion of this course, students will be able to:  1. Understand Geographic Information Science principles. 2. Handle geographic data for a variety of applications.  3. Find, use and evaluate GIS datasets. 4. Describe capabilities and limitations of GIS methods and models. 5. Confidently use capabilities of the ArcMap GIS software package. 6. Demonstrate ability to design and carry out spatial analyses using GIS. 7. Communicate the results of geographic analyses to others, both in oral & written form.  8. Acquire skills to use GIS in a career, or work in a GIS-related career.  9. Solve spatial problems. 10. Give advice for what problems can be solved and what techniques can be used.", "prerequisite": "GEOG 260"}, {"course_name": "GEOG 364: Spatial Analysis", "department": "Geography (GEOG)", "credits": "3 Credits/Maximum of 3", "description": "Geographic measurement, scaling, and classification; analysis of spatial pattern and structure; geographic covariation and autocorrelation. GEOG 364GEOG 364 Spatial Analysis I (3)(BA) This course meets the Bachelor of Arts degree requirements. Geography 364 is an introduction to spatial analysis that focuses on statistical methods for geographers. You will have an opportunity in this course to: learn how tousestatistics in your own work; learn how toconsumestatistics in everyday life The statistical methods you will learn to use are simple descriptive statistics that we use to summarize complex data, as well as the associated charts, diagrams and maps. From there, we will move on to look at chance and probability theory, and simple inferential statistics.Throughout the course, we will be concerned with &ldquo;everyday statistics&rdquo;, primarily as it relates to geography. Contemporary media are saturated with statistics, from reports of climatic change, through latest presidential election polls, to batting averages and yards-gained statistics in sports. A lot of the presentation of these statistics is lazy or inaccurate, and often misleading (whether, deliberately or not), and a major theme of this course will be to look at the issues involved.During most lectures we will spend some time working with sample problems, and to discuss practical applications. These activities are meant to build a deeper understanding of the subject matter but it also relies heavily on your active participation. You will often have work to prepare before lectures or other types of lecture homework.Labs will give you experience with statistics functions in Excel before moving onto SPSS as well as other statistical software, and also with mapping statistical data using GIS software.", "prerequisite": "STAT 200", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 365: Introduction to GIS Programming", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "The rate at which geospatial data are being generated exceeds our ability to analyze them. These developments are quickly leading toward a data-rich but knowledge-poor environment. New challenges arise from an unprecedented access to massive amounts of data. Specialized algorithms are needed to address these scientific and computational challenges and provide innovative and effective solutions to analyze these large, often multi-modal, spatio-temporal datasets generated by high-resolution sensors or computational models. Traditional computational frameworks are specialized to serve a single science application, and are not flexible to drive diverse models on changing computational platforms. GEOG 365 addresses this new challenge by introducing specialized algorithms and data structures to analyze and visualize large and rapidly changing Earth science data. The emphasis of this course is on specialized data miningalgorithms suitable for spatial data and spatio-temporal data with geoscience and Earth science applications. This course teaches how to automate GIS tasks using scripting languages. Automation can make work easier, faster, and more accurate, and knowledge of a scripting language is a highly desired skill in GIS analysts. This course dedicates time to programming fundamentals so that the skills learned can be applied to languages. Increased ability to adapt to new technologies and programming languages will be the greatest benefit students gain from this course. Course Objectives and Learning Outcomes By the end of this course, students should be able to: - Design and implement solutions using scripting languages to automate geoprocessing tasks. - Demonstrate an understanding of programming concepts, methods, and approaches such as debugging, error checking, and documentation. - Demonstrate an awareness of advanced concepts such as external libraries. - Be aware of and able to integrate content, examples, and libraries.", "prerequisite": "GEOG 260"}, {"course_name": "GEOG 390: Professional Development Seminar in Geography", "department": "Geography (GEOG)", "credits": "1-3 Credits/Maximum of 4", "description": "This course equips geography students with a toolkit for career development as they explore the discipline, develop professional networks, and move into life  \"beyond\" Penn State. It will help students develop a deeper understand of the relationship between careers, research, experiential learning, civic responsibility, transferable skills, and the discipline of geography. Students will come away with a set of career-related competencies as well as a framework for achieving further professional development. Students will hone a resume, engage in professional networking via LinkedIn and informational interviews, and construct an e-portfolio to showcase their accomplishments."}, {"course_name": "GEOG 397: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "GEOG 398: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "GEOG 398A: **SPECIAL TOPICS**", "department": "Geography (GEOG)", "credits": "1-3 Credits"}, {"course_name": "GEOG 399: Foreign Studies", "department": "Geography (GEOG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "prior approval of program", "other": ["International Cultures (IL)"]}, {"course_name": "GEOG 410: Climatic Change and Variability", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course introduces students to the physical dimensions of climate change and variability over a variety of temporal and spatial scales. The focus is on recent and future global warming, but we will spend some time looking at climate changes of the past, as context for the future. The emphasis is on the physical science behind questions of global and regional climate changes, but we will also pay some attention to shorter-period climate variations/teleconnections and their impacts on human systems (as possible analogs of future climate change). Because scientific discovery and analysis takes place within a particular social context, we will consider the values, ethics and responsibilities of scientists in general, and specifically in the contexts of geoengineering to minimize or reverse global climate changes. Climate change topics include radiative forcing, greenhouse gases and aerosols, scenario development using statistical and dynamical approaches, equilibrium GCMs versus time-dependent models. Important climate variation topics are droughts, floods, heat/cold waves, and the role of teleconnections; notably, the El Nino-Southern Oscillation, North Atlantic Oscillation and Arctic/Antarctic Oscillations. Because most professional research on climate change and variation involves collaborative science teams, this course emphasizes collaboration and participation. Course Objectives 1. Provide students a basic understanding of the climate system and the internal and external forcings that produces climate variability and change over varying time scales. 2. Introduce students to the tools of the trade how statistical and global climate models work and why they are used. 3. Help students to think critically about global climate change projections and their implications for natural and human systems. 4. Improve students' skills in communicating science concepts for a variety of audiences. Learning Outcomes As a result of taking the course, students should have an increased understanding of global climate change and its potential impacts on society, including: 1. Understand, and be able to explain to others, the physical basis for future global climate change. 2. Be able to set future changes in the context of past climate change and variability. 3. Understand the influence of national and international organizations in structuring climate change research and possible remedies. 4. Articulate their own values, ethics and world view and recognize how these frame their own understanding and perspectives on climate change issues.", "prerequisite": "GEOG 310"}, {"course_name": "GEOG 411: Forest Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course studies processes that control spatial and temporal change in forests.", "prerequisite": "GEOG 314", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 411W: Forest Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course studies processes that control spatial and temporal change in forests.", "prerequisite": "GEOG 314", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "GEOG 412W: Climatic Change and Variability", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Theories and observations of past, present, and future climatic change and variability; introduction to techniques used in climatic change research. GEOG 412W Climatic Change and Variability (3)(BA) This course meets the Bachelor of Arts degree requirements. GEOG 412W introduces students to the physical dimensions of climate change and variation. Climate change topics include radiative forcing, greenhouse gases, scenarios, equilibrium models, and time-dependent models. Important Climate variation topics are teleconnections and the El Nino-Southern Oscillation phenomenon. GEOG 412W would appeal to students with interests in Earth and atmospheric sciences, as well as environmental protection. As a writing-intensive course, GOEG 412W aims to help students improve their ability to communicate scientific information. The course devotes considerable class time to the mechanics of reading, writing, speaking, and especially report production. Students not only write, but also learn to edit and critique writing.Because most professional research on climate change and variation involves collaborative science teams, GEOG 412W focus on collaboration and participation. Students form teams, conduct research, and compile formal collaborative reports on climate change and variation. Students document their individual contributions by producing portfolios.", "prerequisite": "GEOG 110", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "GEOG 414: Principles and Applications in Landscape Ecology", "department": "Geography (GEOG)", "credits": "1-3 Credits", "description": "Landscape ecology is a rapidly evolving discipline that is poised to address contemporary challenges in sustainability science, land management, and conservation. The focus of landscape ecology is on the controls, interactions and outcomes of spatial patterns and processes on ecological dynamics at multiple spatial scales. Landscape ecology explores how energy and nutrients flow across spatially variable patches, how dispersal and migration of aquatic and terrestrial organisms are affected by spatial networks, and how disturbances propagate across complex terrain. Grounded in related fields of ecology, geography, and spatial analysis, landscape ecology provides additional theoretical tools and approaches to guide applied conservation decision-making in a dynamically changing world.The objective of this course is for students to apply the methods, theories, approaches and practical applications of landscape ecology to inform landscape decision-making. Particular emphasis is placed on how humans modify landscapes and how species, ecological communities, and ecosystems have responded to these changes. These objectives will be met through lecture and discussion of prominent landscape ecology topics (scale, pattern quantification, agents of pattern formation, green infrastructure, and conservation biology), computer laboratory exercises, written papers, and group presentations.By the end of the course students will be able to (1) articulate in written and oral form the concepts of scale and pattern, (2) use landscape pattern metrics, spatial statistics, and models to characterize ecological pattern on landscapes, and explain how ecological patterns develop, and (3) apply knowledge of spatial pattern-process interactions to issues of sustainability, conservation, and landscape management.", "prerequisite": "BIOL 110"}, {"course_name": "GEOG 417: Satellite Climatology", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "A discussion of the application of satellite data to current and planned large-scale climate experiments.  GEOG 417GEOG 417 Satellite Climatology (3)(BA) This course meets the Bachelor of Arts degree requirements. Geography 417 presents the theory and practice of satellite remote sensing as applied to the study of climate. Remote sensing refers to the acquisition of information about a target or phenomenon from a distance; climate is the low-frequency signal of weather that involves interactions among Earth's environmental systems (atmosphere, biosphere, cryosphere, hydrosphere). Combining these two disciplines into Satellite Climatology is logical because the fundamental basis of both remote sensing and climate is radiation transfer through Earth's atmosphere. The course emphasizes understanding the different techniques used to determine, from space-borne platforms, the atmospheric, oceanic and land surface conditions important to climate and its variations, and the interpretation of these remotely sensed data in the context of \"climate dynamics\" and \"synoptic climatology.\" Specific topics include the following: Satellite systems (platforms, sensors, orbits, data processing); Remote sensing clouds and cloud systems, Retrieval of atmospheric temperature, moisture, and precipitation, the Earth-atmosphere radiation and energy budgets, and Land-surface conditions and their modification by humans . In addition, examples of the different satellite-based climatologies, and their advantages and limitations with respect to conventional observations (\"ground truth\"), are presented.", "prerequisite": "GEOG 362", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 420Y: Comparative Urbanism", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course investigates selected urban issues through the lens of comparative urbanism.  GEOG 420Y Comparative Urbanism (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. As an upper level urban geography seminar, this course investigates selected urban issues through the lens of comparative urbanism and requires active class participation. Examination of readings from the growing literature on comparative urbanism will introduce students not only to possible ways to design an effective comparative study but also to the varying goals of such work. Other readings, drawn from a wide variety of sources, will target particular issues facing urban areas that may vary from year to year, such as economic restructuring, uneven urban redevelopment, transportation planning, historic preservation, arts districts, the social construction of race and ethnicity, aging in place, and urban poverty. Students in turn will be required to design and carry out a comparative research project focusing on a particular urban issue, highlighting both the similarities and the differences between their selected case study cities and placing them in local, regional, and global contexts. This course is reading and writing intensive and satisfies United States Cultures and International Cultures requirements, as well as the Bachelor of Arts Social and Behavioral Sciences Field.", "prerequisite": "GEOG 160", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "GEOG 421: Population Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course examines key demographic characteristics of the U.S. population and how they are distributed in space. At the same time, we will look at how individuals come to be part of a population and with what implications. The course will focus on the U.S. with a special emphasis on where people live in U.S. cities. Given this focus we will spend significant time on issues of segregation, gentrification, health disparities, environmental justice, and migration. The class includes a significant lab component and students will have the opportunity to conduct empirical analyses that are common in the fields of planning, epidemiology, social work, and other cognate professional fields. This course meets the social and behavioral components of the BA field. The first goal of this seminar is to prepare students to think critically about the way demography and policy interact to produce outcomes that vary within and across populations and across space. Many of the most critical policy debates of our time hinge on an understanding of subgroups delineated by gender, age, race, and/or immigration status. Students will learn to identify the role of history, economics, culture and geography in shaping the contexts in which these policy debates now exist and will gain the critical capacity to evaluate changing conditions in the world around them.The second key goal of this course is to train students in some of the basic techniques for analyzing populations. Being able to devise and execute a project that answers basic questions about the distribution of a population is a foundational skill for many careers that geographers might choose to follow, and can be powerful for engagement in the policy process. The emphasis here will be on applying statistical and GIS skills learned elsewhere to the messy world of real-life data. Students will achieve a better understanding of the possibilities and pitfalls of quantitative analysis of demographic information.", "prerequisite": "GEOG 220"}, {"course_name": "GEOG 422W: Globalization, Migration, and Displacement", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course explores the economic, political, legal, and socio-cultural dimensions of displacement and migration in the context of globalization. The substantive focus will be transnational low-wage labor migration and refugee flows of the late 20th- early 21st centuries, even as the course situates contemporary processes within histories and geographies of economic modernization, urbanization and colonialism. At a conceptual level, students will engage key theories of migration from sociology, economics, geography, and demography, and they will closely explore how race and gender shape migrant experiences and policy debates. Topics to be examined include: political and economic drivers of labor migration; immigration and border policies and politics; refugee politics and policies; human trafficking; shifting social identities, cultures, and notions of belonging in sending and receiving communities; and the role of race, gender, class and nationalism in these processes. Upon completion of this course students will be able to: - Identify and describe the historical antecedents to contemporary cross-border labor migration and refugee flows - Analyze the economic, political, legal, and social-cultural dimensions of transnational labor migration. - Explain the causes and consequences of labor migration from sending regions - Discuss the causes and consequences of labor migration to regions of reception - Compare the factors generating refugee flows across distinct regions over the 20th century - Integrate scholarly understandings of migrant experiences and identities with broader structural forces generating cross-border flows. - Examine distinct politics and policies of refugee protection and resettlement. - Demonstrate how social hierarchies of race, gender, and class shape cross-border labor migration and refugee resettlement. - Apply theories of migration to specific case studies of cross-border mobility. - Develop a research paper that engages course themes and scholarly debates, linking class concepts and debates to a specific case study. - Demonstrate effective visual and oral presentation skills", "prerequisite": "GEOG 20", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "GEOG 423Y: Historical Geography of North America", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Exploration, settlement, and changing patterns of human occupance from the seventeenth century to the 1930s.  GEOG 432Y Historical Geography of North America (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. This is an upper-division, writing-intensive course that presents an overview of current scholarship on the evolving historical geography of the continent. It does this through a set of lectures given by the instructor, through directed readings that will be the basis of class discussion, and centrally through research essays that offer students the opportunity to research, write and argue historical geographies. Research in historical geography is a process of engagement with partial evidence and with secondary material to open windows on aspects of past lives, past economies, and past places. Since an introductory level overview of the historical geographies of the continent is presented in GEOG 122: The American Scene, this class does not offer a comprehensive survey of regions and periods. Rather, it focuses on three themes -staples and the colonial era, local transformations in agricultural and industrial communities in the nineteenth and early twentieth century, and the packaging of memory as a way to expose students to primary evidence and current debates.In the unit on the colonial era, the focus is on a variety of records that illuminate the development of economies based on staples such as fish, fur, tobacco, rice and iron, drawing on evidence from the Lords of Trade and Plantations in London, and from correspondence between merchants and planters, as well as scholarship on the material culture of houses, farms and settlements. For the unit on local change, workshops illustrate how to tease out information from the manuscript census, county atlases and corporate histories; students then pursue similar material for a locale of their own choice and submit drafts of an evolving research essay. A short presentation to the class encourages the effective distillation of visual and data evidence to communicate research findings. On the packaging of memory, the class critically examines how historic sites are presented, and how interpretations have changed in response to shifting academic and popular concerns. Lectures are interspersed with discussions of readings, workshop demonstrations, and by student presentations. Eleven distinct writing exercises are used as the basis of allocating the overall grade.", "prerequisite": "GEOG 122", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "GEOG 424: Geography of the Global Economy", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Focus on industrial location theory, factors in industrial location, studies of selected industries and problems of industrial development.  GEOG 424GEOG 424 Geography of the Global Economy (3) This class will conductresearch on firms and industries engaged in the globaleconomy. Students learn to conduct industry and firms analyses in the context of international regulation. Students learn about the competitive conditions, governmental context, and technological challenges facing selected industries.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "GEOG 424W: Geography of the Global Economy", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course examines the actors, processes, and policies relevant to understanding the global economic system. How does the global economy work? How is it changing? What are the pieces and how do they fit together? What can we do to shape outcomes within this system? In the first section of the course we examine these questions in the context of the 2009 World Development Report produced by the World Bank. The report has as its focus \"Economic Geography\" with a particular focus on the role of cities in development. We will emphasize the differing assumptions made by economists and geographers with regards to processes of economic development and the impact of globalization. In the second portion of the class we will focus on specific industries, firms, and regions in an attempt to put the broader concepts from Part 1 into an applied context. The focus of this section will be on identifying the complexity of the economic system. In Part 3 of the class we draw from the literature on alternative understandings of the global economy and its possibilities and link this literature to broader debates about global capitalism, international economic policy, and social welfare. Bringing together the broad themes from Part 1 and the applied responses and strategies gleaned from Part 2 we will attempt to synthesize both macro and micro-scale understandings of the present economic system.", "prerequisite": "GEOG 326", "other": ["Writing Across the Curriculum"]}, {"course_name": "GEOG 425: Geography of Race, Class, and Poverty in America", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This class examines the spatial interactions of race, class and poverty in the United States.  GEOG 425 Geography of Race, Class, and Poverty in America (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. The terms 'race,' 'class,' and 'poverty' are often discussed in the same breath in academic scholarship. Research portrays the interwoven relationships between economic status, economic security, and ethnic heritage. Despite this powerful and abundant literature, few scholars examine the spatial interactions among race, class, and poverty. The class introduces students to a range of literatures on the meaning of race, class, and poverty in the contemporary United States. We will situate these terms in their local spatial context and investigate how location influences perceptions of the meaning of race, class, and poverty. We will blend historical, contemporary, theoretical and empirical scholarship as we investigate the meaning, understanding and manifestation of race, class and poverty in the U.S. Beginning with history, we will move through the 20th century examining how economic and political cycles have influenced social understanding of these terms. There will be a particular focus on deconstructing the measurement and meaning of the terms and their use in public policy discussions based on perceptual understandings of the terms 'race' , 'class' , and 'poverty.' We will examine powerful historical and contemporary media images of race, class, and poverty as seen through the lens of place and identity.", "prerequisite": "GEOG 126", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"course_name": "GEOG 426W: Gendered Worlds", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Gendered Worlds examines how systems of dominance manifest in everyday life. Through an intersectional approach to social differences, such as gender, race, class, ethnicity, age, ability, and sexuality, the course highlights the significance of difference in shaping experiences of space and place in a global context. The course incorporates approaches from cultural, postcolonial, subaltern, queer, gender, and critical race studies, all of which have influenced current debates across the field of geography. Feminist scholars have long been concerned with the spatial politics of cultural difference. As a point of entry to discussions of gender and geography, this course will explore the diverse ways in which geographers have conceived of, analyzed, and redefined gender as a contested spatial practice that intersects with other facets of identity such as race, class, and sexuality. Using contemporary geographic texts, we will explore the gendered dynamics of geographic research, citizenship, violence, security, nationalism, nature,and globalization. The purpose of this course is to examine how gender is understood and utilized in the field of geography. This course also aims to enhance students' ability to engage in first-hand critical research, as well as collaborative learning, through a reflective and on-going process of research and writing over the course of the semester. At the end of the course, the successful student will be able to: 1. Deploy contemporary debates around gender theory, gendered spatial practices, and cultural difference. 2. Critique the cultural and social construction of gender across time and cultures. 3. Analyze representations of gender in social institutions such as the media. 4. Apply theories of gender and cultural difference in the context of critical written analysis.", "prerequisite": "GEOG 220", "other": ["Cross-listed with: WMNST 426W", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "GEOG 427: Urban Historical Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Study of the development and transformation of the historical urban built environment.  GEOG 427 Urban Historical Geography (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements.Close up, cities can be seen as sets of buildings - some that arelived in, some that are places of work, and others that are places ofcultural celebration. The streetscapes created by these sets ofbuildings can be decoded as a palimpsest of the past. Likewise, thepatterns and names of streets, lanes and alleys between buildingscontribute to morphological databases of property parcels and land usesthat help in the analysis of the historical transformations of urbanform. Seen at a more distant scale, cities are also nodes - centers forsurrounding regional trading systems, and partners with other places innational and global trading systems - that have evolved over a set ofdecades or even centuries. This course offers an investigation of such multiple frames on theurban past. Examples will be drawn from the Americas, but many will befrom Europe, Africa and Asia. Imperialism and its associated colonialmercantile practices meant that variants of urbanism were mapped on toother parts of the world where they often created hybrid forms ofcities over time. In the industrial era, new relations between citiesand the countryside emerged, as new forms of production developed andas resources were harnessed from a more global hinterland. Radicallydifferent types of cities have emerged in the past two centuries.Geography 427 will survey the global urban past and explore ways ofdecoding urban morphological complexity through historical cartographicrecord and extant landscape evidence. The ultimate objective is forstudents to develop an appreciation for the complexity of urban lifeand landscapes in times past and to understand some of the ways inwhich American urban forms adapt or draw distinction from urban formselsewhere. At the same time, the course aims to enhance student oral andwritten communication skills. To enhance their oral communicationskills, each student will be expected to make two presentations ontheir research and to participate in class workshops. To enhance theirwritten communication skills, students are required to write two papersthat include instructor feedback on interim drafts, to craft threearticle summaries, and to write short log responses to most lectures.", "prerequisite": "6 credits in geography, humanities, or social sciences", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "GEOG 428W: Political Geography", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This upper-level undergraduate seminar examines theories and concepts of political geography, with special emphasis on the geographic foundations of power in a globalizing world. The course covers the foundational themes of political geography: state formation; citizenship and nationality; geopolitics; borders; sovereignty; colonialism/postcolonialism; environmental politics; political identity and social movements. The course readings include a balance of theory and case study material and include international and domestic examples. As a writing-intensive course, students will write weekly assignments, workshop their essays in peer-groups, and focus on the techniques of expository writing on political geographic topics. The objective is to develop effective writing skills for presenting analyses of political geographic processes and basing these analyses on investigation, evidence, and clear argumentation in a concise essay format. Students will receive regular feedback and evaluation from the instructor and have several opportunities for presenting their work to their peers. The final project consists of a larger research and writing project and class presentation. After taking this class students will: 1. understand the various linkages between geography and politics 2. be able to apply a multi-scalar framework to understanding politics 3. contextualize concepts of power and resistance in relation to space and time 4. understand how geographic settings simultaneously enable and constrain political agents and options 5. be able to engage quality news media using geographic to gain a broader understanding of what is going on in the world.", "prerequisite": "GEOG 220", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "GEOG 429: Geographic Perspectives on Global Urbanization", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course reflects critically on a number of issues related to global urbanization, including the culture and political economy of urban space.", "prerequisite": "GEOG 126", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "GEOG 430: Human Use of Environment", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "The human use of resources and ecosystems and social causes and consequences of environmental degradation in different parts of the world; development of environmental policy and management strategies.  GEOG 430GEOG 430 Human Use of Environment (3)(BA) This course meets the Bachelor of Arts degree requirements. Geography 430 examines the human use of resources and ecosystems, the multiple causes and consequences of environmental degradation, and adaptive institutional and policy arrangements as prerequisites for resilient and sustainable management and development in different parts of the world. The major objective of this course is to help geographers, earth scientists, and other professionals to develop an awareness and appreciation of the multiple perspectives that can be brought to studies of human use of the environment and of the ways in which resource-management decisions are made in human society. This is a capstone course that encourages students to place their individual major and technical skills within the context of multiple approaches to environmental decision making and management in complex and dynamic social-ecological systems. GEOG 430 is designed as a collective/social learning experience. This implies that the professor and students share responsibility for the learning process and take advantage of collective skills, insights, experiences, and efforts of each other. As in system dynamics, this requires both commitment and flexibility and the willingness to explore foreign territory. As part of this philosophy, learning consists not only of information flow from professor to student, but also from student to student and student to professor. The course follows a case study approach to explore real life lessons of adaptive management around the globe. To make this process work, attendance and active participation are imperative. The course is run more like a seminar than a lecture course and integrates lectures, in-class discussions, presentations, and interactive activities. Student performance is evaluated based on active participation in all of the above, individual short assignments, group projects, in-class quizzes and exams, and one major writing assignment, varying by faculty teaching. This course is offered every semester.", "prerequisite": "GEOG 010 or GEOG 020 or GEOG 030 or GEOG 040 or GEOG 130 or permission of the program", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 431: Geography of Water Resources", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "GEOG 431 is designed for students to understand the natural processes of aquatic ecosystems, management of water resources, and threats to sustaining water quantity and quality, for all types of freshwater surface, groundwater, rivers, lakes, wetlands. This course should appeal to water resource managers, geographers, ecologists, earth scientists, planners, other environmental professionals as well as non-science majors. This course will develop awareness and appreciation of the multiple perspectives about water as a precious resource, commodity, and sometimes hazard. Students in the course will first examine water. Course Justification characteristics, sources, classification systems, and aquatic ecosystems. Next, we will examine water resource management, including issues surrounding irrigation; floods and dams; provision of safe potable water; threats to water quantity and quality including human and aquatic ecosystem effects; the water economy including virtual water and water footprints; water laws and policy; institutions for water management at the global, national, regional and local scale; and issues of water conflict, security, and climate change. Course Objectives: - Learn how/why water is distributed unevenly in space and time around the Earth. - Examine ways resource management decisions made in human society are strongly related to the availability, quantity, and quality of water. - Examine water characteristics, sources, classification systems, and aquatic ecosystems. - Examine water resource management, including issues surrounding irrigation; floods and dams; provision of safe potable water; threats to water quantity and quality including human and aquatic ecosystem effects; the water economy including virtual water and water footprints; water laws and policy; institutions for water management at the global, national, regional and local scale; and issues of water conflict, security, and climate change. When you successfully complete this course, you will be prepared to:  - Identify the unique characteristics of freshwater. - Describe, with a geographic perspective, how and why freshwater is distributed unevenly in space and time around Earth. - Explain the natural processes of aquatic ecosystems. - Discuss why conflicts arise over the vital resource of freshwater. - Identify challenges facing water management in varied climate types around the world. - Compare how humans interact with aquatic ecosystems.", "prerequisite": "GEOG 10", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 431H: Geography of Water Resources", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Perspectives on water as a resource and hazard for human society; water resource issues in environmental and regional planning.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"course_name": "GEOG 432: Energy Policy", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Analysis, formulation, implementation, and impacts of energy-related policies, regulations, and initiatives.", "prerequisite": "EGEE 120", "other": ["Cross-listed with: EME 432"]}, {"course_name": "GEOG 433: Geographies of Justice", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "The justice concept has been a topic of interest within various academic and policy realms concerned with the inequities experienced by racial groups, socio-economic class, and ethnicity. The environment justice movement is generally understood to have begun in the early 1980s with a series of events that demonstrated the inequitable distribution of health hazards and risk. While much work in environmental justice has usefully focused on the disproportionate exposure of poor and minority populations to environmental hazards, conceptualizations of justice have expanded in recent years to include systematic and comparative research within urban and rural populations, industrialized and developing contexts, access to and control over resources, as well as unwilling exposure to hazards, processes and institutions of environmental governance. These trends have resulted in greater attention to the social processes that create and perpetuate inequality on the basis of race, gender, income, or other social categories. In exploring the 'fast conceptual transfer' of the environmental justice concept to other settings, Walker and Bulkeley (2006: 655) suggest emerging interest in distribution between nation-states, an expansion of terms to include gender, age and future generations, and intersections with the vulnerability literatures to examine the threat of natural and produced risks. This course engages with the history and future of social and environmental justice. We begin by examining the emergence of the environmental justice movement in the United States and subsequent export of the justice concept to other topics, including sustainable development and climate change, and within other settings, including Sub-Saharan Africa and Latin America. In exploring the diverse ways that justice is being applied at the present time, we will also question the future viability for justice as a conceptual and organizational tool. Course Objectives This course has four primary objectives: - Examine the history of the concept of environmental justice and the environmental justice movement in the United States; - Consider multiple definitions of environmental justice such as procedural and distributive justice; - Examine the application of the environmental justice concept to other topics, including sustainable development and climate change, and within other settings, including Sub-Saharan Africa and Latin America; and - Consider future directions for environmental justice."}, {"course_name": "GEOG 434: Politics of the Environment", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course explores politics related to the use, transformation, valuation, and representation of the environment.  GEOG 434GEOG 434 Politics of the Environment (3) Scholarship in geography and related disciplines has demonstrated that nature in general and specific environments in particular are unavoidably political. Environmental management can thus never be a purely scientific or technological challenge; it requires critical analysis of cultural, political, and economic contexts, factors, and effects. For instance, effective environmental management requires consideration of how culture shapes how we perceive and value our environments, who wins and who loses in any particular approach to environmental management, and what the relative advantages and disadvantages of competing institutional approaches to environmental management are.This course examines the development of environmental governance, with a primary focus on the United States. It explores both how various groups within society conceive of and value the environment, and multiple approaches to environmental governance and protection. It reviews the history of environmental movements and regulation, and contemporary issues and debates in environmental governance, with particular attention to the effects of institutional forms and social movements. In particular, it examines competing arguments for and against governance approaches centered on state action, market mechanisms, and prominent roles for NGOs and social movements.Students will be evaluated based on: 1) their participation in class discussions, based on critical engagement with material from course readings and lectures; 2) their performance on a midterm and a final examination; 3) an individual research project on a topic relevant to the course, to be designed and carried out under the supervision of the course instructor.", "prerequisite": "6 credits in social sciences or humanities"}, {"course_name": "GEOG 436: Ecology, Economy, and Society", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Analyses of major themes in ecology and economic development, poverty- alleviation, and sustainability.  GEOG 436GEOG 436 Ecology, Economy, and Society (3) For many years, it was believed that there was a direct tradeoff between economic growth and a clean environment. Sustainable development has been proposed as an framework within which these two objectives can be pursued in harmony and actually can reinforce one another. This course focuses on sustainability issues at the broader (macroeconomic) level, as opposed to the operation of individual businesses (microeconomic, or industrial ecology) level.The course will have two main emphases: 1) to evaluate the major conceptual ideas surrounding natural resource management and sustainable development, including equity, poverty, fairness, power, knowledge, and community empowerment; 2) to use empirical case studies to examine the practical, material and policy relevance of these concepts. The first part of the semester will be used to untangle and clarify the ideological and theoretical bases (biases) of broad human-environment discourses as they pertain to community empowerment and resource development. The final part of the semester will be used to analyze case studies in order to assess the relevance of existing theoretical framework for resource empowerment and community development in industrialized countries and the Third World, especially Africa.", "prerequisite": "upper-division standing"}, {"course_name": "GEOG 437W: Energy Geographies and Policy", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course explores the motivations, key concepts, and contemporary challenges of US and international energy policy. The approach of the course is inherently geographical in that we engage the concepts of scale, place, landscape, and materiality to evaluate energy policy issues. The course addresses the following questions: 1) Why and how is energy governed? 2) How does energy policy differ across political scales and energy sectors? 3) Who are the key stakeholders influencing energy policy? 4) How are the costs and benefits of energy policy distributed? 5) How can a geographic perspective advance energy policy making? 6) How well do existing tools and policy frameworks address emerging challenges in energy policy and governance? The course is designed to explore these questions through interactive discussion, drawing on examples from various political levels and in various geographical contexts. A combination of independent writing and presentations will provide students with the expertise to be careful and critical observers of policy developments, and to prepare students for future roles as policy advisors in business and government settings. The course is divided into four parts: 1) overview of US and international energy policy; 2) key concepts and debates in analyzing energy; 3) case studies; and 4) emerging issues and challenges. After successful completion of this course, students will be able to: 1. Analyze the origins, motivations and distributional impacts of U.S. and international energy policies; 2. Apply key concepts from the energy social sciences to contemporary energy debates; 3. Critically assess how geographic perspectives can advance energy policy making", "prerequisite": "GEOG 230", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "GEOG 438W: Human Dimensions of Global Warming", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Human dimensions of climate change: human causes, human consequences, and policy implications of global warming.  GEOG 438W - Human Dimensions of Global Warming (3)(BA) This course meets the Bachelor of Arts degree requirements. Geography 438W, the Human Dimensions of Global Warming, covers both the human causes and consequences of what many people view as the most significant problem facing society. Humans cause climate change primarily by emitting heat-trapping greenhouse gases through everyday activities associated with industrialized society (such as energy production and consumption, transportation, and manufacturing) and land transformation (such as agriculture and deforestation). People experience the consequences of climate change directly through reduced resources (such as food, fiber, forests, and fisheries) or increased natural hazards (such as droughts, floods, and intense storms). They also experience the consequences indirectly through such mechanisms as higher prices for food or larger insurance premiums. GEOG 438W does not address the physical science of climate change; instead, it concentrates on social science issues surrounding the topic. GEOG 438W has two goals: (1) to develop understanding of a set of issues related to the human dimensions of climate change; (2) to develop and apply communication skills by discussing and writing about the topic. The specific content of the course will change with the instructor, but the focus on the human causes and consequences of climate change and on skill-development in writing will be constant. Students will be evaluated on both the course goals: (1) understanding of the human dimensions of climate change; (2) application of communication skills. Although exact procedures for determining grades will vary with instructor, the basis for grades will always include a combination of written exams based on lectures and readings, regular written assignments with instructor feedback, and in-class discussion and participation.", "prerequisite": "EARTH002 , GEOG 010 or METEO003 ; GEOG 030", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "GEOG 439: Property and the Global Environment", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course reviews theoretical and empirical relationships between multiple legal, economic, and cultural approaches to property, and environmental quality and conflicts.  GEOG 439GEOG 439 Property and the Global Environment (3) Property relations are among the most powerful and pervasive institutions in human societies. Fundamental rules governing and legitimating who can do what, and where, they shape and reveal interactions between human societies and physical environments, a concern at the heart of geography. Our own property relations are often all but invisible to us precisely because they are so deeply woven into our perceptions, consciousness, social structures, and everyday experiences of the world. It is thus easy to overlook the fact that we live within highly specific and contingent property arrangements and that changing circumstances are prompting important changes in contemporary property relations.This course explores these issues with a particular focus on their implications for environmental politics and regulation. We will address questions such as: Is the privatization and commodification of nature a recipe for ecological disaster, or the most effective means of preservation? Can we own the weather? What were the historical-geographical circumstances surrounding the development of major modern property forms, and are those forms adequate to the environmental problems we now confront? Are there property relationships outside of the law? How do property relations and conflicts change in response to changing human control over nature, and how can different kinds of property arrangements lead to, or help to solve, environmental and social problems? Readings will review debates over common property; the benefits and dangers of privatization of environmental goods; distinctions between formal and informal property rights; the development of zoning and other regulation of private property; and contemporary debates over intellectual property rights in nature, and relationships among trade, property rights, and environmental quality.The course will be of interest to students interested in environmental policy, land use planning and management, law, the areas of nature-society relations and historical geography, and environmental history. Students will gain a sophisticated understanding of the central underpinnings of much property and environmental regulation, and familiarity with many cutting-edge debates in these domains, both domestically and internationally. Evaluation methods will include examinations and an independent research paper and presentation by each student. The course will be offered every other year, with enrollment capped at 30 students.", "prerequisite": "6 credits in geography, humanities, or social sciences"}, {"course_name": "GEOG 444: African Resources and Development", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Ecological and cultural factors in the geography of Africa; natural resources and development. GEOG 444 / AFR 444 African Resources and Development (3) (BA) This course meets the Bachelor of Arts degree requirements. This course is designed to analyze the ecological, economic, political and cultural factors, which influence development in sub-Saharan Africa. The traditional system, colonialism, modernization, post-colonial philosophies are four conceptual artifacts used to address some of these issues. Within these broad frameworks, the course focuses on existing debates surrounding key development ideologies and narratives in the region, including, poverty, conservation, population, debt, food security, land reform, foreign intervention and global politics. The topics and texts for the course are chosen carefully to provide general factual material as well as exposure to the major discourses surrounding the region's development. The views of many Americans concerning Africa are often both unitary (Africa is a country) and unidimensional (Africa is a place of conflict, poverty, corruption and crisis). Assuming that a number of students are likely to join the class with this general background, the main objectives of the course will be :  (i) to provide a broad geographic and historical tutorial to dispel myths and stereotypes about the region;  (ii) to explore the literature, which analyzes the historical, geographic and political factors that underlie the region's present status in the global economy; and (iii) to gain insights into the intellectual and ideological dimensions of the \"raging\" debates surrounding issues like environment, conservation, population, corruption, and poverty in the region. By the end of the semester, students should have acquired the skills to accomplish the following goals: *develop a \"mental map\" of the broad physiographic, ecological, economic and political zones (blocs) in the region; *be able to discriminate between stereotype and reality on information pertaining to the region; *be able to interpret and analyze the internal (national, regional) dynamics of the region's development; *be able to interpret and analyze the global factors, which influence the environment, economy, and politics of the region; *develop an informed background on the ideological narratives that guide policy in the region, for example, population, sustainable development, post-colonialism, \"empire\" (whether, American, European, Indian, Chinese, South African?).", "prerequisite": "GEOG 123", "other": ["Cross-listed with: AFR 444", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 445: Geography of Human Rights", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course is designed to explore the problems, promises and paradoxes of international violence and the movement to address violence through human rights initiatives. The first half of this course will investigate violence and the broader movement to establish human rights. We will think about violence in the 20th and first part of the 21st Centuries and the way organized mass violence was either similar or different from previous periods through time and space. We will also think about the definition of human rights, the idea of 'just' war and the way human rights may both sustain and undermine efforts at ending violence. The second half of the course will focus on specific examples of human rights initiatives.  The overarching goal of this course is to educate us about the legacies of violence and the struggle to construct a more just and peaceful society.By the end of the semester, students will be able to:  1. Define and articulate different definitions of violence and to see how the definition of violence is related to efforts at addressing violence.  2. Understand the interlinkages between violence and injustice in one area of the world and its links to violence and injustice in another area of the world.  3. Understand multiple and sometimes conflicting definitions of human rights and efforts to address human rights violations through human rights initiatives.", "prerequisite": "GEOG 220", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "GEOG 453: Geospatial Applications in Water Resources & Aquatic Ecosystems", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course is designed to expose students to different geospatial analysis applications in water resources. It will emphasize geospatial data acquisition of hydrologic features, spatial analysis, and data representation. Students will learn through projects, lectures and hands-on computer lab exercises to investigate and solve water resource issues. Practical applications will focus on watershed and drainage network delineation, assessment of aquatic ecosystems, and surface generation methods using spatial hydrology models. Students who successfully complete GEOG 453 will be able to manage, analyze, and represent geospatial data by using spatial analysis software and have a vision of hydrological applications used in land use planning and watershed management. Specific objectives include:  1. Review of data sources and structure in hydrology: georeferenced coordinate systems, datum and scale, map projections, and data acquisition and representation. 2. Use ditial terrain models to route surface runoff and derive watershed and stream networks.  3. Assess aquatic ecosystems and riparian buffers based on landscape analysis and other sources of hydrologic modeling parameters.  4. Model continuous surfaces from point to raster data structure using interpolation techniques.  5. Practice real-world resource problems in both urban and rural areas by integrating hydrologic calculations and automated geospatial procedures.", "prerequisite": "GEOG 363"}, {"course_name": "GEOG 461W: Dynamic Cartographic Representation", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Theory and practice of mapping and geo-representation in a dynamic media context. Applications in science, policy, travel, and education.  GEOG 461W GEOG 461W Dynamic Cartographic Representation (3)(BA) This course meets the Bachelor of Arts degree requirements. Most maps produced today are electronic, dynamic, and often ephemeral -- with millions of maps generated on the web each day. At the same time, computer graphics technologies developed to enable scientific visualization generally, are being adapted and extended for applications with geographic information. The goal of this course is to provide students with both the conceptual understanding and practical experience needed to design effective dynamic representations and assess their effectiveness. During the term we will explore the potential and implications of recent advances in cartography, exploratory data analysis, and information visualization as they relate to the theory and practice of geographic visualization (geovisualization). A key focus of the course is on 'dynamic' representations of geographically referenced information. Dynamic representations are those that change as a result of user actions or data updates. Topics include: animated and interactive maps, exploratory multivariate spatial data analysis, geovisualization to support knowledge construction, interactive web maps, navigation aids for real and virtual worlds, map-enabled decision-support, collaborative geovisualization, dynamic maps to enable learning, semiotic principles for design of dynamic maps and related geovisualization tools, and perceptual/cognitive issues in dynamic geo-representation (including methods for studying the success of visual displays and interaction devices). As a writing intensive course, particular attention will be given to writing for geographic information science (GIScience). This writing will include laboratory project reports, reviews of published literature, and a term project.", "prerequisite": "GEOG 361", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "GEOG 462: Advanced Observation of Earth and Its Environment", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Recommended Preparations: (GEOG 365 AND GEOG 464 ) OR prior exposure to R programming language  This course will provide the requisite materials to understand and apply techniques of remote sensing to study Earth and its environment using the R programming language. Every day numerous satellites from different countries acquire and transmit multispectral high resolution data of Earth and its environment. Such data are used for a variety of operational and research applications, such as weather forecasting, national security, natural hazards, navigation, land use and land cover, surface temperature, climate change, urban planning and many others. Massive amounts of data are received, processed, stored and distributed by several centers around the world, giving an unprecedented access to global high resolution information. Such information can give new insights to study the complementary nature of different parameters of Earth's environment. The first part of the course discusses the R programming language to analyze data, generate maps and plots and general remote sensing methodologies, products availability and characteristics, data types and formats. The second part of the course discusses remote sensing applications for specific tasks including natural hazards, global change, seasonal and interannual studies. Current research issues will be illustrated, including examples pertaining to the atmosphere, land masses, and oceans, and concluding with a survey of some problems that are at the current frontiers of remote sensing.", "prerequisite": "GEOG 365"}, {"course_name": "GEOG 463: Geospatial Information Management", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course examines geospatial data representations and algorithmic techniques that apply to spatially-organized data in digital form.", "prerequisite": "GEOG 363", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 464: Advanced Spatial Analysis", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Skills and knowledge for applying quantitative methods to analyze information with spatial distributions.  GEOG 464GEOG 464 Analysis and GIS (3)(BA) This course meets the Bachelor of Arts degree requirements. Geography 464 is a course in methods for analyzing spatial data--methods that can and should be used when the geographic arrangement of a set of measured observations is thought to be of significance in explaining the values of those measurements. The methods of spatial analysis looked at in this course can be distinguished from conventional statistical analysis techniques, and also from many of the analysis functions programmed into many GIS packages. In fact several spatial analysis methods considered in this course the result of attempts to alter and extend conventional statistical techniques to take account of locational similarity and distance measurements (which is why Geography 364 or an equivalent primer in introductory statistical methods is a prerequisite). This means that the techniques that will be introduced in the course are often quite complex mathematically or statistically. Having said this, the overall goal of the course is to provide sufficient conceptual understanding and practical experience so that students become competent in selecting and applying methods appropriate to a variety of frequently-encountered analytical situations.", "prerequisite": "GEOG 364", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 465: Advanced Geographic Information Systems Modeling", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Before taking GEOG 465, students will have learned the fundamentals and principles of GIS. This course extends such knowledge to modeling geospatial scenarios. A GIS model simulates real-world phenomena, including environmental, physical and natural features, as well as social features such as demographic, transportation and origin-destination data. We will model raster and vector data types with an emphasis on multi-criteria GIS operations, using ArcGIS, R and potential other software packages. Upon completion of the course, successful students will have achieved the following objectives and learning outcomes: Students will be able to: a) discuss basic GIS modeling principles; b) find, use, store, retrieve and evaluate GIS datasets; c) describe capabilities and limitations of GIS methods and models; e) implement capabilities, tools and packages in ArcMap GIS and R environments; f) use R for programming tasks such as looping and branching; g) evaluate an external software program and create a model using this software; h) exhibit ability to design and carry out spatial analyses using GIS; i) communicate the results of geographic analyses to others, both in oral and in written form; j) analyze spatial data sets in terms of predictability and uncertainty; and k) calibrate models based on real-world datasets.", "prerequisite": "GEOG 363"}, {"course_name": "GEOG 467: Applied Cartographic Design", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Project-based map production problems with emphasis on map design and advanced mapping tools in geographic information systems.  GEOG 467 Applied Cartographic Design (3)(BA) This course meets the Bachelor of Arts degree requirements. The course objective is to immerse the student in applied problems of map production and geographic representation. Topics include advanced software methods for labeling and data editing; advanced symbolization and production of extended map series; conversion between software environments; and representation for multiple media, scales and purposes. The challenge of working with clients for mapping is often included in a project. Evaluation is based primarily on meeting draft deadlines, map project quality, written reports on project decisions, and an exam. The 300-level cartography course is a prerequisite for GEOG 467, and an introductory GIS course also provides useful background skills, though it is not a prerequisite.", "prerequisite": "GEOG 361", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 468: Geographic Information Systems Design and Evaluation", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Design and evaluation of Geographic Information Systems and other forms of integrated spatial data systems.  GEOG 468GEOG 468 Geographic Information Systems Design and Evaluation (3)(BA) This course meets the Bachelor of Arts degree requirements. This course teaches GIS design, project management and communication skills and an appreciation of the ethical, legal and social issues surrounding maps, GIS and geographical data.It also introduces some of the newer information-technology aspects of handling geographic information, such as location-based services and sensor webs, that affect how GIS data are accessed and used.The bulk of practical component of the course is taken up with a large group project (four to six persons per group).The project gives students the opportunity to engage in an exercise that spans the entire range of GIS design and implementation: from problem inception to solution testing.Outcomes revolve around the experienced gained by conducting a GIS project from inception to solution, including specification, design, implementation and evaluation, and specifically: 1. Practical experience with technical writing relating to GIS systems lifecycle, including interviewing, fact finding, description of the contents of the various project deliverables and their importance. 2 An appreciation of legal and ethical issues surrounding GIS, maps and geographic including copyright, responsibility and liability and computing law. 3. An understanding of newer technological innovations that will impact the access and use of geographic information, including: data sharing (interoperability), digital libraries and information portals, web services and grid computing. 4. A portfolio of practical systems development work, that documents all stages in the lifecycle of a GIS project.", "prerequisite": "GEOG 363", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 469: Energy Industry Applications of GIS", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Roles of geographic information systems in energy siting decisions focusing on electric energy transmission networks.  GEOG 469 Energy Industry Applications of GI S (3) Over 2 million miles of oil and gas pipeline and nearly 200,000 miles of electric transmission grid currently traverse the U.S. Geographic information systems (GI S) are used to help maintain these far-flung and extremely expensive energy infrastructures. GI S is also used to help determine optimal routes for pipelines and transmission lines as energy demand and production increase, and as the grid is extended to connect to new energy sources and consumers. GEOG 469 provides students with an in-depth exploration of the complexities of siting decisions. The course introduces a variety of siting challenges that confront the energy industry and its customers and neighbors, but focuses on the siting of electrical transmission lines. The course also provides hands-on experience with a common decision support technology, and considers how the technology may be used to facilitate public participation in siting decisions. Students will undertake a term-length project in which they must propose, research, develop and implement a siting recommendation for an electrical transmission line. They will utilize activities from each lesson to develop primary and alternative routes. Using GI S, students will develop overlays, weights and rankings to determine the most suitable location for a proposed transmission line. Students' final product will be maps showing proposed routes based on the siting criteria and rankings developed to minimize the impacts associated with the various siting criteria used. To help students develop the critical thinking skills needed in the energy industry, students will learn to critique their peers' analyses systematically from the perspective of local stakeholders who are most affected by siting decisions. GEOG 469 is designed to help students achieve two of the programmatic educational objectives established for the Energy and Sustainability Policy degree. It fosters energy industry knowledge by illuminating the difficulties intrinsic to facilities siting decisions. And it nurtures analytical skills by familiarizing students with GI S methodology, and by teaching them how to critique GI S analyses systematically.", "prerequisite": "EGEE 102"}, {"course_name": "GEOG 479: Spatial Data Science for Cyber and Human Social Networks", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "This course examines the nexus of geospatial intelligence analysis with cyberspace, the geopolitics of cyber threats, the politics of censorship and hacking, public safety, disaster response, and humanitarian relief. Students will utilize a range of cyber data, systems, and spatial sciences to examine human social networks of the Internet. The course will be centered on geospatial intelligence with emphases on technology, information theory, and cyber and human networks.", "prerequisite": "GEOG 160"}, {"course_name": "GEOG 480: Exploring Imagery and Elevation Data in GIS Applications", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Using imagery and terrain data in typical application scenarios faced by the geospatial professional.", "prerequisite": "GEOG 482"}, {"course_name": "GEOG 481: Topographic Mapping with Lidar", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Using airborne topographic lidar to create elevation models for GIS applications.", "prerequisite": "GEOG 362", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 482: Making Maps That Matter With GIS", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Despite its widespread use in thousands of organizations worldwide, Geographic Information Systems (GIS) remains for many an obscure set of technologies and professional practices. Even practicing GIS professionals may have limited awareness of the breadth of the field and its impacts in government, industry, and non-governmental and non-profit organizations. The course uses case studies of meaningful applications of GIS to reveal key topics across the spectrum of industry sectors defined by the U.S. Department of Labor in its Geospatial Technology Competency Model (GTCM): Positioning and Data Acquisition, Analysis and Modeling, and Software and Application Development. Topics to be mastered include concepts like positioning frameworks, uncertainty, and geo-enablement, methods and techniques including the GPS positioning, spatial modeling, and geo app development, and relevant ethical, legal, and policy issues such as locational privacy. In addition to topical objectives, the course cultivates competencies associated with lifelong learning, a cornerstone of the GTCM. Students achieve educational objectives by searching, discovering, and evaluating information from a variety of sources, including, but not limited to, the Internet. Those with substantial professional experience are encouraged to share their perspectives. Students develop mastery through class discussions in which they collaboratively prepare to demonstrate individual mastery in tests. They also learn to craft case studies of their own by creating and presenting story-telling web apps using cloud-based GIS technology. They gain self-knowledge by assessing their individual competencies in relation to the GTCM. The awareness, knowledge and technical skills they gain prepare them for success in programs such as Penn State's Postbaccalaureate Certificate Program in Geographic Information Systems (GIS) and Master of GIS graduate degree program, and for professional growth.", "prerequisite": "admission to the Master of GIS program or Certificate Program   in GIS"}, {"course_name": "GEOG 483: Problem-Solving with GIS", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "How geographic information systems facilitate data analysis and communication to address common geographic problems.  GEOG 483", "prerequisite": "GEOG 482", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 484: GIS Database Development", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Database design, creation, maintenance, and data integration using desktop GIS software.  GEOG 484", "prerequisite": "GEOG 483", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 485: GIS Programming and Software Development", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "The course focuses on solving geographic problems by modifying and automating generic Geographic Information System (GIS) software through programming. In GEOG 485, students use the Python programming language to write and modify scripts that add functionality to desktop GIS tools and to automate geospatial analysis processes. No previous programming experience is assumed. Core topics covered in this class include object-oriented programming, component object model technologies, object model diagrams, loops, if-then constructs, and modular code design, and situates these topics in the geospatial workflow through their integration with maps, layers, spatial data tables, and spatial analysis methods. Students who successfully complete the course can automate repetitive GIS tasks, customize GIS interfaces, and share their geospatial software development work with others.", "prerequisite": "Permission of instructor or admission to the program", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 486: Cartography and Visualization", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Theory and practice of cartographic design emphasizing effective visual thinking and visual communication with geographic information systems.  GEOG 486", "prerequisite": "GEOG 484", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 487: Environmental Applications of GIS", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "Real-world applications of GIS and spatial analysis to investigate a variety of current environmental issues.  GEOG 487 Environmental Applications of GIS (3)GEOG 487 is an elective course in the Post baccalaureate Certificate Program in GIS and the Master of Geographic Information Systems (MGIS) degree program, both of which are offered exclusively through Penn State's World Campus. GEOG 487 consists of projects, associated readings, quizzes, and discussions related to environmental applications of GIS. Students are exposed to a variety of concepts, tools, data sources and formats, and environmental issues they are likely to encounter in a career involving GIS and environmental management. Like other courses in the GIS Certificate and MGIS programs GEOG 487 is offered in compressed 10-week terms that require a minimum of 8-12 hours of student activity each week. It is offered quarterly (starting in January, April, July, and October). GEOG 487 does not count toward the requirements of the resident B.A., B.S., M.S. or Ph.D. degrees in Geography, except by explicit permission of the student's graduate advisor and the Department of Geography's graduate officer.", "prerequisite": "GEOG 484", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 489: Advanced Python Programming for GIS", "department": "Geography (GEOG)", "credits": "3 Credits", "description": "In GEOG 489, you will learn advanced applications of Python for developing and customizing GIS software, designing user interfaces, and solving complex geoprocessing tasks using both proprietary and open source platforms. Students will also learn the use of version control software for code management and techniques for distributing geospatial Python applications to end users. The course consists of readings, applied projects, quizzes, and discussions about advanced GIS and spatial data science programming concepts and techniques, and it culminates with a term project. GEOG 489 is intended for students who already possess basic geospatial programming knowledge and skills via professional experience or completing GEOG 485. The technology covered in the course includes: Esri ArcGIS Pro/arcpy, Jupyter Notebook, Esri ArcGIS API for Python, QGIS, and GDAL/OGR.", "prerequisite": "GEOG 485"}, {"course_name": "GEOG 493: Service Learning", "department": "Geography (GEOG)", "credits": "3-12 Credits/Maximum of 12", "description": "Classroom instruction with supervised student activity on a group community service project.  GEOG 493GEOG 493 Service Learning (3-12) GEOG 493, Service Learning, provides students with activities that integrate community service with academic study. The aim of service learning is to enrich traditional classroom-based education by getting students into a community, thereby engendering civic responsibility and simultaneously strengthening communities. GEOG 493 has five objectives: (1) to develop understanding of a set of issues; (2) to learn and apply skills associated with those issues; (3) to learn to interpret science issues for dissemination to the public; (4) to develop and apply communication skills by speaking, writing, and/or desktop publishing; and (5) to reflect on personal and career interests in science, the environment, public policy, or related areas. Thus, students will read, write, and talk about a set of issues of importance to a community and engage in a project in that community.The specific service-learning projects will change each semester, although some projects will be ongoing. In addition, more than one GEOG 493 project will be available to students in most semesters and will have alphabetical designations (e.g., 493A or 493B). Students can take GEOG in more than one semester, to a maximum of 12 credits.Depending on the topic of the service-learning project, GEOG 493 can complement courses in most colleges and their majors. The course is available to all Geography majors as elective credits; it is also available to all Geography Minors for credit toward the minor. It counts for credit as an Advanced Physical/Environmental Geography course in the Physical/Environmental Geography Option, and counts for credit as an Advanced Geography course in the General Geography Option.Students will be evaluated on four of the five course objectives: (1) understanding of the issues, (2) learning and application of skills, (3) interpretation of issues for public dissemination, and (4) application of communication skills. Although exact procedures for determining grades will vary with the instructor and service-learning project, the basis for grades will include a combination of written work, oral presentations, in-class participation, and outside-class participation.", "prerequisite": "sophomore standing; 6 credits of social or environmental science"}, {"course_name": "GEOG 494: Research Project in Geography", "department": "Geography (GEOG)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "prerequisite": "prior approval of program"}, {"course_name": "GEOG 494H: Research Project in Geography", "department": "Geography (GEOG)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "prerequisite": "prior approval of program", "other": ["Honors"]}, {"course_name": "GEOG 495: Internship", "department": "Geography (GEOG)", "credits": "1-13 Credits/Maximum of 13", "description": "Supervised off-campus, non-group instruction including individual field experience, practicums, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 495B: Geography Teaching Internship", "department": "Geography (GEOG)", "credits": "1-10 Credits/Maximum of 10", "description": "GEOG 495B Geography Teaching Internship (1-10)(BA) This course meets the Bachelor of Arts degree requirements. The Teaching Internship provides undergraduate students with formal, supervised teaching experience. Instructors recruit students who excel in a particular course to serve as teaching interns (TIs) in subsequent offerings of the same course. TIs may assist their peers as tutors or as laboratory assistants. They may be assigned to assist faculty members by developing and evaluating new course activities and materials. Although TIs may not evaluate their peers' class work, they can play important roles in the formative course assessment by providing feedback in regular meetings with instructors. In the process of developing the knowledge, skills and dispositions needed to be effective in helping fellow students learn, TIs gain experience that prepares them for leadership roles in their professional careers. TIs also gain respect for the effort and imagination involved in designing and conducting college classes.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 495C: Internship Supervision and Mentoring", "department": "Geography (GEOG)", "credits": "1 Credits", "description": "GEOG 495C Internship Supervision and Mentoring (1)(BA) This course meets the Bachelor of Arts degree requirements. GEOG 495C enables MGIS students who participate at a distance through the University's World Campus to earn credit through contributions to the Department's resident programs. Qualified MGIS students will be encouraged to earn one credit (up to a maximum of three) for every semester that they supervise a resident Penn State Geography student in GIS-related internship conducted in the MGIS student's place of work. Qualifications will be judged by MGIS students' academic advisors. Advisors will help MGIS students recruit qualified internship candidates. Advisors will also evaluate the quality of supervision on the basis of the documentation provided by both the MGIS student and the student intern he or she supervised. MGIS students unable to provide internships may still contribute by serving as mentors to students enrolled in the resident course EM SC 300: Professional e-Portfolio Development, through the University's LionLink program.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 495G: Giscience Internship", "department": "Geography (GEOG)", "credits": "1-10 Credits/Maximum of 10", "description": "GEOG 495GGEOG 495G Giscience Internship (1-10)(BA) This course meets the Bachelor of Arts degree requirements. Prospective interns apply directly to faculty members in charge of the Department of Geography's Geo VISTA Center or Gould Center for Geography Education and Outreach, or to persons in charge of appropriate public or private agency external to the University. Students accepted into the internship program are assigned to research or application projects that involve the development, evaluation and/or use of geographic information technologies under the supervision of an experienced faculty member or professional. Per Faculty Senate rules, interns are expected to devote 40 hours of effort for each credit earned.", "prerequisite": "GEOG 160", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 496: Independent Studies", "department": "Geography (GEOG)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 497: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 18", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 498: Special Topics", "department": "Geography (GEOG)", "credits": "1-9 Credits/Maximum of 18", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 498A: **SPECIAL TOPICS**", "department": "Geography (GEOG)", "credits": "1-3 Credits", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 498B: **SPECIAL TOPICS**", "department": "Geography (GEOG)", "credits": "2-3 Credits", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "GEOG 499: Foreign Studies", "department": "Geography (GEOG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "prior approval of program", "other": ["International Cultures (IL)"]}]