[{"course_name": "GEOSC 1: Physical Geology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Earth processes and their effects on the materials, structure, and morphology of the earth's crust. Practicum includes field work, study of rocks, minerals, dynamic models, and topographic maps.  (This course includes from one to several field trips for which an additional charge will be made to cover transportation.)"}, {"course_name": "GEOSC 2: Historical Geology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "History of the earth and its life; fundamentals of evolution, correlation, and paleogeography; practicum includes field trips, study of geologic maps, geologic problems, and fossils, with emphasis on Appalachian geology. (This course includes from one to several field trips for which an additional charge will be made to cover transportation.)", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "GEOSC 10: Geology of the National Parks", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "\"Geology of the National Parks\" uses the unsurpassed features of national parks to address the key questions of geology and the environment. Each topic is introduced with a virtual field trip to a specially chosen national park (involving pictures of the park, a brief history, other highlights of the park, with supplemental materials and links provided on-line). Key questions about the park (Why has Death Valley been getting wider? Why is much of Mt. St. Helens spread across neighboring states?) then motivate discussion of the topic (here, the spreading or squeezing associated with drifting continents), with special attention to implications for humans (for example, predicting earthquakes and volcanic eruptions associated with these features). A suite of exercises provides the opportunity for analytical experience. There are no prerequisites for the course; however, students must meet the university's technical requirements for running Canvas. This course is offered online during the fall, spring, and summer sessions. The goals of the course are to help students learn how certain common-sense ideas allow science to be such a successful human endeavor, that the Earth efficiently but slowly recycles almost everything, that the Earth's environment has been nearly balanced for very long times, that human-induced changes are among the fastest Earth has ever experienced, and that the National Parks are critical but challenged living laboratories, museums, and repositories of biodiversity. In doing so, the students will see the applications to real-world problems of related fields including physics, chemistry, biology, and mathematics, and will develop a greater appreciation of these other subjects. Students will be challenged to reason from data to generalizations, and from these generalizations back to cases, through exercises, quizzes, and examinations.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOSC 20: Planet Earth", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "GEOSC 20 is a 3-credit, introductory level course about the Earth, and since you live on the Earth, you will be affected by the topic we will cover this semester. We will emphasize earth processes and materials that affect the landscape of Earth. You will be learning about fundamental geologic processes and how they impact humans and the environment on regional and global scales. Some of these processes are slow, such as the movements of continents, and change the Earth over a period of millions of years. Others are rapid, such as earthquakes and floods. You will learn how these processes are related and interact with each other.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "GEOSC 20H: Planet Earth", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Nontechnical presentation of earth processes, materials, and landscape. Practicum includes field trips, study of maps, rocks, and dynamic models, introduction to geologic experimentation.  (This course includes from one to several field trips for which an additional charge will be made to cover transportation.)", "other": ["General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "GEOSC 20L: Planet Earth", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Nontechnical presentation of earth processes, materials, and landscape. Practicum includes field trips, study of maps, rocks, and dynamic models, introduction to geologic experimentation.  (This course includes from one to several field trips for which an additional charge will be made to cover transportation.)", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "GEOSC 21: Earth and Life: Origin and Evolution", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Introduction to the origin and evolution of life on Earth from the perspective of geologic time and the fossil record.  GEOSC 021", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "GEOSC 30: Volcanoes", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Basic concepts in Volcanology and Geosciences are explored through a series of virtual field trips to historic eruptions. Since the dawning of history, humankind has been faced with the destructive power of volcanoes. Volcanic eruptions can wipe out entire populations, destroy food supplies, and alter the Earth's climate for years at a time. At the same time, volcanoes provide fertile soil for growing crops and natural geothermal energy. This course uses virtual field trips to one pre-historic and five historic volcanic eruptions to introduce basic concepts in geosciences and volcanology. Each visits a different type of volcano with unique characteristics and impacts - a shield volcano, a cinder cone, a fissure, a stratovolcano, a lava dome, and a supervolcano. We will examine the tectonic driving forces behind these volcanoes as well as their hazards and environmental impacts. Students will use real data from active volcanic fields, as well as original data collected during home experiments, to calculate physical properties of magmas and to interpret the potential impacts of various volcanic hazards. Sidebars will delve into the less obvious interactions between humans and volcanoes from the perspective of mythology, art, and history. Observations and ideas will be logged in virtual field notebooks.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOSC 40: The Sea Around Us", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Introduction to marine sciences and the world ocean, including physical, chemical, biological, and geological aspects of oceanography. GEOSC 40 The Sea Around Us (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. The Sea Around Us introduces students to the basic workings of the ocean. The course covers the origin of the ocean's rock-walled boundaries, the evolution of its coastlines, the motion of currents, waves and tides and their destructive power, the source and composition of seawater, and the role of the ocean in local and global climate. The majority of the Earth's surface is covered by water and thus it seems likely that the human race will become increasingly dependent on oceanic resources in the future. This course seeks to illuminate how the ocean will respond to increased anthropogenic pressure. Students are shown how such issues can be addressed through detailed understanding of the complex interplay between the physical, chemical and biological properties of the ocean. Lectures focus on fundamental principles of natural sciences as related to the ocean using extensive graphics, video clips and demonstrations.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOSC 40H: The Sea Around Us", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Introduction to marine science, including physical, chemical, biological, and geological aspects of oceanography; the sea as a multipurpose natural resource.", "other": ["General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "GEOSC 97: Special Topics", "department": "Geosciences (GEOSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "GEOSC 107N: Rocks, Minerals, and the History of Art", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "This online course investigates select rocks and minerals used in the production of art between the Prehistoric Era and the Early Modern period. Topics covered include chemical and physical properties, occurrence in nature, the processes by which natural materials are acquired and worked, their symbolic and monetary value, and specific works of art in which they are found. Each material (ochre, garnet, lapis lazuli, rock crystal [quartz], igneous rocks [basalt, diorite and porphyry], alabaster and marble) is addressed in a 2-week unit. The seven units are split equally between scientific analysis of the materials and art historical case studies. A final project integrates Geosciences and Art History topics to investigate the use of a chosen natural material in a specific work of art. Each material addressed in the course plays a crucial role in the history of art, and each one was particularly prized for its physical and material properties (color, hardness, etc.). Ochre was the first known pigment, and was in use by early humans for bodily adornment and for drawing and painting in caves and shelters as early as 100,000 years ago for bodily adornment and 40,0000 years ago in cave art. Its availability worldwide and in multiple strong colors made it a desirable choice. Lapis lazuli, by contrast, was difficult to obtain, and difficult to refine as a pigment. It was first used to make small sculptures and cylinder seals in the Ancient world, and was prized for its brilliant blue color. The difficulty in grinding and purifying blue pigment from lapis lazuli made it one of the most expensive pigments in the Medieval and Renaissance world--it was worth its weight in silver! Pure blue lapis pigment, when found in a painting, is always a sign of great expense and importance. Rock crystal was valued for its clarity and purity, and its extreme brittleness meant that works made from it were valued for their intricacy and fragility. Nero reportedly destroyed two elaborate crystal goblets in a rage, and in so doing, deprived future generations of masterpieces of the sculptor's art. In the Ancient Near East and Ancient Egypt, rock crystal was frequently used for amulets and other magical objects, while in the Medieval world, its purity was seen as a metaphor for the Virgin Mary. Garnet had a similar symbolic value in the Middle Ages: its red color was related to the blood of Christ, and it was thus used frequently in liturgical vessels. In the Ancient world, the rich red tone of garnets was prized in jewelry and in small-scale relief carvings. Igneous stones like porphyry, basalt and diorite were particularly prized for their extreme hardness and permanence, and thus the Law Code of Hammurabi was iinscribed on basalt to ensure its permanence. Other Ancient Near Eastern rulers had images of themselves made from basalt and diorite in order to ensure that those works would survive for centuries. Imperial porphyry, an igneous stone with a rich red-purple color, came from a single remote quarry in the Egyptian mountains. Its use was reserved just for the Imperial family in Rome, and it was used for carved sarcophagi, for columns, for colored veneers on floors and walls, etc., as a sign of Imperial authority. Marble is of course one of the most familiar of all art materials, used frequently for sculpture from the very beginnings of art production. The Greeks and Romans in particular took great pains to obtain different types of marbles with specific colors, veining patterns, etc., for use in both sculpture and architecture. Finally, alabaster is one of the easiest of all stones to work: it is so soft that one can make a mark simply with a fingernail! Its intricate banding and translucency made it a favorite material for thin-walled bowls and vases in the Ancient Near East, Ancient Egypt, and in the Classical world. Later, in Early Christian and Medieval Italy, it was used for windows instead of glass--sun shining through alabaster casts a golden glow into a church interior. By the Late Gothic period, alabaster was being exploited as an easily sculpted material throughout Europe, with major quarries and workshops in England (Nottingham), France, and Northern Spain.", "other": ["Cross-listed with: ARTH 107N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOSC 109H: Earthquakes and Society", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Introduction to earthquakes and seismology, and their relationship to society, including monitoring for nuclear weapons and seismic hazards.  GEOSC 109H", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "GEOSC 110H: The Science of Gemstones", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "From Biblical times to the present, gems and precious metals have served as the standard by which empires have measured their worth. Through the ingenious marketing of an international cartel, diamonds have become identified with the oldest and most sacred of human contracts. To what can we attribute the unique allure of beautiful minerals? In this course, students will learn the underlying science of what distinguishes a gemstone from dross. A broad historical introduction will trace the social role that gemstones have played in human history over tens of thousands of years. After a review of the properties of atoms, they will learn the connections between atomic bonds and the physical hardness that has preserved diamonds and other gems against billions of years of abrasive forces. Students also will engage in directed discussions of ethical issues raised by gem materials: Why are gems so costly? Is it moral to purchase an expensive gemstone? What ethical hazards do synthetic gems pose? In addition, the course will explain the surprisingly simple physical processes that account for the magnificent optical properties of gemstones. Students will understand in a quantitative way how the bending of light (refraction) within a gem produces its sparkle: how variation in refraction generates fire (dispersion); how the interference of light rays from periodic structures in some rare gems like opal can yield colors that change with viewing angle (diffraction); and how vanishingly small traces of impurity atoms can generate the deep coloration of rubies, sapphires, and emeralds. In addition, students will learn about the atomic symmetries that govern the physical character of gemstones and allow modern mineralogists to distinguish imposters from real gems.", "prerequisite": "MATH 26", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOSC 111: Forensic Geoscience", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Covers fundamental geoscience concepts such as stratigraphy, mineral and soil identification, seismology, and geochemistry within the context of forensic investigation.  GEOSC 111 Forensic Geoscience (3) (GN)In this course, we will look at the fundamental principles of geoscience and how they can be applied in the context of criminal or liability investigation. Students will learn how to use a stratigraphic column to determine a sequence of events, either in the geologic record or as physical evidence, for example the layers of mud on the bottom of a car suspected of involvement in criminal activity. We will discuss the many types of physical evidence, focusing in particular on those that involve earth materials (soils, sand, mineral dust) or that can be analyzed using techniques commonly applied to geologic problems (for example, analyzing shards of glass from a hit and run accident using a scanning electron microscope). Basic mineralogy, sedimentology, and petrology will be introduced in the context of trace evidence. Common techniques used by both geoscientists and crime scene investigators, including fluorescence, microscopy, ground-penetrating radar, magnetometry, and seismology will be covered, including hands-on demonstrations when possible. We will learn how isotope geochemistry is used to date natural materials, and how it can be used to determine the geographic origin of rocks, minerals, or sediments. Students will learn how and when it is possible to make a statistically meaningful comparison of naturally variable samples present only in trace amounts. The proper handling of earth materials as trace evidence will be explained. Students will be expected to use the knowledge they have acquired to come up with original solutions to both real and invented crime cases. Finally, students will use the material they have learned in class to write an original mystery story in which geological evidence plays a key role in solving a crime.", "other": ["General Education:  Natural Sciences (GN)"]}, {"course_name": "GEOSC 197: Special Topics", "department": "Geosciences (GEOSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "GEOSC 201: Earth Materials", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "Elements of crystallography and crystal chemistry; origin, occurrence, and identification of sedimentary, igneous, and metamorphic rocks and their minerals. This course has one or more required field trips for which a fee is charged to the student.", "prerequisite": "CHEM 110"}, {"course_name": "GEOSC 202: Chemical Processes in Geology", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "An in-depth examination of the application of chemical principles to geological processes.", "prerequisite": "MATH 140"}, {"course_name": "GEOSC 203: Physical Processes in Geology", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "An in-depth examination of various physical processes that operate within and at the surface of the earth.  GEOSC 203 Physical Processes in Geology applies basic principles from physics and mathematics to explore and understand the Earth and the processes that operate within the Earth and at the Earth's surface. The course includes the study of Earth's gravity and magnetic fields, focusing on how they reveal the internal structures and dynamics related to plate tectonics. The basic physics and mathematics of plate motions are also explored in some detail. We will also examine the elastic properties and behaviors of rocks, which form the basis for understanding seismic waves, rock fracture, and fault slip. The next major topic of the class is the flow of heat through the solid Earth system, involving the study of conduction, convection, and advection. The study of heat will provide the basis for understanding the application of simple differential equations with boundary conditions to geological processes; this will also introduce the mathematics of diffusion, which will permeate much of the course. This study of diffusion will enable us to move from steady state conditions to non-steady state conditions that typify most geological settings. We will examine the fluid dynamics relevant to the flow of the mantle and less viscous fluids at the surface such as lava flows and glaciers. The fluid dynamics will also lead us into an exploration of the basic physics of ocean circulation, stream flow, and erosion on land. Throughout the course, students will learn how to use calculus and very simple computer programming in MATLAB to provide a quantitative framework for understanding the physical processes that shape the Earth. The class involves a weekly lab that involves several field trips to make measurements using a variety of geophysical instruments to solve problems related to gravity, stream flow, and heat flow. Other lab activities involve studies of rock friction and fracture, ocean currents, glacial flow, seismology, and plate motions.", "prerequisite": "PHYS 211"}, {"course_name": "GEOSC 204: Geobiology", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "An introduction to how biological processes and materials are used to solve geological problems.  GEOSC 204", "prerequisite": "BIOL 110"}, {"course_name": "GEOSC 210: Geoscience Data Analytics", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Modern geoscience careers require students to be versatile in managing and analyzing data, solving quantitative problems, comfortable in statistical analysis and projection, and adept in presenting numerical interpretations to stakeholders. The proposed course will provide students with the numerical skills to be successful in their undergraduate careers and in the workplace and will serve as entry for more advanced quantitative courses in Geosciences and the College of Earth and Mineral Sciences. The course has five major objectives: (1) To give students an overview of the different types of geoscience data and the skills to organize, manipulate and structure them appropriately for conducting simple analyses including regression, import/export, conditional subsetting, creating and using database structures and design, queries, and metadata; (2) To train students in the fundamentals of a widely used programming language (e.g., Python, Matlab), including variables, functions, loops, boolean logic, and arrays; (3) To teach students how to use programming skills to conduct a range of basic numerical and statistical analyses; (4) To show students how to integrate and analyze several related datasets in solving complex geoscience problems; and (5) To train students how to summarize and present data in an effective manner, including appropriate data visualizations, and to communicate interpretations to stakeholders. Instruction will consist of demonstrations followed by hands-on activities in which students learn skills on laptops. Assessment will include these activities and follow-on homework problems. In addition, students will conduct a capstone project in the last few weeks of the course in which they integrate several data sets to interpret a complex geoscience problem. The course map is designed to reinforce key concepts and skills through scaffolding: Unit 2 applies the principles of geoscience data and data analysis introduced in Unit 1 in a basic programming environment. Unit 3 reinforces the programming concepts from Unit 2 while developing more advanced data analytics skills. Unit 4 applies and synthesizes the concepts and skills covered in the previous three units in the completion of a capstone project.", "prerequisite": "GEOSC 1", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOSC 212N: Earthquakes and Human History", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "A natural disaster is the result of a natural hazard impinging upon human society. In this course we examine seismicity as a geophysical phenomenon and as a natural hazard that interacts with the built environment and the social structures of human societies. Whenever possible, we approach this subject historically. Among other topics, we examine the history of how earthquakes have been understood as well as the impact of earthquakes and seismicity on the history and development of certain societies. Our specific perspectives include: Earthquakes as understood by modern and contemporary earth science Major conceptions of earthquakes in the past Impacts of seismic hazards on the built environment of past societies Impacts of seismic hazards on politics, economic development and social policies of past societies Seismic hazards, earthquake-related technology, and contemporary societies By examining earthquakes in these ways, the study of earthquakes becomes a vehicle for enhancing skills in analytical reasoning. In particular, this course focusses on applications of modern scientific analysis and the approaches commonly employed in historical investigation. Specific skills addressed in this course include, processing and quantifying information, problem solving using evidence and sound reasoning, and expressing ideas with clarity. Immersion in the study of earthquakes affords an opportunity to think more broadly about how people have dealt with natural disasters in the past and to explore the roles that science, technology, and social policy play in defining and addressing natural hazards in contemporary societies and in the future. Class meetings include lectures, discussions, and in-class activities. We analyze scientific observations that have led to increased understanding of earthquakes, earthquake hazards and risk. We also make extensive use of case studies as concrete examples of different types of earthquakes, the historical evolution of ideas about earthquakes, and the range of social impacts of earthquakes. Reading assignments provide essential background for class sessions.", "other": ["Cross-listed with: HIST 212N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "GEOSC 296: Independent Studies", "department": "Geosciences (GEOSC)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projcts, including research and design, which are suprvised on an individual basis and which fall ouside the scope of formal courses."}, {"course_name": "GEOSC 296H: Independent Studies", "department": "Geosciences (GEOSC)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projcts, including research and design, which are suprvised on an individual basis and which fall ouside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "GEOSC 297: Special Topics", "department": "Geosciences (GEOSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "GEOSC 301: Plate Tectonics", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Plate Tectonics plays a primary role in virtually all geologic/tectonic processes, and is the foundation for most disciplines within geosciences. This course will cover plate tectonic topics in depth and will explore the processes that link plate tectonics to the geologic record. The course has two overarching goals: (1) Develop an improved understanding of the Plate Tectonic framework for use in their other geosciences studies, and (2) exploit its broad application across the geosciences to further develop student skills in scientific reasoning, data analysis, science communication, and integrating knowledge across earth science sub-disciplines. Since the development and acceptance of plate tectonic theory in the earth sciences is relatively recent (since - 1970's), students will also be exposed to how science thinking evolves with the addition of new data and new hypotheses. It will combine lectures, labs, case studies, and discussions to address fundamental questions in plate tectonics.", "prerequisite": "GEOSC 1"}, {"course_name": "GEOSC 302: Global Biogeochemistry", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Biogeochemistry is the exploration of the physical, chemical, and biological processes that govern the exchange of energy and elements between the biosphere and geosphere. This course will examine principal biogeochemical cycles (e.g., C, O, S, N, P,) with a focus on geologic processes and geologic origins. Drawing from the primary literature, we will investigate how biogeochemical cycling has changed over Earth's history and as a result of human activities.", "prerequisite": "CHEM 112"}, {"course_name": "GEOSC 303: Introduction to Environmental Geology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Origin of earth and earth materials; natural resources, geologic barriers and hazards, and relationships to human use of the environment.  (This course includes from one to several field trips for which an additional charge will be made to cover transportation.)"}, {"course_name": "GEOSC 310: Earth History", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "The principles of stratigraphy and paleontology and their use, in combination with plate tectonics, in reconstructing the earth's history. This course has one or more required field trips for which a fee is charged to the student.", "prerequisite": "GEOSC201"}, {"course_name": "GEOSC 310H: Earth History", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "The principles of stratigraphy and paleontology and their use, in combination with plate tectonics, in reconstructing the earth's history.", "other": ["Honors"]}, {"course_name": "GEOSC 320: Geology of Climate Change", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Geologic evidence for climate change and mechanisms of change, especially from the Ice Age through the near future.  GEOSC 320"}, {"course_name": "GEOSC 340: Geomorphology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Physical and chemical processes operating at the earth's surface and their resulting landforms. This course has one or more required field trips for which a fee is charged to the student.", "prerequisite": "GEOSC001 ; fifth-semester standing"}, {"course_name": "GEOSC 397: Special Topics", "department": "Geosciences (GEOSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "GEOSC 402Y: Natural Disasters", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Case studies of the causes and consequences of natural disasters; analysis of disaster impact in different economic, cultural, and social conditions. GEOSC 402 Natural Disasters (3) (IL)(WAC) Is anywhere safe from natural disasters? Can we hide, or should we learn to live with the hazards around us? This course will explore the causes, effects, and societal response to disasters. By learning from previous disasters, we can develop strategies to avert the disasters or at a minimum mitigate their affects. We will look at a variety of natural hazards and related disasters including flooding, volcanoes, landslides, earthquakes, hurricanes, and tsunami. By the sue of case studies of recent occurences of natural disasters, we will determine how damaging disasters can be, and what we can do to minmimize their impact on society. This course will provide an in-depth, hands-on study of natural hazards, their geography, and their impact on societies worldwide. We will focus on both the physical processes (e.g. underlying geoglogy or geophysics) of selected natural hazards and the humn systems that have developed to minimize the impact of natural disasters.The course will place emphasis on active learning exercises to investigate processes and responses to natural hazards. We will meet for two periods each week which will include both lecture and group research activities (approximately 30% of time is in lectures, 70% time is in group research activities). Grading will be based on reports for each topic, a disaster diary, and a term report. The term report is an independent project which focuses on a selected city facing significant natural hazards. Cities will be selected from both the developed and developing world to allow comparsions of the impacts of natural disasters under different socio-economic and cultural conditions.The course is offered once each year with a target enrollment of 25-30 students.Prerequisites for the course are at least 6 credits in science courses (inluding GN courses).", "prerequisite": "fourth-semester standing", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "GEOSC 405: Hydropedology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Soil and water interactions across scales, integrated studies of landscape- soil-water relationships, fundamental processes of water flow and chemical transport.  SOILS (GEOSC) 405 Hydropedology (3)Hydropedology is the study of the fluxes, storages, pathways, residence times, and spatio-temporal organization of water in the root and deep vadose zones, and their relations to climate, ecosystem, land use, and contaminant fate. The aim is to characterize integrated physical, chemical, and biological processes of soil-water interactions across scales (including chemicals and energy transported by water flow). This course embraces interdisciplinary and multiscale studies of interactive pedological and hydrological processes in the earth's surface and subsurface environments. The course will address the fundamental issues and practical applications of hydropedology (as a sister discipline of hydrogeology). This course emphasizesin situsoils that have distinct characteristics of pedogenic features, structures, layers, and soil-landscape relationships in the real world. Students will gain an in-depth understanding of soil and water interactions across scales from point observations to watershed phenomena, and will gain skills in predicting flow pathways and water fluxes in the landscape. This course promotes active learning, critical thinking, and hands-on skills. Course format will consist of two lectures and one laboratory/field exercise each week. The course will utilize a network of local watersheds with different land uses for demonstrations and class projects. Grading will be based on weekly lab/field exercise (20%), class research project (40%), homework (10%), one midterm exams (15%), and one final exam (15%). Since hydropedology is linked to a wide array of environmental, ecological, geological, agricultural, and natural resource issues of societal importance, SOILS (GEOSC) 405 will support interdisciplinary training of students in Soil Science as well as in other disciplines of the College of Agricultural Sciences, especially Agricultural and Biological Engineering, Agronomy, and Forest Resources. Students in the College of Earth and Mineral Sciences, College of Engineering, Eberly College of Science, and the Intercollege Graduate Degree Program in Ecology also will find this course useful when undertaking research on the vadose zone, the hydrologic cycle, and the earth system.", "prerequisite": "SOILS101", "other": ["Cross-listed with: SOILS 405"]}, {"course_name": "GEOSC 409W: Geomicrobiology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Investigation of modern and ancient microbial interactions with soils, sediments, the atmosphere, minerals, rocks, nutrients, and pollutants.", "prerequisite": "CHEM 112", "other": ["Writing Across the Curriculum"]}, {"course_name": "GEOSC 410: Marine Biogeochemistry", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Exploration of the ways in which life influences and is influenced by chemical, physical, and geological processes in the ocean.  GEOSC 410", "prerequisite": "CHEM 112"}, {"course_name": "GEOSC 412: Water Resources Geochemistry", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Aqueous geochemistry of silica, alumina, carbonate minerals, and selected metals; organic species in water; isotope geochemistry applied to water.", "prerequisite": "CHEM 110"}, {"course_name": "GEOSC 413W: Techniques in Environmental Geochemistry", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "This course teaches techniques needed for the collection, chemical analysis, and data analysis of environmental geochemical measurements. This course has one or more required field trips for which a fee is charged to the student.", "prerequisite": "CHEM 402", "other": ["Writing Across the Curriculum"]}, {"course_name": "GEOSC 415: Geochemistry", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Element abundance and genesis, application of chemical principles to earth materials, element fractionation in geologic processes.", "prerequisite": "CHEM 112"}, {"course_name": "GEOSC 416: Stable and Radioactive Isotopes in Geosciences: Introduction", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Discussions on theories for natural isotopic and element variations and their applications to the solution of geologic and cosmologic problems.", "prerequisite": "CHEM 110"}, {"course_name": "GEOSC 418: Soil Environmental Chemistry", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Introduction to chemical constituents and processes occurring in soils. Topics include mineral weathering, soil solution chemistry and adsorption of solutes.  GEOSC 418GEOSC 418 (SOILS 419) Soil Environmental Chemistry (3) Upon completion of the course, the students will be able to identify the soil components and properties responsible for the chemical reactivity of soils and will know the fundamental chemical processes that occur in soils. The students will also be able to link theoretical concepts to real life environmental problems. The students will be evaluated on examinations, homework, and class participation. GEOSC 418 (SOILS 419) is offered every Spring semester. Class limit: 25 students.", "prerequisite": "CHEM 112", "other": ["Cross-listed with: SOILS 419"]}, {"course_name": "GEOSC 419: The Organic Geochemistry of Natural Waters and Sediments", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Composition, sources, and fates of particulate and dissolved organic matter in natural environments; biogeochemical processes; organic geochemistry of anthropogenic contaminants.", "prerequisite": "CHEM 110"}, {"course_name": "GEOSC 420: Paleobotany", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Classification, morphology, phylogeny, and stratigraphic occurrence of fossil plants; practicum includes field trips and study of paleobotanical techniques and specimens.  GEOSC 420 BIOL (GEOSC) 420 Paleobotany (3) Land plants provide the oxygen, food, and forest structure that make our lives on land possible. They are sensitive indicators of global change in the past as well as today. This course will examine the history of green plants on the dynamic Earth from their beginnings in the Proterozoic oceans to today, with emphasis on central topics such as the colonization of land, the histories and relationships of major plant groups, the evolution of seeds and flowers, the evolution of plant-animal interactions, extinction and diversification, paleoclimates, and the origins of modern biomes such as rainforests and grasslands.This course is strongly recommended to graduate students and advanced undergraduates with interests in paleobiology and/or plant biology. Specimen observation and field trips will be important course components. Exams, assignments, and class participation will be the primary bases of evaluation.", "prerequisite": "any 3 credit introductory course in historical geology or plant   biology", "other": ["Cross-listed with: BIOL 420"]}, {"course_name": "GEOSC 422: Vertebrate Paleontology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Course covers scientific thinking and skills in scientific writing, the history of vertebrates, and modern evolutionary theory applied to vertebrates.", "prerequisite": "BIOL 110"}, {"course_name": "GEOSC 424: Paleontology and Fossils", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Concepts and procedures using fossils to solve problems in systematics, evolution, biostratigraphy, correlation, sedimentation, paleoecology, and global change.", "prerequisite": "GEOSC001 or GEOSC020"}, {"course_name": "GEOSC 434: Volcanology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Phenomena and products of volcanic eruptions; physical characteristics of lava and pyroclastic material.", "prerequisite": "GEOSC201"}, {"course_name": "GEOSC 435: GEOSCHOLARSHIP", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "The goal of this class is to learn how to function as a geoscientist engaged in the relentless pursuit of knowledge. This course aims to benefit students in professional development, preparation for advanced courses, and senior thesis research and writing. The most important topic is peer-reviewed scientific literature, the currency of science. Recognizing, accessing, databasing, annotating, writing about, summarizing, critically discussing, and correctly citing peer-reviewed papers are the principal activities. There will be regular assigned activities involving much reading, writing, presenting, and discussion. Other topics will include professionalism, gathering data, how to handle specimens and data, publishing, talking to the media, what graduate programs are looking for and how to approach them, and participation in scientific meetings. There will be a major final paper due during exam week (and no exams). This will be a review article written in the style of a top review journal series such as Annual Reviews. For grading, simply, the strongest possible participation, enthusiasm, completeness, and quality of work is expected at all times, and the professor's perception of this is what the grade will be based on, with a heavy weighting from the term paper. Students will receive comments and other feedback all the way through that will make it clear how they are progressing, and the term paper will receive a formal grade.", "prerequisite": "ENGL 15", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "GEOSC 439: Principles of Stratigraphy", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "An introduction to the description and genesis of sedimentary rock bodies, the determination of their stratal geometries, and their correlation.  (This course includes from one to several field trips for which an additional charge will be made to cover transportation.)", "prerequisite": "GEOSC201"}, {"course_name": "GEOSC 440: Marine Geology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Chemical and physical processes affecting the topography and sediments of the sea floor.", "prerequisite": "fourth-semester standing"}, {"course_name": "GEOSC 444: Matlab Applications for Geoscience", "department": "Geosciences (GEOSC)", "credits": "2 Credits", "description": "An introduction to Matlab: m-file development, descriptive statistics, bootstrapping, Fourier transforms, regression, interpolation, least-squares, differentiation, integration, differential equations, signal analysis, graphics.  GEOSC 444 Matlab Application for Geoscience (2)The goal of this class is that students become familiar with Matlab so that they can conduct scientific research without needing to manipulate spreadsheets or other non-mathematically based software. The course is geared towards, beginning graduate and advanced undergraduate students with little or no previous Matlab experience, and examples are focused on applications in the science and engineering with a focus on the geosciences, including problems from groundwater hydrology, tectonics, geochemistry, rock physics, and climate change. Some basic concepts about vectors and matrices will be helpful, but are not required.", "prerequisite": "MATH 110"}, {"course_name": "GEOSC 450: Risk Analysis in the Earth Sciences", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "An introduction to concepts and methods of quantitative risk anlaysis with focus on water, climate, and energy related risks.  GEOSC 450 Risk Analysis in the Earth Sciences is an introduction to concepts and methods of quantitative risk analysis in the Earth system. Key concepts include probability, impacts, risk, uncertainty, statistical estimation, and decision-making under uncertainty. Important methods to be covered are sensitivity studies, probabilistic prediction, and uncertainty analysis. Examples of risks to be analyzed include: drought, flooding, nuclear waste storage, and anthropogenic climate change. Students will also use simple risk analysis software (provided by the instructor and accessible without prior programming experience) to actively apply these concepts to example problems. The course is designed for advanced undergraduate students with a prior exposure to basic statistics and calculus.", "prerequisite": "MATH 140"}, {"course_name": "GEOSC 451: Natural Resources: Origins, Economics and Environmental Impact", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Geologic, economic and environmental issues related to exploitation of non-renewable natural resources (metals, minerals, rocks, and fossil fuels).  GEOSC 451GEOSC 451 Natural Resources: Origins, Economics and Environmental Impact (3) All the materials needed for health and prosperity in our complex society come from the earth, such as water, iron and other metals to make steel, silica to make glass, limestone to make concrete, potash and phosphate to make fertilizers, and oil, natural gas, coal and uranium to generate heat and electricity. Most of these natural resources are non-renewable, and easily recoverable quantities are limited. The main purpose of this course is to increase understanding and appreciation of geological, economical and environmental aspects of exploitation of mineral and energy resources. Approximately two-thirds of the lectures/discussions will focus on geological, geochemical and biological processes that have governed the concentration and dispersion of economically important elements and natural materials on Earth, including water, heavy metals (aluminum, iron, copper, zinc, lead, etc.), precious metals (gold, silver, platinum, etc.), industrial minerals and rocks (clays, limestone, gypsum, salts, etc.), nuclear-energy sources (uranium and thorium) and fossil fuels (petroleum, natural gas and coal). The remaining one-third of the lectures/discussions will focus on: (i) exploration methods to discover new mineral (and fossil fuel) deposits; (ii) economic aspect of mineral commodities (usages, production statistics, economic of mining and concentration); and (iii) environmental issues related to mining, nuclear waste disposal, and constructions. There will be two half-day field trips to study the nature of sulfide mineralization and acid-water pollution.", "prerequisite": "GEOSC001 or GEOSC020"}, {"course_name": "GEOSC 452: Hydrogeology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Hydrologic cycle: occurrence, movement, quality, and quantity of groundwater; solute transport; quantitative hydrogeologic methods; role of water in geologic processes.  This course has one or more required field trips for which a fee may be charged to the student.  GEOSC 452GEOSC 452 Hydrogeology (3) GEOSC 452 is the study of the relation between geological and hydrological processes in the earth's surface and subsurface environments. The course will address the fundamental issues and practical applications of natural flow systems, emphasizing the occurrence, movement, quality, and quantity of groundwater and its relations to contaminate fate and transport. The primary objective is to provide students with the fundamental knowledge and tools that are necessary to understand the hydrologic cycle. Students will gain an in-depth understanding of fluid flow across scales from point observations to watershed phenomena, and will gain skills in using mathematics to describe water fluxes. The course format consists of two lectures each week, and includes two field trips. Grading is based on weekly homework assignments, exams, and participation on the field trips. Because hydrogeology is linked to a wide array of environmental, ecological, engineering, and natural resource issues of societal importance, GEOSC 452 will support interdisciplinary training of students in the natural sciences and engineering. Students will find this course useful when undertaking research about fluids in geologic processes.", "prerequisite": "CHEM 112"}, {"course_name": "GEOSC 454: Geology of Oil and Gas", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Properties, origin, migration, and occurrence of oil and gas. This course has one or more required field trips for which a fee is charged to the student.", "prerequisite": "GEOSC001"}, {"course_name": "GEOSC 460: Principles of Igneous and Metamorphic Petrology", "department": "Geosciences (GEOSC)", "credits": "3 Credits/Maximum of 3", "description": "Igneous and metamorphic processes drive planetary evolution. This course is designed to provide an understanding of the formative processes of igneous and metamorphic rocks through application of simple physical and chemical processes. Through a combination of petrographical observations and applied thermodynamics, students will learn how to treat rocks as chemical systems and, in doing so, equip themselves with a skillset that is of tremendous utility in industry and academia.", "prerequisite": "GEOSC 201"}, {"course_name": "GEOSC 465: Structural Geology", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "Effects and mechanics of deformation of the earth's crust; practicum includes field trips and studies of maps and structural problems. This course has one or more field trips for which a fee is charged to the student.", "prerequisite": "or concurrent: GEOSC203 , GEOSC310"}, {"course_name": "GEOSC 470W: Introduction to Field Geology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Field interpretation of geologic features; principles and techniques of geologic mapping; interpretation of geologic maps and diagrams. This course has one or more required field trips for which a fee is charged to the student.", "prerequisite": "GEOSC001 ; fifth-semester standing", "other": ["Writing Across the Curriculum"]}, {"course_name": "GEOSC 472A: Field Geology I (Introduction to Field Methods", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Introduction to geologic field methods and the 3-D characterization of earth structure and the reconstruction of geologic histories.  This course includes travel outside the University for which an additional charge will be made to cover transportation, food, and lodging.", "prerequisite": "GEOSC310"}, {"course_name": "GEOSC 472B: Field Geology II (Advanced Field Methods)", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Advanced application of geologic field methods to the 3-D characterization of earth structure and the reconstruction of geologic histories.  This course includes travel outside the University for which an additional charge will be made to cover transportation, food, and lodging.", "prerequisite": "GEOSC310 , GEOSC465 . Prerequisite or concurrent: GEOSC472A"}, {"course_name": "GEOSC 474: Astrobiology", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Astrobiology is the study of life in the universe. Astrobiology has become a major focus of scientific research in the United States and a topic often discussed in popular science literature. The recent interest in astrobiology has resulted in the formation of an Astrobiology Institute at Penn State University. This advanced undergraduate course in astrobiology will cover many topics in the field including, biochemical evolution, the origin and evolution of life on Earth, microbial diversity, protein evolution, and the distribution of life in the universe. This course is intended to provide students of the natural sciences with the opportunity to prepare for a research career in the rapidly expanding field of astrobiology. The course will also present astrobiology as a cross-disciplinary framework that ties together the diverse courses the students have already taken. The students will learn new concepts while having, to draw on their previous knowledge of chemistry, biology, and the geosciences. In summary, this course has the following objectives: (1) to develop the student's literacy in astrobiology so that they can critically evaluate claims that they encounter well after the course has ended; (2) to present a scientific question that requires the sum of the student's previous education to solve; (3) to provide a deep background to some of the astrobiological concepts that are often only briefly mentioned in other classes or in the media; (4) to develop research and communication skills required for a young scientist through a class term paper and short oral presentation; and (5) to prepare the students for graduate research in astrobiology by giving them a broad background of the field and by demonstrating many of the outstanding problems yet to be solved.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: BIOL 474"]}, {"course_name": "GEOSC 479: Advanced Stratigraphy", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Modern topics of sequence stratigraphy are addressed, with a heavy emphasis on field and laboratory data analysis and interpretation.", "prerequisite": "GEOSC439"}, {"course_name": "GEOSC 480: Planetary Geophysics", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "GEOSC 480 is an advanced geophysics course that introduces students to the mathematics and physics behind the processes governing planet formation and planet evolution. Students will learn about planet and star formation, and differentiation of planetesimals into cores and mantles. Students will learn about heat transfer by conduction and convection, and apply this knowledge to learn about the temperature distribution within planets, and how they evolve over time. The course also covers the interior structure of planets, and uses basic physical laws to determine the pressure, density, and gravity profiles through planetary interiors. Students will also learn about gravitational interactions between planetary bodies, including tidal interactions between the Earth and moon. We will then cover geophysical techniques for constraining the interior structure and properties of planets, including moment of inertia, gravity, and lithospheric flexure. Homework problems will be used to hone student's skills, including simple exercises in plotting and modeling with MATLAB. The course will be capped off by a term project, where each student will conduct research on a topic of their choice relevant to planetary interiors and their evolution.", "prerequisite": "MATH 140"}, {"course_name": "GEOSC 481: Petroleum Seismology", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "The proposed course will be specially designed for undergraduate students (junior or senior) who are eager to pursuing a career in petroleum energy industry or pursuing a grad school in exploration seismology as well as new graduate students who did not have a petroleum seismology class in their previous studies. This course provides an overview of the physical principles of petroleum seismology with emphasis on exploring and characterizing petroleum reservoirs using seismic methods. The content will include the physical basis of the seismic methods, including wave properties, wave propagation in the Earth, seismic reflections & refractions, data processing, seismic migration, seismic interpretation and well logs, and borehole seismology. Hands-on experience working with field data examples will be provided through computer lab exercises throughout the semester.", "prerequisite": "GEOSC 203"}, {"course_name": "GEOSC 482: Satellite Remote-Sensing For Earth Observation", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "Comprehensive introduction to theory and methods in remote-sensing, covering optical, thermal and radar methods and their application in geosciences."}, {"course_name": "GEOSC 483: Environmental Geophysics", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "This course presents the principles and applications of the variety of techniques geophysicists use to address environmental problems.", "prerequisite": "PHYS 211"}, {"course_name": "GEOSC 487: Analysis of Time Series", "department": "Geosciences (GEOSC)", "credits": "3 Credits", "description": "Nonstatistical approach to data analysis; spectral and correlation analysis; filter theory; signal-to-noise improvement applied to geoscience data.", "prerequisite": "MATH 140"}, {"course_name": "GEOSC 488: An Introduction to Seismology", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "An overview of the observations, methods, and frameworks used in seismogram analysis for earthquake and earth-structure investigations (includes laboratory).  GEOSC 488", "prerequisite": "MATH 140"}, {"course_name": "GEOSC 488H: An Introduction to Seismology", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "An overview of the observations, methods, and frameworks used in seismogram analysis for earthquake and earth-structure investigations (includes laboratory).", "other": ["Honors"]}, {"course_name": "GEOSC 489: Dynamics of the Earth", "department": "Geosciences (GEOSC)", "credits": "4 Credits", "description": "Constitution and dynamics of the solid earth; mechanics and consequences of Plate Tectonic processes.", "prerequisite": "PHYS 211"}, {"course_name": "GEOSC 494M: Thesis Research", "department": "Geosciences (GEOSC)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised student activities on research projects identified on an individual, or small group basis.                                                         ,", "prerequisite": "seventh-semester standing", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "GEOSC 494W: Senior Thesis", "department": "Geosciences (GEOSC)", "credits": "1-4 Credits/Maximum of 4", "description": "Supervised student activities on research projects identified on an individual, or small group basis.                                                         ,", "prerequisite": "seventh-semester standing", "other": ["Writing Across the Curriculum"]}, {"course_name": "GEOSC 495: Internship", "department": "Geosciences (GEOSC)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "GEOSC 496: Independent Studies", "department": "Geosciences (GEOSC)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "GEOSC 496H: Independent Studies", "department": "Geosciences (GEOSC)", "credits": "1-18 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "GEOSC 497: Special Topics", "department": "Geosciences (GEOSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "GEOSC 499: Foreign Studies", "department": "Geosciences (GEOSC)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]