[{"course_name": "HCDD 99: Foreign Studies", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "HCDD 113: Foundations of Human-Centered Design and Development", "department": "Human-Centered Design and Development (HCDD)", "credits": "3 Credits", "description": "HCDD 113 provides a rigorous introduction to the theories, models, and tools that inform Human-Centered Design and Development. It lays the groundwork for subsequent courses in the sequence by examining the relationship between physical capabilities, cognitive and social models, and philosophical issues pertinent to human-centered analysis, design and development work. The course is practice-based, which means that it instructs more abstract concepts through practical activities and practice-based inquiry. Students will learn how to apply cognitive models and philosophical concepts to real-world problems. This approach has the dual benefit of (1) highly engaging pedagogy and (2) the production of portfolio-quality deliverables that students will be able to use to secure internships and entry-level positions in industry. Students will gain skills for synthesizing and communicating design implications as well as presenting work in multiple contexts (e.g. live presentations vs. bite-sized portfolio pages). The format of the class will balance project work with tests, quizzes, short essays, and discussions on key topics. It will also include readings and some short lectures."}, {"course_name": "HCDD 113S: Foundations of Human-Centered Design and Development FYS", "department": "Human-Centered Design and Development (HCDD)", "credits": "3 Credits", "description": "HCDD 113S provides a rigorous introduction to the theories, models, and tools that inform Human-Centered Design and Development. It lays the groundwork for subsequent courses in the sequence by examining the relationship between physical capabilities, cognitive and social models, and philosophical issues pertinent to human-centered analysis, design and development work. The course is practice-based, which means that it instructs more abstract concepts through practical activities and practice-based inquiry. Students will learn how to apply cognitive models and philosophical concepts to real-world problems. This approach has the dual benefit of (1) highly engaging pedagogy and (2) the production of portfolio-quality deliverables that students will be able to use to secure internships and entry-level positions in industry. Students will gain skills for synthesizing and communicating design implications as well as presenting work in multiple contexts (e.g. live presentations vs. bite-sized portfolio pages). The format of the class will balance project work with tests, quizzes, short essays, and discussions on key topics. It will also include readings and some short lectures.", "other": ["First-Year Seminar"]}, {"course_name": "HCDD 199: Foreign Studies", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "HCDD 264: Design Practice in Human-Centered Design and Development", "department": "Human-Centered Design and Development (HCDD)", "credits": "3 Credits", "description": "This course focuses on concepts, methods, techniques, and tools for designing effective technology-enabled experiences. The course will provide students with all the elements for a toolbox they can use to design and create both prototypes and working applications, and some analytic methods they can use to perform basic evaluations. The course will emphasize iterative design and the benefits of employing a cycle of analyze - design - built - evaluate in close cooperation with prospective technology users and other product stakeholders. In addition to more practice-oriented skills and knowledge, the course will provide students with an appreciation for some persistent design challenges including managing design trade-offs, ensuring universal and international access, working with others on co-design, and receiving and delivering design critiques. Students who successfully complete the course will leave equipped to engage with practicing design teams in industry, government, and academia.", "prerequisite": "HCDD 113"}, {"course_name": "HCDD 294: Research Project", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "HCDD 296: Independent Studies", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "HCDD 297: Special Topics", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses offered infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HCDD 299: Foreign Studies", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "HCDD 340: Human-Centered Design for Mobile Computing", "department": "Human-Centered Design and Development (HCDD)", "credits": "3 Credits", "description": "The course will provide students with an appreciation for the importance of mobile computing in modern life. It will also provide an introduction to the technical aspects of mobile computing including input modalities, sensors and sensing, wearable and smart home devices, and virtual/augmented reality. It will provide an introduction to established design concepts as well as explore emerging ideas and new concepts in the domains of mobile computing, and explore some of the most important domains where mobile computing is having a significant impact including health and wellness and computing in the developing world. The latter part of the course will include an analysis, design, and development project for students to work on individually or in groups.", "prerequisite": "HCDD 264"}, {"course_name": "HCDD 364W: Methods for Studying Users", "department": "Human-Centered Design and Development (HCDD)", "credits": "3 Credits", "description": "This course focuses on concepts, methods, and techniques for studying users and evaluating technology in the context of use. It will provide students with methods and tools they can use to incorporate knowledge of users and their settings into the design and evaluation of interactive systems. These methods will include both qualitative and quantitative techniques, as well as how to combine and sequence multiple techniques to gain a more holistic understanding. Students will learn to select and use appropriate data gathering and analysis methods and how to assemble these into a coherent user research design. The course also provides an overview of the most important statistical analysis methods employed in user research. This is a hands-on, practical course designed for HCDD undergraduate students, and others as an elective.", "prerequisite": "HCDD 264", "other": ["Writing Across the Curriculum"]}, {"course_name": "HCDD 399: Foreign Studies", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "HCDD 440: Human-Centered Design and Development Capstone Course", "department": "Human-Centered Design and Development (HCDD)", "credits": "3 Credits", "description": "The Human-Centered Design and Development Capstone course develops the research orientation and creative problem solving necessary for successful careers. The capstone develops these skills in the context of a semester long project, the solution to which requires integration of knowledge, skills and analytic techniques taught in the core curriculum. The capstone will also give student a real world experience in which they will need to work in teams and will be coached on ways to translate analytic outcomes into meaningful and actionable information for decision makers. The course is intended for seniors who have successfully completed the core courses. The capstone projects will integrate knowledge gained in technical subjects such as usability engineering, software construction and engineering, and mobile computing as well as general information technology topics such as machine learning, data mining, data integration and visualization, and privacy and security. Students will also hone their presentation and technical writing skills, generating effective reports that not only explain their analytic processes, assumptions underlying the processes and outcomes, but also communicate the limitations of their approach and potential alternate strategies.", "prerequisite": "HCDD 364W"}, {"course_name": "HCDD 494: Research Project", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "HCDD 496: Independent Studies", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "HCDD 497: Special Topics", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses offered infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HCDD 499: Foreign Studies", "department": "Human-Centered Design and Development (HCDD)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]