[{"course_name": "HEBR 1: Basic Modern Hebrew I", "department": "Hebrew (HEBR)", "credits": "4 Credits", "description": "An introduction to modern Hebrew in its written and spoken forms; oral and aural work stressed.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "HEBR 2: Basic Modern Hebrew II", "department": "Hebrew (HEBR)", "credits": "4 Credits", "description": "Continued study of grammar; emphasis on improving oral-aural facility, with increased attention to reading and writing.", "prerequisite": "HEBR 001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "HEBR 3: Intermediate Modern Hebrew", "department": "Hebrew (HEBR)", "credits": "4 Credits", "description": "Grammar, reading, composition, and oral and aural exercises.", "prerequisite": "HEBR 002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "HEBR 10: Jewish Civilization", "department": "Hebrew (HEBR)", "credits": "3 Credits", "description": "This course explores the life of the Jewish people from Biblical times on, emphasizing cultural, religious, and institutional developments. HEBR 10 / HST 10 Jewish Civilization (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. Jewish tradition goes back thousands of years, and Jews have resided in many different lands. They have become an integral part of many different cultures, yet have often retained (or been forced to retain) a certain degree of separateness or difference. In this course we will trace continuity and change in Jewish traditions from ancient to modern times, and across different regions. Taking into account inter-cultural contact and historical events -- ranging in place from the Middle East to Muslim Spain to Asia, Africa, Europe, and the Americas, and in time from the ancient world to the medieval era, the Holocaust, and contemporary Israel and the U.S. -- we will explore developments in Jewish history, literature, and culture. The course considers topics such as the attitudes other groups have had toward Jews (and vice-versa), the question of whether Jewish identity is a race, a religion, or an ethnicity, the dilemmas Jews face today, and the ways that Jews in many diverse settings have balanced change and continuity. We will explore the factors that shape Jewish experience in different times and places, the diversities within and among Jewish lifestyles, and the ways in which events and interactions with other peoples have influenced the development of Jewish civilization. Finally, we will consider the dilemmas Jews face today in terms of the preservation of their identity and traditions. The course includes class discussion. Students are evaluated on the basis of, essay exams, quizzes, in-class discussion and commentaries, and group projects.", "other": ["Cross-listed with: JST 10", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "HEBR 97: Special Topics", "department": "Hebrew (HEBR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be taught in one year or semester.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 99: Foreign Studies", "department": "Hebrew (HEBR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "HEBR 151: Introductory Biblical Hebrew", "department": "Hebrew (HEBR)", "credits": "3 Credits", "description": "Fundamentals of Biblical Hebrew grammar, syntax, and vocabulary.  J ST (CAMS/HEBR) 151 Introductory Biblical Hebrew (3) The aim of CAMS/J ST/HEBR 151 is to introduce students to the fundamentals of Biblical Hebrew as quickly and thoroughly as possible. Biblical Hebrew is the language in which the Old Testament was written, between the period of approximately 1200-200 B.C.E. This focuses primarily on the morphology and syntax of Biblical Hebrew. Drills on each point of grammar, as well as translation of sentences from Hebrew to English and English to Hebrew, and brief passages taken from the Bible are the basis of the student's homework throughout the semester. By the end of the semester, the students will be prepared to read short, unmodified passages of the Bible. The course will focus primarily on reading and writing, though students will read aloud in class regularly in order to ensure correct pronunciation and understanding. CAMS/J ST/HEBR 151 will prepare students to continue with CAMS/J ST/HEBR 152 and then 400-level courses.The course goals, in addition to providing the students with a firm grounding in Hebrew grammar and vocabulary, include giving the students a basic understanding of the history of the Biblical text. The primary focus will be on mastering paradigms and syntax, but the students will also be introduced to the Biblical texts themselves, which together from such an important piece of literature.", "other": ["Cross-listed with: CAMS 151, JST 151"]}, {"course_name": "HEBR 152: Intermediate Biblical Hebrew", "department": "Hebrew (HEBR)", "credits": "3 Credits", "description": "Intermediate study of Biblical Hebrew grammar, syntax, and vocabulary. CAMS (JST/HEBR) 152 Intermediate Biblical Hebrew (3)(BA) This course meets the Bachelor of Arts degree requirements. CAMS/JST/HEBR 152 continues from CAMS/J ST/HEBR 151, which is a prerequisite for enrollment. After a brief review of key grammar and morphology from the first semester, the course will complete the process of providing students with a sufficient grasp of Hebrew vocabulary, morphology, and syntax to enable them to read unadapted passages from Biblical Hebrew texts (with the aid of a lexicon) by the end of the course. Class sessions will focus on grammar drills, sentences, and similar exercises as homework to supplement class work. As the semester progresses, students will read more and more from actual Hebrew texts, rather than composed sentences by the textbook author, so that when the students enter more advanced classes, they will find the transition to reading Hebrew as smooth as possible.In tandem with the increasing emphasis on Hebrew written by ancient Hebrews, the course will continue to focus on the linguistic and cultural background for the texts that the students read. Students will be evaluated on a combination of written work, including frequent quizzes, tests, homework completion, and course attendance and participation. CAMS/J ST/HEBR 152 will prepare students to continue with courses at the 400-level.", "other": ["Cross-listed with: CAMS 152, JST 152", "Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 197: Special Topics", "department": "Hebrew (HEBR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be taught in one year or semester.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 199: Foreign Study--Basic Hebrew", "department": "Hebrew (HEBR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "HEBR 295: Internship", "department": "Hebrew (HEBR)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practicums, or internships.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "HEBR 296: Independent Studies", "department": "Hebrew (HEBR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 297: Special Topics", "department": "Hebrew (HEBR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be taught in one year or semester.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 299: Foreign Studies", "department": "Hebrew (HEBR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "HEBR 397: Special Topics", "department": "Hebrew (HEBR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be taught in one year or semester.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 399: Foreign Study--Intermediate Hebrew", "department": "Hebrew (HEBR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "HEBR 401: Advanced Hebrew--Conversation Emphasis", "department": "Hebrew (HEBR)", "credits": "3-6 Credits/Maximum of 6", "description": "Development of oral proficiency through discussions focusing on issues in contemporary Jewish culture.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 402: Advanced Hebrew--Reading Emphasis", "department": "Hebrew (HEBR)", "credits": "3-6 Credits/Maximum of 6", "description": "Readings in representative works of traditional and modern literature; practice in composition; study of aspects of Jewish culture.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 451: Advanced Biblical Hebrew", "department": "Hebrew (HEBR)", "credits": "3 Credits", "description": "Translation and analysis of selected readings in Biblical Hebrew texts; attention will be paid to grammatical as well as literary details.  HEBR 451 Advanced Biblical Hebrew (3) HEBR 451 is a Biblical Hebrew literature course in which students will read selections of various genres and dates from different sections of the Hebrew Bible. The overall goal of this course is to increase the ease and fluency of advanced-level students with Biblical Hebrew. Although students will be expected to enter the class with a comfortable level of reading skill as acquired in HEBR 152 or its equivalent, the course will include grammar and building vocabulary. By the end of the course, it is expected that the students will be able to read a Biblical Hebrew text comfortable and be able to analyze grammatical structures. Students' work in the course will be evaluated on class participation (20%), several in class quizzes (20%), and a mid-term (30%) and final exam (30%). HEBR 451 is part of a series of advanced Hebrew classes that will allow students to gain skill and knowledge about a range of Biblical Hebrew texts. HEBR 451 may be used to fulfill a requirement for the Hebrew minor, as well as for the CAMS major language requirement. The course will be offered every other year, with 20 seats per offering.", "prerequisite": "HEBR 152"}, {"course_name": "HEBR 452: Readings in Biblical Hebrew", "department": "Hebrew (HEBR)", "credits": "3 Credits", "description": "Translation and analysis of selected readings in Biblical Hebrew texts; attention will be paid to grammatical as well as literary details.  HEBR 452 Readings in Biblical Hebrew (3) HEBR 452 is a Biblical Hebrew literature course which students will read selections of various genres and dates from different sections of the Hebrew Bible. The overall goal of this course is to increase the ease and fluency of with which advanced students are able to read all types of Biblical texts. Although students will be expected to enter the class with a comfortable level of reading skill as acquired in HEBR 451 or its equivalent, the course will continue to emphasize grammar and building vocabulary. By the end of the course, it is expected that the students will be able to read any Biblical Hebrew text comfortably and be able to analyze grammatical structures. Students' work in the course will be evaluated on class participation (20%), short in class quizzes (20%), and a mid-term (30%) and final exam (30%). HEBR 452 is part of a series of advanced Hebrew classes that will allow students to gain skill and knowledge about a range of Biblical Hebrew texts. HEBR 451 may be used to fulfill a requirement for the Hebrew minor, as well as for the CAMS major language requirement. The course will be offered every other year, with 20 seats per offering.", "prerequisite": "HEBR 451"}, {"course_name": "HEBR 494: Research Project", "department": "Hebrew (HEBR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 494H: Research Project", "department": "Hebrew (HEBR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"course_name": "HEBR 496: Independent Studies", "department": "Hebrew (HEBR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects including research and design which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 497: Special Topics", "department": "Hebrew (HEBR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be taught in one year or semester.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "HEBR 499: Foreign Study--Advanced Hebrew", "department": "Hebrew (HEBR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]