[{"course_name": "HHD 100H: Honors Seminar on Longevity, Health, and Human Development", "department": "Health and Human Development (HHD)", "credits": "1 Credits", "description": "This course aims to provide students with an overview of the impact the growth in human longevity is having on society, viewed through the lens of current research in the fields of health and human development. Students will explore the recent research on growth in the human lifespan and how this is having impacts on individuals, families, employers, governments, and communities. Through readings and discussions with faculty working on research related to aging and longevity, students can see how these issues connect with physical activity, nutrition, communication, health behaviors, health policy, cognition and the effects longer life is having on restaurants, hotels, parks, tourism, health care facilities, schools, and other service industry employers.", "other": ["Honors"]}, {"course_name": "HHD 197: Special Topics", "department": "Health and Human Development (HHD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "HHD 200N: Addiction Science to Society", "department": "Health and Human Development (HHD)", "credits": "3 Credits", "description": "Addiction is commonly defined as set of compulsive behaviors that cannot be stopped despite negative consequences. The term itself is controversial and defined differently by various disciplines. This has resulted in skewed perceptions of addiction by society as a whole. This course aims to inform students on the biological, psychological, and sociological viewpoints of addiction and how they interact to form an integrated perspective (the biopsychosocial model). By understanding the current knowledge on the biological and psychological bases of addiction, students will be better prepared to make knowledgeable decisions on their own behaviors, understand the behavior of others, and generate informed opinions on the social aspects of addiction. We will begin by comparing and contrasting the different ways addiction has been defined in various fields and exploring the debate on which substances/behaviors are actually considered addictive. Throughout the course, students will broadly explore basic concepts in biology (cells, neural communication, brain anatomy, use of animal models, pharmacology, genetics, epigenetics, and comorbidity), psychology (memory, conditioning, reward, expectancy, bias, and mental health) and sociology (family systems theory, stress theory, developmental theory, feminist theory). These concepts will be practically applied to various questions concerning 1. The status of addiction as a disease. 2. How addiction is or should be treated. 3. The effects of addiction on family and society. 4. Policies concerning the criminalization of drugs and compulsive behaviors. In addition, methods and data from primary research in all three domains of the biopsychosocial model will be analyzed. Several assignments using various forms of communication will serve to illustrate the connections and asses integrated learning.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HHD 245N: Health, humanity, and longevity: Conversations with elders", "department": "Health and Human Development (HHD)", "credits": "3 Credits", "description": "How can a person grow to become more truly themselves? How do our habits inform our future? This course examines current research on happiness, aging, and well-being alongside the lived experience of older adults. Together students and older adult community members discuss research as well as compare perceptions and perspectives of the aging experience. We will use humanities orientation to explore what it means to grow as a human being, how to become the person we would like to be, and how to help others do the same. Students will partner with older adults for conversations and a collaborative project.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HHD 294: Research in HHD", "department": "Health and Human Development (HHD)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis"}, {"course_name": "HHD 295: Internship in Health and Human Development", "department": "Health and Human Development (HHD)", "credits": "1-18 Credits", "description": "Supervised internship, field experience, or practicum related to student career objectives."}, {"course_name": "HHD 296: Independent Studies", "department": "Health and Human Development (HHD)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "HHD 297: Special Topics", "department": "Health and Human Development (HHD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "HHD 397: Special Topics", "department": "Health and Human Development (HHD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "HHD 401: Women's Leadership Initiative: Leadership Concepts and Competencies I", "department": "Health and Human Development (HHD)", "credits": "2 Credits", "description": "HHD 401 is the first semester of the year-long program for students selected to participate in the Women's Leadership Initiative (WLI). The course designed to work in concert with WLI activities to support students in their development of the foundational values, knowledge, skills, and confidence to realize their potential as effective, life-long leaders. Through their participation in this course and the spring semester course, students will develop a deeper knowledge of themselves and others, be able to define and critically assess leadership concepts, develop leadership skills, and practice leadership skills in various settings. Students will accomplish these objectives through the completion of assessment tools, discussions with leaders from the campus and the community, mentoring by women leaders, and the delivery of course topics pertaining to leadership. Students will be evaluated through communication skills assignments, reflection assignments, class participation, and completion of assessment tools. Students must apply and be selected to participate in the Women's Leadership Initiative in order to take this course."}, {"course_name": "HHD 402: Women's Leadership Initiative: Leadership Concepts and Competencies II", "department": "Health and Human Development (HHD)", "credits": "2 Credits", "description": "HHD 402 is the second semester of the year-long program for students selected to participate in the Women's Leadership Initiative (WLI). The course designed to work in concert with WLI activities to support students in their development of the foundational values, knowledge, skills, and confidence to realize their potential as effective, life-long leaders. Through their participation in this course and the spring semester course, students will develop a deeper knowledge of themselves and others, be able to define and critically assess leadership concepts and incorporate these into a personal leadership philosophy, develop leadership skills, and practice leadership skills in various settings. Students will accomplish these objectives through the completion of assessment tools, discussions with leaders from the campus and the community, mentoring by women leaders, and the delivery of course topics pertaining to leadership. Students must apply and be selected to participate in the Women's Leadership Initiative in order to take this course.", "prerequisite": "HHD 401"}, {"course_name": "HHD 494: Research Project", "department": "Health and Human Development (HHD)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects on an individual or small-group basis."}, {"course_name": "HHD 495: Internship in Health and Human Development", "department": "Health and Human Development (HHD)", "credits": "1-18 Credits", "description": "Approved experiential learning related to student career objectives"}, {"course_name": "HHD 496: Independent Studies", "department": "Health and Human Development (HHD)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "HHD 497: Special Topics", "department": "Health and Human Development (HHD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "HHD 497I: Intergenerational Communication", "department": "Health and Human Development (HHD)", "credits": "3 Credits", "description": "How can a person grow to become more truly themselves? How do our habits inform our future? This course examines current research on happiness, aging, and well-being alongside the lived experience of older adults. Together students and older adult community members will discuss research as well as compare perceptions and perspectives of the aging experience. We will use an aging lens to explore what it means to grow as a human being, how to become the person we would like to be, and how to help others do the same. Students will partner with older adults for engagement experiences and a collaborative project.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain"]}, {"course_name": "HHD 499: Foreign Studies", "department": "Health and Human Development (HHD)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "HHD 499H: Foreign Studies", "department": "Health and Human Development (HHD)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)", "Honors"]}]