[{"course_name": "HLS 201: Introduction to Homeland Security", "department": "Homeland Security (HLS)", "credits": "3 Credits", "description": "An introduction to homeland security, and defense, with a focus on policy, legal issues, organization, and administration.  PUBPL 201 Introduction to Homeland Security (3) Introduction to Homeland Security provides a baseline of common knowledge for understanding the nature of homeland security. The course achieves this goal by focusing on homeland security, the motivation and nature of terrorists, the policies established by governments, pertinent governmental plans to meet homeland security goals, who the key players are in homeland security, and the relevant legal issues framing efforts to defend the nation's security. As an introduction to the broad area of study, this course serves as a basis for specialized study such as critical infrastructure protection, emergency response management (including natural disasters), border security, security administration, national security, and terrorism. Understanding key principles of homeland security will be expected from students who complete this course.", "other": ["Cross-listed with: PUBPL 201"]}, {"course_name": "HLS 306: Introduction to Crisis and Emergency Management", "department": "Homeland Security (HLS)", "credits": "3 Credits", "description": "An introduction to emergency management in mitigating, preparing for, responding to and recovering from hazards.  PUBPL 306 Introduction to Crisis and Emergency Management (3) The course offers an overview of the field of emergency management in dealing with routine emergencies, crises or disasters, and mega disasters. Specific topics emphasized include: the roles and interactions of the public, nonprofit, and private sectors in emergency management; the legal and organizational structure of the national emergency management system; and the problems and policy issues associated with emergency management. This is done by examining the four phases of emergency management: mitigation, preparedness, response and recovery as they relate to resilience, the attempt to; and an overview, including case studies, of various human-made and, technological disasters as well as disasters related to natural hazards. Emergency management as conducted within the U.S. integrated emergency management system (IEMS) by local state and national emergency management agencies, not terrorist incidents, is the course focus rather than the emerging field of homeland security and terrorist events.", "other": ["Cross-listed with: PUBPL 306"]}, {"course_name": "HLS 401: Introduction to Homeland Security", "department": "Homeland Security (HLS)", "credits": "3 Credits", "description": "This course provides foundational knowledge about homeland security, including policy, organization, and legal issues in the American context.  P ADM 401 Introduction to Homeland Security (3)The Introduction to Homeland Security/Defense course provides a baseline of common knowledge for homeland security professionals. The course achieves this goal by focusing on homeland security/defense, the motivation and nature of terrorists, the policies established by governments, pertinent governmental plans to meet homeland security/defense goals, who the key players are across the homeland security/defense spectrum, and the relevant legal issues framing efforts to defend the nation's security. As an introduction to this broad area of study, this course serves as a basis for specialized study such as bioterrorism defense, critical infrastructure protection, cyber-security, and emergency response management. Understanding key principles will be measured through preparation of a written analysis of key homeland security/defense issues with alternative strategies consistent with current policy and legal constraints."}, {"course_name": "HLS 404: Homeland Security and Defense in Practice", "department": "Homeland Security (HLS)", "credits": "3 Credits", "description": "This course analyzes and evaluates current Homeland Security legislation, and presidential policy directives, executive orders, and strategies, as well as the constraints hindering the implementation of federal and state initiatives. There will be emphasis on creating Information Papers, Meeting Presentations, Executive Summaries, and Talking Points for elected or appointed officials and security professionals to use throughout the Homeland Security Enterprise. This course has a major goal: to educate graduate-level, Homeland Security professionals capable of demonstrating and articulating the many U.S. approaches to Homeland Security, across the entire spectrum of activities - from Prevention to Recovery - from the federal strategic level to the state and regional operational levels, and to the county and municipality tactical levels of government."}, {"course_name": "HLS 475: Critical Infrastructure Protection", "department": "Homeland Security (HLS)", "credits": "3 Credits", "description": "This course provides knowledge about protection of critical infrastructure as an aspect of homeland security.  PUBPL 475 Critical Infrastructure Protection (3) Critical Infrastructure Protection provides a definition of critical infrastructure and examines the importance of protecting it in the post-9/11 era. The course focuses on policies and programs designed to prevent catastrophic events and to protect and maintain the nation's critical infrastructure. It examines such activity through an understanding of the network of organizations at all levels of government and in the private sector responsible for protecting infrastructure. Case examples are provided of catastrophic events to provide an understanding of risks involved in infrastructure protection. Understanding key principles will be measured through preparation of a written analysis of a key homeland security/defense issue with alternative strategies consistent with current policy and legal constraints.", "prerequisite": "HLS 404"}, {"course_name": "HLS 476: Homeland Security Intelligence", "department": "Homeland Security (HLS)", "credits": "3 Credits/Maximum of 3", "description": "The Homeland Security Intelligence course provides a depth of knowledge of key intelligence issues for homeland security professionals.", "prerequisite": "HLS 404"}, {"course_name": "HLS 483: Seminar in National Security Policy", "department": "Homeland Security (HLS)", "credits": "3 Credits", "description": "This course provides a comprehensive overview of the process of U.S. national security policy - the principles, practices, and participants in the development and implementation of security strategy and policy. It applies theories and models to the bureaucratic policy making structure of the Executive Branch, looks at the roles of other governmental participants, and evaluates the many factors that constrain decision making. It assesses the impact of non-governmental entities such as the media, interest groups, and public opinion, and considers the effect of changing domestic factors on the process. Finally, it prepares students to be knowledgeable and effective participants in the process and presents them with a practitioner's framework for policymaking. The main themes of this course are that the U.S. Constitution established a federal government of separate institutions sharing powers within an intentionally inefficient system of checks and balances that has evolved by virtue of a dynamic process of Constitutional Amendments, legislative statutes, judicial decisions, and executive actions; and, that national security decisions are best understood by considering the bureaucratic context in which they are made within the Executive Branch, and as a result of the interaction of other governmental and non-governmental participants.", "prerequisite": "seventh-semester standing", "other": ["Cross-listed with: PLSC 483, PUBPL 483"]}, {"course_name": "HLS 495: Homeland security internship", "department": "Homeland Security (HLS)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, non-group instruction including field experiences, practica, or internships. Written and oral critique of activity required. A specific title may be used in each instance and will be entered on the student's transcript."}]