[{"course_name": "HONOR 201: Developing Critical Thinking for Leadership", "department": "Honors (HONOR)", "credits": "1-3 Credits", "description": "Discussions on various topics using critical thinking skills to make informed leadership decisions.", "prerequisite": "member of the Presidential Leadership Academy", "other": ["Honors"]}, {"course_name": "HONOR 297: Special Topics", "department": "Honors (HONOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Honors"]}, {"course_name": "HONOR 301: The Role of Knowledge in Society", "department": "Honors (HONOR)", "credits": "3 Credits", "description": "Honors interdisciplinary study of topics utilizing contributions from science/ engineering, business, public policy, behavioral sciences/education, and the humanities.  HONOR 301H The Role of Knowledge in Society (3)This course is designed as an honors interdisciplinary study course composed of topics utilizing contributions from science/engineering, business, public policy, behavioral sciences/education, and the humanities.", "prerequisite": "admission to an honors program belonging to the Penn State Honors   Consortium", "other": ["Honors"]}, {"course_name": "HONOR 401: Honors Seminar", "department": "Honors (HONOR)", "credits": "1-6 Credits/Maximum of 6", "description": "In-depth honors-level exploration of a topic or theme that crosses disciplinary boundaries; may be repeated for credit.  HONOR 401H Honors Seminar (3 per semester/maximum of 6)Students will accomplish in-depth honors-level exploration of a topic or theme at the 400-level that crosses disciplinary boundaries. This course may be repeated for credit.", "prerequisite": "admission to an honors program belonging to the Penn State   Honors Consortium or approval from the Schreyer Honors College", "other": ["Honors"]}, {"course_name": "HONOR 493: Honors Service Learning", "department": "Honors (HONOR)", "credits": "1-3 Credits/Maximum of 3", "description": "A supervised honors experience doing service for campus or community welfare and analyzing related issues.  HONOR 493H Honors Service Learning (1-3 per semester/maximum of 6)Students will have a supervised honors experience doing service, service learning, and/or public scholarship dedicated to improving campus or community welfare and then analyzing the related issues through structured reflection.", "prerequisite": "admission to an honors program belonging to the Penn State Honors   Consortium", "other": ["Honors"]}, {"course_name": "HONOR 494M: **SPECIAL TOPICS**", "department": "Honors (HONOR)", "credits": "1-2 Credits", "description": "HONOR 494M Interdisciplinary Writing and Thesis Formulation (2)This course is a seminar to help students understand various approaches to interdisciplinary analysis. The course helps students learn about writing as an interpretive process. The course helps students with the formulation of their honors thesis projects and proposals.", "prerequisite": "admission to an honors program belonging to the Penn State Honors   Consortium", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "HONOR 495: Research Studies", "department": "Honors (HONOR)", "credits": "1 Credits", "description": "A capstone seminar for honors students working on honors theses and projects to work together and learn about their research interests.  HONOR 495H Research Studies (1)A capstone seminar for honors students working on honors theses and projects. Students work together and learn about their research interests.", "prerequisite": "HONOR301H and enrollment in an honors program belonging to the Penn State   Honors Consortium", "other": ["Honors"]}, {"course_name": "HONOR 496: Honors Thesis", "department": "Honors (HONOR)", "credits": "3 Credits", "description": "Research, creative activities, and writing necessary for pursuit and completion of an interdisciplinary honors thesis.  HONOR 496H Honors Thesis (3)Students will learn research, creative activities, and writing techniques necessary for the pursuit and completion of an interdisciplinary honors thesis or honors research project.", "prerequisite": "HONOR301H , senior standing, and enrollment in an honors program belonging   to the Penn State Honors Consortium", "other": ["Honors"]}, {"course_name": "HONOR 499: Foreign Studies", "department": "Honors (HONOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual of group instruction.", "other": ["International Cultures (IL)", "Honors"]}]