[{"course_name": "INTSP 295B: Internship in Business & Engineering", "department": "Internship (INTSP)", "credits": "1-6 Credits/Maximum of 6", "description": "ALT 295B Internship in Business & Engineering (1-6) Individual exploration of practical applications of a field of study through a supervised work experience. Final analytic paper, essays, journals and oral presentation as required by the instructor. Satisfactory employer evaluation required for passing grade. Prior approval of a member of the College faculty required.", "prerequisite": "minimum 30 credit hours; minimum 2.0 GPA; prior approval of   proposed assignment(s) by instructor"}, {"course_name": "INTSP 295C: Internship in Education, Human Development, & Social Sciences", "department": "Internship (INTSP)", "credits": "1-6 Credits/Maximum of 6", "description": "ALT 295C Internship in Education, Human Development, & Social Sciences (1-6) Individual exploration of practical applications of a field of study through a supervised work experience. Final analytic paper, essays, journals and oral presentation as required by the instructor. Satisfactory employer evaluation required for passing grade. Prior approval of a member of the College faculty required.", "prerequisite": "minimum 30 credit hours; minimum 2.0 GPA; prior approval of   proposed assignment(s) by instructor"}, {"course_name": "INTSP 370: Internship Preparation", "department": "Internship (INTSP)", "credits": "1 Credits", "description": "Planning and preparation for upper-level or capstone internship experience, suited to students' individual academic and career interests.  ALT 370 Internship Preparation (1) Planning and preparation for upper-level or capstone internship experience, suited to students' individual academic and career interests. Evaluation methods include two-three page reflective/analytic papers at the end of each segment; preparation and presentation at mock interview. This is an optional preparatory course for upper-division/senior-level internships in degree programs not offering formal internship preparation and will be offered for elective credit.", "prerequisite": "formal acceptance into a College major; junior standing;   minimum 2.0 GPA; completion of core research/skills   course(s) for student's degree program"}, {"course_name": "INTSP 495: **SPECIAL TOPICS**", "department": "Internship (INTSP)", "credits": "1-6 Credits/Maximum of 6", "description": "ALT 495A Internship in Business for non-Business Students (1-6) Individual exploration of the application of a non-business field of study in a business-related setting. Final analytic paper, essays, journals and oral presentation as required by the instructor. Satisfactory employer evaluation required for passing grade. Prior approval of a member of the College faculty required. Intended for non-Business students."}]