[{"course_name": "JAPNS 1: Level One Japanese A", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Introduction to modern Japanese; development of audio-lingual facility and ability to read and write Japanese without aid of romanization.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "JAPNS 2: Level One Japanese B", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Continuation of elementary Japanese, with emphasis on improving audio-lingual facility and strengthening reading and writing skills in modern Japanese.", "prerequisite": "JAPNS001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "JAPNS 3: Level Two Japanese A", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Continued study of modern Japanese at elementary level; extensive audio- lingual practice for conversational fluency; reading/writing original scripts.", "prerequisite": "JAPNS002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "JAPNS 97: Special Topics", "department": "Japanese (JAPNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "JAPNS 99: Foreign Study", "department": "Japanese (JAPNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "JAPNS 110: Level Two Japanese B", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Intermediate Japanese - Continued study of modern Japanese at intermediate level; extensive audio-lingual practice for conversational fluency; reading/writing original scripts.  JAPNS 110 Conversation, Reading, and Composition (3) (IL) (BA) This course meets the Bachelor of Arts degree requirements.The course offers the instruction of intermediate Japanese where students learn how to communicate and express various ideas using the Japanese language. Each chapter includes new essential vocabulary items, grammar patterns, and kanji which enable us to achieve higher overall communicative fluency in Japanese. By the end of the semester, students are able to construct grammatical structores, such as presuppositions, desire, hypothetical condition, causative, completion, regret, etc. The usage of polite expressions of humble and honorific is introduced. Various aspects of Japanese culture and customs are also discussed throughout the semester. This course fulfills the International Cultures requirement.", "prerequisite": "JAPNS003", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "JAPNS 120: Japanese Literature in Its Cultural Context", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Japanese literature and film from classical through contemporary times, with attention to changing cultural settings. Taught in English. This course is intended to provide an introduction to the literature of Japan from the seventh century to the postmodern era. Prior study of Japan is not required and materials will be available in English. Students will learn about major eras of Japanese literature and culture, such as the age of the Man'yoshu, the age of the Genji monogatari (The Tale of Genji), the age of No and Kyogen, the age of Wit and Learning, the age of Meiji, the age of industrialization, the postwar years, and postmodernity. The readings will include several genres, such as poetry, folktale, short story, and novel, with an emphasis on prose fiction. The course is structured so that students develop a historical/cultural perspective in order to understand the contexts that have inspired the literary works. By examining literature in its cultural contexts, students will investigate such topics as the relation between social institutions and the individual, the traditional patriarchal system, the changing roles of women, westernization, the Emperor system, and postmodern consumer culture, among others.Students will read literature and related materials from different periods, with occasional presentations of films. Class work includes some lecture but emphasizes guided discussions, group discussions, and student presentations. This participatory approach is intended to deepen appreciation of the texts, to help students understand value systems that may differ from, or else be shared with, those predominant in modern Western cultures, and to assist them in developing both analytical and expressive abilities. The course is designed to be suitable for all students generally interested in Japan, or interested in various fields of humanistic study, whether or not they have previously studied the culture of Japan.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "JAPNS 120W: Japanese Literature in its Cultural Context", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Japanese literature and film from classical through contemporary times, with attention to changing cultural settings. Taught in English. JAPNS 120W Japanese Literature in its Cultural Context (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is intended to provide an introduction to the literature of Japan from the seventh century to the postmodern era. Prior study of Japan is not required and materials will be available in English. Students will learn about major eras of Japanese literature and culture, such as the age of the Man'yoshu, the age of the Genji monogatari (The Tale of Genji), the age of No and Kyogen, the age of Wit and Learning, the age of Meiji, the age of industrialization, the postwar years, and postmodernity. The readings will include several genres, such as poetry, folktale, short story, and novel, with an emphasis on prose fiction. The course is structured so that students develop a historical/cultural perspective in order to understand the contexts that have inspired the literary works. By examining literature in its cultural contexts, students will investigate such topics as the relation between social institutions and the individual, the traditional patriarchal system, the changing roles of women, westernization, the Emperor system, and postmodern consumer culture, among others. Students will read literature and related materials from different periods, with occasional presentations of films. Class work may includes both lectures and guided discussions, group discussions, and students' presentations. This participatory approach is intended to deepen students' appreciation of the texts, to help them understand value systems that may differ from, or else be shared with, those predominant in modern Western cultures, and to assist students in developing both analytical and expressive abilities. The course is designed to be suitable for all students generally interested in Japan, or interested in various fields of humanistic study, whether or not they have previously studied the culture of Japan.", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "Writing Across the Curriculum"]}, {"course_name": "JAPNS 121H: Japanese Film and New Media", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Survey of Japanese film and new media in the twentieth century and beyond, with attention to changing cultural settings.  Taught in English. JAPNS 121 Japanese Film and New Media (3) (GH;IL) (BA) This course meets the Bachelor of Arts degree requirements.  This course is intended to provide an introduction to modern and cutting-edge forms of cultural production in Japan from the twentieth century to the present day.  Prior study of Japan is not required and materials will be available in English.  Students will learn about major technologies and forms of media, including film, manga, anime,, and various forms of new media (cell-phone novels, blogs, MMOGs, IM, and and Web 2.0 for instance). Readings and screenings will cover several artistic modes including formalism, historiography, documentary, period drama, and experimental works. The course, or individual units within the course, will be structured so that students develop an historical perspective, allowing them to understand the cultural contexts that have inspired the creative works under study. By examining Japanese film and new media with attention to changing cultural settings, students will investigate such topics as the relation between social institutions and the individual, the formation and expression of identity, changing gender roles and family structures, the impact of technological and economic trends on social structure, and changing climates of censorship and freedom of expression. In addition, students will learn to think critically about various media's techniques and aesthetics of representation, and will become more engaged, critical spectators of film and related media. Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. This participatory approach is intended to deepen students' appreciation of the works, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytical and expressive abilities. Through critical reading, group discussion and interpretive writing, students will hone skills for evaluating modes of cultural production and consumption in modern Japan. The course is designed to be suitable for all students generally interested in Japan, or interested in various fields of humanistic study, whether or not they have previously studied the culture of Japan. This course is required of the Japanese major. It is designed to count as General Education, as a B.A. \"Other Cultures\" course, and as an IL 'International Cultures' course.", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "Honors"]}, {"course_name": "JAPNS 121N: Japanese Film and New Media", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Survey of Japanese film and new media in the twentieth century and beyond, with attention to changing cultural settings. Taught in English. JAPNS 121N Japanese Film and New Media (3) (GH;GA;IL) (BA) This course meets the Bachelor of Arts degree requirements.This course is intended to provide an introduction to modern and cutting-edge forms of cultural production in Japan from the twentieth century to the present day. Prior study of Japan is not required and materials will be available in English. Students will learn about major technologies and forms of media, including film, manga, anime, and various forms of new media (cell-phone novels, blogs, MMOGs, IM, and Web 2.0 for instance). Readings and screenings will cover several artistic modes including formalism, historiography, documentary, period drama, and experimental works. The course, or individual units within the course, will be structured so that students develop an historical perspective, allowing them to understand the cultural contexts that have inspired the creative works under study. By examining Japanese film and new media with attention to changing cultural settings, students will investigate such topics as the relation between social institutions and the individual, the formation and expression of identity, changing gender roles and family structures, the impact of technological and economic trends on social structure, and changing climates of censorship and freedom of expression. In addition, students will learn to think critically about various media's techniques and aesthetics of representation, and will become more engaged, critical spectators of film and related media. Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. This participatory approach is intended to deepen students' appreciation of the works, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytical and expressive abilities. Through critical reading, group discussion and interpretive writing, students will hone skills for evaluating modes of cultural production and consumption in modern Japan. The course is designed to be suitable for all students generally interested in Japan, or interested in various fields of humanistic study, whether or not they have previously studied the culture of Japan.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "JAPNS 122: Gods to Godzilla: A Survey of Japanese Culture", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "This course will examine the formation of Japanese culture through the lens of exchange and adaptation. Seeking to examine our understanding of \"Japan\" and \"culture,\" the course will explore the interplay between culture and identity, with the Japanese experience providing a viewpoint that differs from the standard Western-centric narrative in important ways. Focusing primarily on cultural studies and history, we will also consider not only how the world influenced Japan, as is the standard narrative, but also, how Japanese culture impacted other cultures, both near and far, as the country emerged from being an obscure Asian island to a cultural superpower at the beginning of the 21st century.", "other": ["Cross-listed with: ASIA 122", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "JAPNS 172: Introduction to Japanese Civilization", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "This course surveys the development of civilization in Japan from ancient times to the present. Among the key goals of this course is to discuss what is distinctive about \"Japanese civilization.\" As a survey of Japan it includes topics such as external relations and cultural exchanges with Japan's neighbors and the world more broadly; the nature of indigenous beliefs, Shinto and Buddhism; the making of the Japanese bureaucratic state and gentry society; the rise of the commercialized economy; the growth of Japanese culture; Tokugawa Japan, It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: ASIA 172, HIST 172", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "JAPNS 197: Special Topics", "department": "Japanese (JAPNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "JAPNS 199: Foreign Study--Basic Japanese", "department": "Japanese (JAPNS)", "credits": "1-8 Credits/Maximum of 8", "description": "Small group instruction in spoken and written modern Japanese at the introductory level.", "other": ["International Cultures (IL)"]}, {"course_name": "JAPNS 210: Extensive Reading in Japanese", "department": "Japanese (JAPNS)", "credits": "1.5 Credits/Maximum of 12", "description": "This course consists of reading Japanese books without translation or grammar instruction in and outside of class. Students will choose books from a selection provided by the instructor, beginning at a lower level and moving gradually to higher levels under the instructor's supervision. Books may include an audio component. The instructor will select appropriate reading materials and organize them by levels, then constantly monitor students' reading behavior, occasionally giving suggestions and regularly consulting with students. The idea of this class is to learn incidentally, by encountering new words and grammatical patterns that can be understood based on context, and by reinforcing existing knowledge through increased familiarity. The emphasis is on learning the way of reading that allows you to enjoy the content of authentic but carefully selected reading materials. The course will help students develop a habit of reading at a designated time and place. Using language skills acquired in the classroom as a real communication tool will encourage use of Japanese beyond the classroom.", "prerequisite": "JAPNS002", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 295: Internship", "department": "Japanese (JAPNS)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "JAPNS 296: Independent Studies", "department": "Japanese (JAPNS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "JAPNS 296A: Independent Studies", "department": "Japanese (JAPNS)", "credits": "1-18 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "JAPNS 296B: Independent Studies", "department": "Japanese (JAPNS)", "credits": "1-18 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "JAPNS 297: Special Topics", "department": "Japanese (JAPNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "JAPNS 299: Foreign Study--Intermediate Japanese", "department": "Japanese (JAPNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Small group instruction in spoken and written modern Japanese at the intermediate level.", "prerequisite": "JAPNS002", "other": ["International Cultures (IL)"]}, {"course_name": "JAPNS 397: Special Topics", "department": "Japanese (JAPNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "JAPNS 399: Foreign Study", "department": "Japanese (JAPNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "JAPNS 401: Level Three Japanese A", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Further acquisition of the four language skills in Japanese--reading, writing, speaking and listening comprehension.  JAPNS 401 Advanced Conversation (4) (IL) (BA) This course meets the Bachelor of Arts degree requirements.This course aims to enhance students' abilities in speaking, listening, reading, and writing. The objectives in this course are: 1)to review, reinforce, and expand the basic grammar; 2)to expand knowledge of Kanji, vocabulary and idioms; 3) to be able to speak not only in single sentences, but in dialogues to perform basic communicative functions; 4) to be able to read and understand simple essays and stories; 5) to be able to write a short composition; and 6) to able to type Japanese on the computer.", "prerequisite": "JAPNS110", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "JAPNS 402: Level Three Japanese B", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Exclusively for study abroad returnees.  To further develop Japanese proficiency in speaking, listening, reading, and writing.  JAPNS 402 Advanced Reading (3) (IL) (BA) This course meets the Bachelor of Arts degree requirements.This class is offered exclusively to students who have studied abroad in Japan. Only primary multimedia sources (i.e., not a text book)will serve as course materials. Five classes a week will consist of reading session, multimedia presentation, and high level discussion. Intensive analysis and class discussion of multimedia materials will provide the student the opportunity to develop advanced ability to understand, construct, and express opinions and complex verbal concepts in appropriate contextual forms/modes.", "prerequisite": "JAPNS401", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 403Y: Level Four Japanese A", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Continuation of JAPNS 402.  Aims to improve students' proficiency in all four language skills, with a special emphasis on writing.  JAPNS 403Y Level Four Japanese A (4) (IL) This is a four credit course designed for those who have completed Level Three Japanese B or the equivalent. The course aims to further develop students' proficiency in all four language skills, with a special emphasis on writing. Students will study several topics such as Japanese society and Japanese literature for content-based language learning throughout the semester. For each topic variety of media will be used -newspaper articles, essays, short stories, TV programs, movies, etc. The majority of reading and writing assignments will be done outside class, with some guidance from the instructor. That will help students become more independent in studying Japanese. They will use appropriate resources such as dictionaries, reference books, online dictionaries and other online resources depending on their individual needs. Class time will be used mainly for discussions of content, feedback on writing, and presentations by students. All class activities will be conducted in Japanese. Writing exercises include short response papers on topics and summaries of literary pieces or audio visual materials. In the response papers students will reflect more deeply on certain topics, synthesize information from course materials, express their opinions, and support ideas by referring to and citing from source texts. This will help students be prepared for a longer thesis in the next course in the sequence. Discussion on the summaries will cultivate sensitivity toward words and expressions. The course will help students start building their career in Japanese. Students will familiarize themselves with and if they wish study for the Japanese Language Proficiency Test (Level N2). They will also write a resume and formal letters that could be used in job applications and practice formal spoken communication in business settings.", "prerequisite": "JAPNS402", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "JAPNS 404: Level Four Japanese B", "department": "Japanese (JAPNS)", "credits": "4 Credits", "description": "Continuation of JAPNS 403Y.  Aims to improve students' proficiency in all four language skills through content-based language learning.  JAPNS 404 Level Four Japanese B (3)(IL) This is a four credit course designed for those who have completed Level Four Japanese A or the equivalent. The course aims to further develop students' proficiency in all four language skills. Students will study several topics such as Japanese popular culture and issues in contemporary Japan for content-based language learning throughout the semester. For each topic variety of media will be used -newspaper articles, essays, short stories, TV programs, movies, etc. The majority of reading and writing assignments will be done outside class, with some guidance from the instructor. That will help students become more independent in studying Japanese. They will use appropriate resources such as dictionaries, reference books, online dictionaries and other online resources depending on their individual needs.", "prerequisite": "JAPNS403Y", "other": ["International Cultures (IL)"]}, {"course_name": "JAPNS 410: Japanese Through Manga", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "The course aims to expand students' knowledge and application of Japanese language beyond elementary and intermediate textbooks through the use of manga (graphic novels).  JAPNS 410 Japanese Through Manga (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is a three credit course designed for those who wish to expand their knowledge in Japanese and application of it beyond typical elementary and intermediate textbooks. The course will use manga, the format of which helps students understand the story line, the setting, and the thoughts and emotions of the main characters. Given quick interactions between manga characters and onomatopoeia that accompany pictures, students will learn natural daily communications of Japanese. Class discussions will also cover relevant customs, manners, cultural values, socio-historical context, and social perspectives along with language use. The exact texts will vary from instructor to instructor, and may include film and new media in addition to a primary focus on manga. The course will serve as a gateway to the further exploration of Japanese authentic texts and audio visual materials. The prerequisite is JAPNS 110. Students who have successfully completed JAPNS 110, JAPNS 401, or JAPNS 402 are encouraged to take the course. Students who have finished JAPNS 403Y or JAPNS 404 may also take the course.", "prerequisite": "JAPNS110 or equivalent", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 426: Early Modern Japan", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Japanese history from 1580-1880.  ASIA 474 (HIST 474, JAPNS 426) Early Modern Japan (3) Japan's Tokugawa period can be difficult to grasp. It resembles a modern society in many respects but operated according to a logic of social organization different from that of most modern states. There was a collective sense of national identity, but its characteristics differed significantly from modern forms of Japanese identity. Moreover, modern ideologies have contributed to the characterization of early modern Japan as a rigid society and of the country as a whole having been isolated from the rest of the world. The main purpose of this course is to afford students the opportunity to study early modern Japan in detail and, insofar as possible, on its own terms. Through readings in primary and secondary sources, and through the evaluation of visual images, this seminar-style course will deepen students' knowledge of Japan and serve as basis for comparative study of other early modern societies. Although the course investigates classic areas of historical study such as institutional development and foreign relations, the emphasis is on social and environmental history. The course encourages students to think about a range of approaches to the past and to think about the ways our contemporary biases influence the ways we understand the past.", "prerequisite": "HIST 172", "other": ["Cross-listed with: ASIA 474, HIST 474"]}, {"course_name": "JAPNS 430: Japan in the World", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Study of Japan's foreign relations and position in the international community from the early 19th century to the present. ASIA (JAPNS) 430 Japan in the World (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine Japan's foreign relations and changing position in the international community, from the rethinking of relations with the Western world in the early nineteenth century to its emergence as a pop culture superpower in the present day. The course will explore the structures of international relations, such as imperialism and international organizations, with the Japanese experience providing a viewpoint that differs from the standard Western-centric narrative in important ways. We will also consider the development of alternative methods of diplomacy, including cultural exchange and economic and technical assistance.", "prerequisite": "JAPNS 120", "other": ["Cross-listed with: ASIA 430", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 431: Courtly Japan", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Focused study of aristocratic society and culture of Heian period Japan. JAPNS 431 (ASIA 431) Courtly Japan (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. The Heian period of Japanese history saw the apex of a refined court culture. Through readings of primary and secondary sources, this seminar-style course will explore the activities, norms, and structures of courtly society in Japan, from the centralization of imperial power in the 8th century through the court's political marginalization in the late 12th century. We will pay particular attention to religion, the arts, politics and governances, gender, and the gradual rise of samurai power in the shadows of the court. This course is intended to provide an introduction to the political, social, economic, and cultural life of the Heian court of ancient Japan. The goals of the class are not only to gain an understanding of a time and place far removed from our own, but also to develop the skill of building such an understanding through primary and secondary sources, both written and visual. Students in this class will take on the role of historian or literary critic themselves, thinking critically about assigned texts and making their own interpretations of their meanings. Through reading, discussions, and writing, students will enhance their ability to think critically and to express their ideas clearly in both speech and writing. The course is intended to deepen student's appreciation of the cultural production of ancient Japan, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytic and expressive abilities. The course is designed to be suitable for all students generally interested in Japan or in various fields of humanistic study.", "other": ["Cross-listed with: ASIA 431", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 432: War and the Warrior in Japan", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Survey of the role of warfare and the warrior in Japan, with attention to changing cultural settngs. Taught in English. JAPNS 432 (ASIA 432) War and the Warrior in Japan (3) (IL) This course is intended to provide an introduction to the social and historical roles of warfare, and the changing cultural figure of the warrior, in Japan. Some prior study of Japan (JAPNS 120 or JAPNS 121 or HIST 172) is required. All materials will be available in English. Students will learn about subjects like the causes of violence, culturally acceptable ways of resolving conflict, obligations of victor toward vanquished, expectations regarding the memory of the war dead, the ideal of the warrior as a cultural figure, and historical roles that Japanese warriors have played in ages of peace. Readings and screenings will cover several genres, such as film, historiography, history, documentary, classical epic, modern novel, and excerpts from Japanese history textbooks (in translation). The course, or individual units within the course, will be structured so that students develop an historical perspective, allowing them to understand the cultural contexts that have generated attitudes toward war and the warrior in Japan. In addition, students will learn to think critically about various media's techniques and aesthetics of representation, and will become more engaged, critical investigators of literature and related media. Readings and in-class discussion will focus on the image of the warrior as a cultural icon, exploring the many ways in which popular understandings of the warrior have changed over time, for instance, as popularized dramatics began to idealize warriors as moral exemplars in the late medieval period, and then as historical realties made the position of the warrior itself redundant in the early modern era.Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. This participatory approach is intended to deepen students' appreciation of the works, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytical and expressive abilities. Through critical reading, group discussion and interpretive writing, students will hone skills for evaluating modes of cultural production and consumption in premodern and modern Japan. Evaluation will be through means such as in-class presentations, short writing assignments, midterms or quizzes, one analytic paper (3-7 pages), and in-class/on-line participation and discussion. The course is designed to be suitable for all students generally interested in Japan, or interested in various fields of humanistic study.", "prerequisite": "ASIA 4", "other": ["Cross-listed with: ASIA 432", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 433: Traveling Voices", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Transnational Writings of Japan: from Modern to Contemporary Eras . JAPNS 433 (ASIA 433) Traveling Voices (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. Through literary and visual texts from modern to contemporary eras, this seminar-style course will explore a wide range of narrative voices of Japan, created by writers who are physically or figuratively dispersed in many directions within, towards, and away from Japan, and who therefore problematize \"Japanese-ness\" by dealing with cultural situations (e.g. identities, marginality) in their writings. Some Prior Study of Japan (JAPNS 120, JAPNS 121, or HIST 172) is required. Students will explore the rich cultural diversity in Japan and the Japan diaspora, and develop a further understanding of historical border crossers between Japan/East Asia and Americas/the West.They will become more aware of the reciprocal and transformative cross-cultural interactions in languages, literature, religions, economics, ideas, or political formations.They will learn how to think critically, in speech and writing, and develop writing analytic skills appropriate to their final paper project. Evaluation will depend on specific instructor practice, but will certainly emphasize guided discussions, some student presentations (alone or/and group), and writing exercises (especially final research project). A sample guideline might look like this: Class Participation/discussion, Response papers, Informal Presentation (pair or group up to three), Mid-term exam, Final paper presentation, Final Project", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 434: Beyond Anime", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "The visual, tactile, and literary arts play key roles in how modern nation-states make sense of themselves and how they make sense of other nations. Japan provides one key example through which to observe the use and function of art to create not only the image and identity of a nation and national culture, but also the image and identity of other national cultures. In recent years, Japanese popular culture has been reborn around the world. A global generation has grown up watching anime and reading manga in Spanish, Chinese, Russian, and English. Beyond Anime is designed to contextualize the recent appropriation and dissemination of Japanese popular culture through the cyclical history of such appropriations through the modern period. In this way, the course will explore the precursors, antecedents, and contexts to our present cultural moment. Through film, photography, posters, matchbook-labels, textiles, industrial design, novels, and myriad other popular media, this seminar-style study of Japanese popular visual culture will help students see Japanese visual arts in terms that are local to Japanese aesthetics and through those that transcend local cultures. Drawing on the long history of illustrated narrative from scrolls to chapbooks, through film and photo essay, this course confronts the exoticist notion that Japan's arts have always placed a disproportionately heavy emphasis on the visual. Through comparative readings of cultural and visual material from Japan, this course will raise questions of aesthetic, cultural, and national difference. Specific topics will vary with instructor, but may include: the rendering of three dimensional space through perspective, the use of pictures in the service of narrative versus the use of pictures as narrative, and how notions of negative space promise deep insight and risk crass stereotypes.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "JAPNS 450: Introduction to Classical Japanese", "department": "Japanese (JAPNS)", "credits": "3 Credits", "description": "Basic patterns and structures of Classical Japanese from its development in the 6th century through usage in the 20th century.  JAPNS 450 Introduction to Classical Japanese (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is an introduction to the basic grammar and stylistic idiosyncrasies of classical Japanese (bungo). Students will be guided through an examination of key syntactical structures and will be asked to apply their knowledge in order to read, translate, and discuss various texts from the classical, medieval, and early modern periods. In addition to gaining familiarity with standard reference materials (such as dictionaries of classical Japanese), students will also gain a working knowledge of the styles and themes of major works of pre-modern Japanese literature. Successful completion of this course will give students the fundamental skills necessary to read texts composed prior to the 1900's and to engage in research in the field of pre-modern Japanese studies. With this training and knowledge concerning the development of the Japanese language, students will increase their proficiency in modern Japanese and their overall knowledge of Japanese culture and literature.Prior study of modern Japanese is required (with proficiency equivalent to successful performance in JAPSN 402).The purpose of the course is to make bungo (literary Japanese) accessible to as many students as possible. Classical Japanese first appeared in the 6th and 7th centuries and was used to write a wide variety of texts up until the mid-20th century. Knowledge of it is very useful to anyone interested in studying Japanese history, literature, philosophy, politics, art, or culture. The course offers a systematic introduction to the grammar of Classical Japanese, while also presenting Classical Japanese and Modern Japanese as part of a linguistic and cultural continuum.", "prerequisite": "JAPNS402 or equivalent", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)", "International Cultures (IL)"]}, {"course_name": "JAPNS 452: Contemporary Japan:  Cultures, Lifestyles, Trends", "department": "Japanese (JAPNS)", "credits": "3 Credits/Maximum of 6", "description": "Survey of aspects of modern Japanese society; includes readings from Japanese newspapers, magazines, and fiction; topics may vary each semester.  JAPNS 452 Contemporary Japan: Cultures, Lifestyles, Trends (3 per semester/maximum of 6) (IL) (BA) This course meets the Bachelor of Arts degree requirements.This course orients students to cultural issues and trends in contemporary Japan, and the way that those issues and trends are explored in literature, film, newspapers and magazines. The course examines a selection of Japanese-language materials from an array of genres, modes of representation, and historical settings. Focusing on the postwar era to present (1945-), this course introduces various aspects of contemporary Japanese culture, from literary works of the postwar experience to recent popular culture, including anime (animated movies) and manga (graphic novels). Each work is discussed in terms of its own literary or artistic merit, the social context that produced it, its position within the larger trends of literary development in Japan, and its relevance for the modern reader. This course is designed for (prospective) Japanese major or minor students interested in broadening their knowledge of Japanese culture and society as well as for students who wish to compare other cultures and literatures they have studied with those of Japan.", "prerequisite": "JAPNS401", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "JAPNS 453: Japanese Film", "department": "Japanese (JAPNS)", "credits": "3 Credits/Maximum of 6", "description": "Selected films and directors representing various aspects of Japanese culture and cinema; topics may vary each semester.  JAPNS 453 Japanese Film (3 per semester/maximum of 6) (IL) (BA) This course meets the Bachelor of Arts degree requirements.This class will be a seminar-style study of Japanese culture, texts, and language as seen through the lens of Japanese cinema. The goal is to deepen the students' understanding of diverse aspects of Japanese life, history, and culture while developing language skills. Typical class sessions may involve watching sections of film (with our without English subtitles); working with listening comprehension; engaging with student presentations (in Japanese) on studios, directors, or actors; discussing Japanese film history; and analyzing film stills for aesthetic qualities. Participants will be required to view and discuss films in Japanese (with or without English subtitles). Viewing's will be accompanied by secondary readings (at least some of which may be in Japanese). We will also be discussing the films and readings in the context of nation, identity, history, sociology and culture. Exercises will range from group discussion, web-based research in Japanese and English, presentations, essays and film analysis. Students must prepare for class by reading the material carefully, taking notes, writing down questions, and being ready to take part in lively conversations. Course discussion will take place primarily or exclusively in Japanese.This course satisfies the International Cultures requirement.", "prerequisite": "JAPNS401", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "JAPNS 454: Japanese Literature", "department": "Japanese (JAPNS)", "credits": "3 Credits/Maximum of 6", "description": "Selected works from important Japanese texts representing genres such as autobiography, poetry, fiction, and drama; topics may vary each semester.  JAPNS 454 Japanese Literature (3 per semester/maximum of 6) (IL) (BA) This course meets the Bachelor of Arts degree requirements.This class will be a seminar-style study of contemporary Japanese literature. The goal of the course is to help students move from grammar-assisted reading assignments (which may provide vocabulary lists, grammar notes, and cultural notes) to reading 'raw' materials in Japanese, where students are responsible for knowing how to use the appropriate reference materials so that they can compile vocabulary lists, grammar notes, and cultural notes on their own. Students will be reading selected works from an array of genres such as autobiography, poetry, fiction, drama and essays, with topics and thematic focuses varying from semester to semester. Typical class sessions may involve reading aloud from a literary work; engaging with student presentations (in Japanese) on authors, genres, thematic elements, and relevant historical or cultural events; discussing Japanese literary history; analyzing short passages for their aesthetic qualities; and working with specific items of grammar or vocabulary. Participants will be required to read and discuss Japanese literature in Japanese. Exercises will range from group discussion, web-based research in Japanese and English, presentations, essays, quizzes and tests. Students must prepare for class by reading the material carefully, taking notes, writing down questions, and being ready to take part in lively conversations. Course discussion will take place primarily or exclusively in Japanese. This course satisfies the International Cultures requirement.", "prerequisite": "JAPNS401", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "JAPNS 494: Research Project", "department": "Japanese (JAPNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "JAPNS 494H: Research Project", "department": "Japanese (JAPNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "JAPNS 496: Independent Studies", "department": "Japanese (JAPNS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "JAPNS 497: Special Topics", "department": "Japanese (JAPNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "JAPNS 498: Special Topics", "department": "Japanese (JAPNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "JAPNS 499: Foreign Study--Advanced Japanese", "department": "Japanese (JAPNS)", "credits": "1-15 Credits/Maximum of 15", "description": "Small group instruction in spoken and written modern Japanese at the advanced level.", "prerequisite": "JAPNS110 or JAPNS299", "other": ["International Cultures (IL)"]}]