[{"course_name": "LATIN 1: Elementary Latin", "department": "Latin (LATIN)", "credits": "4 Credits", "description": "Pronunciation; inflections; simple rules of syntax.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "LATIN 2: Elementary Latin", "department": "Latin (LATIN)", "credits": "4 Credits", "description": "Advanced syntax and sentence structure.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "LATIN 3: Intermediate Latin", "department": "Latin (LATIN)", "credits": "4 Credits", "description": "Selected readings from representative authors.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "LATIN 51: Elementary Intensive Latin for Graduate Students I", "department": "Latin (LATIN)", "credits": "3 Credits", "description": "Intensive introduction to Latin: first half of graduate intensive sequence in elementary reading, writing, syntax, and cultural contexts.  LATIN 051 Elementary Intensive Latin for Graduate Students I (3)This is the first in a series of three courses designed to give students an intensive introduction to Latin. This is the first half of elementary sequence in reading, writing, syntax, and cultural contexts. Students will learn the Latin alphabet, vocabulary, and will learn to create simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"course_name": "LATIN 52: Elementary Intensive Latin for Graduate Students II", "department": "Latin (LATIN)", "credits": "3 Credits", "description": "Intensive introduction to Latin: second half of graduate intensive sequence in elementary reading, writing, syntax, and cultural contexts.  LATIN 052 Elementary Intensive Latin for Graduate Students II (3)This is the second in a series of three courses designed to give students an intensive introduction to Latin. This is the second half of elementary sequence in reading, writing, syntax, and cultural contexts. Lessons are taught in an authentic cultural context."}, {"course_name": "LATIN 53: Intermediate Intensive Latin for Graduate Students", "department": "Latin (LATIN)", "credits": "3 Credits", "description": "Continued intensive study of Latin at the intermediate level: reading, writing, syntax, and cultural contexts.  LATIN 053 Intermediate Intensive Latin for Graduate Students (3)This is the third in a series of three courses designed to give students an intensive intermediate knowledge of Latin. This is an intensive sequence in reading, writing, syntax, and cultural contexts. Lessons are taught in an authentic cultural context."}, {"course_name": "LATIN 101: Introductory Latin", "department": "Latin (LATIN)", "credits": "4 Credits", "description": "Introduction to Latin forms, syntax, and vocabulary.  LATIN 101 Introductory Latin (4) The aim of LATIN 101 is to introduce students to the fundamentals of classical Latin as soon as possible. Classical Latin is the literary dialect spoken and written by Romans from the first century BCE to the second century CE. This is the language that the classical Roman authors wrote, poets such as Catullus, Virgil, Horace, Ovid, Lucan, and Seneca and prose writers such as Caesar, Sallust, Cicero, Livy, Petronius, Tacitus, and Suetonius. The purpose of the course is to teach students the morphology, syntax, and vocabulary of classical Latin and train them to read and translate simple and complex sentences. The course consists of short weekly presentations of new grammatical and lexical content, vocabulary to be memorized, drills to practice forms and concepts, exercises in reading sentences, homework assignments translating sentences from Latin into English and English into Latin, and regular quizzes and tests to ensure retention and comprehension of material. The goal of the course in the first semester is for students to be able to read short passages of continuous prose based on classical Latin models. The course focuses on reading, translating, and writing rather than speaking, although students will be expected to be able to read Latin aloud with correct pronunciation. LATIN 101 prepares students for Latin 102, the second semester of Introductory Latin, which in turn prepares students to take a 400-level course in Latin."}, {"course_name": "LATIN 102: Advanced Latin", "department": "Latin (LATIN)", "credits": "4 Credits", "description": "Advanced study of Latin grammar, syntax, and vocabulary. LATIN 102 Advanced Latin (4) LATIN 102 continues from LATIN 101. Students who have taken at least three years of high school Latin may qualify to enroll in the course if they have performed well on either a Latin A.P. exam (minimum grade of 3) or a placement exam set by the instructor. LATIN 102 pursues the advanced study of the forms of syntax of classical Latin, the literary dialect spoken and written by Romans from the first century BCE to the second century CE. This is the language that the classical Roman authors wrote, poets such as Catullus, Virgil, Horace, Ovid, Lucan, and Seneca and prose writers such as Caesar, Sallust, Cicero, Livy, Petronius, Tacitus, and Suetonius. The purpose of the course is to equip students with the grammatical rules to read and write complex sentences in Latin. The course consists of short weekly presentations of new grammatical and lexical content, vocabulary to be memorized, drills to practice forms and concepts, exercises in reading sentences, homework assignments translating sentences from Latin into English and English into Latin, and regular quizzes and tests to ensure retention and comprehension of material. The goal of the course in the second semester is for students to be able to read longer passages of continuous Latin prose that has not been adapted. The course focuses on reading, translating, and writing rather than speaking, although students will be expected to be able to read Latin aloud with correct pronunciation. LATIN 102 will also continue to introduce students to Roman civilization and prepares students to take a 400-level course in Latin."}, {"course_name": "LATIN 203: Latin Reading and Composition", "department": "Latin (LATIN)", "credits": "4 Credits", "description": "The course reviews Latin grammar, syntax, and vocabulary and introduces students to classical Latin poetry and prose. LATIN 203 Latin Reading and Composition (4)This four-credit course is at the intermediate-level and follows LATIN 003 or LATIN 102. It satisfies the 12th-credit foreign language requirement and prepares students to take 400-level Latin courses. The course is concerned with perfecting the knowledge of Latin grammar. This is accomplished by the review of grammatical rules and by the reading and explanation of Latin authors. The course reviews the forms, syntax, and vocabulary of Latin, and gives students practice exercises that improve translation skills. Equally important, students are introduced to the principles of Latin style by learning how to translate English into Latin. The review of Latin grammar and the introduction to Latin prose composition provide students with the competence to read representative Roman authors in poetry and prose. Rudimentary Latin readings, supported by school commentaries, are intended to familiarize students with famous examples of classical Roman literature while exemplifying the principles of classical Latin style. Evaluation methods include assessment of students through in-class oral and written drills, in-class translation of Latin into English and English into Latin, weekly translation assignments, regular quizzes, and midterm and final exams. These methods are intended to promote the learning of Latin vocabulary and grammar, to increase the comprehension of the assigned readings, and to foster an appreciation of the stylistic virtuosity of Rome `s greatest writers."}, {"course_name": "LATIN 296: Independent Studies", "department": "Latin (LATIN)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "LATIN 402: Republican Literature", "department": "Latin (LATIN)", "credits": "3-12 Credits/Maximum of 12", "description": "Selected works by Plautus, Lucretius, Catullus, Cicero (content varies).", "prerequisite": "LATIN 203", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"course_name": "LATIN 402H: Republican Literature", "department": "Latin (LATIN)", "credits": "3-12 Credits/Maximum of 12", "description": "Selected works by Plautus, Lucretius, Catullus, Cicero (content varies).", "other": ["Honors"]}, {"course_name": "LATIN 403: Augustan Age Literature", "department": "Latin (LATIN)", "credits": "3-12 Credits/Maximum of 12", "description": "Selected works by Virgil, Horace, Propertius, Tibullus, Ovid, Livy (content varies).", "prerequisite": "LATIN 203", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"course_name": "LATIN 404: Silver Age Literature", "department": "Latin (LATIN)", "credits": "3-12 Credits/Maximum of 12", "description": "Selected works by Petronius, Seneca, Tacitus, Juvenal, Martial, Pliny the Younger (content varies).", "prerequisite": "LATIN 203", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"course_name": "LATIN 450W: History of Latin", "department": "Latin (LATIN)", "credits": "3 Credits", "description": "History of the Latin language and its speakers, from their origins to the 2nd century C.E.", "prerequisite": "LING 102 ; LATIN401 , LATIN402 , or LATIN403", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"course_name": "LATIN 494: Research Project", "department": "Latin (LATIN)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "LATIN 496: Independent Studies", "department": "Latin (LATIN)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "LATIN 497: Special Topics", "department": "Latin (LATIN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}]