[{"course_name": "LER 199: Foreign Studies", "department": "Labor and Employment Relations (LER)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "LER 297: Special Topics", "department": "Labor and Employment Relations (LER)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LER 299: Foreign Studies", "department": "Labor and Employment Relations (LER)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "LER 399: Foreign Studies", "department": "Labor and Employment Relations (LER)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "LER 424: Employment Compensation", "department": "Labor and Employment Relations (LER)", "credits": "3 Credits", "description": "Development and management of employee compensation systems.  LER 424 Employment Compensation (3) Employment Compensation provides an overview of compensation programs, practices, and strategies. This course examines various compensation systems, that serve as an integral component of human resource management operations. Upon completion of this course, students will have a better understanding of compensation program design and development, the criteria used to compensate employees, and challenges that compensation professionals may encounter. Requirements for this course include regular attendance and participation, completion of three case studies, three project assignments, and three examinations which will consist of short answer and multiple choice questions.", "prerequisite": "LER  201 and sixth-semester standing", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LER 425: Employee Benefits", "department": "Labor and Employment Relations (LER)", "credits": "3 Credits", "description": "The examination of employee benefits programs used by employers to meet the welfare needs of employees and their families.  LER 425 Employee Benefits (3) This course is a comprehensive survey of the programs, principles and trends in planning and administering employee benefit programs for private and public employers. The objectives for this course are to provide students with an understanding of employee benefit programs and their broad implications for the workplace, the role of employee benefits in motivating and retaining employees, and the recent trends in employee benefit offerings and cost containment approaches.Topics covered include strategic and tactical planning considerations used in implementing and changing benefit programs, discretionary and mandatory benefits, Social Security, health insurance structures, disability and life insurance programs, workers' compensation, retirement programs, executive benefits, paid-time off programs and accommodation and enhancement programs.This course builds on introductory general foundation courses in human resources and labor relations. It provides students with a working knowledge of employee benefits and its important role in human resources and labor relations careers.Students must select and write a research paper on a benefits topic of special interest. Course grades will be determined from examinations and the research paper.", "prerequisite": "LER  201 and 6th semester standing"}, {"course_name": "LER 445Y: Politics of Affirmative Action", "department": "Labor and Employment Relations (LER)", "credits": "3 Credits", "description": "Examines history, politics, and economics of the use of special programs to advance racial interests in the U.S. PLSC 445Y / AFAM 445Y / LER 445Y Politics of Affirmative Action (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. The objectives of this course are to introduce students to the relationship between affirmative action and other policies purportedly designed to end racial inequality in the U.S. This course approaches the study of affirmative action in the context of the historic racial discrimination and inequality that Black Americans have faced since the founding of the Nation. The purpose of this course is to help students think about how contemporary and historic affirmative action policies relate to race, concepts racial inequality, the historic and continuing causes for racial inequality, public opinion, American politics and economic thought. The course materials will lead students through scholarly and popular articles, books and video presentations on the topic. It is hoped that students will become familiar with the history of affirmative action from its conception. Students will gain an intimate understanding of affirmative action economic and social outcomes on various racial groups. No prior knowledge is assumed, however a knowledge of civil rights history, quantitative methods, and constitutional law will be useful. The Politics of Affirmative Action satisfies the requirements for major and minor electives for the African American Studies, and major and minor electives for Political Science, and Labor Studies and Industrial Relations. Students are evaluated on the basis of an examination, term paper, class participation and class presentations of papers.", "prerequisite": "AAA S 100 level course and PL SC001 or PL SC007", "other": ["Cross-listed with: AFAM 445Y, PLSC 445Y", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "LER 485: The Business Side of Human Resources", "department": "Labor and Employment Relations (LER)", "credits": "3 Credits", "description": "Students will examine the interface between HR, the business model, and other aspects of the business organization.  LER 485 The Business Side of Human Resources (3) Students will have the opportunity to learn about important business issues in human resource management that will introduce them to the interface between human resources and other areas of the operation of a business. This course will focus on subject matter that will better prepare students for the broader role that human resource managers are being requested to play in terms of contributing to the profitability of their employers. In the investigation of the course material, students will be exposed to real life examples and experiences, interaction with outside human resource professionals and guest speakers that will broaden their understanding of the concepts learned in their previous course work in human resources and labor relations. Some examples of the subject matter that will be addressed in this course are: Human resource and business ethics; Basic introduction of the interrelationship of human resources and business finance and accounting; Human resource metrics; Employment process; Leadership and relationship building; Communication in the workplace; Professional networking; Business etiquette; Human resource culture in business. The course is best designed for senior and graduate students who have serious interest in pursuing employment in human resources and/or labor relations.", "prerequisite": "6th semester standing and 6 credits of Labor Studies and   Employment Relations"}, {"course_name": "LER 488: Career Development Seminar I", "department": "Labor and Employment Relations (LER)", "credits": "1.5 Credits", "description": "This course features an introduction to several useful career development resources, development of a personal profile of your career-related strengths and interests, exploration of career options, creation of a career development plan, and guidance for securing prospective internships and other relevant experiences.  LER 488 Career Development Seminar I (1.5) This course is the first of two 1.5-credit seminars designed to help students plan and launch their career in labor, employment relations, or human resources. This seminar features an engaging discovery-oriented approach to career development that includes exploration of the world of work, students&rsquo; personal needs and preferences, and strategies for finding an optimal match in the world of work. This experiential course immerses students in the process of charting their career path and preparing for success as a professional. This seminar fosters the development of practical career management skills that can be applied throughout the students&rsquo; entire career. This seminar, the first in the two-part series, will help students to chart an overall career track as a professional in labor, employment relations, or human resources. This course features an introduction to several useful career development resources, development of a personal profile of career-related strengths and interests, exploration of career options, creation of a career development plan, and guidance for securing prospective internships and other career development experiences.", "prerequisite": "4th semester standing"}, {"course_name": "LER 489: Career Development Seminar II", "department": "Labor and Employment Relations (LER)", "credits": "1.5 Credits", "description": "This course is the second of two 1.5-credit seminars designed to help LER majors launch their career in labor, employment relations, or human resources. Both seminars guide students through the process of charting their career path and preparing for success as a professional.  This seminar focuses on helping students to cultivate their professional brand, plan a job search strategy, market themselves as a professional in the world of work, manage a variety of interview challenges, and strengthen key work habits that are valued by employers and essential to success as a professional.  LER 489 Career Development Seminar II (1.5) This course is the second of two 1.5-credit seminars designed to help LER majors launch their career. The first seminar in the series is targeted toward juniors, while the second is designed for seniors. Both seminars guide students through the process of charting their career path and preparing for success as a professional. This seminar requires students to complete specific career development activities and then complete reflection and application exercises related to those activities. Utilizing a discovery-oriented approach, this course helps students to cultivate their professional brand, plan a job search strategy, market themselves as a professional, manage a variety of interview challenges, and strengthen key work habits that are valued by employers and essential to success as a professional. The course incorporates services offered by Penn State Career Services and the Liberal Arts Career Enrichment Network.", "prerequisite": "LER  488"}]