[{"course_name": "LHR 83S: First-Year Seminar in Labor and Human Resources", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "LHR 83S meets the Bachelor of Arts degree requirements. This course provides a general introduction to the field of labor, employment relations, and human resources, as well as a more in-depth examination of an issue or topic related to the field and it does so in a small class environment. It also introduces first-year students to the University as an academic community, to their responsibilities as a member of that community, and to the wide range of the opportunities and resources available to them. The course fulfills both a first-year seminar and a general education or Bachelor of Arts social/behavioral science requirement. Class sessions stress discussion of assigned readings, debates, and/or talks by guest lecturers/speakers.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "LHR 100: Exploring Work and Employment", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Work and employment are central parts of the human experience. With that in mind, this course has two main objectives. First, to help better prepare students for the role that work and employment will play in their lives. And second, to introduce students to the fields of human resource management and employment relations. The course will begin by looking at the ways in which work and employment impact people's lives financially, socially, and psychologically. It then examines a number of issues that impact the kind of experience that people have at work and that people entering the workforce need to be aware of, including the basic legal rights employees have related to employment, workplace privacy, employment discrimination, family-friendly policies at work, safety and health in the workplace, drug and alcohol testing, and the growing trend of working from home. The course then introduces students to human resource management as a field. It also discusses the various ways that students will interact with human resources professionals when they begin applying for jobs, including the search and hiring process and, once they obtain employment, on issues such as compensation, benefits, and job evaluation. As the employees in some workplaces are represented by labor unions, students will be introduced to the role that unions have historically played in American workplaces. The process for organizing a union will be addressed, as will the collective bargaining process through which employers and unions jointly determine wages and salaries, benefits such as healthcare and pensions, and processes for ensuring fair treatment and due process in the workplace. New alternatives to unions that give workers a voice in their workplace will also be discussed. The final section of the course will focus on globalization and immigration and their impact on work and employment around the world. Both the benefits of globalization (lower costs on consumer goods) and its costs (job losses in developed countries and the exploitation of workers in poorer countries through substandard pay, sweatshops, and child labor) will be discussed, as will the benefits and costs of immigration.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "LHR 136: Race, Gender, and Employment", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course will ask how race and gender affect work in the contemporary United States. We will consider how race and gender shape people's work opportunities, their wages at work, and whether they participate in paid or unpaid labor (or both). We will begin with an overview of work and the changes in the workforce over time; we will move to investigate how workplace structures reproduce gender and race inequalities; will ask how race and gender inequalities are informally maintained through education systems and social networks; will consider differing dimensions of inequality across poverty, immigration, and sexuality; and will consider how studying unpaid labor helps us better understand the formal paid economy. This course meets the Bachelor of Arts degree requirements.", "other": ["Cross-listed with: AFAM 136, WMNST 136", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "LHR 136Y: Race, Gender, and Employment", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course will ask how race and gender affect work in the contemporary United States. We will consider how race and gender shape people's work opportunities, their wages at work, and whether they participate in paid or unpaid labor (or both). We will begin with an overview of work and the changes in the workforce over time; we will move to investigate how workplace structures reproduce gender and race inequalities; will ask how race and gender inequalities are informally maintained through education systems and social networks; will consider differing dimensions of inequality across poverty, immigration, and sexuality; and will consider how studying unpaid labor helps us better understand the formal paid economy. The course emphasizes writing in the form of short assignments and longer papers as a means to develop comprehension of these ideas. This course is a writing intensive course designed to develop formal writing appropriate for a business context. We will use an active and engaged writing process using the course topics of diversity and employment inequality to strengthen writing skills.", "other": ["Cross-listed with: AFAM 136Y, WMNST 136Y", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"course_name": "LHR 160N: The Virtual Transformational Leadership Development Experience", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The Virtual Transformational Leadership Development (VTLD) Experience is designed to help develop the next generation of leaders to serve as agents of change in pursuit of a more civil, equitable, and just workplace, society, and world. A guiding principle of The VTLD Experience is that diversity is a fact, inclusion is a choice, equity is an action, and belonging is an outcome.  It leverages technology, including artificial intelligence, machine learning, interactive arts and and employs high impact teaching practices including micro-lessons, rapid learning, reflective exercises, online discussions, meditation and mindfulness practices, an online journal, and synchronous individual transformational leadership development coaching sessions conducted via Zoom. Students enroll in the VTLD Experience from the University Park and the Commonwealth Campuses and have an opportunity to engage with artists curated by the Center for the Performing Arts at Penn State. This involves viewing performances from a distance and digital programming. Fundamentally, the course is an anti-racist, anti-oppression leadership development experience and aligns with the following foundations and thematic priorities of the university's 2016 - 2025 strategic plan:  Foundations  - Engaging Our Students  - Advancing Inclusion, Equity and Diversity  - Enabling a Sustainable Future  Thematic Priorities  - Transforming Education  - Empowering Through Digital Innovation  - Advancing the Arts and Humanities  - Stewarding our Planet's Resources", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "LHR 165N: Work and Literature", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "If you get a job out of college, work eight hours a day, fifty weeks a year, and retire at age 65, at that point you have will spent roughly one third of your adult, waking life at work. And that is just paid work. Add in housework, childcare, and other forms of unpaid labor and the share of your waking hours devoted to work creeps closer to one half. And those calculations may actually underestimate the influence work has over your life. What you do will determine where you live, how you live, and, perhaps, whether you believe you have ultimately done something meaningful with your life. With work playing such an outsized role in a life, you may as well understand it as best you can. Hence this class. In it, we approach the question of work from the perspective of two disciplines: labor and employment relations and literature. The field of labor and employment relations asks about the social and economic forces-markets, compensation, globalization, immigration, etc.-that shape work. By contrast, the discipline of literature takes a more subjective approach to the question of work. Very broadly speaking, it shows how the forces that shape work play out in individual lives. In short, it shows how individuals feel about the work they do or, in the case of the unemployed, they do not do. Together, the two disciplines provide a global and personal perspective on one of the most important parts of our lives. Students registering for the course will read representative selections from both domains, engage in course discussions, take exams, and write essays as they explore the variety of ways both labor and employment relations and Literature can prepare them for their work lives and help them understand the place of work in culture and society.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "LHR 197: Special Topics", "department": "Labor and Human Resources (LHR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses offered infrequently to explore, in-depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "LHR 201: Employment Relationship: Law and Policy", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "LHR 201 surveys U.S. employment law. It begins with an overview of general legal concepts necessary to understanding the US legal system. It next examines the employment relationship and the employment contract, cornerstones in the field of employment law. In the main body of the course, students examine major state and federal labor and employment statutes, regulations, and cases that create employer and employee rights and obligations beyond those the parties have negotiated for themselves. This part of the course covers such topics as anti-discrimination law, wage and hour regulation, benefit and leave requirements, safety and health enforcement, workers' compensation systems, and the growing use of employer-mandated arbitration of statutory employment rights. Overall, the course analyzes workplace law problems from the different policy perspectives of employees, unions, employers, and the public. As appropriate, it introduces students to the economic, political, and social forces (both historical and contemporary) that influence the content of workplace law.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "LHR 202: Understanding Employee Behavior", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The course will be offered at an introductory level. It is designed to encourage students to explore individual and group behavior at work. The ability to describe, explain and analyze concepts in this course is critical to appreciating the dynamics that determine organizational outcomes. In this context, students will learn basic tools that will assist them in developing management, supervisory and leadership skills. Because the concepts from this course are the foundation of human resource management and employee relations, it is essential to master them in order to be an effective human resource management or employee relations professional. The conceptual learning in the course will include individual differences, diversity, attitudes, fairness perceptions, motivation, decision making, leadership, teams, negotiation, organizational culture and its role in the external context.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "LHR 304: Labor and Employment Relations Fundamentals", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The course surveys the main elements of modern labor and employment relations systems in the U.S. and beyond. The course encourages students to use a framework for evaluating workplace outcomes according to three yardsticks: efficiency; equity; and voice. Focusing primarily on employee voice, the course introduces students to a variety of mechanisms that bring democracy, worker engagement, and worker influence to the workplace. Among these mechanisms are U.S.-styled collective bargaining, non-union systems of worker involvement, European works councils, and a new variety of \"alt-labor\" initiatives from around the world. In its single largest unit, the course focuses on U.S. workplaces, beginning with the historical and legal foundations of the modern U.S. labor relation system. This includes units examining union organizing campaigns, collective bargaining, and dispute resolution systems. Concluding weeks of the course look at issues surrounding the push for workplace flexibility, a comparative labor relations look at other country practices (include European works councils), emerging issues in global supply chains, \"alt-labor\" institutions and practices, the role of gender, race, and diversity initiatives at work, and the impact of automation and artificial intelligence on the future of work.", "prerequisite": "LHR 100"}, {"course_name": "LHR 305: Human Resources Fundamentals", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course will provide students with an opportunity to understand and apply important concepts concerning human resources in the workplace. Students will learn to think of the issues in the class from both the employees' and organizations' perspectives. The course begins with a description and analysis of the role human resource managers play in supporting employees' personal needs as well as an organization's strategic objectives. The discussion traces the changes in that role historically, as well as the  contemporary understanding of HR's part in helping stakeholders succeed. Against this backdrop, students will study three critical variables affecting HR's involvement in management: the individual; the organization; and, the law. Each of these foci illustrates variables with which HR managers must contend. The course presents these variables through a variety of lenses: law, psychology, sociology, history and literature. Students will also spend considerable time studying the various functions HR plays in recruiting, selecting, training, evaluation, compensation, labor relations and safety. In these portions of the class, students will learn to understand the functions not only from the organization's, but also from the employees' perspective. The discussion of functional areas will end with application of the concepts studied to the global business environment in which HR increasingly operates. Throughout students will not only learn the mechanics of, for example, the selection process, but how processes support an organization's and individual's pursuit of their unique purposes. Consistent with the liberal arts environment in which LHR students enroll, the final project requires students to apply the concepts learned concerning the HR function to their everyday lives, helping students to reflect on the difference HR processes can have on both the organization but equally important on the employee. As a Gen Ed course (GS), the course qualifies as a Bachelor of Arts (B.A.) course consistent with the B.A. Fields category.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "LHR 312: Employment Relations to Research Methods in Labor and Employment Relations", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The objective of this course is to enhance students' abilities to use a range of methodologies to evaluate and conduct research in the field of employment relations and human resource management. LHR 312 Employment Relations to Research Methods in Labor and Employment Relations (3)(BA) This course meets the Bachelor of Arts degree  requirements. The objective of this course is to enhance students' abilities to use a range of methodologies to evaluate and conduct research in the field of employment relations and human resource management. It covers core concepts such as the scientific method, literature search, the logic of hypothesis formulation and testing, measurement, sampling and data collection methods, and basic statistical analysis. To accomplish these objectives, the course utilizes readings, lectures, class discussions, exercises and assignments, student presentations, and examinations.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 400: Comparative Employment Relations Systems", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Analysis of structure and elements of employment relations systems in developed and developing areas. LHR 400 Comparative Employment Relations Systems (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course explores contemporary topics in employment relations in the world. The course examines seven examples of employment relations systems, each carefully chosen to illustrate important variations in employment relations practices. It also provides an overview of economic globalization and its impact on employment relations. Topics include global sweatshops, child labor, the diffusion of human resource practices, and corporate social responsibility. The first country case is Germany, which provides an example of a country with strong national unions and a highly developed system of works councils. The Swedish case exemplifies a long-tradition of centralized bargaining and tripartite relations that is now in transition. The third case, Japan, illustrates some of the initial experiences with team work, just-in-time production, and employee commitment through job security and training. China offers an example of a socialist system in transition that has become an economic powerhouse through massive export processing zones, government controlled unions, and wage competition. Brazil provides an important example of a Latin American country with a state dominated employee relations system. South Africa offers a case of highly politicized employment relations in a country in transition from extreme racial segregation to a democracy. Finally, India represents Asia's other economic powerhouse, with an English speaking workforce that is drawn to the booming call center industry and export-oriented production. The second half of the course looks at broader themes related to the topic of globalization. Sweatshops in Mexico and child labor in India examined alongside the diffusion of high-end human resource practices in Brazil. In this section, student will also study inter-governmental institutions such as the World Trade Organization, and the International Monetary Fund. The final unit of this section examines the topic of Corporate Social Responsibility (CSR), recent attempts by corporations -at times in coordination with labor unions-to establish basic sets of rules or standards for their employees wherever units of the corporation might be located in the world today.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "LHR 401: The Law of Labor-Management Relations", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Development of Anglo-American law regulating collective bargaining, with emphasis on American labor-management relations under Wagner, Taft-Hartley, and other acts. LHR 401 The Law of Labor - Management Relations (3)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine the evolution of labor law in the United States. The N.L.R.A. itself, and the decisions of the National Labor Relations Board (N.L.R.B) and the courts, will be examined in order to gain an understanding of the current legal framework underpinning our system of labor-management relations. Major issues to be examined include the rights of employees to union representation; the formation of bargaining units; the conduct of organizing campaigns and elections; the duty to bargain; strikes, striker's rights, and lockouts; picketing, boycotts, and related activity; the enforcement of collective bargaining agreements and the duty to arbitrate; union members' rights and responsibilities, the duty of fair representation; and federal-state relationships in labor relations. Also covered in the course will be the legal framework for public sector labor-management relations, with specific attention paid to Pennsylvania Acts 111 and 195. The course will be taught from a liberal arts perspective, meaning that societal factors influencing the law-history, politics, and economics -will be emphasized. Student performance will be evaluated by means of tests, short papers, and such reports as may be required. This course is complementary to others in Labor Law, including LHR 434, Collective Bargaining and LHR 435 Labor Relations in the Public Sector. The course requires no special facilities or equipment; however, students enrolled are expected to have computer skills sufficient for communication and word processing purposes.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 403: International Human Resource Studies", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Course exploring human resource management from an international perspective. LHR 403 International Human Resource Studies (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course on International Human Resource Management expands beyond the traditional disciplines of HRM through a broader consideration of the impact of national contexts on these areas of organizational practice. The first question addressed is whether 'HRM' actually means the same thing in different countries, especially given that the term 'HRM' was developed from US management practice and scholars. This opens the discussion as to how institutions and culture at the national level help to shape management practice. As organizations become increasingly global, these issues of national culture and institutions can often stand in the way of a seamless progression of HRM across national boundaries. From a national culture perspective, the course compares how people in different countries see themselves and others around them, and how expectations, values and beliefs can differ in the workplace. This understanding is drawn from frameworks of national culture which describe the culture's multiple dimensions. This enables students to identify why and how it may be different working with colleagues from other cultures, as well as understanding the implications this can have for designing appropriate HRM practices. From a national institutions perspective, the course compares how institutions such as legislation, state intervention, trade union influence, education systems, and the respective power of shareholders versus stakeholders can impact on patterns of HRM and employee relations practices in different countries. For example, comparisons are made between economies with very high levels of employment regulation, explaining local employee rights and benefits, and those in which firms have more autonomy to choose how to manage their employees. From a strategic perspective, the course looks at how multinational enterprises are managing this cultural and institutional complexity, making strategic choices in international HRM to ensure they achieve the ultimate balancing act of thinking global but acting local. It considers different strategies firms might take (from complete standardization of HRM to complete localization) and how this then translates into different roles and activities for the IHRM function. This section also explores how these firms manage their international staff (expatriates), as well as finally exploring ethical issues around outsourcing activities to lower cost countries, and the impact of a more globalized workforce on diversity and work-life balance issues.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "LHR 409: Leadership Development: A Life-Long Learning Perspective", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The course examines the continuing influence of social and environmental factors in shaping leadership and leadership development. LHR (OLEAD) 409 Leadership Development: A Life-Long Learning Perspective (3)(BA) This course meets the Bachelor of Arts degree requirements. Current social conditions, such as financial crises, ineffective solutions to local, national, and international problems and corrupt leaders, call for more effective and ethical leadership on a broad scale. The positive and moral transformation of social institutions requires active participation and leadership of more authentic transformational leaders. This course will discuss authentic transformational leadership development from a life span developmental perspective. More specifically, it will focus on how an individual develops his/her leadership skills, potential, and capacity in his/her childhood, school, social organizations, colleges, and work organizations. The primary purpose of this course is to help students understand how family, educational, and other environmental factors have helped and/or will help them develop their transformational leadership potential and leadership effectiveness, in addition to gaining a better understanding of their strengths and weaknesses in respect to personality, individual difference, motivation, values, emotions, self-awareness, and identity. The fundamental objectives of this course are to help students 1) increase self-awareness; 2) to help students to know more about their sense of self, including self-identity, self-awareness, self-efficacy, and other types of self-concepts; 3) to understand the effect of life span influences in an individual's leadership development.", "prerequisite": "OLEAD 100", "other": ["Cross-listed with: OLEAD 409", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 410: Employment Strategies for People with Disabilities", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Develop knowledge, skills, and resources necessary to understand and practice effective employment strategies in working with people with disabilities. This course is designed for students to develop knowledge, skills, and necessary resources to understand and practice effective employment strategies in working with people with disabilities, including individuals from culturally diverse backgrounds. Students will develop skills on networking with employers (e.g., social media, professional organizations, interviewing employers, etc.) for building professional contacts and networks. Various forms of labor market information will be analyzed to identify both challenges and opportunities for people with disabilities in different sectors of the labor market (primary and secondary). Throughout the course, students will learn about disability issues in the workplace (e.g., laws, policy, stigma, accommodations, etc.). A strong emphasis will be on understanding how laws and policies impact employment for people with disabilities, and students will identify legal and illegal practices. Best employer practices will be identified regarding mitigating disability impact on both employees (current and future) and employers. This course will incorporate Assistive Technology (AT) applications so students will be able to identify appropriate AT devices to assist people with disabilities in obtaining and retaining employment along with applicable strategies for working with employers in developing employment opportunities in today's changing world of work. Students will understand how disability is a critical component of workforce diversity and strengths people with disabilities bring to the workplace. Students will identify how people with disabilities should prepare for the employment process including training opportunities (formal and informal), resume development, interview preparation, and initiatives to promote increased employment outcomes. Different disability populations (e.g., youth, Veterans, aging workers, etc.) will be discussed including common barriers for employment as well as how to create opportunities in different employer settings.", "prerequisite": "LHR 100", "other": ["Cross-listed with: RHS 410"]}, {"course_name": "LHR 426: Staffing and Training Strategies in Organizations", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course focuses on the theory and practice of human resource staffing and training in organizations. It provides the conceptual framework for understanding the staffing and training function as a factor of production and service. For this we will discuss policies and practices designed to attract, retain, and motivate employees. It explains how staffing and training can be used as a competitive weapon. For this we discuss how human resource policies and practices can be targeted towards achieving business objectives. This should inspire you to think of the connection between employee effectiveness and profitability. The course also provides the government regulations that impact staffing and training practices. The course uses lectures, group discussion, and in-class exercises to impart these concepts.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 427: Understanding Business Processes for LHR Professionals", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course examines human resource management (HRM) and employment relations (ER) from a strategic perspective embedded in a complex and evolving organizational system. To be effective, students must understand how different organizational strategies interface with the entire set of HR/ER practices put in place. This approach also requires an ability to connect business functions, governance, organizational metrics and financial considerations with investments in the broader HR/ER system. The goal of this course is to build business acumen by providing a foundational understanding of the components of a strategic and proactive HR/ER system. Through active learning, this course will encourage the development of analytical skills, personal competencies, and in-depth understanding of how various HRM and ER parts work together to shape organizational success. Students are more effective in their roles when they understand organizational strategic typologies, business functions, and governance structures that can affect the structure and implementation of the HRM/ER functions. Other topics include vertical and horizontal integration of the supply chain, and mergers and acquisitions, both of which are important to the work context. Basic finance and accounting concepts relevant to HRM/ER such as profit and loss statements, balance sheets, and cash flow enable students to understand how managers and leaders make resource decisions. Students gain credibility with other organizational decision makers by better understanding concepts such as earnings per share, return on assets (ROA) and return on investment (ROI). Understanding the time value of money and implications for decisions regarding investments in people enables students to be more effective in decision-making roles. The goal is to provide students with the fundamentals of the business context as relevant to their roles as HRM and ER professionals. The use of metrics and measures to provide feedback to the organization and individual employees will be examined. The criticality of understanding appropriate metrics and the importance of finding or creating valid, reliable, and bias-free metrics is explored. Learning how to create balanced score cards and associated HRM/ER scorecards can provide actionable insight to all organizational stakeholders. Finally, exposure to conceptual frameworks related to ethics and risk assessment will enable students to apply such frameworks in an organizational context. The goal is to have HRM and ER students develop a deep understanding of perspectives, practices, and tools that connect HRM and ER policies and practices to an organization's context and strategy.", "prerequisite": "LHR 100"}, {"course_name": "LHR 428: Total Rewards", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course requires students to learn the link between company's strategy and compensation, and understand core policies necessary to develop effective compensation systems. The core policies include internal alignment, external competitiveness, and employee contribution. First, theoretical frameworks of human resource management and corporate strategies will be discussed to define the relationship between company's strategy and compensation philosophy. Students then will study how to establish internally consistent and fair pay levels for various jobs using techniques such as job analysis, job evaluation, and competency analysis. The course then will discuss how to collect and analyze salary data and covers 'pay for performance' where students learn the concept of performance management and various incentive practices at the individual, team, and organizational levels. The course will be finalized with the discussion of employee benefits. In this section, students will discuss various benefit options that companies can provide, and various legal issues.", "prerequisite": "LHR 100"}, {"course_name": "LHR 429: Conducting Workplace Investigations", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "A 400-level course that presents the incident management process in a manner that is relevant to managers, human resource professionals, and labor relations professionals. The course focus on that investigative process most critical in describing and explaining events such as,  - Accidents  - Harassment  - Altercations (fights, etc.)  - Abuse of patients/customers  The course will provide a framework for executing the various types of investigative tasks based on evidence-based best practices."}, {"course_name": "LHR 434: Advanced Collective Bargaining and Contract Administration", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course examines, at an advanced level, the theory, practice, and impact of the major phases of union organizing, collective bargaining, and contract administration. Upon completion of this course students should be able describe, explain and participate, at an advanced level, in the major phases of labor relations: union organizing campaigns; collective bargaining (including its preparation phases); grievance processing; mediation; and arbitration, as practiced in industries in the U.S. private sector subject to the National Labor Relations Act, as amended, and the Railway Labor Act. Students will also develop concrete negotiation and grievance administration skills and have the opportunity to apply those skills, with the benefit of observations and feedback. Part I of the course reviews the structure of collective bargaining, the determination of bargaining units, and theories of effective labor negotiation. Further foundational study looks at the law applying to the determination, compositions and scope of bargaining units, as well as the law of collective bargaining, grievance handling, and arbitration. The main body of the course introduces students to different schools of effective technique in the negotiation of labor disputes. Part 2 of the course examines the subjects and processes of collective bargaining in detail. In this portion of the course, the course requires small teams of students to conduct out-of-class exercises. The first asks students to resolve a dispute over bargaining unit determination. In this phase of the course, teams of students negotiate a comprehensive new collective bargaining agreement in a hypothetical (simulated) case study. Similarly, students will conduct an exercise in the processing of grievances through a grievance procedure and, in some case, ultimate arbitration. In the latter procedure (arbitration), students will role-play in union representative, management representative, and arbitrator roles, assigned to writing either advocates' briefs or an arbitration award. The course will also include an exercise in the mediation/conciliation of a labor dispute", "prerequisite": "LHR 304", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 435: Labor Relations in the Public Sector", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Analysis of labor relations problems within different areas of public employment. LHR 435 Labor Relations in the Public Sector (3)(BA) This course meets the Bachelor of Arts degree requirements. Upon completing this course, students should be able to identify the legal frameworks that govern collective bargaining between employers and unions in federal, state and local governments. Students should also be able to explain the process of collective bargaining in the government sector and the special circumstances that make public sector bargaining different from private sector bargaining. At course end, students should be able to identify the parties involved in public sector bargaining, including those involved in dispute resolution, and explain their priorities in the labor relations process. Students should come to understand and articulate the reasons why it is important to study and more fully comprehend the public sector labor relations process. Together, we will explore the distinctions between public and private sector employers that impact labor relations in the public sector, in order to better understand those distinctions. Also, we will explore the principal historical differences between negotiations in the public and private sectors, in order that students can better articulate those differences. In addition, we will work to understand the principal arguments for and against the right to strike for public sector employees, as well as other impasse resolution processes. Finally, we will work to identify and discuss the challenges facing public sector labor relations in the near term and in the intermediate term.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 437: Workplace Dispute Resolution", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Dispute resolution practices and procedures used in the workplace and employment law settings. LHR 437 Workplace Dispute Resolution (3)(BA) This course meets the Bachelor of Arts degree requirements. This course examines dispute resolution procedures in unionized and nonunion workplaces. The course begins with an examination of grievance procedures in unionized workplaces and the system of labor arbitration. The second major theme of the course is an examination of the design and use of nonunion workplace dispute resolution procedures. Finally, the course will look at procedures for resolving employment law disputes and the major public policy debates surrounding mandatory nonunion arbitration procedures. A key objective of the course is to enable students to both understand and think critically about different alternative dispute resolution procedures and their role in employment relations. As part of achieving this objective, the course will include simulated dispute resolution exercises to provide students with experience in using techniques such as arbitration, mediation, and peer review. This course builds on and is complementary with other coursework in Labor and Employment Relations in the areas of employment relations, employment and labor law, and human resource management. It also compliments courses in other departments in the area of dispute management and resolution, including the Minor in Dispute Management and Resolution. LHR 437 may also be taken as an elective by students in the MS in Human Resources and Employment Relations and compliments coursework in the graduate program.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 444: Workplace Safety and Health: Principles and Practices", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The role of employees, unions, employers, and government in dealing with work-related safety and health issues. LHR 444 Workplace Safety and Health: Principles and Practices (3)(BA) This course meets the Bachelor of Arts degree requirements. Workplace Safety and Health: Policies and Practices focuses on the roles of employees, unions, employers, and government in addressing work-related safety and health issues. The course will introduce students to the three interrelated fields of workplace safety, workplace health, and environmental protection. Students will be provided with an overview of key issues within these fields and gain an appreciation for their importance within the workplace. Students will also become familiar with the fundamental concepts involved in the management of workplace safety and health issues. LHR 444 satisfies requirements within the Labor Studies and Employment Relations major and may be taken as an elective. LHR 444 is complementary to other courses dealing with employee relations and legal principles within the workplace.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 450: Developing a Career in Human Resources or Employment Relations", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The overall goals for this course are to enhance student awareness of aspects of themselves that are related to career success and satisfaction, guide student exploration of the world of work, and equip students with strategies for finding an optimal career match in the world of work. More specifically, this course will help students to increase awareness of their strengths, values, interests, and personality thereby helping students to make informed decisions to select and prepare for the next step in their career. Students will research the world of work through information interviews. They will learn how to develop and deploy a personal brand, including resume, cover letters and elevator pitches. Students will apply the career planning resources available through Penn State Career Services, the Liberal Arts Career Enrichment Network, and the Labor and Human Relations Department to their job and internship searches. Students will learn about career management skills from notable and distinguished alumni. Students will improve interviewing skills and prepare for a wide range of interview challenges. Students will integrate prior self-assessment results to summarize the professional assets that each student offers to employers. They will define their unique differentiators and identify the primary motivator that drives them. They will chart five year career goals and draft a development plan for realizing those goals. These steps will help students to begin the life-long process of managing their career in a systematic and proactive manner. Students will be introduced to the various career service options available to them at Penn State including: Penn State Career Services, Liberal Arts Career Enrichment Network, Nittany Lion Careers, and the resources available to them in the School of Labor and Employment Relations. They will also participate in the Strengths Finder Assessment, which is a tool to identify skills in which they exhibit high levels of strength. The following Career Readiness Competencies will be addressed by this course: Critical thinking and problem solving. Students will also strengthen their oral and written methods of communication. The role of digital technology in a career search will be discussed. Career Development Processes will be covered in this course. Resume and cover letter writing will be addressed. Students will learn to develop a network through avenues such as LinkedIn, networking events, information interviews, and connecting with alumni. Students will develop interview skills. Students will receive guidance on developing effective job search strategies, including job offer negotiation, skills and qualities employers are seeking, and career decision making."}, {"course_name": "LHR 452: Human Resources and Employment Relations in Tech", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Students will study the theory, practice, and controversies related to human resources and employment relations in the tech sector. This course will explore how organizations manage the people who produce technology and compare human resource management (HRM) practices in the tech sector to those from industries not based on knowledge resources. We further investigate the role organizational culture and leadership play and introduce students to the relevant public policy debates concerning the organization of work and HRM practices in tech. The course culminates in visits to a variety of U.S. tech companies and meetings with tech employee representatives to build and extend the insights learned in the classroom.", "prerequisite": "9 credits in LER"}, {"course_name": "LHR 458Y: History of Work in America", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "LHR 458Y, \"History of Work in America,\" a writing-intensive course, studies selected problems in the history of work in the United States. This course addresses economic, technological, social, cultural, and political aspects of employment and self-employment. Major topics of concern include methods of producing goods and services, work time, working conditions, the composition of the workforce, the changing functions of managers, the role of the state in shaping labor markets and regulating employment, the formation and actions of unions and other pro-labor organizations, and the relation of work to the family and other social institutions. In addition, students will undertake original research in primary sources and secondary literature, thereby learning something of historical research methods. The essay project is treated as a process, besides regular encouragement of students to submit a paper proposal, rough drafts, and a final draft. Students are advised that the instructor will read and comment on additional drafts as they care to submit. This section of LHR 458Y is a blended course. Some activities take place in the classroom, and other activities are conducted on Canvas.", "prerequisite": "LHR 100", "other": ["Cross-listed with: HIST 458Y", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "LHR 459: Collective Bargaining in Professional Sports", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "In this course, students will learn how collective bargaining works in professional sports and how it compares to bargaining in other industries. Students explore the process of collective bargaining in professional sports in the US and Canada. In particular, the course will examine how the application of leadership, leverage and resources by professional sports employers and their player employees' associations impacts the collective bargaining process and outcomes in each sport. This course will also focus on how the interaction of these three attributes has produced landmark collective bargaining agreements, as well as disruptive strikes, lockouts and litigation. This course will give context to present day professional sports collective bargaining by examining the history and structure of the players associations, the laws affecting professional sports bargaining, and the role of sports agents in the process. Students will have the opportunity to learn how professional sports bargaining illustrates universal lessons about the process of collective bargaining, and also how it is unique. Guest speakers with considerable experience in professional sports collective bargaining will give students in this course real world context and will afford them the opportunity to question actual professional sports collective bargaining practitioners.", "prerequisite": "LHR 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 460: Ethics in the Workplace", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "The course will explore ethics from both a normative and behavioral perspective. A key operating assumption of this course is that every employee of an organization has a responsibility to demonstrate ethical leadership. The course will emphasize the importance and applicability of shared mutual accountability. Four interrelated and mutually reinforcing subject areas will be explored in the course at the individual, organizational and transnational levels business ethics, ethics in unionized firms, corporate social responsibility, and sustainability. Students will develop their abilities to articulate their own moral values and to recognize and resolve ethical dilemmas within an organizational setting. Students will analyze situations using ethical theories and learn to advocate for particular management and labor relations approaches, practices and policies based on ethical considerations. While no one view of ethics is identified as \"best,\" students learn to recognize, evaluate, compare and apply different approaches. Students also will develop their abilities to identify, read, and explain academic literature related to the topic of ethical leadership from a management and employment relations perspective.", "prerequisite": "LHR 100"}, {"course_name": "LHR 464: Communication Skills for Leaders in Groups and Organizations", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Theory- and research-based communication skills for leaders dealing with work-related problems in contemporary groups and organizations. LHR 464 Communication Skills for Leaders in Groups and Organizations (3)(BA) This course meets the Bachelor of Arts degree requirements. LHR 464 Communication Skills for Leaders in Groups and Organizations is a survey of theory, research, and practice related to the communication processes by which individuals in groups and organizations exercise influence, whether or not they occupy positions of acknowledged leadership, and may be taken as part of an Labor and Industrial Relations major or minor, or as an elective by students in other disciplines. The course is offered once each academic year and has an enrollment limit of 40 students per offering. The course requires no special facilities. It extends to other courses in the major primarily in the areas of Industrial Relations and Human Resources. It is also complementary to courses focusing on groups and organizations in Sociology, Psychology, Management, and Engineering. During the course, students are exposed to a variety of theoretical perspectives on the study of leadership, learn about research illuminating its functions, and become acquainted with communication practices derived from and/or suggested by such theories and research that contribute to the exercise of influence and, thereby, effective group and organizational performance. These terminal outcomes define the objectives of the course. Focus will be on leadership as both role-elated behavior and goal-directed behavior, regardless of roles that members of groups and organizations occupy.", "prerequisite": "5th Semester Standing", "other": ["Cross-listed with: OLEAD 464", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 465: Collective Decision Making", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Application of theories of decision making to work-related issues in groups and organizations requiring collective resolution and action. LHR 465 Collective Decision Making (3)(BA) This course meets the Bachelor of Arts degree requirements. This course presents a broad overview of theories, research, and practices in decision making as related to work-related choice making in groups and organizations and is open to students majoring or minoring in Labor and Industrial Relations, as well as to students who may wish to use the course as an elective. The course is offered once each academic year and has an enrollment limit of 40 students per offering. It requires no special facilities. LHR 465 extends to other courses in the major, primarily in the areas of Industrial Relations and Human Resources. It is also complementary to courses dealing with decision making in groups and organizations in sociology, psychology, and management. Of particular interest are decision making practices, as well as theories that account for them, in single-motive situations (in which participants in the process are pursuing a common goal) and mixed-motive situations (in which two or more of the participants are competitively related, but must cooperate to achieve their objectives). Hence, the course deals both with (1) conventional decision making, as in the case of boards, task forces, problem-solving groups, and quality circles or teams, appropriate to single-motive situations and (2) processes, such as bargaining, negotiation, and dispute management/resolution, appropriate to mixed-motive situations. The course also deals with the influence of organizational culture on decision-making in both types of situations. Upon completing LHR 465, students will have been exposed to a broad array of theoretical perspectives on decision making in groups and organizations, will be familiar with research testing these theories, and be aware of decision making practices suggested by theory and research that are useful in situations requiring collective choice and action. These terminal outcomes of the course reflect the objectives.", "prerequisite": "5th Semester Standing", "other": ["Cross-listed with: OLEAD 465", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 466: Labor Union Structure, Administration and Governance", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "American unions have long played an important role in the American economy. However, in the last forty years, the number of workers represented by unions has declined steadily. Within this same time frame unions have been looking at ways to restructure in order to increase their strength if not to just survive. This includes organizing workers beyond their traditional membership, merging with other unions, and reorganizing union hierarchy. It also includes looking at ways to reconnect and mobilize existing members; motivating them to become more committed to and actively involved in their unions. This course will look at the similarities and differences of union structure, internal and external rules of governance and examine best practices for effective union administration. The traditional labor movement's connection with new types of workers' organizations and non-unionized labor movements will also be explored. As they organize, structure, and govern themselves, labor unions must address and accommodate to the diversity among actual and potential members of differing economic, social, occupational, and cultural groups. As students work through the topics outlined above, they will examine whether and how the US labor movement succeeds, or sometimes fails, at creating representational structure that attracts and mobilizes workers of professional-, middle- and lower classes, skilled and unskilled occupations, immigrant and native born, and different genders and races. This course asks: how does one create the kind of union structure and governance that best achieves social justice and progress? At the conclusion of the course students will be able to: - Describe and analyze the primary ways in which unions have structured their activities at the local, national and international levels; - Describe the manner in which union members interact within the governance processes common in the labor movement; - Analyze the relationship between union administration and governance with respect to the legal framework within which unions must operate; - Develop plans to attract employees to join a union and develop tools to effectively socialize new members as effective contributors in pursuing legitimate union objectives. - Articulate the variety of ways in which leadership emerges within the labor movement and how leadership affects the labor movement's ability to successfully interact with the political, social and economic factors influence union success. Students will be able to link these concepts to related courses in the LER major and minor classes addressing collective bargaining and employment relations. They will also find connections to the College of the Liberal Arts and the Smeal College of Business. Courses in related disciplines: Management; Political Science; Psychology; History; Economics.", "prerequisite": "LER 100", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"course_name": "LHR 468: American Labor Unions", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "This course will explore the current state of American labor unions and the historical, cultural, legal, political, and economic contexts within which they operate. In addition, we will examine alternative organizational forms through which U.S. workers organize including cooperatives, worker centers, living wage campaigns, and digital platforms. Among the subjects that students will analyze are the US public's perception of unions, the recent increase in political resistance to US public employee unions, the relationship between rising inequality and declining U.S. labor union membership, shifting union attitudes toward immigrant workers, the impact of globalization on U.S. unions, and how U.S. unions compare to those in other parts of the world. We will also analyze how divisions of class, gender, race, sexuality, and nationality shape the U.S. labor movement today. Finally, we will discuss pressing contemporary issues such as the rise of the gig economy, 2019-2020 strike wave, the Janus v. AFSCME decision, and the impact of the COVID-19 pandemic on U.S. workers. Guest speakers, who are union practitioners, will provide students with the opportunity to question elected union officers and staff and will provide real world context to the course readings. This course will give students a fundamental understanding of how U.S. unions are structured and operate, and how those unions both impact and are impacted by the U.S. and global economies.", "prerequisite": "4th semester standing"}, {"course_name": "LHR 472: Work-Life Practices and Policies", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Explore the causes and consequences of conflicts between work, family, and other life commitments, and how these may be resolved. LER 472 Work-Life Practices and Policies (3)(BA) This course meets the Bachelor of Arts degree requirements. The interdisciplinary field of work-family and work-life developed as a result of middle-class women's entry into the labor force, a movement that generated conflict between family and paid work commitments. Overall, the course addresses the reasons the field developed, relevant theoretical perspectives regarding the issues, and related problems as well as proposed solutions at both the public and private sector levels. The overarching objectives of the course are to expand students' understanding of conflicts between work and family commitments, and how these might be resolved through private and public sector initiatives. Specifically, the course concerns how individuals, families, and organizations interact to help hinder the achievement of balance between work and life commitments, and relevant effects on those involved. The changing demographics of the family, laws and trends around working time, father and mother time with children, the expanded need for elder care, work-life programs such as flextime, concierge services, paid parental leave, part-time careers, paid time-off banks, and the role of unions, corporations and government legislation are covered. The course attempts to link the likely future needs of students to broader trends in society and how balance could be achieved at the level of individuals, families, other stakeholders in the community, and for society as well. Fields of research relevant to the course include labor studies, women's studies, Industrial/Organizational psychology, the sociology of work and of family, and child development. Students will be evaluated on the basis of class participation, through two in-class examinations, and through a final written or oral project providing a chronology and analysis of an adult's work-family history.", "prerequisite": "3 credits in LER/LHR", "other": ["Cross-listed with: SOC 472, WMNST 472", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 475H: Labor in the Global Economy", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits/Maximum of 3", "description": "This course focuses on how the nature of work is changing in the global economy, and the implications for economic opportunity and inequality in both . LER 475H Labor in the Global Economy (3) This seminar focuses on how the nature of work is changing in the \"new economy\" and the implications for economic opportunity and inequality. Sections of the course examine: theoretical approaches to understanding contemporary process of labor restructuring, including globalization, rise of multinational corporations, and growth in global supply chains; case studies of restructuring processes; and innovative labor organizing initiatives at a local, regional and global scale. This course aims to develop a framework for understanding the nature of contemporary processes of economic restructuring and its impact on the world of work. Case studies will provide a deeper understanding of how broad macro-level changes in the nature of contemporary capitalism are mediated by a variety of technological, political, and socio-economic factors in particular industries and geographic contexts. The case studies section of the course will also examine business ethics and corporate social responsibility initiatives. Finally, an in-depth look at workers' responses to these changes at different scales (local, regional, global) will help deepen our understanding of the contested nature of workplace restructuring while exploring promising strategies for improving working conditions. This is a reading-intensive course dealing with the theoretical literature on rapid economic restructuring and how this is shaping work and employment.", "prerequisite": "6.0 credits of LHR and 6th Semester standing", "other": ["Honors"]}, {"course_name": "LHR 480: Current Issues in Human Resources", "department": "Labor and Human Resources (LHR)", "credits": "3 Credits", "description": "Identity and race, gender and heritage, centrality and marginality, self and other, as expressed in literary works from around the world.  Students will study current trends that are shaping human resources management. These trends include information technology, internationalization, new organizational forms, changing demographics, and competitive landscape. Examples of topics include use of social media in human resource management, virtual work, managing an aging workforce and working across international boundaries. The course is case based and as such explores experiences of actual companies. Students will study and discuss the strategies, successes and failures of companies and how these issues and challenges relate to the human resources function. Timely readings that expose students to theoretical structures underlying these changes will be part of this course. In addition, because this is a current issues class, students will be expected to actively follow trending news in the business world through news media and critically examine how it is shaping the human resource management practices. This course will serve as a complement to MGMT 100, 341, 441 and LER 100, 201, 401 and 434.", "prerequisite": "LHR 305"}, {"course_name": "LHR 494: Research Project", "department": "Labor and Human Resources (LHR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 494H: Research Project", "department": "Labor and Human Resources (LHR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"course_name": "LHR 495: Labor Studies Internship", "department": "Labor and Human Resources (LHR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised practicum in labor relations setting with union, management, or government agency.", "prerequisite": "3 credits of LHR and Prior approval by department", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 496: Independent Studies", "department": "Labor and Human Resources (LHR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 497: Special Topics", "department": "Labor and Human Resources (LHR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "LHR 499: Foreign Studies", "department": "Labor and Human Resources (LHR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}]