[{"course_name": "LLED 5: College Reading Improvement I", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Improvement of basic reading skills: vocabulary development; literal and interpretative comprehension; application of these skills more efficiently to college work."}, {"course_name": "LLED 10: College Reading Improvement II", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Development of higher level comprehension, vocabulary, and study skills incorporated into content area reading."}, {"course_name": "LLED 215N: Children's Picture Books as Multimodal Texts", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Children's picture books are often described as fundamental in nurturing the development of young children into engaged readers and fearless writers. Many adults have a special place in their hearts for picture books they loved as children; books they read over and over again, books that spoke to their hearts and minds, and books that helped them figure out the mystery of written language. In this inter-domain course, we will take a close look at children's picture books and explore their magic though integrating humanities and the arts. We will read many, many books of different genres to examine how the written text and illustration work together to compose a work of art that we read, understand, enjoy and connect to. We will explore the criteria by which we judge the literary and artistic quality of picture books and will become acquainted with resources that can help us find exceptional books. We will also consider the significance of children's literature representing diverse perspectives and will work to deconstruct the values and biases implicit in texts written for young children. Much of the course will be organized in a workshop format through which we will learn about the authoring and illustrating techniques and processes used by notable authors and illustrators of modern children's picture books, while also experimenting with the same techniques through drafting and developing our own picture books. Our end goal will be to thoughtfully weave linguistic and visual composition elements to craft original multimodal texts for children.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "LLED 227: Understanding Childhood through Children¿s Literature: Books, Media, Toys", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "This course is transdisciplinary in nature, looking at the multiple ways children's cultures are constructed in contemporary and canonical literature for children, transmitted through films, games, and toys. It blends approaches that consider art, history, politics, popular culture, and technology, as bases of inquiry into children's cultures and childhood. It also considers other classic and contemporary texts for young people. The course opens with students' initial understanding of childhood in their unique cultural spaces and settings. It then proceeds to discuss the dominant perceptions of childhood and their possible implications for how society considers the roles of children and their cultures. It recommends critical multiculturalism as a possible theoretical lens to examine how creators of children's texts construct and imagine children, children's cultures and/or childhood. The course also offers a brief history of children¿s literature. The last half of the semester explores other texts side-by-side children's books from various cultures to enable students to ponder myriad childhood and children's cultures under exploration in the different texts. What patterns do they notice? How might this enable them to further understand the complex nature of children's cultures? Course assignments include designing an artifact that is representative of an aspect of children's culture from course materials.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "LLED 235: Chinese Culture in Child Lit", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Children's literature reveals how a culture imagines itself and offers a window into other cultures for young readers. What a child reads and what is read to the child shows the values the child's nation holds dearly. However, in this rapidly changing world, national culture is fluid, ever changing and mixing with other cultures. Being a global citizen and a potential educator for children requires some level of familiarity with a diverse array of cultures. This course will introduce you to traditional Chinese culture and explore its representations in western children's literature. The class will first delve into the works of Confucianism, Taoism, and Buddhism adapted for children. You will study the impact of these intellectual schools in Chinese society and develop a broad and coherent understanding of Chinese cultural values. From there, the class will examine western children's literature, focusing on voices that echo with or differ from Chinese culture. For example, Ursula K Le Guinn, author of the Earthsea fantasy series, claims that her work was inspired by the Taoist ideas of balance and equilibrium. Other western authors may not claim as fans of Chinese thinking, however, their works clearly echo with Chinese values and thus have been received by Chinese parents and children warmly. For instance, Winnie-the-Pooh is a model of a western Taoist, as observed by Benjamin Hoof, the author of The Dao of Pooh, for Pooh's simplicity and non-action. The spider in Charlotte's Web exemplifies the Confucian ideal of being faithful to friends. The Little Prince plays the mystery of Buddhist nirvana. Some western ideas may seem strange in traditional China such as the idea of the Savior. However, this idea has now become well-known through Aslan the Lion created by C. S. Lewis in The Lion, the Witch and the Wardrobe. Since the early 20th century, western literature has quietly entered and enriched Chinese culture. By expanding your knowledge of traditional Chinese values, you will develop new perspectives to western children's literature. In the second half of the semester, you will write and illustrate a picture book embedded with your understanding of Chinese culture. You will design a curriculum appropriate for a preschool or early elementary classroom. Doing so, you learn how to help children appreciate different cultures, enhance their critical thinking through literature, and become aware of the connectedness among humans across the world.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "LLED 296: Independent Studies", "department": "Language and Literacy Education (LLED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "LLED 297: Special Topics", "department": "Language and Literacy Education (LLED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "LLED 400: Teaching Reading in the Elementary School", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Introduction to the reading program; acquaintance with materials and techniques; observations of reading instruction; correlation with human growth and development. LLED 400 Teaching Reading in the Elementary School (3) LLED 400 is intended to help teacher candidates become knowledgeable users of theory and about language, literacy and culture; and to think through instructional problems thoroughly, using multiple sources of information to experiment with alternative solutions. Dealing specifically with reading, we recognize that text goes beyond print texts to include multimodal visual, auditory, digital, movement, and artifactual texts. In LLED 400, candidates learn to understand how children develop as readers and users of literacies in and out of school. Candidates learn how to teach in ways that support children's successful development and uses of multiple kinds of literacy, including reading. Literacy teaching is both an intellectual and practical matter in which teachers work with students in ways that recognize the complexities of language and its social uses, learning and its cultural contexts, and schooling as organizational phenomena. Children enter schools with multiple types of literacy knowledge and cultural experiences. Coming to understand these complexities requires the coordination of both theoretical awareness and applied knowledge. Candidates' practice is developed as they learn to address the puzzles children present as they construct their knowledge of language, literacy, and literature in various social situations. Developing practical strategies to teach literacy requires a dedication of head, hand, and heart to treat all people with dignity, acknowledging the contributions of all cultural groups and respecting diversity as it honors ideals of social justice. In LLED 400, teacher candidates develop a repertoire of organizational, instructional, and evaluative strategies that are based on research and best professional practices. Candidates work on projects independently and in collaborative groups. Content is presented by the instructor through a combination of lectures, weekly readings and reflections on readings, class discussion, activities and demonstrations, and viewing and analyzing video. Projects include an analysis of children as readers and curriculum planning. A field experience connected to LLED 400 and LLED 401 affords teacher candidates the opportunity to inquire about children's encounters with literacy in elementary grade classrooms. LLED 400 is part of a block of courses in a PSU teacher education program that is unified by the basic set of principles supporting the development of a broader and more inclusive understanding of texts, children, and communities.", "prerequisite": "LLED 401"}, {"course_name": "LLED 400H: Teaching Reading in the Elementary School", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Introduction to the reading program; acquaintance with materials and techniques; observations of reading instruction; correlation with human growth and development.", "other": ["Honors"]}, {"course_name": "LLED 401: Teaching Language arts in Elementary School", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Principles, problems, materials, and techniques involved in teaching speaking, listening, writing, and reading in the elementary school. LLED 401 Teaching Language Arts in Elementary School (3) The purpose of LLED 401 is to acquaint teacher candidates with theories and practices of teaching writing. Candidates are immersed in the study and experience of workshop and strategic models of writing instruction. Basic goals of this course are to help candidates to use language well and thoughtfully concerning writing instruction, literacy, literature and culture; and to think through instructional problems thoroughly, using multiple sources of information to experiment with alternative solutions. We also expect candidates to understand the roles which culture plays in literacy practices, literature, identifications of \"ability,\" and schooling; to learn how people function effectively in groups; and to develop a repertoire of organizational, instructional, and evaluative strategies. A field experience connected to LLED 400 and LLED 401 affords teacher candidates the opportunity to inquire about children's encounters with literacy while learning alongside children and teachers in elementary grade classrooms. LLED 401 is part of a block of courses in a PSU teacher education program that is unified by the basic set of principles supporting the development of a broader and more inclusive understanding of texts, children, and communities.", "prerequisite": "LLED 400"}, {"course_name": "LLED 402: Teaching Children's Literature", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "The purpose of LLED 402 is to familiarize teacher candidates with different theories and practices of teaching literature. Candidates are immersed in the study and experiences of literature and strategic models of literature instruction. Understanding that belief systems inadvertently determine the models of literature instruction educators adopt. LLED 402 asks candidates to be mindful of the diverse nature of our communities, and encourages them to strive to create literary communities that respect, value, and encourage multiple modes of expressions. The basic course goals are to help candidates to understand the importance of story in all human lives; to exhibit a wide repertoire of flexible strategies for interpreting literature; to understand socio-cultural influences upon writing and literature; to know and be able to use basic reference tools and selection guides for research; to become familiar with different genres, diverse texts, and styles; to read for sequence and for secrets; to articulate responses to literature across a variety of media; to weave into the exploration of each of these goals a struggle to understand and to accept human difference; and to understand the role that literature plays in the school curriculum. The course presents theories of teaching literature and models of literature instruction that place at the center socio-cultural practices typical of democratic literary communities. This requires knowledge of how literature and texts work in real life and in a variety of social and cultural contexts. Informed by research, standards and current practices, LLED 402 exhibits the power of literature, the complexities of students' learning and experiences with texts, and the problem solving character of teaching.", "prerequisite": "4th Semester Standing Concurrent: LL ED400, LL ED401 for CEAED majors"}, {"course_name": "LLED 411: Teaching Language Arts In Secondary Schools I", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Exploration of language, literacy, and culture and development of curricular designs for teaching language arts in secondary schools. LL ED 411 is designed to provide pre-service secondary English and communications teachers with the foundational experiences for inquiry into the relationships between language, literacy, and culture. Participants reflect upon personal experiences with language and school, examine secondary education perspectives in pedagogical and philosophical terms, build supportive relationships with colleagues to develop the best curricular and instructional decisions, explore the social, psychological, political, and economic aspects of language use and literacy practices in a country with diverse cultures, explore the construction of meaning and knowledge by the use of language and other symbolic systems of representing and sharing experience. A strong emphasis is placed upon the teacher as collaborator, risk-taker, and researcher, who tries new ideas, documents the classroom experience that results, and shares reflections with colleagues to help construct the best understanding for teaching language arts in secondary schools. Course work involves extensive reading, the production of artifacts of a variety of types (written, performed, multi-media) such as journals, reviews, viewpoints, and original research, all done by both individuals and small groups to pursue the course objectives.", "prerequisite": "5th Semester standing Recommended Preparation: Entrance to SECED major or graduate certification program"}, {"course_name": "LLED 412W: Teaching Language Arts in Secondary Schools II", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Exploration of language, literacy, and culture and development of curricular designs for teaching language arts in secondary schools.  LL ED 412W Teaching Language Arts in Secondary Schools II (3)This three-credit course addresses the theory, practice, and implications of teaching the English language arts at the secondary level. The course is the discipline-specific component of the Secondary Education block taken by majors in Secondary Education prior to student teaching. In this course, students explore issues in language, literacy, and culture and development of curricular designs for teaching language arts in secondary schools. Through in-class and out-of-class activities completed both independently and in collaboration, students read about, talk about, and practice teaching all of the language arts-reading, writing, speaking, listening, and thinking. Activities highlight ways of planning for instruction and ways of assessing student learning as teachers implement those plans. In addition, students will take up the professional issues facing beginning teachers of the English language arts-issues of professionalism and the teaching role, relationships with students, and how teaching can fit into a life. The course builds upon content developed in other courses in the major, including theories of reading, composition, media literacy, and pedagogy. Students engage in a variety of writing tasks both in support of developing course content and as a means of making their work public. This writing includes (but is not limited to) lesson planning, reflective writing on experiences both in the course and in related field experience, and the development of a professional portfolio. During class sessions, informal writing is used for a variety of purposes such as brainstorming, facilitating collaborative work, or framing discussion. Throughout the semester, students draft and receive feedback on a variety of portfolio components, which are revised and incorporated into a final version of the portfolio due at the end of the course. Portfolio contents vary according to instructor, but examples might include statements of educational philosophy, analysis of student writing from field experience, commentary on unit and lesson materials, reflective writing on reading and writing processes, and professional documents such as lesson plans and letters to mentors and potential employers.", "prerequisite": "LL ED411 or LL ED400; Concurrent: C I  412W", "other": ["Writing Across the Curriculum"]}, {"course_name": "LLED 420: Teaching Adolescent Literature and Literacy", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Exploration of adolescent literacy and curricular designs for teaching adolescent literature and literacy in secondary schools. LL ED 420 is designed to provide the personal experiences and inquiry with adolescent literature and literacy patterns essential for pre-service teachers. Participants reflect upon personal experiences with adolescent literature, examine critical education perspectives in pedagogical and philosophical terms, build supportive relationships with colleagues to develop the best curricular and instructional decisions, explore the literary character of adolescent literature, the representation of cultural diversity in the voices of adolescent literature, and the curricular design of experiences with adolescent literature in secondary schools. A strong emphasis is placed upon the teacher as collaborator, risk-taker, and researcher, who tries new ideas, documents the classroom experience that results, and shares reflections with colleagues to help construct a better understanding of using adolescent literature in secondary schools. Course work involves extensive reading, written documents of a variety of types (journals, reviews, reports, original research) done by individuals and small groups to pursue the course objectives.", "prerequisite": "5th Semester standing Recommended Preparation: Entrance for SECED major or graduate level certification pathway."}, {"course_name": "LLED 421: Teaching Writing in Secondary Schools", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "This course will provide preparation for teaching writing in the secondary school context. Students completing this course will meet the following objectives: -Understand one's own history as a writer and as a student in relation to the student's current and future practice in the teaching of writing -Articulate principles of a process approach to writing instruction and a workshop learning environment for writing, grounded in research and theory -Know and use strategies for supporting student writers as they work through writing processes -Differentiate writing instruction for students with varying backgrounds and needs -Access, evaluate, and use professional resources for writing instruction in ways that are consistent with principles grounded in research and theory Course content will include an orientation to writing processes, the social contexts of written genres, classroom environments for teaching writing, overcoming barriers to writing in adolescents, conferring and feedback, teaching the conventions of written English, and writing assessment. In addition, students in the course will engage in professional activities appropriate to a teacher of writing at the secondary level. To achieve these aims, students will engage in significant in-class and out-of-class writing activities. They will study examples of teaching practice and student writing from real secondary school classrooms. They will read and apply research on effective writing instruction. They will develop instructional plans and classroom resources for writing instruction. Finally, they will articulate stances for practice as teachers of writing as they begin their professional careers as teachers", "prerequisite": "5th Semester standing"}, {"course_name": "LLED 422: Teaching the Young Adult Literature Workshop", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "This course is designed to familiarize students with the genre and field of young adult (YA) literature and to provide a rationale and basis for practice for teaching adolescent literature in English Language Arts (ELA) courses utilizing a Reader's Workshop format. By the end of this course, students will be able to (a) Articulate a working definition of adolescent/YA literature; (b) Respond to a variety of YA literature texts individually and in a group to increase understanding, appreciation, and enjoyment of this literary genre; (c) Describe some of the trends and dominant concerns in the field of YA literature, including: multiculturalism, new/digital literacies, critical literacy, and censorship; (d) Choose YA texts appropriate for classroom use by gaining familiarity with a range of popular and/or award-winning YA literature titles; (e) Select YA texts that will stimulate interest, foster appreciation for the written word, and increase motivation of learners to read independently for pleasure and for personal growth; (e) Make and support claims about the use of YA lit in the ELA classroom; (f) Design lessons in the context of a reader's workshop approach; (g) Explore, evaluate, and select instructional materials and professional resources for teaching with YA literature; and (h) Demonstrate an awareness of culturally responsive literature teaching and an understanding of how cultural, linguistic, and ethnic diversity impact teaching and learning as these ideas connect to YA literature. This course engages essential questions in the teaching of young adult literature in the workshop format. First, it invites students to engage the question \"What is young adult literature (YA literature) or adolescent literature?\" This is particularly important as the YA category grows in quantity and importance. Second, students consider, \"How can we use YA literature to teach for social justice and social responsibility?,\" a question resonant with Standard Six of the National Council of Teachers of English's Standards for the Preparation of Teachers of English Language Arts. Students will consider in depth the advantages and the challenges of using YA literature in secondary classrooms. They will learn promising practices in adolescent literacy and teaching young adult literature as well as methods and materials that teachers can use to maximize engagement for all students. Finally, students will engage the linked questions of \"How can ELA teachers motivate students to read for pleasure and personal growth?\" and \"How do we humanize our YA literature teaching and teach for love, justice, joy, and wisdom?\"", "prerequisite": "LLED 420"}, {"course_name": "LLED 445: Teaching English in Bilingual/Dialectal Education", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Theories, techniques, materials for teaching English speaking, reading, and writing to bilingual and nonnative speakers in elementary and secondary schools."}, {"course_name": "LLED 450: Content Area Reading", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Study of reading skills and materials for specific content areas; diagnostic and instructional procedures for classroom teachers.  LLED 450 Content Area Reading (3) LLED 450 is designed to explore the roles of texts and literacies within the daily lives of middle school age students. We will examine both in-school and out-of-school literacy practices related to meaning-making in specific communities of practice. In doing so, we will work from a broader definition of \"text\" that includes print, images, sound, hybrid combinations and artifacts from popular culture. In school, we examine how literacies are involved in the learning of content, emphasizing how social practices of thinking in different ways about the world have been organized into school subjects and how teachers can help students to engage productively in those practices. Out of school, we look at the ways in which this age group uses text and other forms of literacy to make sense of and in their lives. Toward that end, we look closely at the media that they use and the types of texts that are produced for and by them. Although we honor the traditional practices of academic disciplines, we recognize how new texts and tasks ford those boundaries in order to pose and address school and everyday problems. The basic goals of this course are to help teacher candidates to use language well and thoughtfully concerning literacy, text, and culture; and to think through instructional problems thoroughly, using multiple sources of information to experiment with alternative solutions. We also expect candidates to understand the roles that culture plays in literacy practices, texts, schooling and assessments of \"ability\"; to learn how people function effectively in groups; and to develop a repertoire of organizational, instructional, and assessment strategies.This course considers how intermediate grades and middle schools are communities of practice that connect disciplines through the use of language and texts to make sense of the world. The communities surrounding schools influence these uses, and this course follows the students' learning outside the classroom and schools as well as within.", "prerequisite": "EDPSY 014; 6th Semester standing or Graduate Status or Non Degree Graduate Status"}, {"course_name": "LLED 462: The Art of the Picturebook", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "The Art of the Picturebook explores a wide range of picturebooks with the idea that illustrations are visual art evoking thoughts and feelings. Because picturebooks provide aesthetic experiences and contribute to aesthetic development, they are rich and important sources for literacy education. This course provides opportunities to extend students' repertoire of strategies for making sense of picturebooks, to deepen knowledge about picturebooks and the artists who create them, and to consider ways to help children become more sophisticated readers of picturebooks. While picturebooks are often emphasized as integral to the literacy development of young children, they can be engaging and desirable for older children as well. Course topics include picturebooks for the very young, as well as picturebooks that could appeal to elementary and middle school children. Whether picturebooks appear relatively simple and straightforward or contain innovatively complex or metafictive design elements, close readings of them with an understanding of terminology offer opportunities to express and discuss reactions and interpretations. The Art of the Picturebook provides students a forum for exploring preferences, ideas, insights, and questions about selected picturebooks, along with curricular and pedagogical considerations. Course readings include interviews with illustrators, selections about creating picture compositions, and scholarly essays presenting theoretical perspectives and ideas about picturebooks as literature and art for children's literacy development. This course emphasizes that reading and interpreting picturebooks is an active, creative process that is socially, culturally, and historically situated. Authors and illustrators are influenced by culture, so their art reflects values of that culture, consciously or unconsciously. A reader's experience with a picturebook is also influenced by cultural and social contexts in a given moment. Because engaging in aesthetic experiences is an active, creative process, reading picturebooks is, as Jane Doonan (1993), author of Looking at Pictures in Picture Books, asserts, a form of play. The Art of the Picturebook approaches picturebooks as sources of deep play. The course also provides opportunities to research selected illustrators, both for class discussions and an illustrator study project (e.g., a Wiki page). The culminating illustrator study project involves an in-depth investigation of a key children's book illustrator and a process of sharing works-in-progress with classmates for collaborative editing.", "prerequisite": "5th Semester standing"}, {"course_name": "LLED 464: Nonfiction Literature for Children and Adolescents", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits/Maximum of 3", "description": "Nonfiction Literature for Children and Adolescents explores a wide range of nonfiction literature in a variety of subject areas including social studies, math, science, and the arts. This course takes the position that reading nonfiction literature can inspire curiosity and a life-long love of learning, shape inquiry, nourish empathy and compassion, and inform agency. Topics include nonfiction as literature, resources for locating nonfiction literature, nonfiction literature in different subject areas, nonfiction literature as a catalyst for inquiry, creative nonfiction and hybrid texts, biographies and autobiographies, and nonfiction literature for agency. This course also examines techniques of writing nonfiction literature to develop an understanding of strategies that published authors use to create engaging works to inform readers and provide pleasurable reading experiences. This understanding can help adults who work with children and adolescents recognize and identify the qualities that they find desirable for selecting and sharing nonfiction literature with children and youths, whether shared for reading or serving specifically as mentor texts for writing.", "prerequisite": "5th Semester standing"}, {"course_name": "LLED 465: Fantasy Literature for Children", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Fantasy Literature for Children explores a range of fantasy literature including literary fairy tales, toy fantasies, ghosts/horror/suspense, science fiction, reworked fairy tales, low fantasy, and high fantasy. This course will consider different rationalizations for fantasy literature and will examine some of the key stories that illustrate fantasy from different perspectives, such as literary, social, and psychological angles. This course will look at, first, the beginnings of modern fantasy with the fairy tales of Hans Christian Andersen and Carlo Collodi's classic, Pinocchio. Then the course reading will include ghosts and other supernatural fantasy stories, and \"reworked\" fairy tales, a current trend in fantasy literature. Despite of some scholarly debates on science fiction, that is, whether it should be categorized into fantasy or not, this course will consider science fiction as being similar enough to fantasy for it to be included. The course will also include a study of fantasy books currently popular with school-age readers. Fantasy can be divided into two main groups: low fantasy and high fantasy. Several of the stories to be read in the course are perhaps best categorized as low fantasies, not because of what they are, but because they are not high fantasy, which has a mythic quality to it. High fantasy seems to go beyond the particulars of its story to explore the nature of good and of evil. Though high fantasies can be humorous at times, the overall tone is serious. Often characters are on quests and the stakes of success or failure usually involve saving the world from some great evil or preventing the tyranny of some powerful and evil ruler. Reading the different types of fantasy literature and the literary critiques and analyses of those works, this course will be wrestling with the overall importance of those books in the lives of children by pondering imagination and its role in the lives of children.", "prerequisite": "5th Semester standing"}, {"course_name": "LLED 467: Children's Literature in the Classroom", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Study of the theory and practice of using children's literature in the elementary school classroom."}, {"course_name": "LLED 480: Media Literacy in the Classroom", "department": "Language and Literacy Education (LLED)", "credits": "3 Credits", "description": "Exploration of media languages and literacy in classrooms, learning in an electronic age; issues, ideas, and teaching strategies."}, {"course_name": "LLED 495: School Practicum in Reading", "department": "Language and Literacy Education (LLED)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised practicum providing field experiences at any grade level, with opportunities to assume various teaching roles.", "prerequisite": "LL ED400"}, {"course_name": "LLED 496: Independent Studies", "department": "Language and Literacy Education (LLED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "LLED 496H: Independent Studies", "department": "Language and Literacy Education (LLED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "LLED 497: Special Topics", "department": "Language and Literacy Education (LLED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "LLED 498: Special Topics", "department": "Language and Literacy Education (LLED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]