[{"course_name": "MATSE 81: Materials in Today's World", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "A survey of the properties, manufacture, and uses of polymers, ceramics and metals in today's world with emphasis on modern developments and new materials.  MATSE 081 Materials in Today's World (3) (GN;IL)(BA) This course meets the Bachelor of Arts degree requirements. MATSE 081 presents the basic science and technology of materials to non-science students. The course concentrates on 'Materials in Today's World' but frames the discussion in a relevant historical framework. The lectures are built around 'The Central Paradigm of Materials Science and Engineering', which links processing to structures to properties to performance.The fundamental basis of the science of materials, structure, is addressed first. Beginning at the sub-atomic level, the students are introduced to the intrinsically simple concept of metals and non-metals, and to a fundamental understanding of The Periodic Table. From these conceptual ideas, ceramics and electronic materials are rationalized or the basis of their electronic structures.The properties of materials, e.g., mechanical, thermal, electronic and photonic are developed directly from a knowledge of the structures discussed in earlier lectures. The concept of materials' design is introduced with respect to the properties of density, melting point and hardness. 'Young's modulus design's also described.There are as many processing routes as there are materials. Hence, the slate of lectures on processing, investigates prototypical examples of: metals - steel; ceramics - vitreous ceramics; and polymers-polyethylene. Current practices for e.g., the processing of steel and vitreous ceramics are compared with those, which were employed in antiquity.The performance of materials is a constant theme that permeates all the lectures. For example, during the 'firing of clay ceramics', the question' how does the temperature of firing affect both performance and utility?' is addressed.The great thinkers of the physical sciences are introduced via vignettes that are presented, often at the beginning of class. Giants such as Aristotle and Newton are described, warts and all, in an effort to make science a broader part of the human experience. The professor also uses many examples from his own scientific experiences, and his interaction with some of the more (in) famous of the modern scientists.", "other": ["Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)"]}, {"course_name": "MATSE 101: Energy and the Environment", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Energy utilization and technological development, energy resources, conversion and consequences on the local and global environment, and future energy alternatives. EGEE (MATSC) 101 Energy and the Environment (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Energy is the life-blood of any society. The information and principles learnt in this course will allow the students to make sound judgments in the area of personal energy choices; There is increasing concern about the influence of human activities, particularly energy use, on global climate change. This has an impact on global business aspects. Students in all walks of life need to be exposed to the basic concepts to appreciate the positions of policymakers, scientists, and industry over the interrelationship between greenhouse gas emissions and global climate change. The students will acquire knowledge, which will enable them to critically evaluate any energy-related concerns of the society. This is important for any college graduate for responsible citizenship and stewardship. The main objectives of this course are to: provide basic understanding and appreciation of energy and environmental concepts and interconnectedness; analyze energy consumption patterns; discuss various energy resources that power the modern society; examine the energy conversion processes; explore interrelationships between energy use and industrial progress and environmental consequences; discuss future energy alternatives. Student performance will be evaluated continuously through homework assignments, exams, group activities, class participation and a final examination. Position papers or term papers may be used in lieu of homework assignments in some sections. This course is a stand-alone General Education course.", "other": ["Cross-listed with: EGEE 101", "Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "MATSE 101A: Energy and the Environment", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Energy utilization and technological development, energy resources, conversion and consequences on the local and global environment, and future energy alternatives.  EGEE (MATSC) 101A Energy and the Environment (3) (GN;IL)(BA) This course meets the Bachelor of Arts degree requirements. Energy is the life-blood of any society. The information and principles learnt in this course will allow the students to make sound judgments in the area of 'personal energy choices.' There is increasing concern about the influence of human activities, particularly energy use, on global climate change. This has an impact on global business aspects. Students in all walks of life need to be exposed to the basic concepts to appreciate the positions of policymakers, scientists, and industry over the interrelationship between greenhouse gas emissions and global climate change. The students will acquire knowledge, which will enable them to critically evaluate any energy-related concerns of the society. This is important for any college graduate for responsible citizenship and stewardship.The main objectives of this course are to: provide basic understanding and appreciation of energy and environmental concepts and interconnectedness; analyze energy consumption patterns; discuss various energy resources that power the modern society; examine the energy conversion processes; explore interrelationships between energy use and industrial progress and environmental consequences; discuss future energy alternatives.Student performance will be evaluated continuously through homework assignments, exams, group activities, class participation and a final examination. Position papers or term papers may be used in lieu of homework assignments in some sections. This course is a stand-alone General Education course. The course is currently offered in four sections every semester (Spring and Fall) with a total target enrollment of approximately 200-250 students per semester.", "other": ["Cross-listed with: EGEE 101A", "Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)"]}, {"course_name": "MATSE 112: Applied Materials Chemistry for Engineers", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Chemistry of materials with emphasis on intermolecular forces between atoms, molecules, ions, and dense materials and inorganic and organic physical chemistry.  In most majors, this course is not a substitute for CHEM 013 or CHEM 112.", "prerequisite": "CHEM 110", "other": ["General Education:  Natural Sciences (GN)"]}, {"course_name": "MATSE 201: Introduction to Materials Science", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Concepts of relationships between structure and thermal, optical, magnetic, electrical, and mechanical properties of metals, ceramics, glasses, and polymers.", "prerequisite": "CHEM 112"}, {"course_name": "MATSE 201H: Introduction to Materials Science", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Concepts of relationships between structure and thermal, optical, magnetic, electrical, and mechanical properties of metals, ceramics, glasses, and polymers.", "other": ["Honors"]}, {"course_name": "MATSE 202: Introduction to Polymer Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "The materials science of organic or soft materials with an emphasis on synthetic and natural polymer.  MATSE 202 Introduction to Polymer Materials (3) Materials made from many types of natural organic materials, (cotton, wool, hemp, leather, etc.) have been with us throughout recorded history and have played crucial roles in the rise of civilizations and the economies of tribes and nations. Over the course of the last 100 years or so the development of synthetic organic materials, particularly polymers, has transformed the way we live. Modern transportation systems, much of contemporary medicine and the entire electronics and computer industry would not be possible without these materials. In order to understand their nature and provide a basis for a more in-depth understanding of these materials provided by courses with a more specific focus, why they are ubiquitous in modern society, this course will provide students with a basic knowledge of the structure, synthesis and properties and processing of these materials, starting with a review of atomic and molecular structure and proceeding through basic elements of the chemical synthesis, structure, mechanical properties and processing of these materials. Students will discover the commonalities and differences between synthetic polymers, such as polyesters and nylons, and natural or biological polymers, such as cotton and silk. A comparison will also be made between the mechanical properties of \"hard\", inorganic materials such as metals and ceramics, and \"soft\", organic materials such as polymers.The primary intended audience is undergraduates in Materials Science and Engineering. This course will provide a necessary overview of organic materials for those students who will focus on inorganic materials in the major and also provide an introduction to organic materials for those students who will specialize in polymers and other organic materials. It is also anticipated that students in other disciplines who want to obtain an overview of the science and engineering of organic materials would want to take this course.", "prerequisite": "CHEM 202"}, {"course_name": "MATSE 259: Properties and Processing of Engineering Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Relationship of structure and processing variables to the properties and service behavior of metals, polymers, and ceramics.", "prerequisite": "E MCH213 or E MCH210"}, {"course_name": "MATSE 259H: Properties and Processing of Engineering Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Relationship of structure and processing variables to the properties and service behavior of metals, polymers, and ceramics.", "other": ["Honors"]}, {"course_name": "MATSE 297: Special Topics", "department": "Materials Science and Engineering (MATSE)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MATSE 400: Crystal Chemistry", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Principles of crystal chemistry applied to structures, structural defects and properties of organic, inorganic, intermetallic, and metallic crystals.", "prerequisite": "MATSE 201"}, {"course_name": "MATSE 401: Thermodynamics of Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "The course starts with the first law of thermodynamics and its applications to the calculations of heat involved in various materials processes such as chemical reactions and phase transformations. Second law of thermodynamics and the concept of entropy are then introduced. The application of maximum work theorem to engine efficiency is briefly discussed. Various thermodynamic potentials are defined to determine the equilibrium of a system under various thermodynamic conditions, with an emphasis on the Gibbs free energy functions at constant temperature and pressure conditions. The relationships among thermodynamic properties are derived using the Maxwell relations. Phase diagrams of single-component systems are constructed from the Gibbs free energy function, and the Clapeyron equation is applied to describe the phase boundaries. Applications of thermodynamics to the determination of chemical equilibrium and to the calculation of the voltages of electrochemical reactions are also discussed. The last part of the course is focused on the solution thermodynamics and its application to binary phase-diagrams.", "prerequisite": "MATSE 201"}, {"course_name": "MATSE 401H: Thermodynamics of Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Review of equilibrium thermodynamics and applications to metallurgical and material systems.", "other": ["Honors"]}, {"course_name": "MATSE 402: Materials Process Kinetics", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "A treatment of process kinetics including chemical reaction kinetics and momentum, energy and mass transport.", "prerequisite": "MATSE 201"}, {"course_name": "MATSE 403: Biomedical Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Describe properties of materials and composites and their in vivo interactions.  BME 443 (MATSE 403) Biomedical Materials (3) Metals, polymers, and ceramics, and their composites, which are capable of emulating the functions of hard and soft tissues, are the subjects of this course.The subject matter shall be confined to implanted materials; external appliances, such as casts, braces, etc are not considered The topical content of this course will be grouped into four areas. A general introduction to selected aspects of physiology will be presented. This will provide the background necessary to appreciate the factors which govern the selection of biomedical materials. Specific emphases will be placed on polymerization of biopolymers (polypeptides and polysaccharides) and the general relationships between conformation and biological function, the biochemistry of blood and blood surface interactions, the formation of teeth and bone and the relationships between microstructure, composition and function, the immune responses to implanted materials, the resorption of bone (osteoporosis) and the development of caries. The perspective placed on these topics will be that of materials science. 'The selection of ceramics for hard tissue prosthesis will be discussed. Orthopaedic and dental applications for ceramics will be discussed. Specific ceramic materials to be treated include dental porcelain, alumina- and zirconia-based ceramics, and bioglasses and pyrolytic carbons. Various classes of inorganic cements, gypsum, zinc phosphates, zinc carboxylates, silicates, and glassionomer cements will also be considered as ceramics. Hydroxyapatite, Hap-based composites and Hap-metal interactions will be discussed in particular Relationships among physical properties, mechanical properties, and chemical interactions with biological fluids will be described. Dental and orthopedic applications of metals will be described. The fracture toughness of metals, their electrochemical responses in vivo, and the nature of the interfacial interactions with hard tissues will be treated Dental amalgams and the noble metals for dental applications will be considered. Metals and alloys, such as Ti, Co-Cr, and vitallium, used in prosthetic applications, will be described and their properties and limitations discussed The phenomenon of stress shielding and the immune responses associated with the accumulation of metallic and polymeric particular debris in the vicinity of an implant will be discussed in particular Polymeric materials are important in a broad range of biomedical applications. Among these are soft tissue prostheses, hemostatic agents, dental restoratives, bone replacement materials, and surgical adhesives. In some applications it is desirable that a polymeric material biodegrade while in others property retention is desirable.", "prerequisite": "MATSE 201", "other": ["Cross-listed with: BME 443"]}, {"course_name": "MATSE 404: Surfaces and the Biological Response to Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Focus is on special properties of surface as an important causative and mediating agent in the biological response to materials.", "prerequisite": "CHEM 112", "other": ["Cross-listed with: BME 444", "International Cultures (IL)"]}, {"course_name": "MATSE 409: Nuclear Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Nuclear reactor materials: relationship between changes in material properties and microstructural evolution of nuclear cladding and fuel under irradiation.  NUC E (MATSE) 409 Nuclear Materials (3) NUC E/MATSE 409 provides a background on the types of materials used in nuclear reactors and their response to neutron irradiation. Most of the materials problems encountered in the operation of nuclear power reactors for energy production are discussed here. The objective of the course is to give nuclear engineering students a background in materials, so they understand the limitations put on reactor operations and reactor design by materials performance. In the first part of the course, we review basic concepts of physical metallurgy, to develop a mechanistic and microstructurally based view of material properties. In the second part of the course, we present the methods to calculate displacement damage to the material produced by exposure to neutron irradiation. The microstructural evolution that results from the reactor exposure (including radiation damage and defect cluster evolution, and changes) is described. The aim is to create a linkage between these changes at the atomistic level and the changes in macroscopic behavior of the material. Special attention is given to property changes that affect fuel performance and operational safety. Both mathematical methods and experimental techniques are emphasized so that theoretical modeling is instructed by experimental data. Students use the TRIM and SPECTER codes to quantitatively evaluate neutron damage, as well as learn simple analytical models that describe microstructural evolution and property changes under irradiation.", "prerequisite": "PHYS 214", "other": ["Cross-listed with: NUCE 409"]}, {"course_name": "MATSE 410: Phase Relations in Materials Systems", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Phase rule; construction and interpretations of equilibrium diagrams; importance of nonequilibrium in materials.  MATSE 410 Phase Relations in Materials Systems (3) This course integrates three core components of materials science and engineering: thermodynamics, kinetics, and interface crystallography in understanding processing and development of inorganic materials. It is the key course bridging the fundamentals to practical materials processing. Phase equilibria, phase diagrams, phase transformations and heat treatments are addressed in great details through nucleation, transformation kinetics, crystal interface and diffusion. The complexity of materials is discussed in hierarchy from pure elements, binaries, ternaries to multicomponents.", "prerequisite": "MATSE201 , MATSE401"}, {"course_name": "MATSE 411: Processing of Ceramics", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Principles of ceramic processing, including powder preparation and characterization, forming operations, and the basic phenomena underlying these operations.  MATSE 411 Processing of Ceramics (3) This course covers the scientific and engineering principles of manufacturing of ceramic products. The course covers powder synthesis and characterization; surface and colloid chemistry; fabrication; and densification by sintering. There is an emphasis on the physical chemistry of particulate systems as relates to the various stages processing. The course is offered every fall semester and is required for BS graduates of the Ceramic Science and Engineering option in Materials Science and Engineering.The course objectives are for the student to (1) become knowledgeable of all steps involved in ceramic manufacture from powder synthesis through final densification by sintering, (2) understand the rationale and compromises for selecting a given processing route, (3) understand and be able to apply the parametric relations for manufacture of a ceramic with a specified microstructure, and (4) understand the physical chemistry fundamentals responsible for the unique properties of fine powders.", "prerequisite": "MATSE400 , MATSE402"}, {"course_name": "MATSE 412: Thermal Properties of Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Generation of high temperatures, measurement of temperature, heat transfer and furnace design, thermal stability of ceramic materials, applied thermodynamics. MATSE 412 Thermal Properties of Materials (3) The fundamentals of achieving, measuring, and controlling high temperature for materials processing are addressed. The crystal physics underlying heat capacity, internal energy, phonon and photon conduction, and thermal expansion is used to rationalize the behavior of a wide variety of ceramic and metallic materials in severe thermal environments. Micro- and macroscopic thermal transport, thermal shock and fatigue behavior, and thermochemical durability are addressed insofar as their impact on the design of, and with, high performance materials in thermostructural applications. Case studies on materials selection and design using the fundamentals of inorganic crystal chemistry, physics, thermodynamics, kinetics, elastic, and mechanical properties are widely employed. Students interested in disciplines such as metallurgy, ceramic science, electronic and photonic materials, mechanical engineering, aerospace engineering, industrial engineering, engineering science, and chemical engineering will benefit significantly from this course.", "prerequisite": "MATSE201 or MATSE259 , MATSE401; Concurrent: MATSE401"}, {"course_name": "MATSE 413: Solid-State Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "The main course objective is to provide sufficient background for the understanding of fundamental phenomena in solid state materials. Mathematical description of periodic arrays and the concept of reciprocal space are introduced, lattice vibrations are discussed. An introduction to quantum mechanics is given and the solution of the stationary Schrödinger Equation for various problems relevant in nanostructured materials is presented. A semi-quantitative approach is taken how the electronic structure of isolated atoms is changed as they bond and form molecules and solids. Emphasis is placed how such bonding influences whether the resulting material will be a metal, an insulator or a semiconductor. The goal is to master the modern framework in solid state materials that describes materials phenomena at an atomic level, such as electronic band structure and electronic transport, the vibrational properties of solid state materials and to prepare the audience for higher level quantum mechanical problems.", "prerequisite": "MATSE 201"}, {"course_name": "MATSE 415: Introduction to Glass Science", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Composition, melting, fabrication, properties, and uses of glass; combinations of glass with metals and other materials. MATSE 415MATSE 415 Introduction to Glass Science (3) This course aims to explain the unique characteristics of the glassy state, and to describe their role in the processing, application, and engineering performance of amorphous materials and glass products. The course teaches fundamental concepts of amorphous structure, and then utilizes them to establish structure-property relations in various glass systems. The viscosity, thermal expansion, chemical durability, strength behavior, and optical properties of silicate-based glasses are emphasized, although the important properties of phosphate, halide, and chalcogenide glasses are not overlooked. Also included are phenomenological descriptions of glass formation, liquid-liquid immiscibility, viscous flow, structural relaxation, stress relaxation, and crystallization in glass. Various methods for the synthesis of glass are reviewed (melting, CVD, and sol/gel), along with important manufacturing processes for commercial glass products. Throughout the course, the applications of glass and glass components in electronics, photonics, biomedicine, transportation, and energy are described to rationalize the use of glass (i.e., the materials selection), the specific glass composition, and the associated processing method.", "prerequisite": "MATSE400 , MATSE401 , MATSE402 , MATSE462"}, {"course_name": "MATSE 417: Electrical and Magnetic Properties", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Electrical conductivity, dielectric properties, piezoelectric and ferroelectric phenomena; magnetic properties of ceramics. ESC 417 / MATSE 417 Electrical and Magnetic Properties (3) is designed to provide students with a fundamental understanding of the different responses a material can have to applied electrical or magnetic fields. Important properties are introduced and correlated with knowledge of material chemistry, crystal structure, and microstructure to provide an understanding of the mechanisms responsible for controlling the observed properties, as well as the ways in which properties can be engineered. Electronic and magnetic properties encompass dielectric, ferroelectric, conductor, superconductor, and ferromagnetic materials. Material properties and structures are related to sensors, energy storage and conversion devices, biomedical devices and electronic components in telecommunications.", "prerequisite": "MATSE 400", "other": ["Cross-listed with: ESC 417"]}, {"course_name": "MATSE 419: Computational Materials Science and Engineering", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Introduction to computational material science and engineering. Overview of the computational methods for materials, from atomistic to the continuum scale. MATSE 419 Computational Materials Science and Engineering (3) Modeling is a critically important tool in the field of materials. This course is designed to inform students about all areas of materials modeling, and to explore the use of modeling in different research areas. This is a hands-on undergraduate level course, mandatory for all MATSE students, covering current methods for modeling soft and hard matter, at the atomistic, meso and continuum scale levels. It consists of an overview of individual techniques of modeling from atomistic molecular dynamics and Monte Carlo, coarse-grained molecular dynamics, and multiscale modeling, to the continuum (e.g. SAFT, CALPHAD). It also includes a computer laboratory component with hands-on exercises. At the conclusion of the course, students will understand the physical basis and basic procedures of each technique. Students will be able to understand the general literature in modeling and its connection with experimental work, as well as to communicate with experts in the field. From the laboratory practices, they will learn how the individual modeling techniques contribute to knowledge in each area, and to interconnect them with experimental information.", "prerequisite": "CMPSC 200"}, {"course_name": "MATSE 421: Corrosion Engineering", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits/Maximum of 3", "description": "Industrial forms of corrosion and preventive methods, and their description in terms of basic thermodynamic and kinetic considerations. MATSE 421 Corrosion Engineering (3) This 3-credit course is an introduction to the corrosion field and more broadly to the principles of electrochemistry and to the electrode reactions that occur during the undesirable corrosive degradation of metal, and also in various important commercial processes such as electroplating, electroless plating, battery and fuel cell operation, aqueous extraction metallurgy and corrosion prevention techniques. The objectives of this course are to introduce the student to the (1) principles of electrode reactions, (2) nature of commercial corrosion resistant alloys and their compositions, (3) various forms of corrosion and preventative measures, and (4) design of electrochemical laboratory and field procedures for detecting corrosion processes and determining their rates. Thermodynamic and rate data are used to make engineering decisions relative to the occurrence of corrosion, to the effectiveness of the various preventative measures, and to electrochemical design. Corrosion processes and electrode reactions more generally are primarily concerned with the surface properties of materials, but the bulk properties, such as microstructure, grain size, hardness, and composition, are discussed in terms of their impact on materials degradation. In-class closed-book exams and problem sets, and homework that allow student collaboration, are used for evaluation. Computer access to the course is available and includes all lecture material, old exams with answers, home works, and syllabus on the Web. This course is offered every year with typical class size of less than 20 students.", "prerequisite": "PHYS 212"}, {"course_name": "MATSE 422: Thermochemical Processing", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Physico-chemical aspects of high temperature extraction and processing of metals and alloys. Design and evaluation of processes and process options.  MATSE 422 MATSE 422 Thermochemical Processing (3) An important goal of materials engineering is to efficiently produce metals and alloys of specific composition. Familiar examples include the tonnage production of metals and alloys, the production of ultra high purity electronic materials such as silicon and germanium, and the deposition of thin films for various applications. In this course the students get an understanding of the physical and chemical principles underlying these operations and how these principles are applied in industrial practice. The students get ample opportunities to apply thermodynamics, kinetics, and transport phenomena to understand why the processes currently in use work. Furthermore, they learn how to marshal information for the design of projected new processes and process options. Broadly stated, the topics include solid-state reactions, production of liquid metals, and processing, all carried out at high temperatures. The topics are covered in a set of lecture notes available from the instructor. The lectures are accompanied by about fifteen problems sets in the form of home work and class work so that the students experience first-hand how the principles of thermodynamics and rate processes are applied in solving important problems in thermochemical processing.", "prerequisite": "MATSE401 , MATSE402"}, {"course_name": "MATSE 425: Processing of Metals", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Modern methods of shaping metals in liquid and solid states: casting, joining, powder and deformation processing. Design of new technology. MATSE 425 Processing of Metals (3) This course focuses on how metals and alloys may be processed into different shapes and how those processing procedures affect the metallurgical microstructure and properties. Consideration of shape, the alloy composition, and property goals are all factors in selecting an optimum processing 'window'. Such carefully selected processing conditions not only produce the desired component shape in a cost-efficient manner but also ensure acceptable properties and safe in-service performance. This course surveys the following metal processing procedures: (a) solidification processing, (b) heat", "prerequisite": "MATSE402 , MATSE410"}, {"course_name": "MATSE 426: Aqueous Processing", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "A study of the chemical and engineering principles pertinent to metal processing in aqueous systems:  hydrometallurgical extraction, plating, materials preparation.  MATSE (MN PR) 426 Aqueous Processing (3) This 3-credit course deals with the chemical and engineering principles underlying the aqueous processing of metals: metal extraction from primary and secondary sources, electroplating, and metal finishing, powder synthesis, energy storage and conversion, and treatment of recycling of metal-containing toxic wastes.1. Physico-Chemical Principles - Thermodynamic, chemical kinetic and transport factors which control hydrochemical processes (leaching; precipitation; adsorption; solvent extraction; ion exchange; electrowinning, electrorefining and electroplating; membrane processes; energy storage and conversion); graphical representation of homogeneous and solid/solution equilibria; chemical reagents.2. Engineering Principles - Reactor design and staged operations; ideal batch, continuous stirred-tank and plug-flow reactors; fluidized bed reactors; electrochemical reactors; multistage separation processes (solid-liquid, liquid-liquid, and gas-liquid systems).3. Process Synthesis - Design of metal separation (extraction, refining, waste treatment) materials synthesis, metal finishing, and energy storage/conversion processes and system-integration of unit operations, industrial practice. Emphasis on closing circuits to minimize or eliminate waste effluents.", "prerequisite": "EME 301", "other": ["Cross-listed with: MNPR 426"]}, {"course_name": "MATSE 427: Microstructure Design of Structural Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "The focus of this course is on understanding the microstructure development and design of structural ferrous metals. The course will begin with understanding the basic physical metallurgy concepts of ferrous metals and applying these principles to understanding their processing/structure/property relationships. Specifically, the alloying principles, phase transformation behavior, and transformation kinetics steels will be considered in detail. Heat treatment practices (annealing, normalizing, quenching, tempering, and precipitation hardening) and their effects on the microstructure and mechanical properties of each of these metals will also be studied.", "prerequisite": "MATSE201 , MATSE259 or equivalent"}, {"course_name": "MATSE 430: Materials Characterization", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Elements of crystallography and the characterization of crystalline and non- crystalline materials using x-ray diffraction, electron microscopic, and other instrumental techniques.  MATSE 430 Materials Characterization (3) This course will introduce students to characterization techniques for quantifying microstructure, chemistry and atomic structure of solid state materials. Elastic and inelastic interactions of radiation (e.g. electromagnetic and electrons) with solid state materials are the basis for most characterization techniques. Utilizing these interactions it is possible to obtain structural and chemical information from materials, often at small length scales. In this course, students will be introduced to the most common imaging, diffraction and spectroscopy techniques used for materials characterization. They will develop an understanding of the underlying physics behind the techniques to enable interpretation of the data. The course will be beneficial for any student interested in solid-state materials, as it provides a key component of the processing-structure-properties process.", "prerequisite": "MATSE 201"}, {"course_name": "MATSE 430H: Materials Characterization", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Elements of crystallography and the characterization of crystalline and non- crystalline materials using x-ray diffraction, electron microscopic, and other instrumental techniques.", "other": ["Honors"]}, {"course_name": "MATSE 435: Optical Properties of Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Electromagnetic spectrum, interaction of light with materials, color, thin film optical coatings, electro-, integrated and nonlinear optics.", "prerequisite": "MATSE400"}, {"course_name": "MATSE 436: Mechanical Properties of Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Fundamental relationships between structure and mechanical behavior of materials.  MATSE 436 Mechanical Properties of Materials (3) The topics covered in this course are essential to students in the Materials Science and Engineering options, and these are also required for materials engineering courses nationally accredited by the professional societies. The course is taught at the 400 level because it requires the fundamental courses in mathematics and physics to be completed. The course also requires completion of an introductory course in materials science. This new course typically fits into the junior or senior year, when students in the major are understanding how the properties of materials can be changed by controlling the structure of materials. The course has also been designed such that students in other engineering majors can take this course as a technical elective. Some of the information in this course is used in laboratory courses for the major. The course is not required as a prerequisite for other courses.", "prerequisite": "MATSE 201"}, {"course_name": "MATSE 440: Nondestructive Evaluation of Flaws", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Methods and limitations of nondestructive evaluation of mechanical flaws; optical, acoustical, electromagnetic, x-ray, radiography, thermography, and dye techniques.", "prerequisite": "EMCH 213", "other": ["Cross-listed with: EMCH 440"]}, {"course_name": "MATSE 441: Polymeric Materials I", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "This 3-credit course focuses on about 50 commercially most important polymers together with the discussion of synthesis routes, industrial production processes, processing methods, physical and chemical properties, and applications. They are classified into 10 families of polymeric materials, which are taught along with introduction of polymeric materials and synthesis of polymers in the beginning of the class.", "prerequisite": "CHEM 202"}, {"course_name": "MATSE 445: Thermodynamics, Microstructure, and Characterization of Polymers", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "The properties of individual polymer chains. Theoretical and experimental techniques pertaining to the characterization of polymeric microstructure.  MATSE 445 Thermodynamics, Microstructure, and Characterization of Polymers (3) This course develops fundamental understanding of microstructures and chain conformations of polymers, and addresses theoretical and experimental techniques pertaining to the characterization of polymeric microstructure.", "prerequisite": "MATSE202 or MATSE443"}, {"course_name": "MATSE 446: Mechanical and Electrical Properties of Polymers and Composities", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "This course is an introduction to the mechanical and electrical properties of polymers and polymer-based composites: The main focus is on the importance of molecular structure, rubber elasticity, mechanisms of yielding, viscoelasticity, and the manifestation of the static and ac dielectric properties, as well as conduction. The course topics include polymer chain structures and characterization methods, the amorphous state (glass transition), the crystalline state (including X-ray diffraction, degree of crystallinity, and kinetics), polymer networks and gels, mechanical properties, and electrical properties.", "prerequisite": "MATSE202 or MATSE443"}, {"course_name": "MATSE 447: Rheology and Processing of Polymers", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "This course deals with the fluid mechanics, rheology, and processing of polymeric materials.", "prerequisite": "MATSE202 or MATSE443"}, {"course_name": "MATSE 450: Synthesis and Processing of Electronic and Photonic Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "The materials science of applying thin film coatings, etching, and bulk crystal growth; includes materials transport, accumulation, epitaxy, and defects.", "prerequisite": "MATSE 201", "other": ["Cross-listed with: ESC 450"]}, {"course_name": "MATSE 455: Properties and Characterization of Electronic and Photonic Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Materials characterization in general; electrical properties of crystals, contacts, films; optical properties of single phase materials, waveguide, and multilayer stacks.", "prerequisite": "MATSE201 or E SC 414M , E SC 314"}, {"course_name": "MATSE 460: Introductory Laboratory in Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "1 Credits", "description": "An introduction to comparative physical properties and characteristics of various materials including mechanical, electrical thermal, and structure/ morphology. MATSE 460 Introductory Laboratory in Materials (1) This is a lab course whose goal is to provide an integrated approach to materials science and engineering. Any individual lab will consist of a number of elements, initially students will be provided with a presentation summary of the proposed lab. This could be film, video, web delivery, hard copy or live presentation. Presentation time will be limited but should be reviewed before students attempt the hands-on lab. All labs will examine a variety of different materials including metal, ceramics and polymers. Labs will be integrative in the sense that they will include use of spreadsheets, data plotting, and presentation of results as written reports and/or as a \"PowerPoint\" presentation. The labs selected have been chosen specifically because they cut across all current basic materials disciplines. These labs are intended to provide students with a broad appreciation of the range and contrast of material structures and properties, in order that students more fully appreciate the breadth of material science and engineering.", "prerequisite": "MATSE 201"}, {"course_name": "MATSE 462: General Properties Laboratory in Materials", "department": "Materials Science and Engineering (MATSE)", "credits": "1 Credits", "description": "An introduction to comparative physical properties of various materials including mechanical, thermal electrical properties and the measurement of said properties.  MATSE 462 General Properties Laboratory in Materials (1) This is a lab course whose goal is to provide an integrated approach to physical property measurements in materials science and engineering. Any individual lab will consist of a number of elements, initially students will be provided with a presentation summary of the proposed lab. This could be film, video, web delivery, hard copy or live presentation. Presentation time will be limited but should be reviewed before students attempt the hands-on lab. All labs will examine a variety of different materials including metal, ceramics, polymers and composites. Labs will be integrative in the sense that they will include use of spreadsheets, data plotting, and presentation of results as written reports and/or as a 'PowerPoint' presentation. The labs selected have been chosen specifically because they cut across all current basic materials disciplines. These labs are intended to provide students with a broad appreciation of the range and contrast of material properties and the measurement of such properties, in order that students more fully appreciate the breadth of material science and engineering.", "prerequisite": "MATSE460"}, {"course_name": "MATSE 463: Characterization and Processing of Electronic and Photonic Materials       Laboratory", "department": "Materials Science and Engineering (MATSE)", "credits": "1 Credits/Maximum of 1", "description": "Provides experience with key processing methods for EPM materials and advanced characterization methods for EPM materials and simple device structures.", "prerequisite": "MATSE400 , MATSE430 , MATSE450 , MATSE455 , MATSE460; Concurrent: MATSE450, MATSE455"}, {"course_name": "MATSE 468: Ceramics Laboratory III", "department": "Materials Science and Engineering (MATSE)", "credits": "1 Credits", "description": "Cermaic processing and powder characteristics.  MATSE 468 Ceramics Laboratory III (1)This course will demonstrate to students the experimental techniques by which the key powder characteristics and powder processes are determined, how to analyze the data from the measurements, and to reveal the interaction between properties, processing and structure. The course concentrates on the importance of powder characterization, forming techniques, sintering and microstructure characterization in the processing of ceramics.", "prerequisite": "MATSE 462"}, {"course_name": "MATSE 471: Metallurgy Processing Laboratory", "department": "Materials Science and Engineering (MATSE)", "credits": "1 Credits", "description": "A laboratory integrating experimental aspects of the material contained in MATSE 425, casting, solidification micro-structures heat treating, welding, etc. MATSE 471 Metallurgy Laboratory I (1) This course is largely a metals processing laboratory focused on casting, metal deformation, heat treating, and welding. Understanding how these processes affect microstructure and properties will be studied.", "prerequisite": "MATSE 462"}, {"course_name": "MATSE 473: Polymeric Materials Laboratory", "department": "Materials Science and Engineering (MATSE)", "credits": "1 Credits", "description": "Principles and practices of polymerization, including condensation, free radical (bulk, solution, suspension, emulsion), ionic, and Zeigler-Natta procedures. MATSE 473 Polymeric Materials Laboratory--Synthesis (1) This laboratory course provides students exposure to a variety of synthetic techniques basic to Polymer Science. From the polymerization of styrene to the preparation of urethane foams, students will see the role varied synthetic methods and chemistries play in determining the final form and properties of a given polymer. Students also learn the polymer structure characterization by examining the produced polymers with proper tools and instruments.", "prerequisite": "MATSE443"}, {"course_name": "MATSE 475: Particulate Materials Processing", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Fundamentals of processing particulate materials including production, characterization, handling, compaction, and sintering of metal, carbide, intermetallic, and composite powders.", "prerequisite": "EMCH 315", "other": ["Cross-listed with: ESC 475"]}, {"course_name": "MATSE 483: Simulation and Design of Nanostructures", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Introduction to computer simulation techniques and their applications at the physical/life sciences interface.  E SC (MATSE) 483 Simulation and Design of Nanostructures (3) Students will learn the simulation techniques and the design rules of nanostructures. Basic concepts of computer modeling will be introduced using quantum and classical approaches. Fundamental physical phenomena encountered in the molecular fields of computational physics, chemistry, and biology will be studied. Applications are drawn from a broad range of fields including soft and condensed matter to build an understanding of nanostructures.The course will assume knowledge and skill developed in the prerequisite courses of PHYS 214 and MATH 230. Students are expected to combine knowledge from other courses with information presented here to develop sophisticated interpretations and understanding of physical and chemical principles of nanostructures and their design rules.Evaluation methods to be used in this course will be two in-class examinations and one final period examination. The course contains a computer code generation and implementation component. Students will use commercial or educational computer codes (e.g. Matlab, Mathematica, AMBER, CHARMM, VASP, etc.) which are available at our high performance computing clusters (http://gears.aset.psu.edu/hpc/)/ Students will use the computing clusters to perform simulations which are accessible from any classroom or laboratory at Penn State.The principal objectives of the course is to learn the fundamental physics of nanostructures and to design them with computer simulations. This approach starts from classical molecular dynamics that apply on the large scale biological and synthetic assemblies and encompasses quantum mechanics for the molecular and atomic sizes. This course will give a broad scientific picture of simulation techniques in the area of nano-science and technology.", "prerequisite": "PHYS 214", "other": ["Cross-listed with: ESC 483"]}, {"course_name": "MATSE 485Y: International Internship in Materials: Experimentation and Documentation", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "A course focused on international research, specifically experimentation and documentation, facilitated through the International Internship in Materials Program.  MATSE 485W International Internship in Materials: Experimentation and Documentation (3) (IL) The objective of this course is to enrich students' preparation for careers in materials science and engineering in a global environment. The course is intended as a follow-up to MATSE 484W: International Internship in Materials: Research Definition and Methodology, in which the student will complete the research and documentation on the topic developed in that course. It may be used as a direct substitution for MATSE 494W: Research and Design Senior Project in the degree requirements for Materials Science and Engineering. The course will continue the student's development of international communication skills and appreciation of cultural and technical issues associated with conducting research in overseas laboratories. Students will complete their research experimentation, data analysis and interpretation under the supervision of a Materials Science and Engineering faculty mentor and a mentor from their host overseas laboratory or University. Students will compile a written thesis encompassing their technical findings, with specific emphasis on the economic, manufacturability, sustainability, environmental, safety/health, social and political issues of relevance to the topic. It is expected that the students will carefully and comprehensively articulate and consider the cultural, social, and scientific differences and similarities they experienced in performing the research in an international venue.", "prerequisite": "Seventh-semester standing in Materials Science and Engineering; MATSE484Y ; satisfactory completion of cultural class from Office of   Education Abroad", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "MATSE 492W: Materials Engineering Methodology and Design", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "Designed to familiarize students with the literature and technology developments in the use of, and design with, materials in industrial applications.  MATSE 492 Materials Engineering Methodology and Design (3) The objective of this course is to teach students the skills to solve realistic problems related to the use of materials in industrial practice. This will be accomplished by considering alternatives for materials design or selection and proposing the most effective scientific or engineering solutions. The methodology will take into account other forces acting on the design process, such as economic, environmental, sustainability, manufacturability, ethical, health and safety, social and political concerns. Students will develop these design skills by working in teams on projects defined by industry, and will learn to communicate their solutions in verbal and written form. Students will also learn the key features needed in developing a team approach to solving problems. Typically, evaluation is based on written reports, performance in presentations, and instructors's assessment of the student's participation in design team activities. At the conclusion of the course, each student will select a design or independent research topic for their capstone senior-year design project.", "prerequisite": "MATSE201 , MATSE202 , MATSE436 , sixth semester standing in Materials Science and Engineering", "other": ["Writing Across the Curriculum"]}, {"course_name": "MATSE 493W: Materials Science and Engineering Multidisciplinary Capstone Design Project", "department": "Materials Science and Engineering (MATSE)", "credits": "3 Credits", "description": "This course focuses on multidisciplinary industry-sponsored and community service-based design projects offered in conjunction with the College of Engineering's Learning Factory.  MATSE 493W Materials Science and Engineering Multidisciplinary Capstone Design Project (3) This course will provide students with the opportunity to learn the design process in the context of an industry-sponsored or community service-based design project that demands they produce a working solution. The design projects in this course will be structured for students from two or more different engineering majors, as defined by the project sponsors in collaboration with the instructor and departmental project coordinators. The project sponsor will provide the technical expertise for theproject, a clear definition of all project deliverables that are expected, and the financial support to cover needed materials and supplies and travel costs. Project sponsors will be invited to attend the Project Kickoff at the start of the semester to present their ideas and answer questions from the students as well as the Design Showcase at the end of the semester where teams display their results to the project sponsorsand the public. The Center for Engineering Design and Entrepreneurship (CEDE) in Hammond Building and the BernardM. Gordon Learning Factory will provide the facilities where the design teams can work together to develop the design concept and prototype solutions. Faculty members in the School of EngineeringDesign, Technology, and Professional Programs (SEDTAPP) will administer the course, including reading, evaluating, and grading the final project report, provide lectures on topics including on project management, design, product manufacturing, intellectual property, engineering ethics, societal/global/contemporary/professional issues, and related technical topics, and organize invited technical lectures related to industry projects. In accordance with standard Learning Factory procedures,specific multidisciplinary projects will be selected for this course to provide challenging senior-year design experiences for all students, and the Director of the Learning Factory will coordinate the selection of these projects with the course instructor prior to the start of each semester of the course offering. Multidisciplinary teams will be formed based on specific project needs (i.e., expertise from two or moredisciplines based on the project scope).", "prerequisite": "MATSE492W", "other": ["Writing Across the Curriculum"]}, {"course_name": "MATSE 494M: Research and Design Senior Project", "department": "Materials Science and Engineering (MATSE)", "credits": "1-3 Credits/Maximum of 3", "description": "Continuation of a research problem in materials culminating in a bound thesis describing the work.", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "MATSE 494W: Research and Design Senior Project", "department": "Materials Science and Engineering (MATSE)", "credits": "1-3 Credits/Maximum of 3", "description": "MATSE 494W Research and Design Senior Project (2) This course continues the senior thesis research topic addressed by the student in MATSE 493W. This is a capstone research/design project which integrates: a) background literature search with articulation of a research hypothesis, b) design and implementation of an experimental plan to test the hypothesis, and c) conclusions regarding the validity of the hypothesis based on the experimental data obtained in the course of the research.The main characteristic of this course is the performance of the research plan articulated in MATSE 493W, followed by interpretation of the data in the context of the original hypothesis(es). Laboratory research is generally performed in collaboration with faculty and graduate research assistants, using equipment and facilities in a wide range of laboratories throughout campus. Occasionally, the nature of the research may require the student to collaborate with researchers outside of Penn State, perhaps even spending some time in residence at other facilities.The course culminates in the preparation of a bound thesis detailing the relevance and findings of the research. Assessment of the student's progress is via grading of all components of the thesis (literature review/background, statement of the problem, design of the experimental plan, results and discussion, conclusions, recommendations for future work, and references/appendices), as well as the diligence of the student in performing the experimental research in a professional and timely fashion. The course is offered each semester to allow for differing schedules for students following the conventional MATSE curriculum versus those who have elected to participate in the Cooperative Education program.", "other": ["Writing Across the Curriculum"]}, {"course_name": "MATSE 496: Independent Studies", "department": "Materials Science and Engineering (MATSE)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "MATSE 496H: Independent Studies", "department": "Materials Science and Engineering (MATSE)", "credits": "1-3 Credits/Maximum of 3", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "MATSE 497: Special Topics", "department": "Materials Science and Engineering (MATSE)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]