[{"course_name": "MET 97: Special Topics", "department": "Mechanical Engineering Technology (MET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MET 105: Mechanical Systems", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Mechanical Systems with Laboratory is an introductory course for Engineering Technology major students to broadly introduce Mechanical Engineering Technology.  MET 105 Mechanical Systems (3)MET105 includes mechanical engineering technology profession, United States Customary System and Metric System, communication skills; structures and mechanics including the resultant of a system of forces, moment of a force, and the requirements for equilibrium; Materials and Stress including a stress-strain curve, the material properties for metals and their alloys, ceramics, polymers, and composite materials, a factor of safety; Fluids Engineering including the application of fluids engineering, a fluid's density and viscosity properties, laminar and turbulent fluid flows, buoyancy, drag, and lift, the volumetric flow rate and pressure drop of fluids through pipes. Thermal and Energy system including various energy, heat, work, and power quantities in the SI and USCS, the principle of energy conversion, the basic operating principles of various engines; Motion and Power Transmission including the design and operation of power-transmission equipment, rotational velocity, work, power, belts, and gears."}, {"course_name": "MET 107: Computer Applications for Technologists", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Programming spreadsheets, data bases and presentation software for solutions of technical problems; introduction to languages allowing creation of program macros."}, {"course_name": "MET 111: Mechanics for Technology: Statics", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Forces; moments; resultants; two- and three-dimensional equilibrium of force systems; friction; centroids and moments of inertial of areas.  MET 111 Mechanics for Technology: Statics (3) MET 111 will provide practical and compressive coverage of elementary statics. In addition to the theoretical approach, the course will demonstrate the practical applications of statics concepts. Students entering this course should have basic knowledge of algebra as well as geometry and trigonometry. Course will introduce the definition of scalar and vector quantities. This will be followed by vector addition, vector subtraction, resolution of vectors, addition of systems of coplanar forces, rectangular components of a vector, etc. Course will also introduce the concept of moments and couples. This will be followed by introducing free-body diagrams as a tool for solving statics problems. Emphasis will be placed on equations of equilibrium for particles and rigid bodies. Students will be exposed to 2D and 3D equilibrium. Course will put emphasis on truss and frame analysis as well as pulleys. Distributed loads will also be discussed. Course will also introduce the concept of friction, angle of friction, wedges, etc. Belt friction and rolling resistance as well as friction in bearings will also be discussed. Course will also introduce the concept of centroids, center of gravity, and moment of inertia of an area. Emphasis will be put on calculating centroidal moment of inertia of composite areas. Polar moment of inertia and mass of moment of inertia will also be introduced. Student will learn not only problem solving strategy but also develop ability to present results in clear manner.", "prerequisite": "MATH 26"}, {"course_name": "MET 112: Statics Laboratory", "department": "Mechanical Engineering Technology (MET)", "credits": "1 Credits", "description": "Laboratory experimentation associated with basic engineering mechanics principles and concepts including forces, moments, equilibrium, trusses, frames, friction, and centroids.  MET 112 Statics Laboratory (1)MET 112 facilitates the basic understanding of certain principles and concepts of elementary engineering mechanics. The course provides the hands-on experience essential to learn the fundamental engineering mechanics topics including forces, moments, equilibrium, frames, trusses, friction, and centroids.Laboratory experiments will be supported by lectures presented in MET 111 (taken concurrently), demonstrations, and associated computer software utilization.", "prerequisite": "MATH 26"}, {"course_name": "MET 197: Special Topics", "department": "Mechanical Engineering Technology (MET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MET 206: Dynamics", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Kinematics (particles and rigid bodies), kinetics, work-energy, impulse- momentum, and mechanisms.  MET 206 Dynamics (3) Instructional, Educational, and Course Objectives - To introduce students to the basic principles of dynamics as applied to practical problems which include such topics as friction, kinetics of particles and rigid bodies, laws of force and motion, using methods of work-energy and impulse-momentum. Further, students will consider mechanisms which are typical in manufacturing industries and mechanical design. These goals serve to satisfy the following course objectives: -Students should be able to demonstrate proficiency in applied design, manufacturing processes, and mechanics. -Students should be able to apply concepts of applied mathematics and science in solving technical problems.", "prerequisite": "MET 111"}, {"course_name": "MET 210W: Machine Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Design machine elements including bearings, springs, levers, shafts, gears, belts, and small mechanical devices; writing skills and computer applications.  MET 210W Machine Design (3) ME T 210W is designed to provide students with the necessary concepts and procedures to properly design machine elements in mechanical systems. The course starts with the study of the properties of various engineering materials, including various types of steel, aluminum, and plastics. Heat treating of steels is also covered. Machine design criteria are presented along with discussions of various types of stresses, concepts of principle stress, combined stresses, and methods of stress analysis. Failure theories and their application to brittle and ductile materials are covered along with the relationship of these concepts to design factors. The influence of dynamic loads on design and design margins is also covered. Welded and bolted connections and their design requirements are also studied, along with the application of buckling and beam deflection analysis to the design of support colunms and beams. The course also examines the design of various types of springs and gears, the calculation of shaft stresses, and the design of clutches, brakes, belts, and chains.The writing component of the ME T 210W course is satisfied by having students choose a design project which is completed over the course of the semester. Instructors introduce the design project early in the semester and discuss how writing exercises will be used to complete the project. Students write an initial proposal that is graded and returned. Subsequently, students prepare and present progress reports at various times through the semester. These are also graded. The project ends with students preparing a draft final project report, which is critiqued and returned. Based on the critique, a final design report is prepared and is a significant component of the final course grade. Both the progress reports and the final design report activities involve both written and oral exercises.", "prerequisite": "MET 206", "other": ["Writing Across the Curriculum"]}, {"course_name": "MET 213: Strength and Properties of Materials", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Axial stress and strain; shear; torsion; beam stresses and deflections; combined axial and bending stresses; columns, ductility, resilience, and toughness.  MET 213 Strength and Properties of Materials (3)MET 213 includes analysis and computations of axial stress and strain, shear and bearing stress; stress-strain diagrams, mechanical properties of materials including yield strength, ultimate strength, modulus of elasticity, percent elongation, poisson's ratio; stress concentration, axial deformations, statically-indeterminate axially loaded members, thermal stress and strain; torsion analysis including shear stress, angle of twist, power, rotational speed; beam bending analysis including shear force and bending moment diagrams, flexure stress, beam shear stress, , beam deflections; combined axial and bending stresses; columns.", "prerequisite": "MET 111"}, {"course_name": "MET 214: Strength and Properties of Materials Laboratory", "department": "Mechanical Engineering Technology (MET)", "credits": "1 Credits", "description": "Measurement of mechanical properties of materials; structural testing, data acquisition and analysis; technical laboratory report writing."}, {"course_name": "MET 296: Independent Studies", "department": "Mechanical Engineering Technology (MET)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "MET 297: Special Topics", "department": "Mechanical Engineering Technology (MET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MET 306: Computer-Aided Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Computer-aided drafting and design; computer software solutions to mechanical engineering technology design problems.  MET 306 Computer-Aided Design (3) This course is designed to be the third CAD course in a Mechanical Engineering Technology program. Students will be exposed to modeling industry specific geometry using solid and surface modeling techniques. Sheet metal modeling, tool path generation and material removal simulation for CNC operations as well as mechanism analysis are taught, Automation and optimization techniques using CAD packages are also covered in lab assignments. Students are expected to document their designs by producing industrial quality working drawings. Lecture material is directly related to the laboratory assignments and topics in understanding hardware and CAD software bench marking as well as associated costs and their relationship to the engineering design process are also covered. Experience in basic CAD modeling is required as well as a working knowledge of Statics, Dynamics and Strength of Materials. Evaluation is based on laboratory assignments, homework assignments, quizzes and a final project.", "prerequisite": "MET 107"}, {"course_name": "MET 308: Computer Aided Solid Modeling and Analysis", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Basic techniques necessary to perform Computer Aided Design and Analysis in three dimensions for machine components.  MET 308 Computer Aided Solid Modeling and Analysis (3) To introduce students to the theory and practice of creating computer aided design files for mechanical components, drawings, layout of multiview drawings, detailing design projects, assemble parts, and create assembly drawings and sections. Although it is highly recommended that the students have basic knowledge of finite element analysis FEA theory, the very user friendly interfaces and CAD interactive modes available in the market together with appropriate introductory training will enable students to perform reasonable and reliable structural, thermal, and motion analysis. This analysis is at the core of every day assignments for design engineers working in modern industrial firms with concurrent engineering culture. With the advent of very powerful desktop workstations, FEA is now available at a practical cost to virtually all engineers and designers."}, {"course_name": "MET 320: Strength of Materials II", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Principles of stress and strain in 3D, indeterminate structures, failure theory, and energy methods in solid mechanics.  MET 320 Strength of Materials II (3) This course consists of three main subject areas; a study of statically indeterminate structures, a study of stresses and strains in three dimensions, and a study of energy methods in solid mechanics. Statically indeterminate structures are studied for stresses and deformations. The types of indeterminate structures studied are axially loaded members, including temperature changes; torsionally loaded members, including geared connections; and bending members. Stresses and strains are studied in three dimensions with Mohr's Circle to identify principal stresses and absolute maximum shear stress, to understand Hooke's Law and other material property relationships, and to apply various failure or yield theories. Energy methods are studied so that stresses and deformations from impact loading of structures can be analyzed and included in the design of axial, torsion, and bending structures. Energy methods are also used to determine the static deformation of complicated structures. Other miscellaneous topics may include unsymmetric bending, bending of multi-material beams including reinforced concrete, bending of curved beams, shear center, combined loadings, torsion of non-circular members, columns, and true stress and true strain.", "prerequisite": "EMCH 213"}, {"course_name": "MET 321: Analytical Techniques", "department": "Mechanical Engineering Technology (MET)", "credits": "2 Credits", "description": "A study of engineering methods of problem formulation and solution; includes differential methods, dimensional analysis, and graphical analysis.", "prerequisite": "MATH 140"}, {"course_name": "MET 330: Thermodynamics", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Introduction for technologists to the basic concepts and applications of thermodynamics.  MET 330 Thermodynamics (3)This course is designed as the first thermal sciences course in a series of three. Students are introduced to the basic thermodynamic units and concepts, the properties of pure substances, first law of thermodynamics for open and closed systems, second law of thermodynamics, ideal cycles, performance and efficiency, entropy, power and refrigeration cycles. Evaluation is based on homework assignments, quizzes and examinations. Students need a background that includes inorganic chemistry and calculus to succeed in this course.", "prerequisite": "PHYS 250"}, {"course_name": "MET 331W: Heat Transfer", "department": "Mechanical Engineering Technology (MET)", "credits": "4 Credits", "description": "Introduction for technologists to the basic concepts and applications of heat transfer.  Includes a thermodynamics and heat transfer laboratory.", "prerequisite": "ME 300", "other": ["Writing Across the Curriculum"]}, {"course_name": "MET 332: Thermal Engineering A", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Basic thermodynamic units, concepts, properties of ideal gases and vapors, first and second laws, gaseous mixtures, one-dimensional compressible flow.", "prerequisite": "MATH 140"}, {"course_name": "MET 336: Engineering Fluid Mechanics", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "This course introduces mechanical engineering technology students to the development of basic fluid mechanics relationships. Course topics include such as fluid properties, pressure measurement, hydrostatic forces on plane and curved surfaces, buoyancy and stability, conservation of mass, conservation of momentum, and conservation of energy. Specific , Bernoulli's equation, internal and external flow, friction In pipes and fittings, Reynold's number, laminar and turbulent flow, boundary layer theory, Minor losses, Major losses, and Drag forces are discussed. Students use differential and integral calculus and draw free body diagrams to solve applied fluid flow problems.", "prerequisite": "ET 321"}, {"course_name": "MET 338: Thermal/Fluids Laboratory", "department": "Mechanical Engineering Technology (MET)", "credits": "1 Credits", "description": "The objective of the Thermal/Fluids Lab course is to provide Mechanical Engineering Technology students with practical experience in thermal-fluid applications. Students will develop experience in making fluid velocity, flow rate, temperature, and power measurements. Exercises will cover a range of applications and may include: power generation, refrigeration cycles, duct flows, and other thermal-fluid phenomena. Laboratory experiments will be performed in groups. Typically, students will prepare individual written lab reports to present their findings and demonstrate their understanding of each laboratory experiment."}, {"course_name": "MET 341: Mechanical Measurements and Instrumentation", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Measurement concepts, transducers, electronic-aided measurement, mechanical and electrical measurements.  Intended for mechanical engineering technologists.  MET 341 Mechanical Measurements and Instrumentation (3) This course serves as an introduction to the fundamental principles of instrumentation and measurements. Subjects covered in this course may include the responses of first and second order systems, the concept of time constant and rise time, calibration, standards, design of experiment, and lectures on the design and function of different types of sensors and instruments. Topics may be added or removed, as needed to meet Program Outcomes. The course includes lectures alternating with hands-on laboratory where students apply the material learned in the lectures. For many students this is the first time they have actual hands-on experience with electronic and measurement equipment, such as oscilloscopes, breadboards, function generators, digital data acquisition systems, integrated circuits, strain gauges, displacement sensors, thermocouples, tachometers, force sensors, accelerometers, velocity meters, pressure transducers, flow measurements, etc. Students learn not only how to use these devices in the lab, but also the fundamental principles of their operation.", "prerequisite": "EET 105"}, {"course_name": "MET 358: Process Design Engineering", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Introduction to process design for production applications from job shop to world-class manufacturing environments.  MET 358 Process Design Engineering (3) Process design engineering includes the theory and application of principles and practices for economical tool design. Students will learn and demonstrate the use of basic engineering metrology tools. Students will learn and apply the principles of geometric dimensioning and tolerancing to datum systems. Students will learn the elements of process design for a variety of manufacturing processes currently used in industry with a focus on material removal methods including computer numerical control machining. Students will learn the fundamentals of process specification, planning, and fixture design for high-volume material removal operations. Students will participate in a team project to design and build a production machining fixture. The project teams will document and present their designs.This course is the second of a three-course sequence with a focus on manufacturing. The first two courses, Introduction to Manufacturing Processes and Process Design Engineering, are required in the Mechanical Engineering Technology program at Penn State Capital College. The third course, Manufacturing Engineering, is a senior-level technical elective. The course in this proposal will be offered every spring semester with a projected enrollment of 30. All lab work will be done in the Engineering Lab Building.Students are evaluated based on their individual performance as well as their participation as a team member. Evaluation opportunities are both lecture and lab-related. There are two exams and a couple of short projects that each student will complete. Student teams will conduct a machining experiment, which each student will analyze in a formal lab report. Project teams will document their fixture designs with drawings and supporting descriptions. Also, each team will prepare a formal presentation showcasing their fixtures and present it to the class.", "prerequisite": "IET 321"}, {"course_name": "MET 365: Design of Machine Elements", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Design of structural and mechanical elements with emphasis on theories of fatigue failure.  MET 365 Design of Machine Elements (3)Design of Machine Elements covers a wide array of mechanical engineering principles. The course draws heavily on the knowledge gained in the strength of materials lecture and laboratory courses. Failure Theory is covered for both static and dynamic loading conditions. The study of failure under 'low stress' cyclic loading, also called fatigue, is a feature of failure theory study. Finally, the theories are applied to the design of machine and structural elements that include beams, columns, pressure vessels, shafts, keys, couplings, belt and chain drives, fasteners, springs, gears, brakes, and clutches. The effects of wear and lubrication on machine design are also examined.", "prerequisite": "ET 322"}, {"course_name": "MET 370: Engineering Materials Laboratory", "department": "Mechanical Engineering Technology (MET)", "credits": "1 Credits", "description": "Materials Science and Engineering is an organized investigation of engineering materials, including their classification, properties, and means of testing to determine their properties. In materials courses different topics such as atomic bonding, crystalline structure of materials, structural imperfections, solid state diffusion, plastic deformation, mechanical properties of engineering materials, systematic analysis of materials failure, phase diagrams and kinetics are discussed. The application of materials in manufactured products and construction, and the effects of both manufacturing processes and in-service stress on materials are considered. The laboratory subjects combine hands-on experiments with the materials which will be discussed in the lecture. Sample preparation, tension tests, hardness test, impact resistance, heat treatment, fatigue testing, torsion, shear, bending, etc. are some of the experiments which may be performed in the lab sessions. The report for the lab session is a necessary component which is a practice for written technical communication."}, {"course_name": "MET 397: Special Topics", "department": "Mechanical Engineering Technology (MET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "MET 403: Advanced Mechanical Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Continuation of strength of materials and machine design, with emphasis on advanced methods of design and analysis of machine elements.", "prerequisite": "MET 365"}, {"course_name": "MET 415: Finite Element Analysis Applications I", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Solutions of advanced engineering design problems using finite elements. Intended for engineering technologists.  MET 415 Finite Element Analysis Applications I (3) Finite Element Analysis Applications I is a required course for junior or senior-level students in the Mechanical Engineering Technology (METBD) baccalaureate degree program. Finite element analysis (FEA) is a computer-simulation tool which is frequently used in engineering practice. Students study fundamental topics in static, structural FEA with the goal of mastering the usage of this software tool to become efficient and effective users of FEA technology in their engineering careers. Emphasis is placed on appropriate modeling (symmetry, simplifying assumptions, etc.), clear communication of analysis findings, and verification of results.", "prerequisite": "MET 320"}, {"course_name": "MET 417: Finite Element Analysis", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Formulation and computer implementation of finite element models for solving problems in heat transfer, fluid flow, and solid mechanics.", "prerequisite": "MET 365"}, {"course_name": "MET 418: Finite Element Analysis for Plastics Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Solutions of advanced engineering problems using finite element and finite difference techniques; advanced topics in computer-aided manufacturing; problems in optimization and design.", "prerequisite": "EGT 120"}, {"course_name": "MET 425: Finite Element Analysis Applications II", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Solutions of advanced engineering design problems using finite element methods.  MET 425 Finite Element Analysis Applications II (3) Students study advanced topics in finite element analysis (FEA), including CAD interfaces, non-linear behavior, heat transfer analysis, dynamic analysis, optimization and/or design of experiments (DOE), and design and analysis to code. Emphasis is placed on efficient models (symmetry, simplifying assumptions, etc.) and verification of results.", "prerequisite": "MET 415"}, {"course_name": "MET 431: Heat Transfer", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Basic principles of conduction, convection, and radiation with applications.", "prerequisite": "MET 332"}, {"course_name": "MET 432: Fluid Power", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Principles of fluid flow, hydraulic components, and hydraulic circuits having application to industry.  MET 432 Fluid Power (3) This course studies fluid motion, flow, and energy losses, as well as, fluid storage and distribution. Specific devices are examined, including hydraulic pumps and air compressors; hydraulic and pneumatic actuators such as motors and cylinders; and fluid power circuit valves and other ancillary devices. Heat transfer in fluid power circuits is evaluated. Fluid power circuit design is presented using electrical and electronic controls with ladder logic programming.", "prerequisite": "ME 300"}, {"course_name": "MET 435: Building Energy Systems", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Analysis and design of components and systems for building heating and cooling; emphasis on applying the thermal sciences.", "prerequisite": "MET 332"}, {"course_name": "MET 436: Energy Conservation Systems", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Analysis of processes and systems for energy conversion, including power, refrigeration and air conditioning cycles, thermoelectric etc.", "prerequisite": "ME 300"}, {"course_name": "MET 438: Thermal Engineering B", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Applied thermodynamics of power cycles; refrigeration and air conditioning cycles; combustion; psychometrics; and gas mixtures.", "prerequisite": "MET 332"}, {"course_name": "MET 440: Vibrations for Technologists", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Principles of basic vibration theory, vibration measurement, data acquisition and analysis, and the effective presentation of vibration data.  MET 440 Vibrations for Technologists (3) This course will introduce students to basic vibration theory. The theoretical topics will include lumped parameter, single degree-of-freedom and multi degree-of-freedom systems with descriptions of damping models, transmissibility, and transient behavior. Simple continuous systems will also be described. The focus of the course will be on data acquisition and data analysis and on practical vibration solutions. Students learn how to install various measurement devices and how to discriminatively process vibration signals. They also learn effective ways of presenting data to engineering and management. The practical vibration solutions presented will allow the student to understand and solve general problems typically encountered by a technologist in industry.Student performance will be evaluated by exams, graded homework, assignments, and laboratory reports.", "prerequisite": "MET 206"}, {"course_name": "MET 441: Vibration Analysis", "department": "Mechanical Engineering Technology (MET)", "credits": "4 Credits", "description": "Analysis of motion arising from lateral and torsional vibrations of systems; free and forced vibrations; damping; isolation; balancing.", "prerequisite": "EMCH 212"}, {"course_name": "MET 452: Rapid Prototyping", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Introduction to the production of prototypes directly from computer models.", "prerequisite": "IET 216"}, {"course_name": "MET 454: Automatic Controls", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "An introduction to basic automatic control theory, practical applications of automatic controls to typical industrial machinery, HVAC equipment, etc.  MET 454 Automatic Controls (3) This course is intended for mechanical engineering technology students. It provides the student with a spectrum of knowledge about process controls and control systems. The course will cover some of the theoretical and practical concepts that underline the analysis and response of linear control systems. A brief coverage of industrial and electronic components used in modern control engineering is also necessary. Examples include microprocessors, Operational amplifiers, Solid state switches, relays, filters, PLC's, motors, etc. Principles of closed-loop control systems and stability analysis using the Laplace transform are also discussed. Laboratory demonstration on PLC's and the use of computer simulation for modeling control systems are available.", "prerequisite": "EMCH 212"}, {"course_name": "MET 455: Mechatronics", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Integration of mechanical and electronic systems implemented using data acquisition systems, sensors, actuators, signal conditioning, feedback controls, and programmable logic controllers.  MET 455 Mechatronics (3) Mechatronics is essential to the design and manufacture of modern products and processes. Mechatronics design is an approach where mechanical, electronic, computer, and control subsystems are designed simultaneously to function as an integrated system forcing the designer to be familiar with several disciplines. The course offers an integrated approach to engineering, incorporating product design, microprocessor-based control, manufacturing systems, modeling, and simulation. Mechatronic systems depend for their unique functionality on computer software; whether PC or PLC. This course studies mechatronics at both the theoretical and practical level using in-class lectures with formal concepts and laboratory simulations to prove out design concepts. Emphasis in the course is placed on physical understanding of the system rather than on mathematical formalities.Lecture topics include the fundamental aspects such as automation safety, logic functions, Boolean algebra, system input and output sources, flow charting, PLC programming and system design. Each of the lecture topics are reinforced using lab assignments based on software simulations or physical hardware configurations designed to stimulate the student's involvement and interest.", "prerequisite": "EET 100"}, {"course_name": "MET 457: Lean Manufacturing", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Principles and methods of Lean Manufacturing currently used in modern industries.  MET 457 Lean Manufacturing (3)This course introduces the students to the methods of Lean Manufacturing used currently in the manufacturing industry. The basic Lean Manufacturing topics covered in the lecture include its history, the commitment required by a company to start and sustain Lean Mfg, team building, and the training required by both management and the employees. To aid in the organization of the many Lean topics lectured on and to give the students a structured guideline for analyzing a process, the method of Value Stream Management is used. This method, when used on either a manufacturing or office environment, maps the manufacturing process and analyzes it for opportunities to reduce waste. Once the process mapping has been accomplished, the more advanced Lean topics are then covered which introduces the student to methods of reducing or eliminating waste in the manufacturing process. These topics include fast setup (SMED), plant floor organization (5S), improving equipment uptime (TPM), improving product quality, error proofing a process (Poka-Yoke), work balancing and cellular layout. Additionally, the most advanced topics of autonomation, just-in-time (JIT), flexible or agile manufacturing, and Kanban are covered. In order for the student to fully comprehend the material presented, the students are placed into teams that are sponsored by local industries to work on a manufacturing process. The students are given the opportunity to explore a manufacturing process and develop ways to eliminate problems, issues, and waster in an actual situation rather than a simulation.", "prerequisite": "IET 215"}, {"course_name": "MET 458: Controls Laboratory", "department": "Mechanical Engineering Technology (MET)", "credits": "1 Credits", "description": "Introduction to open loop, closed loop, error analysis, and main components of a control loop. Analysis concepts cover first and second-order systems, stability criterion, and transfer functions. Application of electronics, analog/digital convertors, and electrical circuits. Properties of systems, time constant, process gain, natural and damped frequency, transient and steady state responses. Design of proportional, derivative and integral controllers based on closed-loop specifications. Microprocessor selection, programing and interfacing for system automation and control. Software design and implementation for process monitoring and logic control. Examples of mechanical systems utilizing sensors and actuator technologies, including amplifiers. Laboratory experiments give hands-on experience with components and equipment used in the design of mechatronics product. Emphasis on interpretation of experimental data, group dynamics, experimental design, and report writing."}, {"course_name": "MET 461: Advanced Machine Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Stress analysis, material selection, design of machine elements, design of connections, and computer-aided design.", "prerequisite": "MET 210W"}, {"course_name": "MET 462: Internal Combustion Engine Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "The effect of operation requirements on design and construction of internal combustion engines; study of support systems and emissions control.", "prerequisite": "MET 332"}, {"course_name": "MET 470: Materials Engineering", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Study of material selection, material properties, material test methods, and special topics.", "prerequisite": "CHEM 110"}, {"course_name": "MET 480: Senior Capstone", "department": "Mechanical Engineering Technology (MET)", "credits": "1 Credits", "description": "Career and professional topics; development of year-long senior project with industry.  MET 480 Senior Capstone (1) Senior Capstone is a required course for senior-level students in the Mechanical Engineering Technology (METBD) baccalaureate degree program. The purpose of the course is to introduce students to the practices associated with managing an industrial-based project. Student teams begin working on a capstone project. Project definition, specification development, scheduling, engineering constraints, and budgeting of both time and money are discussed. Other issues of career development are presented, such as interviewing, resume preparation, and career opportunities. Ethical issues related to the discipline are discussed. Engineering economy, OSHA, and safety are introduced.", "prerequisite": "IET 216"}, {"course_name": "MET 481: Project Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "This course is the first of a two-part course sequence that comprises the capstone design experience in the MET major (the second course is MET 486, Project Design). In this course students study the engineering design process, begin working on their senior design project, and learn about professional topics related to industry. Topics in the engineering design process include needs identification, concept generation, concept selection, costing, and project planning. Professional topics include communication, team work, ethics, safety, and sustainability. Engineering economics and its application to the capstone design project is a featured topic. Students are evaluated through assignments and quizzes. One major component of the course is to begin work on a capstone design project. Students typically work in teams of 3 to 4 on an industrially-sponsored project or other project approved by the faculty. The student teams work with the sponsor to develop a project scope and plan, perform background research, begin to solve the problem, and present their project proposal orally and in written form. Students are evaluated on both their technical and presentation skills, as well as their ability to function as a team. This capstone course is required in the Mechanical Engineering Technology (MET) program.", "prerequisite": "MET 365"}, {"course_name": "MET 485: Senior Industrial Project", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Individual or group design projects in mechanical design or materials.", "prerequisite": "MET 331W"}, {"course_name": "MET 486: Project Design", "department": "Mechanical Engineering Technology (MET)", "credits": "3 Credits", "description": "Design of system or machine, including decision making, engineering analysis, layout, detail drawings, specifications, construction.", "prerequisite": "MET 481"}, {"course_name": "MET 495: Internship", "department": "Mechanical Engineering Technology (MET)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica or internships.  Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor", "other": ["Full-Time Equivalent Course"]}, {"course_name": "MET 496: Independent Studies", "department": "Mechanical Engineering Technology (MET)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "MET 497: Special Topics", "department": "Mechanical Engineering Technology (MET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]