[{"course_name": "MGMT 1: Business Leadership", "department": "Management (MGMT)", "credits": "3 Credits", "description": "The aim of this course is to introduce fundamental concepts of business management and leadership.  MGMT 001S MGMT 001S Business Leadership (3) (FYS)MGMT 001S aims to introduce students to the academic discipline of management through the study of leadership and management principles and practices. The course is intended for First Year students enrolled in the Smeal College of Business Administration and other First Year students as recommended by their advisor.The course will cover a variety of concepts pertinent to leadership and management. We will begin by focusing on Leadership Theory and the practical manifestation of leadership in business and society. We will discuss how different leadership styles have appropriate application, and attempt to identify current leadership practices. We will also trace the evolution of management theory in this century, and distinguish between facts and fads in management. The class will then investigate the current business/industrial trend toward \"Teams\" and group problem solving, and will participate in experiential team-building exercises.The course format will consist of lectures, outside reading, small-group discussion, class discussion and projects, and experiential exercises. Students will be, required to use multiple University resources, including the libraries, the computer center, class list-serve and e-mail, the internet, and the CDPC. Projects will include investigation of various disciplines within the broad area of business as exemplified by the variety of majors and options in the Smeal College of Business Administration.The term grade for this course will be determined by a weighted average of essay exams, written assignments, and class participation. The weights are as follows: mid-term 35%, writing assignments 15%, participation 15%, and final exam 35%.This course is also intended to fulfill the First Year Seminar requirement for students in the Smeal College of Business Administration. The course will accomplish this goal by conforming to the Criteria for First Year Seminars as spelled out in the Faculty Senate Legislation of 1998.", "other": ["First-Year Seminar"]}, {"course_name": "MGMT 100: Survey of Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Introduction to organizational factors relevant to management processes, including leadership, motivation, job design, technology, organizational design and environments, systems, change. May not be used to satisfy Penn State Business baccalaureate degree requirements.  Not available to students who have taken B A 304 or MGMT 301."}, {"course_name": "MGMT 100W: Survey of Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Introduction to organizational factors relevant to management processes, including leadership, motivation, job design, technology, organizational design and environments, systems, change.  May not be used to satisfy Penn State Business baccalaureate degree requirements. Not available to students who have taken B A 304 or MGMT 301.", "other": ["Writing Across the Curriculum"]}, {"course_name": "MGMT 197: Special Topics", "department": "Management (MGMT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MGMT 199: Foreign Studies", "department": "Management (MGMT)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MGMT 215: Entrepreneurial Mindset", "department": "Management (MGMT)", "credits": "3 Credits", "description": "This course provides the opportunity to learn to think like an entrepreneur in the broader context of social entrepreneurship, intrapreneurship, creative problem solving, opportunity recognition, and innovation.  MGMT 215 Entrepreneurial Mindset (3) An entrepreneurial mindset can be applied to different situations such as social entrepreneurship, intrapreneurship, creative problem solving, opportunity recognition, technology management, innovation and career development, etc. The skills and attributes of an entrepreneurial mindset can be used to expand career options and career paths for students in any major. Students will develop self-efficacy, leadership, recognition of new opportunities, resourcefulness, creativity and comfort with ambiguity. Further, this course will help students develop an appreciation for mistakes and failure as valuable learning opportunities. Through experiential exercises and problem based learning the student will be afforded the opportunity to study, apply and absorb an entrepreneurial mindset as an approach to viewing the world, to recognizing opportunities and to developing novel solutions. After taking this course the student, regardless of a student's major or college, will have a greater understanding of how to apply entrepreneurial thinking to problems and adopt entrepreneurial solutions to those problems to transform them from problems into opportunities."}, {"course_name": "MGMT 296: Independent Studies", "department": "Management (MGMT)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "MGMT 296H: Independent Studies", "department": "Management (MGMT)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "MGMT 297: Special Topics", "department": "Management (MGMT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MGMT 299: Foreign Studies", "department": "Management (MGMT)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MGMT 301: Basic Management Concepts", "department": "Management (MGMT)", "credits": "3 Credits", "description": "MGMT 301 exposes undergraduate students to the fundamental principles and basic concepts of management, with emphasis on organizational design, management processes, leadership, motivation, and managing teams and individuals in a global business environment. Understanding these principles and concepts is extremely important for students preparing for and entering the business profession. Managers plan, organize, lead, and control. These functions provide a foundation for MGMT 301 and are included in all course topics and modules. Typical modules include: An Overview of Management; Strategy and Structure; Organizational Behavior; and Group/Organizational Dynamics. The overview of management focuses on the manager's role and function, decision making, ethics, and managerial oversight. Topics covered in a strategy and structure module will include culture, environmental influences, strategy, organizational structure, globalization, and innovation. Organizational Behavior focuses on how decision making is influenced by various stakeholders who have formal and informal authority and control in a business. What motivates individuals and who are leaders in an organization is discussed along with group dynamics. Understanding team processes, conflict, adaptation to change, and various levels of group and one-on-one communication is important and will be covered by reviewing traditional management strategies and structures along with discussions on current and evolving management issues. Students may earn credit towards graduation for only one of the following; BA 304, MGMT 301, MGMT 301H, or MGMT 301W."}, {"course_name": "MGMT 301H: Basic Management Concepts (Honors)", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Study of fundamental principles and processes available to the understanding of management. Students will likely spend a major part of their lives working for one or, perhaps, leading one they have started. Although sound technical skills and relevant knowledge are important reasons an organization hires employees, the ability to lead and manage people is critical for future advancement. This course is focused on the social facets of organizations - as opposed to elements such as finance, marketing, operations, etc. A good grasp of how organizations work will help students succeed in their careers. This course provides a forum to critically engage with theories and concepts that attempt to explain organizational practices. It is designed to not only provide students with the basic fundamentals that may be used as tools to become better managers, but also help students question their own assumptions about how people ought to behave and how they actually do behave in organizations. This course, builds on the concepts embedded in a traditional foundation management course by researching the theories these courses are built upon and pointing out the advantages and limitations of these different approaches. The topics covered in this course will provide both the breadth and depth of understanding of various topics including organizational structure, strategy, culture, leadership styles, ethics, and staffing that fall under the domain of Management and Organization. In addition, specific challenges faced by managers in contemporary organizations such as managing teams, globalization, and diversity are also incorporated. These topics are covered using lectures, independent research, case analyses and experiential exercises that will help you develop in-depth domain knowledge as well as managerial skills. In addition, the course will facilitate the development of research and analytic skills through the inclusion of individual presentations of current topics that represent critical issues in organizations. A team project will further enhance knowledge acquisition of specific issues facing organizations and, since teams are prevalent across most organizational settings, also help develop teamwork skills. Students may earn credit towards graduation for only one of the following; BA 304, MGMT 301, MGMT 301H, or MGMT 301W.", "other": ["Honors"]}, {"course_name": "MGMT 301M: Basic Management Concepts", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Examination of fundamental principles and processes applicable to the study of managment. May not be used to satisfy Smeal College baccalaureate degree requirements.  Not available to students who have taken B A 304.", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "MGMT 301W: Basic Management Concepts", "department": "Management (MGMT)", "credits": "3 Credits", "description": "MGMT 301W, Basic Management Concepts, is a three credit course offered each semester across Penn State. MGMT 301W exposes undergraduate students to the fundamental principles and basic concepts of management, with emphasis on organizational design, management processes, leadership, motivation, and managing teams and individuals in a global business environment. Understanding these principles and concepts is extremely important for students preparing for and entering the business profession. Managers plan, organize, lead, and control. These functions provide a foundation for MGMT 301W and are included in all course topics and modules. Typical modules include: An Overview of Management; Strategy and Structure; Organizational Behavior; and Group/Organizational Dynamics. The overview of management focuses on the manager's role and function, decision making, ethics, and managerial oversight. Topics covered in a strategy and structure module will include culture, environmental influences, strategy, organizational structure, globalization, and innovation. Organizational Behavior focuses on how decision making is influenced by various stakeholders who have formal and informal authority and control in a business. What motivates individuals and who are leaders in an organization is discussed along with group dynamics. Understanding team processes, conflict, adaptation to change, and various levels of group and one-on-one communication is important and will be covered by reviewing traditional management strategies and structures along with discussions on current and evolving management issues. Students may earn credit towards graduation for only one of the following; BA 304, MGMT 301, MGMT 301H, or MGMT 301W.", "other": ["Writing Across the Curriculum"]}, {"course_name": "MGMT 320: Establishing Workforce Diversity and Inclusion", "department": "Management (MGMT)", "credits": "3 Credits", "description": "This course provides students with an understanding of the relevance and importance of diversity within corporate America as well as a review of global business practices. Students will examine marketing, management, and finance topics within the context of issues pertaining to persons of different orientations, gender and ethnic backgrounds. Diversity Workforce and Inclusion looks at topics that directly and indirectly impact employment opportunities, day-to-day work practices, and the civil environment in which individuals deal with as they attempt to establish themselves as successful individuals on equal footing with their colleagues. Course participants will be given the opportunity to examine their own biases and questions surrounding the topics of diversity, inclusion, and leadership in a multicultural environment. Current national and global trends in workplace diversity will be covered along with federal mandates that impact employment, education, and civil matters."}, {"course_name": "MGMT 321: Leadership and Motivation", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Applies organizational behavior theories, concepts, and skills to leading and motivating individuals and groups.", "prerequisite": "BA 304"}, {"course_name": "MGMT 326: Organizational Behavior and Design", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Concepts, theories, and methods of managing people and designing organizations.  MGMT 326 Organizational Behavior and Design (3) This introductory course covers the concepts, theories, and methods of managing people and designing organizations. Issues and challenges of managing at different organizational levels (individual, group, project, and total organization) are discussed and illustrated with real-world examples. Students learn about the latest means of designing high-performing organizations, including how to change an organization. This course will serve as a foundation for taking advanced management courses. The primary method of evaluation is an examination after each of the four major parts of the course, but class participation and short papers may also be used for evaluation.", "prerequisite": "BA 304"}, {"course_name": "MGMT 331: Management and Organization", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Designing organizations to effectively manage new technologies, structures, and people in changing global contexts.", "prerequisite": "BA 304"}, {"course_name": "MGMT 341: Human Resource Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Introduction to the strategic planning and implementation of human resource management, including staffing, development, appraisal, and rewards.", "prerequisite": "BA 304"}, {"course_name": "MGMT 355: Leadership and Change in Organizations", "department": "Management (MGMT)", "credits": "3 Credits", "description": "This course focuses on concerns with understanding yourself as a leader in organizations-especially organizations undergoing change.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 365: Social Entrepreneurship", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Social entrepreneurship exposes students to the power of solving social problems through market-based solutions. Entrepreneurs, in general, create opportunities through resource integration. Therefore, social entrepreneurs create socially beneficial opportunities through the integration of public and private resources. In this course, students will explore the latest regulatory, legal and macroenvironmental policies and issues related to social entrepreneurship. In contrast to existing entrepreneurship courses, social impact is the primary purpose driving firm creation. Profitability, or value capture is not required, but might provide an innovative business model choice. In order to support the creation and growth of important social opportunities, entrepreneurs should consider different business model innovations beyond financial returns alone might produce. After taking this course, students will be alert to legal and regulatory opportunities, be capable of developing relevant marketing innovations and provide measurement and impact analyses prior to and after implementation of their strategies associated with social entrepreneurship. These learning outcomes will benefit traditional entrepreneurs and social entrepreneurs in developing innovative solutions.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 395: Internship", "department": "Management (MGMT)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor."}, {"course_name": "MGMT 397: Special Topics", "department": "Management (MGMT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MGMT 399: Foreign Studies", "department": "Management (MGMT)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MGMT 400: Organization Development", "department": "Management (MGMT)", "credits": "3 Credits", "description": "A study of organizational change and methodologies related with change and improvement.  Examination of planned change on processes, strategies, people and culture in organizations.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 401: Contemporary Issues in Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Advanced treatment of topics of current managerial significance. Issues examined will differ by instructor, section, and semester. Consult departmental office.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 409: Project Management for Non-business Majors", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Project management for non-business majors covers the technical and people skills related to project management within a variety of organizational structures. Students learn the tools and concepts needed to successfully balance schedule, budget, and scope while managing risk and resources during the project life cycle. Leadership and teamwork skills are emphasized and practiced in a hands-on approach throughout the duration of the course.", "prerequisite": "5th semester standing"}, {"course_name": "MGMT 410: Project Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "MGMT 410 Project Management (3) Project Management has been labeled by Fortune magazine as the number one career choice for the coming decade. Increasingly, organizations are adopting project management techniques and structures within their business framework. Project management offers the twin advantages of allowing organizations to create products and processes efficiently, through optimal use of resources, and rapidly, in order to respond to rapid time-to-market demands. This course would greatly aid business majors, as companies are in great need of a trained cadre of qualified project managers who can allow the business firm to operate to its highest potential.The role of the instructor in this course is to train students in the wide variety of demands and skills for which they must be qualified: the ability to exert leadership in managing project teams, an understanding of people and behavioral skills, and the ability to effectively use computer-based scheduling and tracking software to keep timetables and schedules.The course itself would be set up around semester-long projects, either developed by the instructor, or developed (in collaboration with the instructor) by students involved in business enterprises. As a result, students would have real-time experience in the challenges of creating a unified team, solving problems, tracking their projects, and presenting a final paper and presentation on the process.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 415: Project Portfolio Management and Organizations", "department": "Management (MGMT)", "credits": "3 Credits", "description": "An advanced course in project management focusing on portfolio planning and control within the context of specific organizational challenges.  MGMT 415 Project Portfolio Management and Organizations (3) Project Portfolio Management (PPM) is a strategically-focused course on the management of projects, programs, and portfolios in organizations. The management of individual projects is a complex, multi-level challenge involving myriad issues of planning, organizing, and controlling all project elements. Project portfolio management addresses a more strategic need; namely, the process of project selection in order to develop a balanced portfolio of projects designed to support organizational initiatives. As a result, this course addresses the critical issues of maximizing value in a portfolio, linking projects to organizational strategy, understanding the critical organization effects of structure, environment, and culture on project success, and creating a coherent PPM framework for the firm. Because the focus is more strategic, the role of the instructor in this course is to go beyond the mechanics of planning and controlling a single project to training students how to think strategically where projects and programs are concerned; to recognize their role in creating a PPM plan for an organization, selecting projects for value, rebalancing a project portfolio, and maintaining this focus within the organization.", "prerequisite": "SCM 301"}, {"course_name": "MGMT 418: Project Planning and Resource Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Advanced course in project management focusing on a more in-depth approach to project planning and scheduling and resource management. MGMT 418 Project Planning and Resource Management (3) Project Planning and Resource Management is a more in-depth look at some of the most important aspects of project management; the ability to accurately plan and schedule projects using the latest and most accurate methods. Further, the course addresses resource management within the context of planning, noting the important linkage between these two elements. Accurate planning can be done through a variety of techniques, including CPM, PERT, simulation, linear programming and other optimization methods. Students will learn when each of these methods are most useful, benefits and drawbacks of various planning and resource management techniques, and how to apply these techniques to their projects. In addition, students will learn about different types of project risks, and techniques for analyzing and managing these risks. Because the focus is hand-on and problem-based. The role of the instructor in this course is to demonstrate these analytical techniques through classroom exercises and assignments and software packages, including MS Project, simulation, and Analytic Hierarchical Process (AHP).", "prerequisite": "SCM 301"}, {"course_name": "MGMT 420: Negotiation and Conflict Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "An exploration of the sources of interpersonal conflict and strategies of resolution in the managerial context.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 424: Interpersonal Relationships in Organizations", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Developing individual skills in interpersonal and group settings and experience-based and conceptual training in relating effectively to other people.", "prerequisite": "MGMT 321"}, {"course_name": "MGMT 425: New Venture Creation", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Via problem-based learning, students define new business ventures to meet current market needs, develop business models, and present to various stakeholders. The goal of New Venture Creation is to better prepare undergraduate students to be leaders in adaptive, globally-minded, technology-savvy organizations. The course is structured so students develop skills that are of high value in any workplace: leadership skills, self-efficacy, creativity and the ability to deal with ambiguity. Upon course completion, students will have a working knowledge of traditional and non-traditional ways for identifying a new product or business opportunity, quantifying the potential, understanding the key competitive factors, researching the audience, and producing a convincing plan for financing and launch. Students who want to augment the skills and knowledge from their major with the ability to develop a new product/service/process, will find New Venture Creation a valuable course. This is a novel problem-based learning (PBL) course, where the learning is student-centered, with faculty acting primarily in the role of facilitators. Active/Experiential learning happens in this course because students develop ownership of their venture concepts and are fully responsible for the genesis of ideas.", "prerequisite": "ECON 102", "other": ["Cross-listed with: ENGR 425, IST 425"]}, {"course_name": "MGMT 426: Invention Commercialization", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Working with Penn State inventions selected by the Intellectual Property Office, student teams define an optimum commercialization path each technology.  ENGR 426ENGR (MGMT/IST/ENTR) 426 Invention Commercialization (3) The goal of ENGR (MGMT/IST/ENTR) 426 is to have students understand why invention commercialization is complicated and difficult by participating in the process. For example, the inventor rarely has insights into the markets for his/her invention, is often not interested in the details of commercialization, and can be secretive. In addition, the business and financial communities often do not take the time, or have the resources, to understand new technologies and perform complex due diligence. Thus lack of due diligence often leads to rejection of innovation because existing companies often discount new technologies from outside the company as NIH - 'not invented here'. Effective transfer of new invention or innovation to a commercial product requires at least three different functional communities to interface: technical, legal and business. Each uses a different language, comes from different educational and cultural backgrounds, and may have an inherent distrust of the others. These functional barriers are difficult to overcome.This course teaches how these barriers can be broken down as student teams help bridge the perceived chasm between key players in the invention commercialization process. In these teams, students bring the skills and knowledge from their major to develop an invention commercialization recommendation for the Technology Transfer Office and the inventor. For example, business students focus on finance and market opportunity assessment; engineering and IST students focus on design refinements, prototyping support, and (if appropriate) making technology suggestions to the inventor.Upon completing the course, the students will have a working knowledge of different university and corporate technology or invention commercialization processes, important intellectual property management tools for inventions (patents, license agreements, option agreements) source of funding to move inventions toward product development, and delivering top quality presentations which outline the recommended commercialization path. Students who enjoy open-ended projects which involve the interplay of business and invention of who wants to work on interdisciplinary teams with the newest inventions will find this course a valuable course. NOTE: Because the inventions/products are based on Penn State faculty intellectual property, students must sign the Penn State Special Intellectual Property Agreement For Students - For Use When Assigning Intellectual Property to The Pennsylvania State University. The form can be viewed at http://guru.psu.edu/policies/RAG13.htmlThe course will be offered both Spring and Fall semesters with an enrollment of 40 students.", "prerequisite": "ECON 102", "other": ["Cross-listed with: ENGR 426, IST 426"]}, {"course_name": "MGMT 427: Managing an Entrepreneurial Start-Up Company", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Exploration of the tensions and experiences of starting and growing a new company.  MGMT 427 Managing an Entrepreneurial Start-Up Company (3)Start-up companies have a high failure rate. Acquiring and balancing limited resources, changing direction quickly, building a coherent team, managing intellectual property, and creating new markets all test a wide range of managerial skills not usually demanded in one person within a larger organization. Whereas a large company has a strong and well-defined structure and ample resources to deal with unexpected challenges, a start-up usually has insufficient resources, or management experience and yet must deal with daily important and often unpredictable forces. It is the tenacity of an entrepreneur that can take a company through the valleys of despair to eventually succeed. Students will be exposed to these tensions and experience through problem-based learning methods what it is like to start and grow a new company. The course will provide students with knowledge and experience to increase the likelihood of success whether as a principal in a small company or an investor representative.", "prerequisite": "ECON 102"}, {"course_name": "MGMT 427W: Managing an Entrepreneurial Start-up", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Start-up companies have a high failure rate. Acquiring and balancing limited resources, changing direction quickly, building a coherent team, developing an organization's culture from scratch, managing intellectual property, and creating new markets all test a wide range of managerial skills not usually demanded in one person within a larger organization. Whereas a large company has a strong and well-defined structure and ample resources to deal with unexpected challenges, a start-up usually has insufficient resources and/or management experience, yet it must deal on a daily basis with important and often unpredictable forces. Students will be exposed to these tensions and experience through problem-based learning methods that illustrate what it is like to start and grow a new company. The course will provide students with the knowledge and experience to increase their likelihood of success whether as a principal in a small company or an investor representative. Managing a Startup is a problem-based learning (PBL) course, where the learning is student-centered, with faculty acting primarily in the role of facilitators. Active learning happens in this course because students are engaged in the analysis of the complex situations that underlie startup companies. The course leverages the on-line course management system to define weekly learning objectives, support electronic delivery of assignments and provide robust video content from entrepreneurs, investors and key employees, who provide additional insights into the management decisions and ethical dilemmas the leader of a startup faces. Because the course is structured around the on-line course management system, it could be offered at any Penn State location with very little revision. The particular companies and cases that are the focus of the class are easily adapted by using different case studies, companies and course mentors.", "prerequisite": "CAS 100", "other": ["Writing Across the Curriculum"]}, {"course_name": "MGMT 430: Project Risk Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Risk management is indispensable for effective project management. The course provides students with proven theories, tools, and best practices in risk management in order to manage a project to its success. From the course, students will recognize that project risks are not surprises and can be effectively managed by conducting analytics and best practices in risk management planning, risk identification, qualitative and quantitative risk analyses, risk response planning, and risk monitoring and control. The course will also emphasize the applications of these concepts to practices. Case studies will be used to help students develop a practical understanding of the best practices in project risk management.", "prerequisite": "SCM 301"}, {"course_name": "MGMT 431: Entrepreneurship and Small Business Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Entrepreneurship, new ventures, and management of small firms.", "prerequisite": "ACCTG 211"}, {"course_name": "MGMT 432: Small Business Field Study", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Supervised field study with a small firm.", "prerequisite": "MGMT 431"}, {"course_name": "MGMT 433: Leadership and Team Building", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Team-based learning approach to developing conceptual knowledge, skills sets, and personal competencies needed for leading and managing organizations.  MGMT 433 Leadership and Team Building (3)To lead effectively and to manage others in contemporary work contexts requires mastery not only of conceptual knowledge, but also of the intra- and inter-personal competencies and skills sets that are vital to successful performance in a work environment. This course emphasizes an experiential-based learning approach that is designed to impart skill sets and competencies in areas such as leadership, teambuilding, negotiating, communicating, valuing diversity, managing conflict, and more. The course thus uses assessment exercises, role playing techniques, group problem solving exercises, and other experiential-based learning techniques in order to provide students with a framework for better understanding their own strengths and weaknesses, to enable them to practice, enhance, and to gain confidence in their competencies in these various areas, as well as to enable students to better appreciate when and how to effectively apply these skills sets and competencies in the workplace.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 440: Advanced Human Resource Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "In depth study of human resource management and personnel administration functions and processes.", "prerequisite": "MGMT 341"}, {"course_name": "MGMT 441: Organizational Staffing and Development", "department": "Management (MGMT)", "credits": "3 Credits", "description": "This course focuses on the skills and methods managers need to manage staffing and development activities in organizations.  MGMT 441 HRM Professional Seminar (Part 1): Staffing and Development (3) The purpose of this course is to give students the skills and knowledge they need to contribute to organizational staffing and development activities. Students will learn technical and organizational aspects of making hiring decisions, designing and implementing training programs, and developing career management initiatives. Topics include strategic human resource management, HR planning, the contingency workforce, HR information systems and technologies, job design, recruitment, selection, employment legislation, diversity, training, management development, career planning, and the like. This course is normally taken in the first semester of the senior year. It builds on information introduced in MGMT 341 (Human Resources Management) and moves beyond survey-level material to more specialized knowledge and skill. The course is taken concurrently with MGMT 442 (HRM Part One) and is typically taken as a precursor to MGMT 443 (HRM Proseminar, Part Two) and 444 (HRM Practicum, Part Two). These courses together constitute the core of the HRM Option for Management majors.", "prerequisite": "MGMT 341"}, {"course_name": "MGMT 443: Performance Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "This course focuses on skills and methods managers need to enhance the contribution of employees to organizational performance and effectiveness.  MGMT 443 HRM Professional Seminar Part Two: Performance Management (3) The purpose of this course is to give students the skills and knowledge they need to enhance the contribution of employees to the performance and effectiveness of the organization. Students will learn technical and organizational aspects of performance planning, goal setting, performance and feedback, compensation and reward systems, incentive systems, high performance work organizational change, and the like. This course is normally taken in the second semester of the senior year. It builds on information introduced in MGMT 341 (Human Resources Management) and moves beyond survey-level material to more specialized knowledge and skill. The course is taken concurrently with MGMT 444 (HRM Practicum, Part Two) and is typically taken after students have completed MGMT 441 (HRM Proseminar, Part One) and MGMT 442 (HRM Practicum, Part One). These courses together constitute the core of the HRM Option for Management majors.", "prerequisite": "MGMT 341"}, {"course_name": "MGMT 445: Managing a Diverse Workforce", "department": "Management (MGMT)", "credits": "3 Credits", "description": "This course focuses on developing knowledge and skills for managing differences within and among organizations. It provides an in-depth look at the sources of diversity-related conflicts in organizations, constructive approaches for managing these conflicts, and how corporations can leverage diversity for competitive advantage. The overall objective is to provide students with an understanding of the business case for diversity, the legal requirements surrounding the management of diversity in organizations, the structural dimensions of implementing diversity programs, skills for managing diversity in teams, as well as a general sensitivity to the kinds of issues that create conflicts within and between firms. Students will explore legal requirements including: EEOC, affirmative action, and the Americans with Disabilities Act and the implications of these for selection, compensation, promotion and dismissal. Examples of specific steps corporations have taken to address demographic, functional, occupational, and identity-based differences will be provided. Through the use of interactive case studies and experiential exercises, students will be given opportunities to learn about and appreciate their own and others' cultural heritages, reflect on constructive approaches for handling diversity-related conflicts (including those stemming from functional, occupational and identity-based differences as well as demographic ones) and for designing human resource management systems that capitalize on diversity and promotes inclusion.", "prerequisite": "MGMT 301", "other": ["United States Cultures (US)"]}, {"course_name": "MGMT 450: Labor Management Relations", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Study of the key concepts and processes involved in current American labor/management relations.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 451: Business, Ethics, and Society", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Advanced examination of social, ethical, legal, and economic responsibilities of those who must make and execute challenging business decisions and manage others who do. The course focuses on the knowledge, skills, and perspectives that a leader in business must have in order to navigate the intersection of business, ethics and society. This includes prescriptive frameworks for ethical decision making, an understanding of how people actually make ethical and unethical decisions, strategies for creating and sustaining ethical cultures, and practice addressing real and hypothetical challenges to responsible leadership in business.", "prerequisite": "MGMT 215"}, {"course_name": "MGMT 451W: Business, Ethics, and Society", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Advanced examination of social, ethical, legal, economic, equity, environmental, public policy, and political influences on managerial DECISIONS AND STRATEGIES.  MGMT 451W Business, Ethics, and Society (3) Focuses on the knowledge, skills, and perspectives that a manager must have in order to deal with the social, legal, ethical, and political demands in society. Ecological, ethical, and public policy dimensions of various managerial decisions are examined.", "prerequisite": "BA 241", "other": ["Writing Across the Curriculum"]}, {"course_name": "MGMT 453: Creativity and Innovation", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Analysis of the process of innovation in organzations and of how creativity and other variables influence the process.  MGMT 453 Creativity and Innovation (3) Creativity and Innovation analyzes the process of innovation in modern business organizations and the variables that influence the process. The relationship between creativity and innovation is investigated and individual, organizational and environmental influences on both the creative and innovation processes are examined. Special attention is given to organizational architectures that are conducive to innovation. A major objective of the course is to help students develop the competencies necessary for managing innovative organizations.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 457W: Strategic Management of Innovation and Technologies", "department": "Management (MGMT)", "credits": "3 Credits", "description": "New technologies are turned into innovations and create value for consumers only when they are successfully commercialized. Brilliant technologies can sit for years or even decades in the ivory tower. A successful commercialization of certain technologies does not only require deep understanding of the features of the technologies, but also well-developed frameworks to understand the dynamics of the technologies, the industries that the technologies will be applied to, market potential responses to the technologies and other firms who are interested in collaborating or competing to commercialize the technologies. These frameworks help managers to design the optimal strategy for different types of technologies and innovations (including incremental, disruptive, radical, and sustainable innovations) under dynamic market environments. The course covers several concepts, frameworks and tools through case-based learning methods that illustrate how different innovations and technologies are strategically managed and commercialized. Analyzing the successes and failures detailed in the cases will provide students the knowledge and analytical skills needed to develop comprehensive strategies to manage new technologies. This course is writing-intensive so be prepared to horn your business writing skills along the way. Strategic Management of Innovation and Technologies is a case-based learning course, where the learning is student-centered, with faculty acting primarily in the role of facilitators. Active learning happens in this course because students are engaged in actively analyzing cases and applying newly learned frameworks to the cases. The course leverages the University's course content management system (CMS) to define weekly learning objectives, support electronic delivery of assignments and provide robust video content from managers, inventors and venture capitalists, who provide additional insights into the process of technology commercialization. Because the course is structured within the CMS system, it could be offered at any location with very little revision. The companies and cases that are the focus of the class are easily adapted by using different case studies, companies and course mentors.", "prerequisite": "MGMT 453", "other": ["Writing Across the Curriculum"]}, {"course_name": "MGMT 461: International Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Examines issues of nations and cultures including motivation, communication, negotiation, leadership, ethics and social responsibility, and women in management.", "prerequisite": "BA 304", "other": ["International Cultures (IL)"]}, {"course_name": "MGMT 466: Organizational Learning and Knowledge Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Examination of the social processes through which organizations continuously develop, acquire, interpret, and apply information and knowledge for performance enhancement and continuous improvement.  MGMT 466 Organizational Learning and Knowledge Management (3)The primary focus of this course is to examine critically the social structures and processes through which organizations continuously acquire, develop, organize interpret, distribute and apply information and knowledge for performance enhancement and continuous improvement. Topics such as single-loop learning, double loop learning, and deuterolearning (i.e., learning how to learn) are considered, particularly as they apply to self managed work teams, process-based and network structural design, employee involvement approaches, impact of organizational culture and leadership practices. A second focus of the course is to examine the social processes and structures through which the key outcome of the learning process -- organizational knowledge -- usually expressed in terms of improved core competencies, and intellectual capital, can be leveraged across products, functions, business units, geographical regions, and competitive environments to improve organizational performance and competitive advantage and provide added value for customers. Particular emphasis is placed on knowledge management in support of the organization's competitive strategy, with a focus on the exchange of tacit, person-to-person knowledge that is difficult to codify and store. Additional emphasis is placed on the mechanisms available for organizational members to gain access to needed knowledge.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 471: Strategic Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Issues that influence the competitive performance of the firm are identified and examined.  MGMT 471 Strategic Management (3 )This course focuses on the management of the firm using a strategic perspective. The strategic perspective emphasizes the firm as the unit of analysis (e.g., analyzing how a firm competes in its industry), and it addresses key decisions that have a long-term impact on the structure and performance of the organization (e.g., diversifying into a new business or changing the company's strategy). The course draws heavily on prior business courses in accounting, marketing, finance, and international management. Key topics include industry analysis, competitor analysis, company analysis, corporate-level strategy, business-level strategy, strategy implementation, and firm performance. The course is normally taught using the case methods, but the course may include a computer simulation and/or oral group presentations.", "prerequisite": "MGMT 326"}, {"course_name": "MGMT 471W: Strategic Management and Business Policy", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Study of strategic management and business policy formulation and implementation processes.", "prerequisite": "MGMT 301", "other": ["Writing Across the Curriculum"]}, {"course_name": "MGMT 475W: Strategic Product Development", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Study of an organization, industry, and evaluation of the introduction to a new product.  Preparation of proposal for industry product.  MGMT 475W Strategic Product Development (3)This course is the first of a two course sequence that will provide a capstone experience for the Interdisciplinary Business and Engineering BS degree. The tools of strategic management and cross-functional collaboration will be introduced and serve as a background for the design, development, and implementation of a new product within an existing corporation. Student teams will be provided with an industry concept and work toward the objectives of a firm sponsoring the product concept. During the first semester, the evaluation of the product including feasibility of the product, design, manufacture, and intellectual property will be evaluated by student teams and presented to the firm. The final document will include a complete written assessment of each of the components of feasibility.", "prerequisite": "MGMT 301", "other": ["Writing Across the Curriculum"]}, {"course_name": "MGMT 476: Product Realization Capstone", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Study of an organization, industry, and evaluation of the introduction of a new product.  Preparation of proposal for industry product.  MGMT 476 Product Realization Capstone (3)This course is the second of a two course sequence that will provide a capstone experience for the Interdisciplinary Business & Engineering BD degree. The tools of strategic management and cross-functional collaboration will be used to design, develop, and implement a new product within an existing corporation. Student teams will be provided with an industry concept and work toward the objectives of a firm sponsoring the product concept. During the second semester, the evaluation of the product including feasibility of the product, design, manufacture, and intellectual property will be used by student teams and a final presentation and written assessment will be prepared for the firm.", "prerequisite": "MGMT 475W"}, {"course_name": "MGMT 480: Business Transformation Consulting", "department": "Management (MGMT)", "credits": "3 Credits", "description": "This course provides key issues, concepts, and methodologies associated with business transformation and management consulting. Students will explore the professional services industry, industry best practices, and a variety of client contexts where advisory services are needed. Additionally, students will learn common consulting methods and how to apply them in client organizations. A consulting-oriented solution development lifecycle is used as the organizing framework of the course. The primary phases of this framework include: client qualification/validation, problem identification, data gathering, requirements definition, project planning, solution design, solution development, solution implementation, and client relationship management. Students will learn to how to identify and define organization problems, highlight pain points, map work flows, explore business models, investigate strategic alignment, develop recommendations, present business cases, and prototype solutions. The course will also enable students to learn how to advise clients and present key points and recommendations in a direct, clear, and compelling manner. Course objectives are to provide students with consultative methods, skills, and tools essential to facilitating organizational change. The course is designed around real-world problems and projects involving organizational assessment, solution development, and implementation planning. In this course, each student will be assigned to a consulting team. Each consulting team will be assigned to work with a corporate client to address a real-world business problem. Students will learn how to work proactively with key stakeholders to identify and understand the choices, risks, and benefits of particular solution alternatives, prepare project proposals, develop a plan to support the needed changes, and assess the effectiveness of business transformation efforts. Depending on the project, the recommended solution may be prototyped or fully developed during the course.", "prerequisite": "MGMT 301"}, {"course_name": "MGMT 481: Global Strategic Management", "department": "Management (MGMT)", "credits": "3 Credits", "description": "With increasing competition around the globe, companies today confront an increasing array of choices regarding geographic markets, locations for key activities, ways of organizing businesses, operations, and processes for managing across borders. This course provides a broad exploration of new business models developed for competing in the global marketplace. It discusses the evidence, concepts and models for understanding the strategic issues facing executives nowadays and their impacts on company performance. In particular, it investigates various aspects of corporate level and business level strategy dealing with opportunities and challenges in the global competitive environment. It considers the dynamics in the global business environment and addresses key strategic decisions that influence firm growth and competitive advantages. The aim of this course is to prepare students to manage effectively in today's interconnected world by understanding this changing environment, principles of global strategy, and the relation between global strategy and organization. Students will develop strategic thinking capabilities and apply analytical tools and frameworks for understanding key factors influencing decision making in today's interconnected world. The course builds on insights from prior business courses in accounting, marketing, finance, organizational behavior, strategy, and international management. Learning will take place through lectures, in-class activities, case discussion, simulation, and group project and presentations.", "prerequisite": "MGMT 326"}, {"course_name": "MGMT 483: Compliance and Fairness in Organizations", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Compliance with employment laws with respect to managing human resources and fair treatment in employer-employee relationships.  MGMT 483 Compliance and Fairness in Organizations (3) This course is intended for undergraduate students who want to learn more about the laws governing the employment practices introduced in the survey course in human resource management. This course will clarify the legal context within which businesses in general, and managers in particular, manage their employees. Students will learn about the legal rights and responsibilities of both employers and employees. Objectives of the course include learning how to comply with workplace laws and regulations, learning how to legally and effectively implement these requirements in an organization, and, as managers of human resources, knowing how to run a safe and fair workplace. To accomplish these objectives, students will evaluate and analyze federal employment laws and regulations, state employment laws (where applicable), and U.S. Supreme Court rulings. The emphasis will be on providing an informed legal context for managerial behavior. Student achievement of these learning objectives will be evaluated using several methods: students will summarize, interpret, and analyze employment law cases, write and develop a portfolio of critical essays of corporate employment practices, research and present (with team members) a project analyzing a current legal challenge to a specific company employment practice, and prepare a comprehensive written examination of material covered in the course.", "prerequisite": "MGMT 341"}, {"course_name": "MGMT 485: Entrepreneurial Opportunity Creation", "department": "Management (MGMT)", "credits": "3 Credits", "description": "Entrepreneurial Opportunity Creation is a process for co-creating ideas, markets and products by testing value propositions in actual market conditions. Opportunity co-creation prepares entrepreneurs to manage under conditions of extreme uncertainty. Opportunity creation is an iterative process between internal and external stakeholders focused on mutual value creation and exchange. Upon validation that a meaningful market opportunity exists, organizational resources are designed and deployed to match the learned opportunity. Unlike traditional entrepreneurial approaches, organizational formation is predicated on co-creation activities and is custom designed to fit the specific opportunity. This sequence reduces risk previously caused from efforts to predict the unpredictable, an uncertain future. This course will prepare students to learn how to create their own opportunities through active learning instead of predictive planning techniques rooted in risk analysis. Students will learn to use lean management techniques such as prototype development, sales and entrepreneurial marketing. This specific process or opportunity creation reverses conventional thinking and positions ideas, resources and experiences as outcomes of the process, not inputs.", "prerequisite": "MGMT 453"}, {"course_name": "MGMT 486: Entrepreneurial Investment and Resource Acquisition", "department": "Management (MGMT)", "credits": "3 Credits", "description": "As resource integrator's, entrepreneurs must first understand what resources are needed to create a new venture (through Entrepreneurial Opportunity Creation) and then solicit and organize internal and external resources (aka Venture Capital). Although venture capital is often conceptualized as formal investments made by large investment institutions seeking high growth opportunities, a more inclusive definition of venture capital more aptly considers all forms of external resource sharing to provide the creation of value, new ventures and wealth. The entrepreneurial ecosystem offers an expanding number of tools to aid new venture creation. As such, successful entrepreneurs need to be aware of the options and understand their respective strengths and weaknesses. Today's entrepreneurs can utilize traditional investment tools such as banking, personal debt obligations and venture capital institutions as well as emerging forms of investment tools such as crowdfunding resources, angel investors and accelerators. This course will provide students with the insights into raising venture capital, more broadly defined as any necessary external assets, through business planning, networking, investment pitching and negotiating. This will require students to compile the learning outcomes gained through prerequisite material in opportunity creation into a comprehensive business plan including financial projections. Through these activities, students in this course will be prepared to engage with applicable external resources providers and/or investors.", "prerequisite": "MGMT 485"}, {"course_name": "MGMT 494: Research Project", "department": "Management (MGMT)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "MGMT 494H: Research Project", "department": "Management (MGMT)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "MGMT 495: Internship", "department": "Management (MGMT)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor.", "other": ["Full-Time Equivalent Course"]}, {"course_name": "MGMT 496: Independent Studies", "department": "Management (MGMT)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "MGMT 496B: **SPECIAL TOPICS**", "department": "Management (MGMT)", "credits": "1-6 Credits"}, {"course_name": "MGMT 497: Special Topics", "department": "Management (MGMT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MGMT 499: Foreign Studies", "department": "Management (MGMT)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]