[{"course_name": "MICRB 106: Elementary Microbiology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "A survey course in microbiology for non-majors, this course focuses on the roles of microbes in human health and disease, agriculture, biotechnology, and other areas of societal impact. Topics include the mechanisms and natural history of microbial evolution; microbial growth and the control of microbial growth; the staggering diversity of microbial diversity, microbial metabolism, and microbial genetics; the unique biology of viruses; biotechnology its social impacts; pathogenesis and immunity; and explicit connections between each of these topics and their public health impacts.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "MICRB 106H: Elementary Microbiology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Importance of microorganisms in public health and disease, agriculture, and industry; descriptive course for nontechnical students.", "other": ["General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "MICRB 107: Elementary Microbiology Laboratory", "department": "Microbiology (MICRB)", "credits": "1 Credits", "description": "MICRB 107 is an introductory laboratory course designed for students who do not intend to pursue further study in the field. The course demonstrates the use and practice importance of microbes in everyday life. Instruction begins with the proper handling and visualization of microorganisms. Almost by definition, the vast majority of microorganisms are too small to be seen with the naked eye. Therefore, students must learn the correct use of the light microscope. Instruction in the proper care and maintenance of the microscope is provided. Students prepare and stain specimens using a number of methods designed to characterize microorganisms. The importance of working safely in a laboratory setting is emphasized throughout the course. Many skills are developed in this laboratory course. Aseptic technique skills allow for the transfer organisms properly from one culture medium to another. A variety of media are used and the reasons for their use are explained. Students also learn how to quantify the number of bacteria in specimens such as water, soil or food. The course demonstrates ways to control microbial growth by various means for example, temperature, osmotic pressure, pH, exposure to ultraviolet light and use of disinfectants. Students learn the importance of controlling microbial growth on their person and how failure to do so can lead to the spread of disease, especially in hospital settings. Other experiments illustrate methods used to preserve food products and test water for contamination and may include molecular techniques to study microbial genomes. While students learn to isolate and identify organisms from their own body, other common bacteria found in or on the human body are also studied. A variety of diagnostic cultural and physiological tests are employed to identify organisms students have isolated. This simulates in a very real way the process physicians depend on for diagnosis of infectious diseases. A related experiment demonstrates how antibiotics that are likely to be effective in treating an infection are selected. Taken together, most of the experiments conducted in MICRB 107 are designed to encourage students to investigate the many important roles microorganisms play in the living world. The specific examples covered each semester may vary based on student and instructor interest. As a course that meets general education (GN) requirements, students will increase their scientific literacy in the field of microbiology and develop critical and analytical thinking skills.", "prerequisite": "MICRB 106", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "MICRB 150: Introductory Medical Laboratory Technology", "department": "Microbiology (MICRB)", "credits": "4 Credits", "description": "Introduction to basic principles and procedures of clinical laboratory work. Practicum emphasizes proper collection, handling, and preparation of biological samples.", "prerequisite": "Admission to 2MLT program"}, {"course_name": "MICRB 151A: Clinical Chemistry for Medical Laboratory Technicians", "department": "Microbiology (MICRB)", "credits": "5 Credits", "description": "Basic principles and procedures for measuring chemical components of blood and other body fluids. MICRB 151A Clinical Chemistry for Medical Laboratory Technicians (5) This course is taken with (or before) MICRB 151D - Clinical Chemistry Practicum. Topics include: laboratory safety; phlebotomy; quality assurance; lab math; instrumentation in clinical chemistry; measurement of carbohydrates, proteins, electrolytes, lipids, hormones, enzymes, tests of kidney and liver function, and their clinical significance. Laboratory sessions focus on basic measurement techniques, using spectrophotometry.", "prerequisite": "BIOL 163"}, {"course_name": "MICRB 151B: Hematology for Medical Laboratory Technicians", "department": "Microbiology (MICRB)", "credits": "5 Credits", "description": "Blood cell identification and analysis. Related procedures for diagnosing normal or disease states of blood cells and coagulation. MICRB 151B Hematology for Medical Laboratory Technicians (5) This course is taken with (or before) MICRB 151E - Hematology Practicum. Topics include: hematopoiesis; measurement of red cells, white blood cells, and platelets; significance of hematology results in the diagnosis of hematological diseases; principles of coagulation and related disease states, with emphasis on common factor deficiencies and platelet abnormalities. Laboratory sessions focus on manual techniques, and microscopic identification of blood cells. A capstone project requires the student to research and present a patient case study to the class.", "prerequisite": "BIOL 163"}, {"course_name": "MICRB 151C: Immunohematology and Serology for Medical Laboratory Technicians", "department": "Microbiology (MICRB)", "credits": "4 Credits", "description": "Antigen-antibody interactions of diagnostic importance. Immunologic principles and procedures necessary for the transfusion of blood products. This course is taken with (or before) MICRB 151F - Immunohematology Practicum. Topics include: principles of normal immune function, with emphasis on humoral immunity; common serology tests used to diagnose infection and disorders of the immune system; selection and testing of donors and preparation of blood components; testing required to determine blood types and detect unexpected antibodies that impact selection of blood products; transfusion practice, transfusion reactions; hemolytic disease of the fetus and newborn. Laboratory sessions focus on manual techniques, ABO and Rh testing, antibody identification.", "prerequisite": "BIOL 163"}, {"course_name": "MICRB 151D: Clinical Chemistry Practicum", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "Supervised experience at affiliated clinical laboratory. Focus is on the practical application of clinical chemistry procedures. Phlebotomy.  MICRB 151D Clinical Chemistry Practicum (2) This clinical practicum enables the 2MLT student to gain experience in clinical chemistry, and includes approx. 110 hours of supervised experience in an affiliated clinical laboratory. The course is taken concurrently or after the lecture course Micrb 151A - Clinical Chemistry for Medical Laboratory Technicians. Topics include: specimen handling; common chemical analyses of blood and other body fluids; principles of operation, use, maintenance, and troubleshooting of clinical chemistry analyzers; quality control; safety; phlebotomy. Upon completion of Micrb 151D, the student will be able to:1. Demonstrate mathematical calculations necessary to prepare reagents, gather data, calculate results, and analyze specimens in the clinical chemistry department.2. Recognize errors in the collection of specimens for chemical analysis.3. Demonstrate the use of basic chemistry instruments; participate in the maintenance, and troubleshooting of these instruments.4. Interpret the clinical significance of common chemical analyses.5. Assess the validity of patient results by correlating laboratory data with quality control results.6. Perform phlebotomy and routine chemistry procedures at appropriate mastery levels.7. Demonstrate methods of maintaining a safe working environment in the chemistry department of the clinical laboratory.8. Achieve specific standards of attitude and work habits at the clinical bench.", "prerequisite": "MICRB 151A"}, {"course_name": "MICRB 151E: Hematology Practicum", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "Supervised experience at affiliated clinical laboratory. Focus is on the practical application of hematology and coagulation procedures.  MICRB 151E Hematology Practicum (2) This clinical practicum enables the 2MLT student to gain experience in hematology and coagulation, and includes approx. 120 hours of supervised experience in an affiliated clinical laboratory. The course is taken concurrently or after the lecture course Micrb 151B - Hematology for Medical Laboratory Technicians. Topics include: hematopoiesis; hemostasis; common hematology and coagulation methods; the principles of operation, use, maintenance, and troubleshooting of hematology analyzers; microscopic examination of blood smears; quality control. Upon completion of Micrb 151E, the student will be able to:1. Recognize pre-analytical factors affecting hematology and coagulation results.2. Perform routine hematology and coagulation procedures at specific mastery levels.3. Demonstrate the use of common hematology and coagulation analyzers, and participate in the maintenance and troubleshooting of these instruments.4. Interpret the clinical significance of hematology and coagulation results.5. Demonstrate methods of maintaining a safe working environment in the hematology department of the clinical laboratory.6. Identify normal and abnormal red cell, white cell, and platelet morphology in peripheral blood smears.7. Follow protocol when reporting patient results.8. Assess the validity of patient results by correlating laboratory data with quality control results.9. Achieve specified standards of attitude and work habits at the clinical bench.", "prerequisite": "MICRB 151B"}, {"course_name": "MICRB 151F: Immunohematology Practicum", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "Supervised experience at affiliated clinical laboratory. Focus is on the practical application of immunohematology procedures.  MICRB 151F Immunohematology Practicum (2) This clinical practicum enables the 2MLT student to gain experience in pre-transfusion testing and serology, and includes approx. 110 hours of supervised experience in an affiliated clinical laboratory. The course is taken concurrently or after the lecture course Micrb 151C - Immunohematology and Serology for Medical Laboratory Technicians. Topics include: routine procedures for determining ABO and Rh blood type; antibody identification; crossmatching techniques; handling and storage of donor products; common serology tests; quality control. Upon completion of Micrb 151F, the student will be able to:1. Perform routine immunohematology and serology procedures at specific mastery levels.2. Follow protocol required for the handling, storage and the issue of blood products.3. Interpret the clinical significance of common serology and immunology tests.4. Maintain a safe working environment in the immunohematology and serology departments in the clinical laboratory.5. Assess the validity of patient results by correlating laboratory data with quality control results.6. Achieve specified standards of attitude and work habits at the clinical bench.", "prerequisite": "MICRB 151C"}, {"course_name": "MICRB 151G: Clinical Microbiology and Body Fluids Practicum", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "Supervised experience at affiliated clinical laboratory. Focus is on the practical application of microbiology procedures and body fluid analysis.  MICRB 151G Clinical Microbiology and Body Fluids Practicum (2) This clinical practicum enables the 2MLT student to gain experience in clinical microbiology and body fluid analysis, and includes approx. 150 hours of supervised experience in an affiliated clinical laboratory. The course is taken concurrently or after the lecture course Micrb 151W. Topics include: specimen handling; cultivation and identification of bacteria with a minor emphasis on parasitology and mycology; antibiotic sensitivity techniques; chemical and microscopic analysis of urine and body fluids; toxicology and therapeutic drug monitoring. Upon completion of Micrb 151G, the student will be able to:1. Demonstrate methods of maintaining a safe working environment in the microbiology and urinalysis departments of the clinical laboratory.2. Select and inoculate appropriate media for the culture of patient specimens.3. Perform common biochemical, microscopic, serological, and molecular-based methods to identify microorganisms, at specified mastery levels.4. Identify normal and abnormal physical properties of urine and other body fluids.5. Recognize discrepant results when reviewing urinalysis findings.6. Perform routine urinalysis and body fluid analysis at specified mastery levels.7. Perform therapeutic drug monitoring and common tests for drugs of abuse.8. Assess the validity of patient results by correlating laboratory data with quality control results.9. Achieve specified standards of attitude and work habits in the clinical laboratory.", "prerequisite": "MICRB 151W"}, {"course_name": "MICRB 151W: Clinical Microbiology and Body Fluid Analysis for Medical Laboratory       Technicians", "department": "Microbiology (MICRB)", "credits": "5 Credits", "description": "This course is taken with (or before) MICRB 151G - Clinical Microbiology and Body Fluids Practicum. Topics include: analysis of urine and body fluids; tests of renal function; collection of patient specimens; cultivation, identification and clinical significance of bacteria, with a minor emphasis on parasitology, mycology and virology; techniques to determine antibiotic susceptibility. Laboratory sessions include specimen collection, urine and spinal fluid testing, manual identification of common pathogenic and non-pathogenic bacteria, and concentration of ova and parasites. The student prepares a research paper on a topic related to clinical microbiology; this semester-long process includes instruction on library research techniques, and the writing of several documents in preparation for writing the research paper. This course is writing-intensive.", "prerequisite": "BIOL 163", "other": ["Writing Across the Curriculum"]}, {"course_name": "MICRB 199: Foreign Studies", "department": "Microbiology (MICRB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MICRB 201: Introductory Microbiology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Elementary principles of microbial and viral structure, reproduction, genetics and physiology; relationship to food, water, soil, industrial and disease processes. MICRB 201 Introductory Microbiology (3) MICRB 201, Introductory Microbiology, is a survey course that touches on the full range of topics generally considered to fall within the scope of microbiology. After a short overview of the origins of microbiology and the ways in which forms of life too small to be seen with the naked eye can be studied, the course launches into the following basic topics: 1) structure and function of the bacterial cell as compared with plant and animal cells 2) care, feeding, and controlling the growth of bacteria 3) how bacteria acquire and use energy 4) how energy and nutrients are used to make cell components and carry out life processes 5) how bacteria organize, replicate and control the expression of genetic information 6) how viruses differ organizationally and reproductively from bacteria, and finally 7) how bacteria are classified and why various classification schemes are important. The remainder of the course is concerned with specific roles bacteria and viruses play in nature. Issues addressed include: 1) role of bacteria in the cycling of elements in the terrestrial environment 2) importance of bacteria in aquatic environments, including the safety of drinking water and treatment of waste water 3) the role of bacteria and viruses in human health and disease. Bacteria existed long before higher life forms, so animals, including humans, evolved means to protect themselves from harmful bacteria while forming relationships with bacteria that are beneficial. These harmful and beneficial relationships are intimately connected to immunology, a field that has long been included in the study of microbiology. The study of disease-causing microbes includes the topics of how these organisms are spread and how they can be controlled using anti-bacterial and anti-viral agents. Selected diseases are used to explain the various mechanisms by which microbes are able to cause illness. Finally, the course also covers the role microorganisms play in the spoilage of foods and, more importantly, the myriad ways in which bacteria, yeast and fungi are used to manufacture such popular foods as breads, cheeses, wines, beers and many other fermented food and dairy products. At some point in the course, there is discussion of how microbes are used in the rapidly-expanding area of biotechnology and their potential for yielding products of benefit to agriculture and humankind. This topic also treats the controversial issues connected with biotechnology, including ethical, theoretical and practical issues that are or will eventually need to be addressed by society.", "prerequisite": "CHEM 110"}, {"course_name": "MICRB 201H: Introductory Microbiology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Elementary principles of microbial and viral structure, reproduction, genetics and physiology; relationship to food, water, soil, industrial and disease processes.  MICRB 201H Introductory Microbiology (3) MICRB 201H, Introductory Honors Microbiology, is a survey course that touches on the full range of topics generally considered to fall within the scope of microbiology. After a short overview of the origins of microbiology as a science and the ways in which forms of life too small to be seen with the naked eye can be studied, the course covers the following basic topics: 1) the tree of life and the position of microbes in the biological world, 2) structure and function of the bacterial cell as compared with plant and animal cells, 3) microbial nutrition and growth, 4) molecular biology and gene regulation in microbes, 5) microbial genetics, 6) an overview of microbial classification and diversity, and 7) the principles of how microbes interact with their environment.Unlike the standard sections of MICRB 201, the honors course then moves on to an integrated description of microbial diversity and ecology in association with topics such as carbon metabolism, energy acquisition and utilization including photosynthesis, and the environmental impacts of microbial utilization of inorganic chemicals. This is followed by a section concerning eukaryotic or non-bacterial microbes, a section concerning the use of microbes in industry, and then a basic overview of viruses and how they work.The last part of the course deals with microbial interactions with other organisms with an emphasis on their interactions with man. This starts with a discussion of how microbial growth can be controlled, and then the various kinds of relationships that can exist between microbes and other organisms are covered. This is followed by a section on immunology or the mechanisms animals possess to defend themselves against potentially harmful microbes. The final section concerning a broad range of microbially-caused diseases is preceded by a description of microbial analysis in the clinical or medical laboratory as well as a discussion of how disease-causing microbes are spread in animal populations.MICRB 201H is taught so as to emphasize the impact of microbes on our everyday lives. One way this is accomplished is by class presentations made by small groups of students on topics of current interest in the community at large. Students also write a term paper that can involve any aspect of microbiology using an article from the popular press as their starting point. All students are also required to make a short in-class presentation in which they provide an overview of their term paper. While much of the instruction involves the standard lecture format, classroom discussion is encouraged at all times.", "prerequisite": "CHEM 110", "other": ["Honors"]}, {"course_name": "MICRB 202: Introductory Microbiology Laboratory", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "The goal of MICRB 202 is to inspire excitement and enthusiasm for the important science of microbiology, and to provide students with foundational knowledge of how microbiology techniques can be used to study key aspects of microbial biology such as antibiotic resistance, metabolism, cell structure, and genetics. Specifically, this course will introduce students to the techniques used in microbiology labs to isolate, stain, characterize, identify and control microorganisms. Through the exercises performed in this lab course, students will learn microbiology methods which have many uses and applications in science, medicine and industry. In addition, the exercises performed will help students appreciate the important role microbes play in the lives of all individuals."}, {"course_name": "MICRB 203: Inquiry-based Microbiology Laboratory", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "In this course, students learn the scientific method and important microbiological concepts and techniques by designing and executing experiments. Through a series of experimental modules, students will practice and hone their skills at formulating interesting questions, developing testable hypotheses, designing experiments, and analyzing results. Module topics will cover identification and characterization of microbes, interactions between microbes and their environment, pathogenesis, and microbial communities. At the end of the course, students will be prepared to participate in engaged scholarship opportunities, such as performing independent research."}, {"course_name": "MICRB 251: Molecular and Cell Biology I", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "BMB 251 Molecular and Cell Biology I (3) is an introduction to the fundamental principles of molecular and cellular biology, with a primary focus on eukaryotic cells. Topics covered will include elementary biochemistry; structure and function of biological macromolecules, the cell and its organelles; the role of biological membranes in bioenergetics and sub-cellular compartments. There will be a particular emphasis on the molecular mechanism of heredity; the organization and expression of genetic information; experimental methods used in the analysis of gene expression and the relationship between gene/protein structure and function.", "prerequisite": "CHEM 112", "other": ["Cross-listed with: BMB 251"]}, {"course_name": "MICRB 252: Molecular and Cell Biology II", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Continuation of BMB 251 / MICRB 251 ; cytoskeleton, cell growth, division, adhesion, signalling, germ cells, differentiation, immune system, nervous system, plant cells. BMB 252 / MICRB 252 Molecular and Cell Biology II (3) focuses on the internal organization on eukaryotic cells and their organization in multi-cellular organisms. Topics covered include cell communication, the cytoskeleton, cell cycle, fertilization and development of multi-cellular organisms, genesis of tissues, and the molecular mechanisms of cancer and immunity.", "prerequisite": "BMB 251", "other": ["Cross-listed with: BMB 252"]}, {"course_name": "MICRB 297: Special Topics", "department": "Microbiology (MICRB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "MICRB 299: Foreign Studies", "department": "Microbiology (MICRB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction."}, {"course_name": "MICRB 399: Foreign Studies", "department": "Microbiology (MICRB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MICRB 401: Microbial Physiology and Structure", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Physiology and structure of bacteria important in microbiological research. Designed for science majors.", "prerequisite": "CHEM 202"}, {"course_name": "MICRB 405A: Seminar and Practicum in Medical Technology", "department": "Microbiology (MICRB)", "credits": "8 Credits", "description": "Chemistry. Fundamental principles and the quantitative measurement of chemical components in the blood and other body fluids."}, {"course_name": "MICRB 405B: Seminar and Practicum in Medical Technology", "department": "Microbiology (MICRB)", "credits": "1 Credits", "description": "Urinalysis. Identification of cellular and noncellular urinary sediments. Qualitative chemical analysis of urine."}, {"course_name": "MICRB 405C: Seminar and Practicum in Medical Technology", "department": "Microbiology (MICRB)", "credits": "6 Credits", "description": "Hematology. Principles of red and white blood cell development. Identification of normal and pathological conditions."}, {"course_name": "MICRB 405D: Seminar and Practicum in Medical Technology", "department": "Microbiology (MICRB)", "credits": "5 Credits", "description": "Immunohematology. Immunologic and genetic principles governing the transfusion of blood and blood products."}, {"course_name": "MICRB 405E: Seminar and Practicum in Medical Technology", "department": "Microbiology (MICRB)", "credits": "7 Credits", "description": "Microbiology. Identification of normal and abnormal microbial flora from various locations on and within the human body."}, {"course_name": "MICRB 405F: Seminar and Practicum in Medical Technology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Serology-Immunology. Immunological principles and their application in the identification of present or past disease states of the human."}, {"course_name": "MICRB 408: Laboratory Instructional Practice", "department": "Microbiology (MICRB)", "credits": "1-2 Credits/Maximum of 2", "description": "Participation in the instruction of undergraduate laboratory courses, including classroom preparation; discussion of principles and objectives of each exercise.", "prerequisite": "8 credits in microbiology and permission of department head"}, {"course_name": "MICRB 410: Principles of Immunology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "The MICRB 410 / VBSC 410 Theories of immunity (3cr.) course provides a basic foundation in immunology with a focus on the progression from antigen recognition and innate immune responses to the development of acquired immunity. During the course, students will have the opportunity to learn about key topics that lead to an understanding of the how the human immune system functions. Such topics include the primary cells and anatomical sites of the immune system as well as the activation and processes of innate immunity. In addition, students will learn about the organization and generation of lymphocyte antigen receptors, major histocompatibility complexes, and antigen presentation. Topics will also be presented that allow students to build an understanding of how antigen recognition and presentation leads to the development, selection, and survival of B and T lymphocytes. T-cell mediated immunity, humoral immunity, and the dynamics of the immune response will also be discussed in depth. Topics such as the immunobiology of allergy, transplantation, autoimmunity, immunodeficiency, diseases, vaccines, and/or cancer will also be presented in order to help students build an understanding of the interplay between the immune system and health and disease will be discussed throughout the semester.", "prerequisite": "MICRB 201"}, {"course_name": "MICRB 411: Survey of Microbiology Literature", "department": "Microbiology (MICRB)", "credits": "1 Credits/Maximum of 99", "description": "An introduction to readings and oral presentations in microbiology.", "prerequisite": "8 credits in MICRB courses"}, {"course_name": "MICRB 412: Medical Microbiology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Characteristics, methods of identification, and pathogenesis of bacteria that cause human disease; principles of disease dynamics and control.", "prerequisite": "MICRB 201"}, {"course_name": "MICRB 413: Microbial Diversity", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "survey of microorganisms having special adaptive mechanisms for life in common and unique environments; topics include ecology, evolution, and bioremedia- tion.", "prerequisite": "MICRB 201"}, {"course_name": "MICRB 415: General Virology:  Bacterial and Animal Viruses", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "The interaction of different types of viruses with bacterial and animal cells, including mechanisms of infection and viral synthesis.  MICRB 415 General Virology: Bacterial and Animal Viruses (3) General Virology: Bacterial and Animal Viruses covers the interactions of different types of viruses with animal and bacterial cells, emphasizing molecular and genetic concepts of viral infection and viral replication. Students are expected to apply basic concepts of microbiology as well as molecular and cell biology to understanding selected viral life cycles, particularly at the molecular level. Lectures are augmented by in-class discussion and homework assignments. Typically, students are evaluated by two hourly exams and a final exam that assess their knowledge of virology and their ability to apply basic concepts of gene expression and cell biology to explaining viral life cycles. This course builds on the common requirements of MICRB 201 and BMB 251/ MICRB 251 BMB 252 / MICRB 252. The instruction expands into the cellular and molecular bases of viral life cycles with regular reference to and comparison with cellular and molecular biology of uninfected cells. The content of this course complements those on the basic mechanisms of gene expression (BMB 400) and prepares the student for understanding the molecular basis of viral pathogenesis covered in BMB 435 / MICRB 435 / VBSC 435.", "prerequisite": "BMB 252"}, {"course_name": "MICRB 416: Microbial Biotechnology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "The overall goal of Microbial Biotechnology (3 cr.) is to provide students with an opportunity to apply their knowledge of microbiology and biotechnology to the synthesis of biologically important and industrially useful products. The course will focus on the application of the tools of Microbiology, Molecular Biology, Biochemistry, Forensics, Environmental Biology and Bioinformatics to exploit microbes as \"vessels\" to create an array of products to benefit humans, animals and the environment. For example, discussions may address the use of microbes in the cleanup of polluted environments (bioremediation) as well as their role in producing drugs (vaccines, antibiotics, etc.), industrially important enzymes (rennet, meat tenderizers, indigo production etc.), and biodegradable plastics. Furthermore, ethics and regulations surrounding the production, marketing, and distribution of these biologics will be discussed. Students in the course will also participate in a project wherein they conceive of an idea for a value-added product, research steps necessary to bring said product to market, investigate aspects related to intellectual property, and develop a marketing plan. The student project will culminate in a class competition where students will choose to invest their \"biotech bucks\" in a fellow student's proposed company. Throughout the entirety of the course, the concepts of entrepreneurship and innovation will be at the forefront of class discussions.", "prerequisite": "BMB 442", "other": ["Cross-listed with: BIOTC 416"]}, {"course_name": "MICRB 421M: Laboratory of General and Applied Microbiology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Laboratory exercises demonstrating fundamental techniques and principles of experimentation of general and applied microbiology.", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "MICRB 421W: Laboratory of General and Applied Microbiology", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Laboratory exercises demonstrating fundamental techniques and principles of experimentation of general and applied microbiology.", "prerequisite": "MICRB 201", "other": ["Writing Across the Curriculum"]}, {"course_name": "MICRB 422: Medical Microbiology Laboratory", "department": "Microbiology (MICRB)", "credits": "2 Credits", "description": "Advanced level microbiology laboratory course centered on medically important microorganisms including bacteria, fungi and parasites. Course content covers pathology and current techniques for identification of each microorganism, as well as the underlying concepts, such as physiological and biochemical properties.", "prerequisite": "MICRB 202"}, {"course_name": "MICRB 432: Advanced Immunology: Signaling in the Immune System", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "The study of signaling pathways that regulate the immune response. BMB 432 / MICRB 432 / VBSC 432 Advanced Immunology: Signaling in the Immune System (3)This course will use the immune system as a model in which to study how cells communicate in order to coordinate an immune response. We will focus on signaling mechanisms that regulate such immune responses as T cell activation, Thl/Th2 differentiation, macrophage activation, and migration of immune cells to sites of inflammation. All lectures are based on recent reviews by key investigators in each field, as well as primary articles to present students with the most recent advances, techniques, and approaches used. The goal of the course will be to convey a basis understanding of intracellular signaling mechanisms that will pertain to all areas of biology, an appreciation for current questions and future directions in the field, and an in depth understanding of the signals that govern immune responses. The material presented will build on the basic concepts learned in BMB 400 and MICRB 410, and will lay the foundation for more advanced courses at the graduate level.", "prerequisite": "BMB 251", "other": ["Cross-listed with: BMB 432, VBSC 432"]}, {"course_name": "MICRB 435: Viral Pathogensis", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Viral Pathogenesis provides students with a general knowledge of medically relevant viruses, with a specific focus on important human viral pathogens. The course is meant to help students understand how viruses cause diseases in humans and animals. Lectures and in-class discussions will focus both on the fundamentals of viral infection and disease mechanisms, and on contemporary virology-related topics in the scientific literature. Topics discussed can be divided into two main areas: (1) general concepts related to viral pathogenesis and the control of viral infections; and (2) specific viruses that cause human disease including HIV-1, herpes viruses, papillomaviruses, influenza virus, West Nile virus, Ebola virus, and SARS virus. Although prior knowledge of virology is not required for taking this course, a working knowledge of molecular biology, cell biology, immunology, and some microbiology is helpful.", "prerequisite": "MICRB 201", "other": ["Cross-listed with: BMB 435, VBSC 435"]}, {"course_name": "MICRB 447: Laboratory in Molecular Immunology", "department": "Microbiology (MICRB)", "credits": "1 Credits", "description": "Immunology laboratory course that centers on current molecular techniques that utilize immunological compenents. Students will learn to purify and label antibodies, detect antigens and titer antibodies. Example techniques taught in this course are Dot Blot, Western Blot and ELISA. Most techniques will be taught in a diagnostics or inquiry-based context."}, {"course_name": "MICRB 450: Bacterial Genetics", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Emphasis will be on the role of mutations in the analysis of gene function; a detailed analysis of replication, transcription, translation, recombination and DNA repair. The course will also delve into the mechanisms involved in the regulation of gene expression both at the individual gene level as well as on a \"global\" scale. The course will examine the structure, replication and utilization of plasmids, transposons and bacteriophages, particularly focusing on their roles in the horizontal transfer of DNA between bacteria. The course will include both formal lecture presentations by the instructor as well as presentations of published research related to the field of bacterial genetics whenever possible.", "prerequisite": "BMB 251", "other": ["Cross-listed with: BMB 450"]}, {"course_name": "MICRB 460: Cell Growth and Differentiation", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "Mechanisms and regulation of protein trafficking, organelle biosynthesis, cell development, signaling and cell cycle control. Emphasizes experimental design and analysis. BMB 460  / MICRB 460 Cell Growth and Differentiation (3) is a unique course that uses the primary literature to teach significant content in advanced cell biology while simultaneously exposing students to the scientific craft of experimental design and analysis. In addition to exploring historical and current cell biology research articles, students will develop two vital scientific skills; critical thinking as applied to experimental data and creative thinking about solving unresolved questions in cell biology. In this course students will read from journals to explore questions about cell biology and how cell biologists decipher cell functions. Instead of a general survey of cell biology, we delve into specific issues, often looking at \"classic\" papers describing how a specific phenomenon was first investigated to place current questions in context before progressing to the latest publications exploring how innovative techniques have been applied to deciphering cell function. The course is divided into units, each of which emphasizes content in a different area. Actual content may vary from year to year as the course is updated to reflect progress in a field of research. We have previously explored the general areas of cell membrane dynamics, intracellular protein trafficking, cell cycle regulation, cell signaling pathways and cancer cell biology. Finally, the course ends with a unit on stem cells and therapeutic cloning technology. A portion of the final unit is also devoted to discussing the ethical implications of stem cell research with an emphasis on how to make personal decisions about how our society should approach these issues. Reading guides are provided for each assignment to help students find and understand important points in reading assignments. Class periods are devoted to explanations and instructor-led discussions about the readings with an emphasis on understanding the questions, the methods used to approach the questions, the experimental results and the interpretations of the results. Furthermore, periodic class periods are dedicated to experimental approach exercises where students work in groups to practice posing new questions as suggested by our readings and proposing experiments to answer these questions. These skills are vital part of what cell biologists do daily, and these exercises provide practice in thinking like a scientist. Students have previously reported that by taking this course they acquired the ability to read and understand the primary literature and have gained an in-depth understanding about how to use various experimental techniques.", "prerequisite": "BMB 252", "other": ["Cross-listed with: BMB 460"]}, {"course_name": "MICRB 480: Cancer Development and Progression", "department": "Microbiology (MICRB)", "credits": "3 Credits", "description": "BMB 480 / MICRB 480 Cancer Development and Progression (3) explores how cancer initiates and progresses with a focus on the interactions between tumor cells and normal tissues in the body. The goal of the course is to build fundamental knowledge of the mechanisms that drive cancer, and the current advances and challenges in cancer treatment. Genetic, biochemical, mechanical, and metabolic aspects of cancer will all be discussed along with relevant experimental techniques. RNA and DNA viruses that cause cancer will be highlighted as agents leading to the discovery of oncogene and tumor suppressor signaling pathways, and as ongoing contributors to cancer-related death. Significant attention will be given to the role of the immune system in cancer development, prevention, and treatment. By understanding mechanisms leading to the disruption of signaling pathways in cancer, students will develop a framework of how hallmark features of cancer arise and what corresponding therapeutic strategies have been developed to target them. Students are expected to participate in lectures and take part in discussion and analysis of scientific literature. This course applies core concepts from genetics, biochemistry, and cell biology to the study of cancer and provides a useful foundation for students interested in pursuing related graduate research or medical studie", "prerequisite": "BMB 252", "other": ["Cross-listed with: BMB 480"]}, {"course_name": "MICRB 496: Independent Studies", "department": "Microbiology (MICRB)", "credits": "1-18 Credits/Maximum of 18", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MICRB 497: Special Topics", "department": "Microbiology (MICRB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MICRB 499: Foreign Studies", "department": "Microbiology (MICRB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]