[{"course_name": "NUTR 100: Nutrition Applications for a Healthy Lifestyle", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course introduces students to nutrition principles necessary to promote a healthy lifestyle through assessment and application. Students will be better prepared to evaluate nutrition-related issues presented in the media and to make informed choices about their diet in order to promote health throughout their lives. Information about nutrients (proteins, carbohydrates, fat, vitamins, water, and minerals) and the physiological processes used to digest, absorb, and utilize them is presented and related to such topics as maintenance of ideal body weight, improvement in physical performance, and the role of nutrients in various disease states such as heart disease, diabetes, cancer, and osteoporosis. Topical issues such as alcohol ingestion, food insecurity, and consumer concerns will be utilized to integrate and critically analyze information presented by various media outlets. This course is intended for non-nutrition major students and will fulfill 3 credits of the GHW requirement of general education. Students who have earned credit for NUTR 251 may not schedule this course.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "NUTR 119: Elementary Foods", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "Basic principles and fundamental processes underlying food preparation. For non-nutrition majors only."}, {"course_name": "NUTR 120H: Food Preparation", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "Scientific principles of basic food preparation, with an emphasis on the physical and chemical aspects.", "other": ["Honors"]}, {"course_name": "NUTR 123S: First Year Seminar in Nutritional Sciences", "department": "Nutrition (NUTR)", "credits": "1 Credits", "description": "The course will meet once weekly to provide first year students with a basic understanding of why nutrition is important and how to improve their own diet and that of their friends and families. The course will explain the 3 options in nutritional sciences, promote discussions and learning about popular diets that may or may not offer health benefits, and explore important discoveries and advances in the nutritional sciences that underpin the current state of knowledge.", "other": ["First-Year Seminar"]}, {"course_name": "NUTR 170: Careers in Nutrition", "department": "Nutrition (NUTR)", "credits": "1 Credits", "description": "Nutrition professionals describe career paths and opportunities for graduates in applied and science options; strategies for making effective career decisions."}, {"course_name": "NUTR 175: Healthy Food for All: Factors that Influence What we Eat in the US", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course encompasses the study of eating behavior and how fundamentals of nutrition-policy (e.g., farm bill, child nutrition act that provides food education and food assistance in relation to Dietary Guidelines for Americans and Dietary Reference Intakes), the food environment, and behavioral economics influence food choice thereby affecting the overall health, nutrition, and well-being of indivdiuals and communities within the United States. While aspects of this are covered in a variety of disciplines (e.g., nutrition, food science, agriculture, economics, sociology, and others), these aren't always integrated for students. The purpose of this course is to provide an interdisciplinary perspective of how individuals, including those living in poverty, make food choices within their communities, and how these choices impact health and wellness. Topics include an introduction to what we eat, why we eat, and the key roles of diet on health with focus on the links among poverty, food security and obesity. The politics of food discusses portions of the Farm Bill and Child Nutrition Act with focus on the Women, Infants and Children Supplementary Food Program (WIC), the Special Nutrition Assistance Program (SNAP), and school lunch, and the influence these programs have on what is produced and consumed. The behavioral economics of food will focus on determinants of food choice including taste, cost, nutrition, and convenience as well as provide an overview of the biology and psychology of eating through hand-on experiential activities. Through these experiences, students will gain household budgeting skills across income levels that provides perspective to barriers to eating healthy. Lastly, food access dimensions will be discussed (e.g., food desserts, food swamps, grocery stores, targeted advertising/marketing) will be discussed.", "prerequisite": "NUTR 100", "other": ["United States Cultures (US)", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "NUTR 175Z: Healthy Food for All: Factors that Influence What we Eat in the US - LINKED", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course encompasses the study of eating behavior and how fundamentals of nutrition-policy (e.g., farm bill, child nutrition act that provides food education and food assistance in relation to Dietary Guidelines for Americans and Dietary Reference Intakes), the food environment, and behavioral economics influence food choice thereby affecting the overall health, nutrition, and well-being of individuals and communities within the United States. While aspects of this are covered in a variety of disciplines (e.g., nutrition, food science, agriculture, economics, sociology, and others), these aren't always integrated for students. The purpose of this course is to provide an interdisciplinary perspective of how individuals, including those living in poverty, make food choices within their communities, and how these choices impact health and wellness. Topics include an introduction to what we eat, why we eat, and the key roles of diet on health with focus on the links among poverty, food security and obesity. The politics of food discusses portions of the Farm Bill and Child Nutrition Act with focus on the Women, Infants and Children Supplementary Food Program (WIC), the Special Nutrition Assistance Program (SNAP), and school lunch, and the influence these programs have on what is produced and consumed. The behavioral economics of food will focus on determinants of food choice including taste, cost, nutrition, and convenience as well as provide an overview of the biology and psychology of eating through hand-on experiential activities. Through these experiences, students will gain household budgeting skills across income levels that provides perspective to barriers to eating healthy. Lastly, food access dimensions will be discussed (e.g., food desserts, food swamps, grocery stores, targeted advertising/marketing) will be discussed. This course is a linked course with AGBM 170Z meets the General Education Integrative Studies requirement.", "other": ["United States Cultures (US)", "General Education: Health and Wellness (GHW)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "NUTR 199: Foreign Studies", "department": "Nutrition (NUTR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "NUTR 211R: Applying Biochemistry to Nutrition", "department": "Nutrition (NUTR)", "credits": "1 Credits", "description": "The course provides the student with a beginning understanding of how the biochemistry and metabolism under instruction applies to the human body. This includes the localization of biochemical processes within tissues and organs, the organ specific utilization of macronutrients as fuel sources, organ-specific specialization of macronutrient metabolism, and the anatomical features that accommodate and facilitate these functions. This course is supplemental to BMB 211: Elementary Biochemistry, and helps the student apply the biochemical activities taught in BMB 211 in the context of human physiology and nutrition. The beginning level coverage offered in both BMB 211 and NUTR 211R will prepare students for NUTR 445, Energy and Macronutrient Metabolism.", "prerequisite": "CHEM 202"}, {"course_name": "NUTR 251: Introductory Principles of Nutrition", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "NUTR 251 Introductory Principles of Nutrition (GHW) is a 3-credit course. This course is designed for nutrition majors and non-majors to provide a broad understanding of general principles of nutrition. Concepts covered include the essential nutrients, digestion, absorption, transport, and food sources. Additionally, major health issues related to some nutrients that are of public health concern in the United States are discussed in more detail giving insight into cause, treatment and prevention. Of major importance to students' lives are health and nutrition implications of overweight and obesity, heart disease, diabetes, bone health, and energy balance as affected by diet and physical activity. Lastly, understanding of nutritional needs throughout the life span is introduced, with emphasis on pregnancy, lactation, and infant nutrition. All of these concepts at this introductory level are important for students in the major so that they are prepared for upper division courses.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "NUTR 294: Research Project", "department": "Nutrition (NUTR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "NUTR 296: Independent Studies", "department": "Nutrition (NUTR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "NUTR 297: Special Topics", "department": "Nutrition (NUTR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "NUTR 299: Foreign Studies", "department": "Nutrition (NUTR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "NUTR 320: Science and Methods of Food Preparation", "department": "Nutrition (NUTR)", "credits": "4 Credits", "description": "The purpose of this course is to teach students the science of food preparation, to develop culinary skills, to learn how to preserve the nutritional content of plant and animal foods, and how to apply food safety principles during food preparation. Additionally, for each food preparation method, students will learn the underlying chemical and physical principles responsible for the recipe outcome and apply these principles in the cooking lab. Students will gain an understanding of production methods used by food manufacturers and the source of food additives used to make processed foods. Students will apply scientific principles of food preparation by modifying recipes to improve the nutritional quality of prepared foods while maintaining product quality. During the lab sessions, students will learn basic culinary techniques and apply these techniques by reading recipes, preparing foods, and using sensory evaluation to analyze the prepared foods.", "prerequisite": "NUTR 251"}, {"course_name": "NUTR 358: Assessment of Nutritional Status", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "NUTR 358 is an introduction to the purpose, methods, and scientific basis for assessment of nutritional status in total health care for individuals and groups. Students will learn the role of nutritional assessment within the Nutrition Care Process model. Information is presented regarding current standards of food and nutrient intake adequacies and the use of these reference standards in nutritional assessment. Laboratory and case study assignments are included in the course to apply nutrition assessment principles and understand the role of anthropometric, biochemical, clinical, and dietary intake measurements as part of the nutritional assessment. Students will learn to measure, calculate, and interpret personal anthropometric and dietary intake variables. The course will teach students to collect and interpret personal nutritional assessment data and assess nutritional status.", "prerequisite": "NUTR 251"}, {"course_name": "NUTR 360: Nutrition Education and Behavior Change Theory", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course covers a range of topics related to providing evidence-based nutrition information to individuals as well as population-level health. It is designed to be an introductory course in nutrition education and theory within the Nutritional Sciences major. Students will explore the tenets of communication, education, and behavioral theories and models pertinent to the development and dissemination of nutrition information. Exploration of the fundamentals of food behavior, basic communication strategies essential to the nutrition counseling relationship, group facilitation, and working with diverse population groups will be examined through didactic lecture, individual practice, and project-based learning. Using current technologies to locate and understand evidence-based research, guidelines and protocols will be emphasized. Students will apply information discussed to the development of culturally sensitive nutrition education materials that are appropropriate for the target population that is being addressed.", "prerequisite": "NUTR 251"}, {"course_name": "NUTR 361: Community and Public Health Nutrition", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course covers a range of topics around nutritional issues related to population-level health. Community or public health work appeals to many graduates of Nutritional Sciences because it allows them to directly affect the nutritional status of large groups of people. Many nutritionists are drawn to community and public health work because it allows them to practice a variety of skills, such as assessing the nutritional needs, planning interventions, designing educational programs, and conducting program evaluation. In this course, students learn the theory behind community assessment, policy development, intervention planning, and program management and will have an opportunity to practice the skills necessary to carry out these activities through in-class activities and assignments. By the end of this course, students will have a deeper understanding of which population groups in the US benefit from federal food and nutrition assistance programs; what these programs are; what laws and policies regulate them; and how they operate.", "prerequisite": "NUTR 251", "other": ["United States Cultures (US)"]}, {"course_name": "NUTR 386: Managing Quality in Food and Nutrition Services", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "NUTR 386 Managing Quality in Food and Nutrition Services (3) This course is designed to foster the integration of management principles in the profession of nutrition and dietetics. Topics include strategic application of principles of management and systems in the provision of food and nutrition services to individuals and organizations, quality management, health care systems, leadership theory, corporate culture and communication, fiscal management in food and nutrition services, employee staffing, counseling and retention, and marketing. A business plan is also developed incorporating key operating indicators for organizational structure, marketing and financial objectives."}, {"course_name": "NUTR 390: Nutritional Biochemistry and Physiology", "department": "Nutrition (NUTR)", "credits": "4 Credits", "description": "NUTR 390 is an upper-level undergraduate course that provides a solid foundation in principles of biochemistry, anatomy, physiology in the context of nutrition. Particular focus will be placed on macronutrients (protein, carbohydrate and fats), in conjunction with relevant micronutrients. Gene regulation related to nutrition will be covered. Concepts from pharmacology and toxicology are introduced as a way to build language around nutritional biochemistry. Absorption, distribution, metabolism and excretion will be covered for all relevant nutrients. NUTR 390 does not meet degree requirements for the Nutritional Sciences major or minor.", "prerequisite": "CHEM 202"}, {"course_name": "NUTR 391: Professional Preparation in Nutrition and Dietetics", "department": "Nutrition (NUTR)", "credits": "2 Credits", "description": "This course provides students with an introduction to current issues in public health, the healthcare industry, professional practice and consumer trends that impact nutrition and health careers. Students will participate in activities during class to explore current topics in public health and issues related to improving access, quality of care and affordability in health care. Ethics scenarios will be presented and discussed that are relevant to nutrition and other healthcare practitioners. This course also prepares students to develop a set of professional skills necessary to initiate a career in the field of dietetics and their required field experience. This course is designed to help students increase self-awareness, become cognizant of strengths and weaknesses, and develop more effective communication skills. Students will use these skills to obtain and successfully complete an advanced field experience in nutrition (NUTR 495).", "prerequisite": "NUTR 360"}, {"course_name": "NUTR 393: Dietetic Internship Application Development", "department": "Nutrition (NUTR)", "credits": "1 Credits", "description": "This course is designed to assist students with the critical thinking skills required to prepare and implement post-graduate educational plans required to progress in the field of nutrition and dietetics. Students wishing to become a Registered Dietitian Nutritionist (RDN) must apply to and be selected for a post-baccalaureate professional supervised learning experience, also known as a dietetic internship, following graduation. The process is competitive, complex and requires self-awareness of professional strengths and weaknesses as well as knowledge of the individual characteristics and objectives of specific dietetic internships. This course will introduce students to this process and help them with the skills needed to clarify their goals and complete the materials needed for a dietetic internship application.", "prerequisite": "NUTR 391"}, {"course_name": "NUTR 399: Foreign Studies", "department": "Nutrition (NUTR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "NUTR 400: Introduction to Nutrition Counseling", "department": "Nutrition (NUTR)", "credits": "2 Credits", "description": "This course introduces students to the principles and issues present in the nutrition counseling relationship. Topics will include techniques designed to promote and support nutrition behavior change such as motivational interviewing, cognitive behavior change, working with resistance, transference, countertransference, how to conduct a nutrition counseling session, ADIME charting, coding, and billing issues. Students will learn how to give advise effectively, improve their listening and self-reflection skills as they progress through the course. Challenging situations such as eating disorders, dual diagnosis, and obesity will be explored through role-playing and simulation. The dietitian's role within the healthcare team, skill development through practical application and an introduction to Interprofessional interactions will be emphasized.", "prerequisite": "NUTR 358"}, {"course_name": "NUTR 407: Nutrition for Exercise and Sports", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "Interactions between nutrition, food selection, and timing of eating as they apply to exercise training and recreational physical activity.", "prerequisite": "NUTR 251"}, {"course_name": "NUTR 410: Eating and Weight Disorders", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "Eating behaviors vary widely across individuals, but only the extremes of these behaviors are considered pathological. This course provides an opportunity for students to attain a theoretical overview of eating and weight-related disorders, including anorexia nervosa, binge eating disorder, bulimia nervosa, obesity, and dieting. The course will discuss theories and current literature on the causes, diagnosis, symptoms, and treatment of eating and weight-related disorders. In addition, the course will also provide an overview of the differences in the prevalence, manifestations, and treatment of disordered eating in special populations, including men, children, athletes, and minorities. For each topic discussed, students will have related readings to provide insight on the history, theory, research and challenges related to this topic. At the end of this course, students will have an understanding of the history, definition, causes and controversies in eating and weight disorders. In addition, students will be able to define the various eating disorders and critically discuss research regarding their causes, consequences, treatment, and prevention.", "prerequisite": "NUTR 358"}, {"course_name": "NUTR 421: Biocultural Perspectives on Public Health Nutrition", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "NUTR 421 (3) (IL) takes a public health perspective whereby the bio-cultural influences on health and nutrition are examined across global contexts. It will challenge students to consider the extent to which social and cultural factors contribute to food behaviors and nutritional status, particularly among vulnerable populations in low- and middle-income settings. The application of the social sciences, including key principles from nutritional anthropology, are a critical yet often overlooked aspect of public health nutrition interventions; this course will ask students to critique both over- and under-nutrition interventions through both biomedical and ethnomedical lenses. Students will describe key considerations for culturally-appropriate nutrition intervention development, implementation, and evaluation within the public health sphere.", "prerequisite": "NUTR 251", "other": ["International Cultures (IL)"]}, {"course_name": "NUTR 425: Global Nutrition Problems: Health, Science, and Ethics", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course is a survey of topics with a focus on an examination of the underlying reasons for malnutrition in developing countries and the nutrition-related health problems facing developing country populations, particularly women and children. The topics will range from climate change, clean water supply, and health, to micronutrient deficiencies during pregnancy and child development.Identification of ethical issues and the underlying values/principles of situations relevant to the lives of poor people in developing countries will be discussed, including the right to food in the context of humanitarian aid. Discussion of interventions and current solutions involving multi-country cooperation and agencies meant to alleviate these problems will be explored.", "prerequisite": "NUTR 175Z", "other": ["International Cultures (IL)"]}, {"course_name": "NUTR 445: Energy and Macronutrient Metabolism", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course is designed to provide a foundation in the chemistry and metabolism of the macronutrients. Building on a knowledge base in biochemistry, physiology, and nutrition, this course will focus on the metabolism of proteins, carbohydrates, and lipids, and the integration of these metabolic pathways. The course provides the student with a sufficient application of biochemical processes, cellular molecules and their metabolism to serve as a basis for an advanced study of nutrition.", "prerequisite": "BMB 211"}, {"course_name": "NUTR 445H: Nutrient Metabolism I", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "Nutrients, their sources, metabolism, interrelationships and requirements with focus on carbohydrates, lipids, and proteins.", "other": ["Honors"]}, {"course_name": "NUTR 446: Micronutrient Metabolism", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "Nutrition 446 is designed to provide a foundation in integrated metabolism, metabolic functions, biochemistry, as well as cellular and molecular biology of the micronutrients (vitamins and minerals). It is an advanced nutrition course that will build upon your basic knowledge in physiology, biology, chemistry and nutrition. Students need to have a solid understanding of macronutrient metabolism (NUTR 445) in order to fully understand the micronutrient metabolism material presented in this course.", "prerequisite": "NUTR 445"}, {"course_name": "NUTR 451: Nutrition throughout the Life Cycle", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course will take a lifecycle approach to the study of nutritional needs, status, conditions, and interventions. The same nutrients are needed from birth to older age, but the requirements change along with a plethora of other factors including food preferences, chewing ability, digestion, absorption, metabolism, growth, behaviors, and barriers to healthy eating. The course will be divided into nine life stages and will cover what is nutritionally important at each stage. The student will also learn how nutritional status at one stage can impact health in later stages. By the end of this course, the student will have in-depth knowledge of nutritional needs and issues at each stage of life.", "prerequisite": "NUTR 358"}, {"course_name": "NUTR 452: Nutritional Aspects of Disease", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course will review the underlying nutritional components and pathophysiology of common human diseases/disorders. The focus is on the metabolic disturbances and nutritional interventions for the prevention of these diseases. Topics include nutritional aspects of obesity, diabetes, cardiovascular disease, GI and renal diseases, immunity and viral diseases, and cancer. The overall goal of this course is to expose students to the integrated nature of the disease process with a focus on nutritionally based or related diseases.", "prerequisite": "NUTR 445"}, {"course_name": "NUTR 453: Medical Nutrition Therapy", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This Medical Nutrition Therapy course provides students with a strong understanding of how to best prescribe diets for patients, depending on the specific disease profile of the individual. This understanding comes from integrating knowledge of disease pathophysiology with nutrient roles and requirements. This knowledge of disease process informs dietary recommendations. In each case, students use the Nutrition Care Process to assess individual patient needs to determine best practice. Strong assessment skills will allow students to prioritize treatment for best outcomes at an individual level. This course covers prescribed medical nutrition therapy for major disease states encountered in clinical practice. Background pathophysiology lays the foundation for interpreting research and prescribing best practice diets for diseases including obesity, diabetes mellitus, cardiovascular disease, renal failure, and liver disease among others. Additionally, planning and usage of enteral and parenteral nutrition is covered. In each unit, students use their understanding of disease states to provide nutrition recommendations in case study examples. Prescriptive diets must reflect physiological states as well as individual patient preferences."}, {"course_name": "NUTR 460: Nutritional Neuroscience", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "This course explores how food affects behavior and the brain, and vice versa: how neural circuits and gut hormones control eating and other behaviors. Throughout the course we will dissect the proverb ¿You are what you eat¿, and examine the effect of diet and body weight on behavior and cognition. Links between pathology and dysfunction in the gut and neurological and psychiatric diseases, including addiction, autism or Alzheimer¿s will also be explored. This course will cover current nutritional neuroscience findings from both animal models and human studies. We will also emphasize critical evaluation of nutritional neuroscience topics.", "prerequisite": "NUTR 251"}, {"course_name": "NUTR 490W: Nutrition Seminar", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "It is essential for nutrition professionals to keep up with the latest discoveries in the field. In this course, students will learn how to review published literature, integrate and evaluate the information, and disseminate their findings to others both verbally and in writing. A major focus of the course is the preparation of the paper in which students will critically evaluate original research papers and other evidenced-based documents, summarize the findings, and provide conclusions based on a careful analysis of the cited literature. From these exercises, students will acquire skills in interpreting research results and communicate their findings of a nutrition-related topic in a professional manner in both written and oral formats. The overall goal of this class is to empower students to sort fact from fiction in nutrition information and to be able to communicate their findings effectively.", "other": ["Writing Across the Curriculum"]}, {"course_name": "NUTR 494: Research Project", "department": "Nutrition (NUTR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "NUTR 494H: Honors Research Project", "department": "Nutrition (NUTR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "NUTR 495: Advanced Field Experience in Nutrition", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "NUTR 495 is intended for students to earn academic credit through a supervised field experience in a dietetics or nutrition-related field. Students will complete 240 hours at a site agreed upon between the student, the field experience preceptor, and NUTR faculty member as a result of the Field Experience Proposal developed in NUTR 391. The primary focus of the field experience is both observational and participatory experiential learning accompanied by onsite supervision, as well as University-based instruction.", "prerequisite": "NUTR 391", "other": ["Full-Time Equivalent Course"]}, {"course_name": "NUTR 496: Independent Studies", "department": "Nutrition (NUTR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "NUTR 496H: Independent Studies", "department": "Nutrition (NUTR)", "credits": "3 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "NUTR 497: Special Topics", "department": "Nutrition (NUTR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "NUTR 498: Special Topics", "department": "Nutrition (NUTR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "NUTR 499: Foreign Studies", "department": "Nutrition (NUTR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]