[{"course_name": "OLEAD 100: Introduction to Leadership", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "The ability to lead others is increasingly valued in today's world of work, and this course introduces key leadership concepts and practices based on current theory and research from both a social science and humanities perspective to prepare students for either the Bachelor of Science or the Bachelor of Arts as well as serve as a general education social science requirement. Whether or not a person is in a formal position of leadership, Introduction to Leadership will help students to discover the knowledge and skills necessary for effective leadership. The course will view leadership from an interactional framework that analyzes leadership from the perspective of the leader, the followers, and the situation. In particular, the unit on the leader will introduce traits, behaviors, gender, leadership development, personal strengths, developing leadership skills, creating a vision, addressing ethics, power, influence, and character. The unit on the leader-follower dynamic will introduce the concepts of followership, motivation, job performance, job satisfaction, engagement, embracing diversity and inclusion, listening to out-group members, managing conflict, overcoming obstacles, as well as leading group and teams. The final unit will focus the impact of the situation on leadership and will introduce students to organizational culture and climate, contingency theories of leadership, change, innovation, and will revisit the interactional framework in total to have students reflect on what they have learned.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "OLEAD 201: Organizational Theory and Functions for Leaders", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "Organizational theory and functions will explore the various functions of organizations in order to prepare students for future coursework. In particular the nature of organizations themselves will be examined along with various functions such as leadership, financial, communications, technology, production, sales, etc. Students will then use organizational theory to see how the various functions interconnect and support the overall goals of the organization.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "OLEAD 210: Evidence-Based Leadership", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "In evidenced-based leadership, students will learn how to use strong information and facts to increase the likelihood of success of leadership in organizations. In particular, this course starts by examining different kinds of evidence and analyzing their quality and usefulness. From there students will learn how to use that evidence to improve their leadership. Also covered will be convincing others to use strong evidence as well as implementing strategies based on that evidence to improve organizational effectiveness and success.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "OLEAD 220: Emotional, Social, and Cultural Intelligences and the Implications for Leadership", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "This course focuses on emotional intelligence, social, cultural intelligence competencies used to develop the leadership capacity to be self-aware, understand oneself and others, and to work across cultural differences to effectively meet the demands of work. Relevant theoretical models, key concepts, and scientific research are explored. The growing body of research relating emotional, social, and cultural intelligences to high work performance and leadership effectiveness will be explored as well as neuroscience research explaining how these competencies can be developed through practices to focus attention enhanced by awareness. The course relates theory and research to practical application by focusing on the development of competencies and their effective use in increasing self-knowledge, motivating and influencing others, demonstrating empathy, effective problem solving, applying decision-making skills, stress management strategies, enhanced well-being as well as leading across cultural differences.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "OLEAD 230: Leadership Across Industries", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "Leadership across industries compares and contrasts leadership in different types of industries. In this course students will learn about the various types of organizations and examine why leadership in those organizations have some leadership characteristics that are similar and others that are different. Industries such as private sector, government, education, healthcare, military, law enforcement, small business, and others will be used as examples to demonstrate those similarities and differences. This comparative analysis will help students learn about other styles of leadership that they may access for their own organizations as well as allow for some career exploration."}, {"course_name": "OLEAD 409: Leadership Development: A Life-Long Learning Perspective", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "The course examines the continuing influence of social and environmental factors in shaping leadership and leadership development.  OLEAD (LER) 409 Leadership Development: A Life-Long Learning Perspective (3)(BA) This course meets the Bachelor of Arts degree requirements. Current social conditions, such as financial crises, ineffective solutions to local, national, and international problems and corrupt leaders, call for more effective and ethical leadership on a broad scale. The positive and moral transformation of social institutions requires active participation and leadership of more authentic transformational leaders. This course will discuss authentic transformational leadership development from a life span developmental perspective. More specifically, it will focus on how an individual develops his/her leadership skills, potential, and capacity in his/her childhood, school, social organizations, colleges, and work organizations. The primary purpose of this course is to help students understand how family, educational, and other environmental factors have helped and/or will help them develop their transformational leadership potential and leadership effectiveness, in addition to gaining a better understanding of their strengths and weaknesses in respect to personality, individual difference, motivation, values, emotions, self-awareness, and identity. The fundamental objectives of this course are to help students 1) increase self-awareness; 2) to help students to know more about their sense of self, including self-identity, self-awareness, self-efficacy, and other types of self-concepts; 3) to understand the effect of life span influences in an individual's leadership development.", "prerequisite": "6th semester standing", "other": ["Cross-Listed", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "OLEAD 410: Leadership in a Global Context", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "This course explores the science and practice of leadership around the globe through pertinent scholarly literature and related instructional resources.  OLEAD 410 Leadership in a Global Context (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will explore the science and practice of leadership across the globe. In particular, cross-cultural differences in leadership styles and methods from around the planet will be examined. Emphasis will be made on gaining knowledge of various cultural perspectives from around the world. That knowledge will then be used to examine successful leadership interactions between diverse cultures. Upon completion of Leadership in a Global Context, students will be able to understand differences within and between cultures, understand how diversity can impact an organization; recognize there are various sources of information to learn about culture; utilize various sources of information to gain knowledge of culture; develop the ability to recognize cultural differences in leadership situations, and think about developing leadership in global situations based on culture.", "prerequisite": "OLEAD 100", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "OLEAD 411: Women and Leadership", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits/Maximum of 3", "description": "Skills and competencies needed for effective leadership may change/vary from one era to another, one culture to another and one industry to another. Researchers and leaders themselves do not agree on a definition of \"leader\" or the skills/competencies that establish an effective leader. One might say that \"what it takes to be an effective leader\" is relative to the situation. Through the review of literature and research on leadership in general; review of literature and research on women in leadership; problem-solving in leadership scenarios; and self-assessment, students will develop a working definition of leadership and identify and develop leadership traits/competencies to encourage more women to be successful future leaders.", "prerequisite": "OLEAD 100"}, {"course_name": "OLEAD 464: Communication Skills for Leaders in Groups and Organizations", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "Theory- and research-based communication skills for leaders dealing with work-related problems in contemporary groups and organizations. LHR 464 Communication Skills for Leaders in Groups and Organizations (3)(BA) This course meets the Bachelor of Arts degree requirements. LHR 464 Communication Skills for Leaders in Groups and Organizations is a survey of theory, research, and practice related to the communication processes by which individuals in groups and organizations exercise influence, whether or not they occupy positions of acknowledged leadership, and may be taken as part of an Labor and Industrial Relations major or minor, or as an elective by students in other disciplines. The course is offered once each academic year and has an enrollment limit of 40 students per offering. The course requires no special facilities. It extends to other courses in the major primarily in the areas of Industrial Relations and Human Resources. It is also complementary to courses focusing on groups and organizations in Sociology, Psychology, Management, and Engineering. During the course, students are exposed to a variety of theoretical perspectives on the study of leadership, learn about research illuminating its functions, and become acquainted with communication practices derived from and/or suggested by such theories and research that contribute to the exercise of influence and, thereby, effective group and organizational performance. These terminal outcomes define the objectives of the course. Focus will be on leadership as both role-elated behavior and goal-directed behavior, regardless of roles that members of groups and organizations occupy.", "prerequisite": "5th Semester Standing", "other": ["Cross-listed with: LHR 464", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "OLEAD 465: Collective Decision Making", "department": "Organizational Leadership (OLEAD)", "credits": "3 Credits", "description": "Application of theories of decision making to work-related issues in groups and organizations requiring collective resolution and action. LHR 465 Collective Decision Making (3)(BA) This course meets the Bachelor of Arts degree requirements. This course presents a broad overview of theories, research, and practices in decision making as related to work-related choice making in groups and organizations and is open to students majoring or minoring in Labor and Industrial Relations, as well as to students who may wish to use the course as an elective. The course is offered once each academic year and has an enrollment limit of 40 students per offering. It requires no special facilities. LHR 465 extends to other courses in the major, primarily in the areas of Industrial Relations and Human Resources. It is also complementary to courses dealing with decision making in groups and organizations in sociology, psychology, and management. Of particular interest are decision making practices, as well as theories that account for them, in single-motive situations (in which participants in the process are pursuing a common goal) and mixed-motive situations (in which two or more of the participants are competitively related, but must cooperate to achieve their objectives). Hence, the course deals both with (1) conventional decision making, as in the case of boards, task forces, problem-solving groups, and quality circles or teams, appropriate to single-motive situations and (2) processes, such as bargaining, negotiation, and dispute management/resolution, appropriate to mixed-motive situations. The course also deals with the influence of organizational culture on decision-making in both types of situations. Upon completing LHR 465, students will have been exposed to a broad array of theoretical perspectives on decision making in groups and organizations, will be familiar with research testing these theories, and be aware of decision making practices suggested by theory and research that are useful in situations requiring collective choice and action. These terminal outcomes of the course reflect the objectives.", "prerequisite": "5th Semester Standing", "other": ["Cross-listed with: LHR 465", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "OLEAD 495: OLEAD Internship", "department": "Organizational Leadership (OLEAD)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised practicum in organizational leadership."}, {"course_name": "OLEAD 496: Independent Study", "department": "Organizational Leadership (OLEAD)", "credits": "1-18 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "prerequisite": "OLEAD100"}, {"course_name": "OLEAD 497: Special Topics", "department": "Organizational Leadership (OLEAD)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest.", "prerequisite": "OLEAD100"}]