[{"course_name": "PHIL 1: The Big Questions", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course plunges students into the deepest philosophical questions: Why is there something rather than nothing? Can I be sure about anything? What is the purpose of life? Is morality real or conventional? Can the existence of God be proven or disproven? Can science explain everything? Students will meet a range of historical and contemporary formulations of philosophical questions such as these, study various types of response, and acquire the analytical and expository skills to develop and defend their own perspectives. The course proceeds through discussion, reading, writing, and other assignments", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 1H: The Big Questions -Honors", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course plunges students into the deepest philosophical questions: Why is there something rather than nothing? Can I be sure about anything? What is the purpose of life? Is morality real or conventional? Can the existence of God be proven or disproven? Can science explain everything? Students will meet a range of historical and contemporary formulations of philosophical questions such as these, study various types of response, and acquire the analytical and expository skills to develop and defend their own perspectives. The course proceeds through discussion, reading, writing, and other assignments.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 2: Individuals in Society", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course provides a philosophical introduction to pressing social and political issues. We will ask, for example, what justifies having a government; whether inequality is ever justified; what obligations citizens have toward each other and toward non-citizens; what exactly is wrong with racism, sexism, and other injustices and what we should do about them; the limits and benefits of privacy; and the role of families, schools, churches, clubs, and employers in public life. We study prominent philosophers and theorists on these questions, and address recent events or policies. Students will develop an appreciation for thinking about values in the context of conflicting political visions, and the analytical and expository skills for examining and discussing them.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 3: Ethical Life", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course offers students an overview of ethical issues, moral reasoning, and questions concerning the good and flourishing life for individuals and groups. It engages the work and critical interpretation of major figures in moral thinking, and enters into the full complexity of contemporary moral problems. Students will study and evaluate competing accounts of the right way to live, including their overall plausibility, their background assumptions, and their practical implementation.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 4: The Human Condition", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course introduces central philosophical questions about the lives we humans live: Can our lives have meaning, and does their value depend on it? Does each of us have a true self to be discovered, or a shared human nature we cannot escape? What do we mean by \"authenticity,\" is it worth striving for, and can it be achieved? What difference does recognizing your mortality make to anything? We explore these questions in conversation with influential historical perspectives and contemporary theories, while approaching them from everyday concerns. Doing so provides a path for introducing philosophical ideas and evaluations into ordinary life.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 5: Film and Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course examines film as both an aesthetic medium and as a medium for the exploration of philosophical questions. In addition to watching films, class assignments will include the reading of interpretative texts about specific films, philosophical discussions of film as a form of art-work, and writings by major film makers and film critics. With its origins in the late 19th-century, film is an quintessentially modern form of art that reflects changes in modern society (consumer culture, political organization, and cultural modes of perception), advances in technologies (cameras, sound recording, computer graphics), and aesthetic forms of expression. This complex intersection of society, technology and art will be a focal point in understanding what is both novel and traditional about films: how do films change our perception of the world? How can films shape our collective consciousness? How are traditional structures of narrative transformed through the unique combination of visual and auditory experience in films? These and other questions are central to an understanding of film as a modern form of art. From the beginning of film-making, films have often been used by directors and screen-writers as a medium for the exploration of the human condition, social consciousness, and historical awareness. The genres of historical fiction and science fiction have traditionally represented two important forms in which film raises and seeks to answer philosophical questions. Film is also a medium for the exploration of the social structures and values: family relations, love, friendship, and other social forms of existence are often the main theme of scrutiny and experimentation in films. How can we read what a film reveals about such social relations and individual psychologies? How can film explore basic questions of human existence? Can such philosophically minded films also aspire to art-works of poetical beauty? This richness in how films can provoke us to reflect upon the past, the present, and the future will be critically explored through different ways in which philosophers and film critics have reflected on film. These readings will be paired with specific films, with films and assigned readings drawn from international films, classical films from the 20th-century, and contemporary science fiction films.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 6: Literature and Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Explores fundamental issues of human existence through the traditions of western literature and philosophy. CMLIT 6 / PHIL 6 Philosophy and Literature in Western Culture (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed to introduce students to the various interpretive approaches to literature and philosophy. The class will explore key philosophic themes as these are exhibited in imaginative literature, and in doing so will practice both philosophical interpretation of literature and literary treatment of philosophy. The central themes of this course could include, for example, self-knowledge and self-deception; self-isolation, alienation and community; conflict of moral responsibilities; the use and abuse of language; the meaning of art; the ideal of a \"simple life;\" normalcy and madness. The class will ask such questions as what counts as literature, what purpose it serves, what is the relationship between literature and ideology, and whether a text can be considered independently from what the author wanted to say in it. This course is a non-major General Education Humanities course. It may be used to fulfill minor requirements in philosophy. This course may be used to fulfill an additional-course requirement in either the minor or the major in Comparative Literature, although it is geared primarily towards non-majors.", "other": ["Cross-listed with: CMLIT 6", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 7: Asian Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This class is an introduction to the major intellectual philosophical traditions of Asia: Hinduism, Buddhism and Zen Buddhism, Jainism, Confucianism and Neo-Confucianism, and Taoism. It proceeds through careful study of major, representative texts and authors of each of these traditions, and may range from foundational works to modern and contemporary developments.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 8: Gender Matters", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Feminism is one approach to addressing systematic oppressions of both women and men. This course examines various feminist philosophical approaches to issues such the construction of gender, sex, and sexuality, the nature of gender injustice, and the intersectionality of oppressions. It also addresses contemporary issues, including sexual harassment and assault, abortion, explicit and implicit bias, and discrimination and exclusion.", "other": ["Cross-listed with: WMNST 8", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 9: Race, Racism, and Diversity", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course offers a critical examination of the ways we today often think about race and racism, the latter considered in its cultural, institutional, and systemic forms, as well as in its individual manifestations as slurs, beliefs, and attitudes. This course also takes up the philosophical issues raised by the concept of race in intersection with class, gender, and related concepts. It aims to promote diversity by fostering an appreciation and respect of differences especially in respect of race, ethnicity, gender, and religious affiliation.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 10: Critical Thinking", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course provides a critical awareness of the function, nature, strengths, and weaknesses of argumentation in its various real-world and academic forms and contexts. Students examine the construction of persuasive arguments, discover types of fallacy, and learn how to evaluate reasoning for validity and soundness (that is, logicality and truth).", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 10H: Critical Thinking", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course provides a critical awareness of the function, nature, strengths, and weaknesses of argumentation in its various real-world and academic forms and contexts. Students examine the construction of persuasive arguments, discover types of fallacy, and learn how to evaluate reasoning for validity and soundness (that is, logicality and truth). There will be specific application to moral and social-political issues, and to the nature of education. As an Honors section, this course will expect considerable engagement and creativity by members of the class.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 10Z: Critical Thinking", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course provides a critical awareness of the function, nature, strengths, and weaknesses of argumentation in its various realworld and academic forms and contexts. Students examine the construction of persuasive arguments, discover types of fallacy, and learn how to evaluate reasoning for validity and soundness (that is, logicality and truth).", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 11: Science and Truth", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course investigates the nature of science, scientific reasoning, and the \"scientific method.\" The value of objectivity and explanation will be considered in relation to our knowledge of the world and ourselves. Students will compare scientific truth claims to others, such as those from common sense, religion, the humanities, and pseudo-science. Key concepts include hypothesis, falsification, evidence, models, and theory. We ask: How do facts relate to proofs? What is the role of subjectivity in interpreting data? Does science progress? Are there questions science cannot answer? The goal of the course is for students to understand better the meaning, value, and limitations of the scientific enterprise.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 12: Symbolic Logic", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course is an introduction to symbolic logic. Logic is the science of correct reasoning, and symbolic logic is a particular branch of logic that studies correct reasoning using a formal or arti¿cial language. In this course, students will first learn basic vocabulary for argument analysis, standards for evaluating arguments that are expressed in English, and basic methods for testing these arguments along with the shortcomings of said methods. The deficiencies of the more natural approach to evaluating and testing arguments motivates a turn to learning symbolic logic as it purports to provide a more precise way of evaluating arguments. To this end, students will learn the symbols, syntax, and semantics of two different logical (formal, symbolic) languages (propositional and first-order predicate logic) and how to translate sentences from English into these formal languages. Once the languages are formulated, students will learn how to make use of mechanical tests (truth tables and/or truth trees) that allow for evaluating arguments for validity as well as testing propositions and sets of propositions for other logical properties (e.g. consistency, tautology, etc.). In addition to mechanical tests, students will learn how to solve proofs in two different languages. That is, they will learn a set of inference, derivation, or \"proof\" rules and use these rules to show that a conclusion follows from a set of premises.", "other": ["Bachelor of Arts: Quantification", "General Education: Quantification (GQ)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 13: Nature and Environment", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "What is nature, and what is the appropriate human relationship with it? What are our obligations toward non-human animals, endangered species, or ecosystems? Is contemporary industrial society alienated from nature, and, if so, what should be done about this? What alternatives for living differently are genuinely available to us today? These questions are addressed through discussion of current environmental issues (e.g., consumerism, agriculture, wilderness protection, environmental justice, climate change, environmental activism) as well as influential historical and contemporary philosophical approaches, such as deep ecology, social ecology, ecofeminism, bioregionalism, and eco-phenomenology. PHIL 13 Philosophy, Nature, and the Environment (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. This course familiarizes students with concepts regarding the central and very old philosophical problem of describing and understanding nature and the place of human beings in it. This philosophical discourse has evolved in the past 25 years into a firm sub-discipline of philosophy itself, usually under the title of \"Environmental Philosophy\" or \"Philosophy of nature.\" The discipline addresses a complex of crucial problems of contemporary society, politics, and ethics revolving around the relation of human beings and the environment. Students will learn the various and conflicting views on nature and the environment, and they will develop the ability to critically navigate these various positions as well as the assumptions underlying the contemporary environmental debate. Students will be graded on participation, case study analyses, a group presentation and response, and a final paper. PHIL 13 satisfies the GH requirement and is geared towards non-Philosophy majors. It may be used to fulfill minor requirements in philosophy. This course is offered once a year with an enrollment of 50-200 students.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 14: Love and Sex", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course examines the dominant philosophical and theological theories of love and sexuality in the Western world; historical and recent critiques of those theories; and the relevance of gender, race/ethnicity, and sexual orientation to all such thinking about love and sex. Related ethical issues include monogamy, same-sex marriage, cultural differences, pornography, and consent, especially in contemporary US context.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 14H: Love and Sex - Honors", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course examines the dominant philosophical and theological theories of love and sexuality in the Western world; historical and recent critiques of those theories; and the relevance of gender, race/ethnicity, and sexual orientation to all such thinking about love and sex. Related ethical issues include monogamy, same-sex marriage, cultural differences, pornography, and consent, especially in contemporary US context.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 15: How to Live", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Philosophy, uniquely, studies how best to live. But being better at questions than at answers, philosophy mainly provides hypotheses about the nature of good life and the various routes to it. Does it mean minimizing mental suffering, through elimination of superstition and fear? Or control of one's bodily desires, through feats of endurance? Or modesty about what you know, through examination of one's beliefs? Or reducing the amount of injustice you do, by thinking about the consequences of every action? Or changing the way people think, by revealing the power dynamics beneath everyday social institutions? Each week this course articulates one hypothesis from Western (e.g., Greek, Roman, European, American) or non-Western (e.g., Indian, Chinese) philosophy, historical or contemporary, then makes sense of the reasons for it, and then puts it into personal (or group) practice for five days. Students track, process, and evaluate their experiences through journaling, blogging, and other modes of writing, some of which will involve discussion with other students. Each week also features philosophical, literary, spiritual, or journalistic readings expressing the tenets of the particular way of life, defending it against other ways of life, or exploring the particular historical/cultural context that occasioned it. These readings may include, for example, Socratic dialogues, Stoic handbooks, meditation mantras, existential dramas, political manifestos, nature journals, or book reviews. At the semester's end, students invent their own philosophical \"best way of life,\" formulating and justifying rules, models, or virtues to live by, and engage in conversation with other students on this topic. Students should leave the class recognizing the diversity and challenge of a range of way-of-life ideals, their historical context and contemporary promise, how to decide on their appropriateness for themselves, and what it would mean to adopt, refine, and support their own \"philosophy\" of life.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 60N: Philosophy and 1960s Counterculture", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Explores some of the central philosophical ideas, values, and social scientific theories that motivated, attended, and/or were presupposed by signature events, projects, and persons typically associated with the 1960s Counterculture. PHIL 60N Philosophy and 1960s Counterculture. Students examine original texts and experience other forms of media to enhance their understanding of central philosophical and social scientific assumptions and theories underlying historically prominent projects and events that are typically associated with the 1960s Counterculture, including, for example, ones that address the relationship of individuals to society, the conditions and ideals of the good life, and the nature of dominance and social control. Students are guided in the design and completion of mini-research projects that address specific counter-cultural phenomena and that are intended to further foster the development of interdisciplinary research skills and inquiry. PHIL 60N satisfies 3 credits of the General Education Integrative Studies Requirement and may be used to fulfill 3 credits of the GH and GS requirements.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 83: First-Year Seminar in Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "First-year seminars in philosophy provide critical introductions to fundamental philosophical issues and problems. Each first-year seminar develops a broad overview of historical and contemporary thought through readings, discussions, and student writings. In this way, students will gain an understanding of important figures, ideas, problems, and theories that have shaped and continued to influence thought and practice around the world. Students will examine diverse viewpoints that will allow them to understand a wide range of views and challenge them to defend their own positions. First-year seminars involve active use of writing, speaking, and group projects. They provide opportunities for gathering information, analyzing problems, and synthesizing diverse perspectives. Finally, each first year seminar in philosophy allows students to link theory to their own lives.", "other": ["Bachelor of Arts: Humanities", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 98: Special topics", "department": "Philosophy (PHIL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 102: Existentialism", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course introduces students to the evolution of Existentialism, with its kernel in mid-nineteenth century reflection on Christianity's loosening grip on culture, its influence by the early-twentieth century experience of war's utter and widespread destructiveness, and its development in mid-twentieth century industrial and capitalist modernity. It concerns especially what it means to define one¿s own life in light of social pressures, interpersonal conflict, and economic forces, with or without the aid of traditional or religious guidance. This that means the course focuses on metaphysical, moral, and social issues concerning reality, the nature of the self, the basis of values, and the relations between individuality and community, and studies philosophical treatises, imaginative literature, and other genres of writing. Representative authors include Kierkegaard, Nietzsche, Marcel, Wright, Ellison, Jaspers, Fanon, Camus, Beauvoir, Sartre, and Lorraine Hansberry.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "PHIL 103: Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Through reading and discussion of classical and contemporary sources, this course provides an introduction to the basic questions of ethics, the major currents in traditional ethical theory (virtue ethics, deontology, consequentialism), and more recent developments (e.g., care ethics). These schools of thought offer distinct answers about how we should decide what to do and about what makes a character, a decision, an action good or bad, right or wrong. Students will gain a basic understanding of concepts such as agency, autonomy, and moral responsibility, while also reflecting on the foundations, scope, and limits of moral reasoning: Are ethical norms universal, particular, or culturally relative? How is the moral life of the individual related to political life? Are there moral solutions to social problems or vice versa?", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 103H: Honors Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Through reading and discussion of classical and contemporary sources, this Honors course provides an introduction to the basic questions of ethics, the major currents in traditional ethical theory (virtue ethics, deontology, consequentialism), and more recent developments (e.g., care ethics). These schools of thought offer distinct answers about how we should decide what to do and about what makes a character, a decision, an action good or bad, right or wrong. Students will gain a basic understanding of concepts such as agency, autonomy, and moral responsibility, while also reflecting on the foundations, scope, and limits of moral reasoning: Are ethical norms universal, particular, or culturally relative? How is the moral life of the individual related to political life? Are there moral solutions to social problems or vice versa?", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 103W: Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 3", "description": "Through reading and discussion of classical and contemporary sources, this WAC course provides an introduction to the basic questions of ethics, the major currents in traditional ethical theory (virtue ethics, deontology, consequentialism), and more recent developments (e.g., care ethics). These schools of thought offer distinct answers about how we should decide what to do and about what makes a character, a decision, an action good or bad, right or wrong. Students will gain a basic understanding of concepts such as agency, autonomy, and moral responsibility, while also reflecting on the foundations, scope, and limits of moral reasoning: Are ethical norms universal, particular, or culturally relative? How is the moral life of the individual related to political life? Are there moral solutions to social problems or vice versa?", "prerequisite": "ENGL 015 or ENGL 030H", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"course_name": "PHIL 105: Philosophy of Law", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys philosophical questions concerning any legal system. What counts as a law? Do judges interpret or create new law? How can laws be unfair? What kinds of punishment, if any, are appropriate? When is civil disobedience justified? Could there be international law, and how can rights be enforced? These questions will often be asked in the context of the American system of common law and statutes, and thus will overlap with questions of federalism, constitutionalism, democracy, the police and prison systems, and social and economic structures. They will also require investigating the views of human nature underlying various philosophical positions. In general, the course examines the relations between human values, ethics, and law and the way these relations affect the organization of broader social, political, and religious institutions.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 105H: Honors Philosophy of Law", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys philosophical questions concerning any legal system. What counts as a law? Do judges interpret or create new law? How can laws be unfair? What kinds of punishment, if any, are appropriate? When is civil disobedience justified? Could there be international law, and how can rights be enforced? These questions will often be asked in the context of the American system of common law and statutes, and thus will overlap with questions of federalism, constitutionalism, democracy, the police and prison systems, and social and economic structures. They will also require investigating the views of human nature underlying various philosophical positions. In general, the course examines the relations between human values, ethics, and law and the way these relations affect the organization of broader social, political, and religious institutions.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 106: Business Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Business ethics is not just about CEOs behaving badly. Even if sweatshops treat humans poorly, do they deserve thanks for their labor market expansion? Must corporate trustees seek only profit for their shareholders, or also benefit their surrounding communities? Who picks up the cost of environmental degradation by airlines, factories, and farms? What exactly does 'truth in advertising' mean, and how limited should marketing be to children, or about alcohol and pharmaceuticals? How should the imperatives of the 'free market' or 'capitalism' be treated in democratic decision-making? The course will develop a student's critical skills in evaluating the philosophical foundations and justifications for business and economic systems, the relation between morality and contemporary business practices, and central positions and figures in the history of philosophical analysis of these questions.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 107: Philosophy of Technology", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys different views about technology: what counts as technology, what role it plays in society and human development, what benefits it might promote, and what obvious or hidden effects deserve criticism. The course's readings and discussions prompt reflection on the purpose and consequences of technology for your own life, what possibilities it opens and forecloses, and how it modifies, sometimes irreversibly, your environment. Required readings may include current news articles and blog posts, science fiction, historical analyses of technological change, and philosophical investigations of the concept of technology.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 108: Social and Political Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course studies philosophical views about large-scale human relations: in groups, communities, populations, nations, and countries. By studying prominent philosophers and positions it investigates the following kinds of questions: Why might anarchy give way to government? How do political arrangements differ from domestic, friendship, or business obligations? Ought people organize to pursue a common good or goal? What does fundamental opposition about religion, morality, financial interest, and human sentiment mean for integration into a public realm? Is the personal always political, and what deserves to be kept private? Such questions have animated philosophy since its origins, is of vibrant contemporary interest, requires development of a view of human nature, and relates to ethics, psychology, sociology, law and criminology, economics, and political science. By the course's end, students should have a greater critical understanding of the nature of social and political organization, influences on human values, and the traditional philosophical problem concerning the good society.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 108H: Honors Social and Political Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course studies philosophical views about large-scale human relations: in groups, communities, populations, nations, and countries. By studying prominent philosophers and positions it investigates the following kinds of questions: Why might anarchy give way to government? How do political arrangements differ from domestic, friendship, or business obligations? Ought people organize to pursue a common good or goal? What does fundamental opposition about religion, morality, financial interest, and human sentiment mean for integration into a public realm? Is the personal always political, and what deserves to be kept private? Such questions have animated philosophy since its origins, is of vibrant contemporary interest, requires development of a view of human nature, and relates to ethics, psychology, sociology, law and criminology, economics, and political science. By the course's end, students should have a greater critical understanding of the nature of social and political organization, influences on human values, and the traditional philosophical problem concerning the good society.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 108W: Social and Political Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This WAC course studies philosophical views about large-scale human relations: in groups, communities, populations, nations, and countries. By studying prominent philosophers and positions it investigates the following kinds of questions: Why might anarchy give way to government? How do political arrangements differ from domestic, friendship, or business obligations? Ought people organize to pursue a common good or goal? What does fundamental opposition about religion, morality, financial interest, and human sentiment mean for integration into a public realm? Is the personal always political, and what deserves to be kept private? Such questions have animated philosophy since its origins, is of vibrant contemporary interest, requires development of a view of human nature, and relates to ethics, psychology, sociology, law and criminology, economics, and political science. By the course's end, students should have a greater critical understanding of the nature of social and political organization, influences on human values, and the traditional philosophical problem concerning the good society.", "prerequisite": "ENGL 015 or ENGL 030H", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"course_name": "PHIL 109: Aesthetics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Aesthetics is the philosophical study of our experience of certain natural and artistic objects that incite pleasure or displeasure in us, and which we judge to be beautiful, ugly, or sublime. Aesthetics asks: What makes something beautiful? Are our judgments of beauty universal? What counts as art? What are the relations between beauty, morality, and truth? The objective of this course will be to provide students with a survey of historical and contemporary perspectives on these questions. The students should leave the course with a good grounding in aesthetic theory as well as an understanding of how the theoretical considerations apply in art criticism.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 110: Philosophy of Science", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course examines core philosophical questions about science, scientific reasoning and scientific practice. What is scientific method, and what role do deduction, induction and abduction play in it? How does scientific method differ from one science to another? What role do mathematics, mathematical models and computation play in the various sciences? How does reductionism (the claim that parts determine the whole according to specified laws) help science develop but also limits it? Why must philosophical reflection on science also encompass the history of science? If we pay close attention to the role of science in culture, we find that it has ethical as well as epistemological aspects, as it interacts with religion and politics.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 113: Philosophy of Literature", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course investigates the expression of philosophical ideas in literary form and, likewise, literature's contributions to a philosophical inquiry into fundamental questions of human existence. Its central themes may include the nature of love and desire, personal identity and relationships with others, and ethical concerns of good and evil. Readings are drawn from the history of world literature and philosophy, from Classical Greek texts to contemporary science fiction.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 114: Feminist Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course familiarizes students with concepts and challenges in feminist philosophies. Students will investigate the intersections of gender, race, sexuality, class, and other dimensions of identity through feminist analysis of epistemological and metaphysical assumptions (e.g., What is a woman? Does one's sex and/or gender provide special access to certain types of knowledge?), social structures, language, and the character of power.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 115: Philosophy and Education", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys the core philosophical questions that arise when thinking about education and teaching: What ought people to learn? How are instruction and experience related? What counts as knowledge and truth? How do we discover the human nature that underlies our educational theories? What are the moral implications of leading young people out of innocence or ignorance? What is there to education beyond classrooms, schooling, and reading? How much education ought a society to require or expect of its population? How important is intellectual and moral maturity? The course also considers the historical contexts from which philosophical theories about education have arisen and their ideological, political, social, and economic implications.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 118: Environmental Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course explores current environmental problems and human development in the context of historical and contemporary views of the relation of humans and nature. It examines differing conceptions of nature¿s value, human values, and the human condition more generally. It also investigates how distinct social, economic, and political ideologies and systems affect the human relation to nature, and how the ethical problems that arise from such systems may be critically evaluated and potentially resolved.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 119: Ethical Leadership", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Leaders, in whatever context, make difficult decisions, distribute scarce resources, direct and influence the conduct of others, and represent the goals of the enterprise they lead. Thus they ought to exemplify prudence, fairness, integrity, honesty, trustworthiness, sincerity, and morally upright behavior. This course investigates these concepts and the moral dilemmas that arise in developing or applying them. It also explores, philosophically as well as practically, the ways leaders might identify ethical challenges, analyze them, imagine possible solutions, and be motivated to do the right thing. Students may read a variety of literature, from classic plays and novels, to prominent philosophical texts, to recent studies of ethics and leadership.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 120N: Knowing Right from Wrong", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "\"Knowing Right from Wrong\" provides a comprehensive understanding of the nature of moral ideas, beliefs, and behaviors in contemporary contexts. What roles do nature and nurture play in the development of moral sensibilities? How do moral emotions and moral reasoning interact to produce moral behavior? What defines moral character and how does it influence what we do? Is it possible to derive what ought to be done from what is known about the world? How do we respond when moral demands compete with another? How do our moral convictions color our perceptions of world events? Can individuals and groups with differing moral commitments communicate with one another and live together peacefully? The course integrates perspectives from philosophy, psychology, and sociology, and prepares students to think about (and act in) a world in which morality (and its linked concepts, such as judgment of others) plays an increasingly important social and political role. The course treats morality as both an aspirational concept and as an actual social practice, and focuses on three major themes: (1) the origins and development of moral reasoning and ethical systems, (2) the influence of moral emotions and moral intuitions on moral reasoning and behavior, and (3) the influence of social and contextual factors on moral behavior and expression. Integrating the philosopher's interest in ethics, with the psychologist's interest in the mind and body, and the sociologist's interest in groups, the course provides a comprehensive introduction to morality in contemporary society, and the ways in which it shapes the lives of people in everyday situations.", "other": ["Cross-listed with: PSYCH 120N, SOC 120N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 122: Philosophy of History", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys the core questions that arise when thinking about history, the relevance of the past, and the writing of history: How can we know history? What does it explain and what does it teach? Are those who don¿t know it doomed to repeat it? Is it objective? How is it related to human nature and progress? And what exactly is history ¿ is it simply everything that has happened, or specific sequence of events, or a narrative we apply to make sense of some aspect of the past or present? In addressing these questions, the course emphasizes the thought of influential figures, including Hume, Vico, Hegel, Marx, Mill, Rickert, Dilthey, Croce, Collingwood, and Hempel. In general this course helps students think philosophically about the fact that humans live essentially through time and across generations. It also contributes to understanding the practice of studying, research, writing, and talking about history.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 123: Media Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys the core philosophical questions connected with mass media: What is newsworthy? What is the whole story, and what makes it true? How ought media's form influence the power of its content? What authorizes journalists to interpret the facts? How much does individual self-understanding and social organization depend on media images and tropes? Does it make sense to speak of \"the media\" as a unified phenomenon? As we work to formulate and answer these questions, students will acquire ethical understanding, media literacy, and an appreciation for the role media plays in the formation of cultural expectations about knowledge, values, and technology.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 124: Philosophy of Religion", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys perennial philosophical questions connected with religion: What is God, deity, or divinity? What is the nature and significance of religious experience? Is it rational to hold religious beliefs? How persuasive are arguments about the existence of God? How compatible is religion with modern science? What are the meanings of miracles, immortality, and creation? In what ways might morality depend on religion? What role ought religion to play in society and the public sphere? What lesson should we draw from profound religious experiences? Ought religious tolerance to be limited at all? Through the reading and discussion of relevant historical and contemporary texts, students will be encouraged to reflect on such questions from a variety of perspectives.", "prerequisite": "third-semester standing", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 125: Theories of Knowledge", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys the core questions in epistemology: What do we mean when we claim to know something, as opposed to merely having an opinion about it? What sorts of things, if anything, are ultimately knowable? What role ought sensation, perception, observation, experience, authority, testimony, or reason play in forming, changing, justifying, or defending claims to knowledge? Are such claims to knowledge always conditioned by the social and historical situation, and limited by the knowers' standpoint, or are there universal standards to establish them? Through analysis and discussion of classical historical and contemporary texts, the course introduces students to these and related problems of knowledge and acquaints them with the most influential strategies that philosophers have developed in response to them.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 125W: Theories of Knowledge", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This WAC course surveys the core questions in epistemology: What do we mean when we claim to know something, as opposed to merely having an opinion about it? What sorts of things, if anything, are ultimately knowable? What role ought sensation, perception, observation, experience, authority, testimony, or reason play in forming, changing, justifying, or defending claims to knowledge? Are such claims to knowledge always conditioned by the social and historical situation, and limited by the knowers' standpoint, or are there universal standards to establish them? Through analysis and discussion of classical historical and contemporary texts, the course introduces students to these and related problems of knowledge and acquaints them with the most influential strategies that philosophers have developed in response to them.", "prerequisite": "ENGL 015 or ENGL 030H", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"course_name": "PHIL 126: Metaphysics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course considers key concepts, problems, and figures in metaphysics, the investigation into the nature of reality. We will ask the deepest questions about what exists and how things relate to one another on a fundamental level. For example: Does everything ultimately reduce to simple substances, or is reality organized into types? Does time exist objectively, or is it dependent on the mind? Does effect follow cause as a matter of universal law or only as a statistical probability? What factors determine whether a thing is the same over time or differs at every instance? We will also query the most basic assumptions about reality, that a pencil will not fall through a desktop, the sun will rise tomorrow, and the world was not created a minute ago. Students will develop skills in reading difficult texts, evaluating arguments, and formulating their own philosophical views through discussion and in writing.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 126W: Metaphysics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This WAC course considers key concepts, problems, and figures in metaphysics, the investigation into the nature of reality. We will ask the deepest questions about what exists and how things relate to one another on a fundamental level. For example: Does everything ultimately reduce to simple substances, or is reality organized into types? Does time exist objectively, or is it dependent on the mind? Does effect follow cause as a matter of universal law or only as a statistical probability? What factors determine whether a thing is the same over time or differs at every instance? We will also query the most basic assumptions about reality, that a pencil will not fall through a desktop, the sun will rise tomorrow, and the world was not created a minute ago. Students will develop skills in reading difficult texts, evaluating arguments, and formulating their own philosophical views through discussion and in writing.", "prerequisite": "ENGL 015 or ENGL 030H", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"course_name": "PHIL 127: Philosophy of Mind", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The course wonders, \"What is a mind?\" - especially in its relationship to the brain, the person, and the world. We study whether consciousness defines a mind, what limitations if any subjectivity places on the scientific investigation of the mind, and how to build a robot with a mind. Readings may include texts from the history of philosophy and contemporary philosophy, as well as neuroscience and psychology. Students will learn a broad range of skills needed to understand and synthesize the variety of information relevant to the mind.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 129: Philosophy of Language", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Philosophy of language asks the following sorts of questions: What makes a system of symbols a language? What is meaning? How does a term or a symbol refer to an object? In what way is speech also an action? How does language affect the way we see the world? This course offers a critical survey of key concepts, topics, and texts from Classical authors (e.g., Plato and Aristotle) and more recent thinkers, in the post-Fregean analytic tradition, the Peircean pragmatic tradition, and the post-Husserlian or Saussurean continental tradition. It shows how the debates about language and its relation to the world shed light on other major problems of philosophy. Due to the formal nature of its subject-matter, the course helps students develop skill in the logical analysis of sentences and descriptions.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "PHIL 131N: BS: Identifying Bias and Falsehood", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The course will consider the ways statements are used for aims other than to convey accurate information. This disregard for truth results in the increasingly difficult task of identifying bias and falsehood in the age of information. There are three areas most corrosive to knowledge: language, science, and statistics. The course will examine the appeal of rhetorical arguments and the role of bias in assessing claims; various ways evidence fails to support a conclusion; and the manipulation of data to make information appear more compelling than it is. Students will learn to evaluate the truth of arguments based on philosophical and scientific criteria, and use a variety of skills to identify bias and falsehood in the media.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 132: Bioethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys core topics in recent bioethics - the study of ethical problems issuing from the use and treatment of human and non-human animals in the research and practice of medicine and biotechnology. It aims to help students think more critically and argue from specific moral theories when evaluating issues concerning human body and its enhancement, the value of life and death, abortion and euthanasia, the distinction between biological and moral conceptions of human, the nature of health, illness and disabilities, the allocation of resources for health-care, doctor-patient relationships, and our moral conduct toward animals in medical and industrial contexts.", "other": ["Cross-listed with: BIOET 100", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 133N: Ethics of Climate Change", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Climate change is not only a political, economic, and social crisis, it presents one of the great moral problems of our time. This course will cover the science, policy, and ethics of climate change. It fulfills general science requirements by giving an overview of the role played by such diverse scientific disciplines as chemistry, earth systems, ecology, and geology in understanding our changing climate while also exploring mitigation and adaptation strategies being developed in the fields of engineering, forestry, agriculture, and others. It fulfills humanities requirements by delving into the ethical dimensions of climate change, including religious and humanistic theories of human flourishing, deontological and teleological theories of ethics, and analysis of specific choices addressed by international negotiators. A hallmark of this course is using Penn State as a 'living laboratory' by taking advantage of both faculty expertise and the realworld activities of the Office of Physical Plant. Every week, students will interact with experts from various quarters of the University in order to see how climate change is being approached in a multi-disciplinary fashion. The first third of the course will feature guest lectures by EMS faculty working on paleoclimate, modeling, carbon sinks, ocean acidification and other aspects of climate science. The second portion will engage humanists, economists, historians, and artists at Penn State. The third will include tours of Penn State facilities, such as the East Campus Power Plant, and interviews with researchers developing new energy and sequestration technologies. In addition to exams and papers, students will prepare for a mock negotiation by learning about the energy profile and history of assigned countries. They will then have to set specific CO2 and temperature goals and come up with solutions to achieve these. The goal is to understand the role placed by ethical ideals in the pragmatic process of producing an equitable solution. In short, this course will give students the tools to understand the basic science of climate change and its ethical implications. Students will come away with a better sense of the moral dimensions of this phenomenon and the implications for human civilization and for the biosphere.", "other": ["Cross-listed with: METEO 133N, RLST 133N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 134: Food, Values, and Health", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 3", "description": "This course studies the ethical and social issues connected to food, personal and cultural eating habits, body image and ideas of health, and agricultural practices and industrialized food production. We will discuss the following sorts of questions: In what ways are cooking and eating central to our human identity? What do judgments about being anorexic, overweight, or eating unhealthily mean and do? How strong are the arguments for vegetarianism, veganism, or raw-food-ism? Ought we to eat as our Paleolithic ancestors did? If the future holds engineered meat, GMO fruit, and Soylent shakes, what are we to think? Should food-companies be allowed to advertise to children? Is alcohol more like food, like medicine, or like drugs? Students will pursue answers to such food-ethical questions by learning relevant moral and social theory, discussing past and contemporary approaches to these issues, and analyzing case studies. We will pay particular attention to food as a symbol with psychological, social, and spiritual meanings and effects.", "other": ["Cross-listed with: FDSC 134", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 135: Ethics in Jewish Tradition and Thought", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course takes as its starting point the idea that modern ethical frameworks are deeply rooted in the soil of older traditions. By examining the development of Jewish intellectual traditions and their roots in the Bible, it provides students with an opportunity to study ethics in a philosophically textured, culturally rich, and historically informed way. And by focusing on Jewish engagement with the Bible, the course illuminates other traditions that derive from biblical monotheism: for example, those associated with Christianity, Islam, and the Enlightenment. The first part of the course takes up the idea of tradition and includes a study of biblical texts that serve as the foundation for key moral concepts. Following the traditional division of the scriptures, it examines questions of human identity and responsibility in the Torah, social ethics in the Prophets, and the quest for wisdom in the Writings. The final topic in this unit is the development of ethical tradition among the great sages of Jewish antiquity. The second unit shifts focus to the appropriation of tradition in modern Jewish thought. After reviewing important developments in Jewish thought in the medieval and early modern periods, it turns attention to the ways that some recent figures have addressed perennial concerns in light of commitments and ways of being that are integral to Jewish identity. By reading closely the works of such seminal thinkers as James Kugel, Joseph Soloveitchik, and Abraham Heschel, we will gain a deep acquaintance not only with important vocabulary but also with the ways that traditional words and concepts may be used dynamically to produce fresh ways of looking at questions in moral philosophy.", "other": ["Cross-listed with: JST 135, RLST 135", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 136N: Art and Philosophy in Ancient Greece", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Ancient Greece provided Western Civilization much in terms of art and philosophy. The influence of the Greeks can be seen in such areas as architecture, sculpture, concepts of beauty, literature, etc. These are independent domains, but there is often integration between the two disciplines. This course will uncover the ways in which philosophy informed Greek ideals and the role played by both visual art and literary art. To that end, sections will focus on each of those two disciplines. Study will also display how the disciplines come together in the following areas: 1) Beauty and 2) The interrelation of art, religion, philosophy and the state. Early in the course, students will thoroughly examine the concept of Beauty, with an emphasis on Ideal Beauty. Students will explore objective and subjective definitions by developing models of each and then synthesizing competing ideas in their own unconventional definitions of Beauty. Foundational work will include study of specific Greek artists/thinkers, and involve students in working toward identifying traces of early thinking in contemporary society. This will include both written and visual work. Analyses will target philosophical thought, sculpture and architecture primarily from Early Classical and High Classical/Golden Age works as students explore the Greek search for perfection. The periods and styles that will be covered include: Geometric which includes the Orientalizing period; Archaic; Classical (Early, High, and Late); and Hellenistic. Next students will examine and discuss different philosophical topics such as metaphysics, epistemology, aesthetics, etc. An emphasis will be placed on Plato and Aristotle but the Pre-Socratics may also be considered. Art and philosophy are also integrated in Ancient Greece. Plato considered beauty, art, the artist and tragedy in works such as The Republic, Philebus, Ion and Hippias Major. Aristotle's major contribution to aesthetics is in the Poetics. The last section will consider the relationship between literary art (plays) and the Greek understanding of authority, particularly the gods, the state and the individual. Much of the art in the Greek culture (as it is in most cultures) is best understood in terms of the dominant religion. The themes developed gave rise to a great deal of philosophical reflection in terms of the place of religion, and how the individual saw themselves in relation to the gods and the state. Through an examination of plays and philosophical texts, students will explore this relation between the individual and an authority (gods or rulers).", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 137N: Introduction to Philosophy through Health and Sport", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 3", "description": "Introduction to Philosophy through Health and Sport (PHIL137N). 3 credits. (Inter-Domain), (GH), (GHW) is a general education interdomain course that introduces students to the major branches, ideas, theories, and arguments of philosophy. This introduction is contextual insofar as it provides an overview of core philosophical ideas by relating them to a multidimensional conception of health, specifically focusing on positive health (wellness) and thinking about both philosophy and health in relation to sport. This is an Inter-Domain (\"N\") course containing two general education domains (GH/GHW). Successful completion of the course fulfills 3 credits of Integrative Studies in General Education.", "other": ["General Education: Humanities (GH)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 139: Latino/a Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This introduction to Latino/a Philosophy covers the historical experience of Latino/a peoples and the impact that those experiences have had and can have on \"American\" philosophy. It also covers race, class, gender, and ethnicity in relation to the Latino/a experience, and thus ethics, political theory, legal theory, critical philosophy of race, and feminist philosophy. In the process it offers an introduction to key themes in contemporary philosophy. The course includes comparisons with African American, Asian, and Native American philosophies.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 197: Special topics", "department": "Philosophy (PHIL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 198: Special topics", "department": "Philosophy (PHIL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 199: Foreign Study--Philosophy", "department": "Philosophy (PHIL)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "PHIL 200: Ancient Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course examines key themes, texts, and persons in ancient Greek philosophy, with the works of Plato and Aristotle at the core. We ask: What did Socrates mean when he said \"the unexamined life is not livable by humans\"? Or when Thales said \"All begins in water\"? Or when Epicurus said \"Only pleasure is valuable\"? Or when Parmenides said \"You cannot speak of what is not\"? To answer these questions, we examine the cultural background of philosophical thinking (Homer and Hesiod; Near Eastern traditions; trade and empire), and we survey views about, for example, the universe's structure and origin, the nature of reality and change, the status of knowledge and opinion, the best way of life for individuals and for societies, and the value of reason, persuasion, argument, and logic. We also give close attention to the formation, meaning, and purpose of philosophy, wisdom, and sophistry. This includes analysis of the \"myth reason\" hypothesis, Milesian inquiry into basic principles (archai), physical vs. ethical inquiry, and the development of doctrine, discipline, and disagreement. In addition to the figures mentioned above, figures studied may come from the periods of the Presocratics (e.g., Pythagoras, Heraclitus, Xenophanes), Hellenism (Stoic, Epicurean, Cynic, and Skeptic), the Romans (e.g., Cicero, Seneca), and the Neoplatonists (e.g., Plotinus).", "other": ["Cross-listed with: CAMS 200", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 201: Medieval Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course examines key themes developed by the philosophers from the long millennium between the fall of Rome and the rise of the Renaissance, many of whom responded to ancient Greek philosophy in the context of their theological commitments (Christian, Jewish, Muslim). The works of Augustine and Aquinas are at the core; readings may also include works by Boethius, Anselm, Abelard, Occam, Scotus, Avicenna, Al-Kindi, Maimonides, and Averroes. We ask: What is the fundamental nature of reality, and where do humans fit in? How ought we to understand essence and existence? Do abstract concepts correspond to real \"universals\" or are they mere names? What does a belief in free will and evil commit us to? What should we make of the arguments for God¿s existence? What are laws of nature, and in what respect might natural law govern our lives? To answer these questions, we examine the cultural and Greek/Roman background of medieval philosophy, and give close study to the significant philosophical and related texts of the tradition.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 202: Modern Philosophy: 1600-1800", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course surveys major philosophical issues of the seventeenth and eighteenth centuries, a vibrant era of scientific revolution, religious and political upheaval, and Europe's rise to global power. In its quest for a method of scientific discovery, philosophy breaks with the Aristotelian tradition that had dominated it for centuries; it ends up confronting remarkably new questions and modes of explanation. We focus on the works of the major thinkers of this era, such as Descartes, Spinoza, Leibniz, Locke, Berkeley, Hume, and Kant. Although with different priorities and conclusions, each takes up the implications of the new, mechanistic conception of nature. We study their investigations into the following types of questions: What is \"substance\" and what are the genuine qualities of things? What is the nature of the mind, and how is it related to the \"material body\"? How do we acquire knowledge of reality, and can we ever be certain of this knowledge? Are natural phenomena determined by causal laws? Does God exist and, if so, what is his role in relation to a material world governed by causal laws? The lively debates over these questions gave birth to two rival schools of thought, one seeking answers in the innate principles of the mind (rationalism), the other in our experience of the world (empiricism).", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 203: Nineteenth Century Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The nineteenth century is a period of political upheaval and ongoing social, cultural, and scientific transformation, shaped in equal parts by the French Revolution and the Industrial Revolution. This transformative character is reflected by the epoch¿s most influential philosophers. Kant's \"critical\" philosophy emphasizes the primacy of practice and the subject's active role in constructing reality. Hegel focuses on the rationality implicit in the historical growth of religion and the political institutions of the state. As the century wears on, escalating social and political conflicts lend credibility to outspoken critics of such optimistic rationalism. Schopenhauer¿s pessimism, Kierkegaard's existentialist focus on the irrationality of faith, Marx's historical materialism and emphasis on class struggle, Nietzsche's \"genealogical\" anti-realism and philosophy of power are prominent examples. The embrace of new paradigms in morality (Mill), natural science (Bergson), and psychology (Freud, James) round out the picture of a century in transition from \"classical\" European modes of thought to the self-conscious secularism and dynamism of the 20th century. By reading a broad selection of representative texts, students will learn about the major figures and streams of thought that shaped the course of this eventful period in the history of Western philosophy.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 204: Twentieth Century Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The 20th century can be characterized as a crisis of foundations, doubt about the ultimate grounding or demonstrability of our beliefs concerning the world and ourselves. So-called continental philosophy sought a ground of knowledge in phenomenology, the view that human subjective experience (\"phenomena\") reveals essences, how things actually are. By mid-century, deconstructionist critique shattered confidence about the underlying distinctions assumed here. So-called analytic philosophy began the century with a commitment to eliminating metaphysical speculation in favor of narrowly empirical truths, on the model of scientific investigation; but the eventual unconvincingness of this view led to theories of knowledge and metaphysics that allowed for the absence of foundations. Rooted in this and earlier rejections of foundations, so-called pragmatism began as way to assess competing ideas by the difference they make in human action. A crisis in political foundations generated the social and philosophical movements of Marxism, critical race theory, and feminism. The ramifications of these crises continue to be acutely felt in contemporary philosophy, making the 20th century a period of particularly diverse and relevant resources. This course satisfies BA and GH requirements.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 205: American Philosophy: 1840-Present", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "American philosophy comes into its own in the mid-nineteenth century, emancipating itself both from its origins in Protestant religion and from the tutelage of European role-models. The 1840s see the rise of the New England Transcendentalists (Emerson, Thoreau), who emphasized imagination, individualism, equality, and moral progress. During the decades of national reconsolidation following the Civil War, Pragmatism arises (Peirce, James, Dewey, Royce). Its practitioners innovations help set the tone for many twentieth-century intellectual developments: the emphasis on history, practice, and pluralism; the break with metaphysics and intellectualistic approaches to science, morality, and society; and the commitment to a \"radical empiricism\" broad enough to embrace scientific observation, religious experience, and social experimentation. Fuller's early feminism, Addams's social progressivism, and Du Bois's reflections on racial inequality constitute uniquely American moments in the history of philosophy. Certain more recent philosophers (Putnam, Rorty, Cavell, and Brandom) have renewed and extended the pragmatist legacy. The course evaluates the problems raised by these philosophers and traces their influences on American society, politics, and culture. One of the principal goals is to enable students to understand better this rich philosophical tradition and its importance-both critical and constructive-in the contemporary American landscape.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PHIL 208: Contemporary Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Treating contemporary philosophy as history encourages us to ask what current ideas are likely to resonate in the future. The course focuses on philosophical work that crosses disciplinary boundaries, addresses new social and political problems, introduces experimental styles, and opens novel areas of investigation. By engaging with the ideas of philosophers who are writing and thinking right now, students gain the opportunity to consider how well philosophy addresses issues of concern to a world that they themselves belong to. Examples include climate change, racism, posthumanism, globalization, gender and sexual identity, and the science of the mind. Working with living philosophers also affords the opportunity to see the authors speak about their work on video or, when practical, in person.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 233Z: Ethics and the Design of Technology", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Humans have always created artifacts and artificial environments to aid us in our survival and to help fulfill our needs and desires. Moreover, today technology is all pervasive, transforming and conditioning our social and political relations, our cultural understanding of ourselves, and our relationship with other animals and the natural environment. Designers make important choices concerning the creation, development, and deployment of many if not most technological innovations. Consequently, the task of the designer is an ethical one. It is therefore important to give future designers the opportunity to reflect upon the meaning of technology, particularly in its moral dimensions. Two means will be used to achieve our course goals. Much of the time will be spent thinking about and discussing the various impacts that particular technologies have upon the social, cultural, and political lives of human beings and upon the natural environment. To facilitate thoughtful discussion, we will read a number of authors, writing short papers in preparation for critical discussion in class. The second means is aimed at putting our ideas into practice by working in teams on several design projects. These design projects will require the integration of readings, discussion, and research and their synthesis to resolve the moral aspect of a design problem. Student teams will work cooperatively on these projects and make oral progress reports as well as final written and oral reports.", "other": ["Cross-listed with: STS 233Z", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHIL 242N: Happiness and Well-Being", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "PHIL 242N : Happiness and Well-Being. 3 credits. (Inter-Domain), (GH), (GS), (BA). This course provides a general introduction to the topics of human happiness and well-being as these topics are both approached from the humanities discipline of philosophy and the social and behavioral science discipline of psychology. The course will introduce the distinct methods of inquiry into the topic of well-being in philosophy and psychology and highlight the disciplinary commitments of the two fields more generally. Students will understand and evaluate the empirical research into well-being and positive psychology in psychology. Students will understand and evaluate the three major theories of well-being in philosophy: hedonism, the desire satisfaction theory, and the objective theory. We will appraise whether the empirical results affect the viability of the philosophical theories. We will appraise whether the philosophical theories affect the significance of the empirical results. We will consider such questions as: What are the strengths, weaknesses, and complementarities of the philosophical and psychological approaches to well-being? Are psychologists and philosophers talking past each other, or can the two disciplines learn from each other's research results and philosophical theories? What implications do the results and theories studied have for concrete choices I should make in order to increase my well-being? Are there implications for choices of social policies aiming to increase well-being?", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHIL 296: Independent Studies", "department": "Philosophy (PHIL)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 297: Special Topics", "department": "Philosophy (PHIL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 299: Foreign Studies", "department": "Philosophy (PHIL)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "PHIL 401: American Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "A distinctively American school of philosophy emerged in the early part of the nineteenth century and remains influential in the present day. American transcendentalism, philosophical applications of evolutionary theory (e.g., social Darwinism), the abolition of slavery (Garrison, Douglass), and equality for women (e.g. Grimké, Stanton, Fuller) dominated the early part of the nineteenth century. By far the most well-known philosophical movement in the later nineteenth and early twentieth century was pragmatism (Peirce, James, Dewey). Its proponents developed new approaches to a range of traditional philosophical topics, including truth and knowledge, ethics, the nature of reality and the mind, religion, and education. \"American philosophy'\" is characterized by its emphasis on the decisive value of practice and its guiding role in relation to theory; by its metaphysical pluralism, anti-Cartesian fallibilism, and rejection of intellectualism; its constructive criticism of racial and gender inequalities (e.g. Du Bois, Addams, Ladd-Franklin), and its commitment to a conception of experience (\"radical empiricism\") broad enough to embrace both science and religion. In more recent times, influential neopragmatists such as Richard Rorty and Robert Brandom have further advanced the tradition and demonstrated its continuing philosophical and social relevance. This course builds on its precursor (Phil 205), focusing on specific topics, works, or figures.", "prerequisite": "PHIL 205", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 402: Seminar in European Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "Among the most important movements to emerge in the decades around 1900 are phenomenology (Husserl, Merleau-Ponty) and neoKantianism (Natorp, Cassirer), which make important contributions in metaphysics, epistemology, and to research in the foundations of logic, mathematics, and science. Hermeneutical thought (Dilthey), by contrast, emphasized \"historicity\" over the ostensibly timeless objects of traditional philosophical thought, insisting that interpretive \"understanding\" of historically situated subjectivity was a kind of knowledge distinct from the \"explanation\" of purely objective phenomena, while Marxism urged attention to historical development in the name of social critique and political change. These productive tensions are evident in the major movements that dominate mid-twentieth century Continental philosophy: existentialism (Heidegger, Sartre), critical theory (Adorno, Horkheimer), and structuralism (Jacobson, Lacan, Althusser). Beginning in the 1960s, French Continental philosophy enters a phase of self-criticism that gives rise to innovative and challenging forms of discourse, often referred to collectively as post-structuralism (Derrida, Foucault, Deleuze). These thinkers challenge basic assumptions of classical Continental philosophy, e.g., the centrality of subjectivity; the privileging of identity over difference; the non-violent sovereignty of reason; the unity, continuity, and progressive character of history; the possibility and desirability of totalizing \"structures\" of collective power, action, and intelligibility. At the same time, secondgeneration critical theorists (e.g., Habermas) seek to revise their teachers' overly rigid commitment to Marxism and outmoded psychological and sociological conceptions in favor of more nuanced theory of \"communicative action\" and the structural transformation of the public sphere. Building on its survey-oriented precursor (PHIL 102), this course provides an opportunity for more focused engagement with selected authors and works, or with particular topics or streams of thought pursued through attention to a variety of authors and works.", "prerequisite": "PHIL 102", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 403: Seminar in Environmental Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "How do and should human beings relate to the natural world - and what is the natural world? What moral obligations or considerations for non-human animals, plants, and other parts or features of nature? What do we owe to other human beings, and future humans, with respect to the environment? This course examines such questions in light of current ethical and social-political theories and uses such questions to assess the adequacy of those theories (which were often formulated without explicit concern to answer such questions about the environment). We can then assess the pressing environmental issues of today - climate change, conservation, pollution, sustainability, and population - in light of those theoretical perspectives.", "prerequisite": "PHIL 118", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 405: Seminar in Philosophy of Law", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course gives close attention to key themes in the philosophical analysis of legal systems, either historical or contemporary. Relevant issues may include the nature of law and its relation to morality, custom, and politics; the nature of constitutional interpretation and the role of judges; the purpose and limits of punishment; the possibility of international law and rights-enforcement; the connection between legal arrangements and social or economic inequality; the differences between types of legal system (e.g., common law, statutory, ecclesiastical); and the idea of progress in law. Students will gain a deeper understanding of select issues they may have studied in PHIL 105; develop skills of reading, comprehension, critique, and expression; and continue to appreciate the value of philosophical approaches to (at times problematic) human institutions.", "prerequisite": "PHIL 105", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 406: Seminar in Business Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course examines ethical issues introduced and engaged by business. These may include the relation between morality and contemporary business practices, the nature of money, corporate social responsibility, self-regulation and government, advertising, social consequences of systems of production, environmental economics, economic inequality and justice, the relationship between business and politics, the philosophical foundations and justifications for business and economic systems, and central positions and figures in the history of these questions.", "prerequisite": "fifth-semester standing", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 407: Seminar in Philosophy of Technology", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The human condition may very well be a technological condition. Developing and refining technology have proven central to cultural and perhaps even evolutionary history, the development of science, our economic practices, and-most importantly-our selfunderstanding. Should we understand the co-development of humanity and technology as a continuous history? Or have the past two centuries-with the development of industrial mechanization, the computer, and now the Internet-marked a radical shift of some kind? This course will explore the philosophy of technology in more focused and rigorous ways than the department's lower-division course, PHIL 107, seeking to understand the way in which technology is transforming our relationships to ourselves, to other people, and to our world. Guiding questions for the course include: What is technology? How does it inform and inflect human flourishing and the human condition? What are its ramifications for ethical thought?", "prerequisite": "PHIL 107", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 408W: Seminar in Social and Political Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course builds on lower level courses in social and political philosophy (e.g., 108) to provide an in-depth examination of philosophical issues relating to political institutions and social practices. These issues may include questions concerning the justification of government; the nature of equality, freedom, democracy and other modes of political organization; or issues concerning the evaluation of social life such as race and racism, cultural identity, power, and violence. Assigned readings willy typically include historical and contemporary philosophical work on these questions as well as material on current events, social controversies, historical material, and other works that expand and reflect upon these core issues.", "prerequisite": "108", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"course_name": "PHIL 409: Seminar in Aesthetics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Aesthetics examines questions related to the nature of art and beauty as well as the nature of aesthetic judgment and experience. Building on its precursor (PHIL 109), this course explores selected topics in traditional or contemporary aesthetics in greater depth. Typical issues include the distinction between beauty, sublimity, and ugliness; the nature of aesthetic experience and artistic value and their relation to knowledge; the basis and validity of aesthetic judgments; the relationship between art, morality, and society; and the influence of social identities (race, class, gender, sexuality, ability, etc.) on the production and reception of art. In addition to familiarizing themselves with theoretical approaches, students will typically also engage in the discussion and critical interpretation of specific artworks (e.g. paintings, sculptures, photographs, films, musical compositions or performances, literary works), both as a way of exemplifying particular aesthetic issues and approaches, and with a view to enhancing students¿ aesthetic perception and experience.", "prerequisite": "PHIL 109", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 410: Seminar in Philosophy of Science", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course reviews the development of philosophy of science in the past century and studies its development once it turns its attention to modern cosmology and biology in this century. We begin with the Vienna School, which took physics to be the most important science, and analyzed deductive thought by means of predicate logic. Then we will look at the work of Thomas Kuhn, who insists on the importance of the history of science for philosophy: we must look at how the sciences develop over time. This makes biology especially interesting: we begin with Darwin, and trace developments to the discovery of DNA and the importance of genetics, and consider the way biology combines the microscopic, the macroscopic, and the study of biological systems. This leads science to interact with politics, as the issue of global warming becomes apparent. How does theory intersect with practical deliberation? The development of modern cosmology also reminds us that the whole universe has a history, and changes our sense of our environment. So it seems that the philosophy of science must include not just deductive thought, but also historical thought and practical deliberation.", "prerequisite": "110", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 413: Seminar in Philosophy of Literature", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course builds on its precursor (PHIL 113) to provide a deeper, more focused perspective on specific topics and issues, for example the nature of fiction and its relation to fact, the value of literary works of art (aesthetic, cognitive, educational, and social), and the nature and proper norms of literary interpretation, translation, analysis, and historiography. Assigned readings will typically be philosophical or (more broadly) theoretical in character, though the instructor may incorporate works of literature into the syllabus. In addition to skills in both the writing and the critical analysis of texts, students will deepen their appreciation of the value of literary representation and its relation to the distinct but closely related field of philosophical reflection.", "prerequisite": "109", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 416: Philosophy of Social Science", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course focuses on the methods and epistemological bases for work in the social sciences, which include any field that focuses on explanations of human behavior, psychology or social activity. Topics include questions of objectivity, meaning and interpretation, and the grounds for knowledge of the human condition. Issues may also include whether such sciences are best seen as empirical (even quantitative) accounts of human behavior or interpretive and qualitative understandings of those phenomena.", "prerequisite": "PHIL 108", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 418: Seminar in Ethical Theory", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course builds on lower level courses in ethics and value theory (e.g., PHIL 103). It goes deeper into questions of the meaning, justification, and motivational grounding of ethical judgments. Topics may include \"normative ethical systems\" such as utilitarianism, Kantian ethics, Aristotelian virtue theory, and feminist care ethics. Also included are more abstract issues in \"meta-ethics\" such as whether ethical statements can be true or false, whether they stand in logical relation to each other as do other propositions, what connection do such judgments have to the psychological make-up of human beings, and the like. Also considered are questions such as the objectivity (or relativity) of ethical judgments and their relation to the meaning and evaluation of social practices and institutions.", "prerequisite": "103", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 418W: Topics in Ethical Theory", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course builds on lower level courses in ethics and value theory (e.g., PHIL 103). This class goes deeper into questions of the meaning, justification, and motivational grounding of ethical judgments. Topics may include \"normative ethical systems\" such as utilitarianism, Kantian ethics, Aristotelian virtue theory, and feminist care ethics. Also included are more abstract issues in \"meta-ethics\" such as whether ethical statements can be true or false, whether they stand in logical relation to each other as do other propositions, what connection do such judgments have to the psychological make-up of human beings, and the like. Also considered are questions such as the objectivity (or relativity) of ethical judgments and their relation to the meaning and evaluation of social practices and institutions.", "prerequisite": "PHIL 103", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"course_name": "PHIL 424: Seminar in Philosophy of Religion", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course builds on its precursor (PHIL 124) to provide a deeper perspective on specific topics and issues, typically through discussion of classical or contemporary writings by recognized philosophers of religion. Though the course will typically focus on one or a few selected questions, these may range as broadly as the field itself, for example: how and to what extent is religious faith compatible with reason, scientific rationality, and our knowledge of history? Are there universal types of religious experience and what is their human value and objective significance? Are religion and morality mutually independent or does one rest on or constrain the other? Arguments concerning the existence of God, the interaction between religion, society, and politics, and religious pluralism are further possible topics. Beyond gaining familiarity with canonical texts and honing their skills as critical readers and writers, students will find opportunities to reflect both on religion¿s historical, social, and moral significance as a dimension of human life, and on the specific challenges it raises.", "prerequisite": "PHIL 124", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 425W: Epistemology", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The nature of cognition and perception, the conditions of experience, and the justification and truth of belief.", "prerequisite": "PHIL 125", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"course_name": "PHIL 426W: Metaphysics", "department": "Philosophy (PHIL)", "credits": "3-6 Credits", "description": "Examines the nature of reality, the existence of freedom, and the nature of matter, mind, and values.", "prerequisite": "PHIL 126", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"course_name": "PHIL 427: Seminar in Philosophy of Mind", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The nature of the mind and its relation to the physical world is the focus of this course, which builds on its precursor (PHIL 127). Topics include the definition of consciousness, what constitutes a self, and whether artificial constructions like robots could have minds. Views on these topics, as formulated by a range of (largely twentieth-century) movements - logical behaviorism, functionalism, (physicalist) reductionism, eliminativism, dualism, mind-brain identity theory, and enactivism - have significant metaphysical and ethical consequences. If consciousness is separate from the body, physical theories of causation cannot explain the effect of thought on action. If robots can have minds, there are reasons to be concerned about exploitation of robots as well as the possibility of robot domination. Students will investigate these topics in greater depth, typically either by selecting one or two for careful study or by focusing on the thought of one or two selected authors, e.g., Ryle, Smart, Millikan, Fodor, Block, Churchland, and Chalmers. Texts will challenge students to read and analyze contemporary and historical scholarly work on the topic. The issues discussed will encourage reflection on the assumptions students have about themselves and how their minds shape and are shaped by the world.", "prerequisite": "PHIL 127", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 432: Medical and Health Care Ethics", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Examines ethical, political, and social issues in the research, implementation, and practice of medicine, medical technologies, and healthcare.", "prerequisite": "fifth-semester standing", "other": ["Cross-listed with: STS 432", "Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 433: Ethics in Science and Engineering", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Ethical issues arising in the practice of science and engineering and their philosophical analysis.", "other": ["Cross-listed with: STS 433", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PHIL 435: Science and Religon", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course offers an intensive examination of the complex relationship between religion, science, and philosophy in different traditions and historical periods. How did science and religion emerge as distinct ways of understanding the universe? Were the two always in conflict? What is the nature of this conflict - is it historical, cultural, conceptual, linguistic, or methodological? Are there ways to make them compatible? Do they constitute separate realms with clear-cut borders and jurisdictions? In pursuit of wellinformed answers to these questions, the specific topics of this course will typically include modern scientific conceptions of the natural world and human life (e.g., cosmology, the origin and value of life, evolution) and the contemporary impact of these conceptions on religious belief; ethical questions stemming from scientific methods and biotechnology (e.g., cloning and genetic engineering and the religious responses to such acts of \"playing God\"), and examples of contemporary scientific approaches to explaining religious experience (e.g., cognitive science, neuroscience, and evolutionary psychology). The instructor may use discretion in selecting representative texts by religious studies scholars, philosophers, scientists, and historians of science with a view to offering a diverse set of authoritative and sometimes controversial approaches to the subject.", "prerequisite": "PHIL 110", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 437: World Philosophies", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "Philosophical traditions, problems, and authors in African, Asian, Middle- Eastern, Native American, or other non-Western cultures and intellectual traditions.", "prerequisite": "9 credits of philosophy, including 6 credits of philosophy at the   200 level or 5th semester standing", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "PHIL 438: Seminar in Feminist Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course will explore some of the influential theories and texts in the field of feminist philosophy. Feminist philosophy encompasses a broad range of inquiry, from political and ethical issues to foundational metaphysical and epistemological problems - e.g., What is a woman? What is the relationship between knowledge, epistemology, and power? Feminist philosophical approaches are diverse and include thinkers from all approaches to philosophy and are often richly influenced by work in women of color feminisms (e.g., intersectionality, Latinx), approaches to sexuality studies (e.g., LBGT studies and Queer Theory), post- and decolonial studies, and disability studies. Assigned readings will typically offer a range of approaches to feminist philosophy. While a majority of the readings will cover issues discussed by contemporary thinkers, a few historically significant feminist philosophers will often be included. Through reading and discussion, this course will introduce students to some of the central approaches to feminism, some of the most pressing issues, as well as the central controversies of feminist philosophy. Students will develop their interpretative and philosophical skills, while gaining a deeper understanding of the importance of feminist philosophy to the tradition of philosophy as well as to the general betterment of society.", "prerequisite": "114", "other": ["Cross-listed with: WMNST 438", "Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 439: Asian Philosophies and Issues", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "Exploration of the traditions, problems, and authors of one or more of the philosophical systems of Buddhism, Hinduism, Taoism, and Confucianism.", "prerequisite": "5", "other": ["International Cultures (IL)"]}, {"course_name": "PHIL 441: Capstone Course in Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course is intended as the Capstone Course for Philosophy majors and is to be taken during their senior year or during the last semester of their junior year.", "prerequisite": "6th semester standing and up"}, {"course_name": "PHIL 453: Seminar in Ancient Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "This course allows intensive study of select authors, traditions, works, or questions from ancient Greek and Roman philosophy. Key authors may include, for instance, the Presocratics, Socrates, Plato, Aristotle, Epicurus, Lucretius, Cicero, Seneca, Augustine, or Plotinus. Key traditions may include Stoicism, Hedonism, Platonism, Skepticism, Jewish, Roman, and Christian reception, or Neoplatonism and Neopythagoreanism. Key works may include Nicomachean Ethics, On the Nature of Things, Confessions, or Enneads. Key themes may include ethics (e.g., virtue, human flourishing, and pleasure), psychology (e.g., emotion, character, immortality of the soul), epistemology (e.g., imagination, knowledge, wisdom), metaphysics (e.g., atomism, teleology, dualism), logic, aesthetics, or history. This course may also include intellectual and cultural context for claims or trends in ancient philosophy. Students will develop in-depth experience with parts of ancient philosophy that goes beyond what they receive in the department's mid-level survey, PHIL 200: Ancient Philosophy. They will also hone reading, interpretative, argumentative, and creative philosophical skills on the relevant texts, which are among the most fascinating, puzzling, and frequently referenced of the Western philosophical tradition.", "prerequisite": "PHIL 200", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 455: Seminar in Modern Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "This course builds on its precursor (PHIL 202) to focus on specific topics in philosophy between 1600 and 1800. This includes the nature of substance; the mind-body problem; the method of knowledge acquisition; and the tensions between freedom, causal determinism, and a teleological conception of nature. Assigned readings typically include selections from the canonical texts of major figures such as Descartes, Spinoza, Leibniz, Locke, Berkeley, and Hume. The instructor may also choose to incorporate less studied figures such as Malebranche, Gassendi, Bacon, or women philosophers of the era, such as Lady Conway, Wollstonecraft, and Princess Elizabeth. Students will improve their skills in reading historical texts, reconstructing the arguments in writing, and deepen their appreciation of history of philosophy as a method of analyzing philosophical concepts and problems.", "prerequisite": "PHIL 202", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 456: Seminar in Nineteenth Century Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "This course builds on its precursor (PHIL 203: Nineteenth Century Philosophy) to focus on specific topics and issues of the nineteenth century. These may typically include the moral and practical implications of Kant's critical philosophy; Hegel's conception of history, religion and society; the socially progressive and socially conservative appropriations of Hegelian philosophy (e.g., Feuerbach's \"projection theory\" of religion, Marx's historical materialism and labor theory of value, and Kierkegaard's radical separation of faith and reason); Nietzsche's critique of realism, rationalism, and classical theories of the origin and value of morality; Mill's utilitarianism and liberalist conception of freedom; and Freud's theory of the unconscious. The instructor may choose a selection of representative texts or excerpts, for example Kant's Critique of Pure Reason, Hegel's Phenomenology of Spirit, Marx's Economic and Philosophic Manuscripts of 1844 and Capital, Kierkegaard's Concluding Unscientific Postscript, Nietzsche's Birth of Tragedy or Genealogy of Morals, and Mill's On Liberty.", "prerequisite": "PHIL 203", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 457: Seminar in Twentieth Century Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "This course builds on its precursor (PHIL 204: Twentieth Century Philosophy) to provide a more focused understanding of selected trends, topics, and questions specific to the period. The twentieth century is marked by a parting of the ways among rival (and often mutually hostile) approaches with distinct questions, styles, and agendas. Analytic philosophy of language emerges as a synthesis of Frege¿s formal logic with an empiricist theory of meaning; its early proponents (e.g., Russell, Moore, Carnap) aim to expose much of traditional philosophy as futile engagement with \"pseudo-problems\" and replace it a logically perfect language in which genuine problems can be posed and scientifically resolved. Phenomenology (e.g., Husserl, Merleau-Ponty) and existentialism (e.g. Heidegger, Sartre) revolt against the nineteenth century's overblown metaphysical systems and assert the importance of returning to an intuitive engagement with \"things themselves\" and with the lived experience of the human condition. Critical theory (e.g. Benjamin, Adorno) emerges as a synthesis of Marxism, aesthetic criticism, psychoanalytically informed sociology. Around mid-century, each of these streams of thought undergoes a period of crisis and renewal, associated with names such Wittgenstein and Quine in the case of analytic philosophy, Derrida, Foucault, and Deleuze in that of phenomenology and existentialism. Newly emergent critical philosophies such as feminism and decolonial thought heighten the sense of intellectual ferment. Students will emerge from the course both with a deepened understanding of one or more of twentieth century philosophy's key concerns (e.g., language and logic, history, power, the structure of reality, the nature of value and normativity, the relation of theory and practice, art and aesthetic experience, gender and identity) and canonical authors, and a sense of how they relate to the rival schools of thought.", "prerequisite": "PHIL 204", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 458: Seminar in Contemporary Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "This course will explore some of the influential theories and texts in contemporary philosophy. Contemporary philosophy encompasses a broad range of inquiry, from attention to the treatment of knowledge, reason, and the subject; to ethical and political issues; and to aesthetics and metaphysical problems. Themes may include such questions as: What is the status of the human subject in relation to the world? What is the status of truth once we recognize the radical contingency of our historically-bound existence? What is the relation between aesthetic value and ethical value? What does it mean to exist as a temporal agent? What forms does the exercise of power assume in late-modern societies and what resources does philosophy provide for a critique of societies of control? What resources are there in recent developments in philosophy for revitalizing the ancient ideal of philosophy as a way of life, including the concern with the flourishing life? Through reading and discussion, this course will introduce students to some of the central approaches to contemporary philosophy, some of the most pressing issues, as well as the central controversies of contemporary philosophy. Students will develop their interpretative and philosophical skills, while gaining a deeper understanding of central themes and figures in philosophy over the past century.", "prerequisite": "PHIL 208", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 460: African American Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course will explore central questions and themes guiding the evolution of African American philosophy in the 19th and 20th centuries. Our course will study three different movements from the era. We begin with slavery and questions of reason, civility, and nationality. We move on to philosophies of value and culture in the early twentieth century, with the focus on secularization and the historical nature of philosophical truth. Finally, we will read the work of black political philosophers, and the turn to Marxism and Hegelianism. Issues to be discussed include the foundation and source of race as knowledge of the world, the nature of blackness and identity, the nation as a locus of consciousness and action, God's role in the universe, and the possibility of an Afro-Pessimism about these things.", "prerequisite": "5", "other": ["Cross-listed with: AFAM 460", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "PHIL 461: Plato", "department": "Philosophy (PHIL)", "credits": "3-6 Credits/Maximum of 6", "description": "Plato has had, with his student Aristotle, the greatest influence on the history of Western philosophy of any writer. He synthesized politics and ethics, pedagogy and dialectics, psychology and epistemology, metaphysics and ontology, and even cosmology. He founded Europe's first research institute, cultivating mathematicians, astronomers, psychologists, rhetoricians, literary scholars, and of course philosophers. He lived at a time of profound political upheaval, in a democratic Athens that had just lost a war of imperial expansion. He wrote dozens of dramatic dialogues, among the greatest works of prose ever, celebrating his teacher Socrates, stunning his readers into puzzlement, and posing problems of self-understanding that would set the philosophical agenda for centuries to come. His works have appealed to skeptics and mystics, formal theorists and creative writers, Jews, Christians, and Muslims, and philosophers of a wide range of sensibilities. This course studies a variable range of his dialogues, with the goal of getting a broad and deep understanding of this author and his philosophical reception. Students will also learn about the features of Plato's thought and world that remain culturally salient - the Academy, the Forms, Platonic love, Socratic ignorance, the dialogue form, Platonism and Neoplatonism, and the distinctiveness of Greek philosophy.", "prerequisite": "PHIL 200", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 468: Jewish Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "This course explores the rich history of Jewish philosophy since the Medieval Ages through to the 20th-century. Attention will be paid to debates about the relation between Judaism and Christianity, ethics and religion, what is specific about Jewish identity and religious experience, the challenges of secularism, and the issue of Zionism. Authors studied in the course include Maimonides, Mendelssohn, Heine, Cohen, Rosenzweig, Benjamin, Buber, Levinas, and Derrida.", "prerequisite": "PHIL 135", "other": ["Cross-Listed", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "PHIL 472: Islamic Philosophy", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "A survey of major texts from the Islamic philosophical tradition, focusing primarily on the classical period (ninth to twelfth centuries) and its influence on modern thinkers.", "prerequisite": "9 credits in RLST and/or PHIL, or 6 credits of PHIL at the 200-level", "other": ["Cross-listed with: RLST 472", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "PHIL 473: German Idealism", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "Critically examines the philosophy of central German idealists, including Kant, Fichte, Schelling, and Hegel, and its impact on later philosophy.", "prerequisite": "PHIL 202", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 474: Kant", "department": "Philosophy (PHIL)", "credits": "3-6 Credits/Maximum of 6", "description": "Critical examination of the metaphysics, epistemology, aesthetics, legal and moral philosophy, and influence of Immanuel Kant.", "prerequisite": "PHIL 202", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 476: Hegel", "department": "Philosophy (PHIL)", "credits": "3-6 Credits/Maximum of 6", "description": "Critical examination of the metaphysics, moral theory, epistemology, and philosophy of history of this central figure of 19th-century philosophy.", "prerequisite": "PHIL 203", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 478: Ethics After the Holocaust", "department": "Philosophy (PHIL)", "credits": "3 Credits", "description": "The aim of this course is to explore various ways in which philosophers have responded to Auschwitz (a signifier, or name, which is in turn not without controversy and complexity). It will examine, in particular, the promise and failure of post-Holocaust ethical theory, with attention to evil, suffering, goodness, witnessing, testimony, trauma, and human rights. Authors include Levi, Agamben, Arendt, Adorno, Levinas, Jonas, and Jankelevitch. Through reading and discussion of primary sources, this course introduces students to these philosophers' leading questions, methods, and conclusions, with reference to their historical context and their impact on later philosophy. The course will make these writings accessible to students without unduly presupposing prior knowledge, while also encouraging students to rise to the challenge with their own critical analysis and creative interpretations.", "prerequisite": "One course in either JST or PHIL", "other": ["Cross-listed with: JST 478, RLST 478", "Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 479: Critical Theory", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "In this course, the term Critical Theory refers to a distinctive approach to social, cultural, and political theory associated with the Institute for Social Research in Frankfurt am Main, Germany, which was founded in 1923. Members of what came to be called the Frankfurt School were sharply critical of the political structures, social institutions, and culture of late capitalist societies such as Germany and the United States (where they lived and worked in exile during the Second World War). They were heavily influenced by the post-Kantian German philosophical tradition, especially the work of Hegel, Marx, Nietzsche, and Freud. This course will focus on the historical development of Critical Theory, with an emphasis on the major figures of the early Frankfurt School: Theodor Adorno, Max Horkheimer, Walter Benjamin, and Herbert Marcuse. However, since Critical Theory is also an ongoing theoretical project, we will also study some contemporary representatives of this tradition, as well as some of its trenchant critics. After some introductory material, including discussion of the Marxist background of early Critical Theory, the course will focus on the following themes: Modernity, History, and Progress; Psychoanalysis and Critique; Culture and Art; and Race, Antisemitism, and Imperialism. In addition to the authors mentioned above, we will discuss work by such thinkers as Jürgen Habermas, Axel Honneth, Nancy Fraser, Seyla Benhabib, Enrique Dussel, and Angela Davis.", "prerequisite": "PHIL 203", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 485: Heidegger", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "Martin Heidegger's masterpiece, Being and Time, is among the fundamental philosophical texts of the 20th century, taking up questions of metaphysics, religion, temporality, ontology, the history of philosophy, language, technology, and aesthetics. His thinking there influenced the development of hermeneutics, existentialism, and postmodernism, and continues to inform contemporary approaches to these topics. This course thus gives pride of place to Being and Time, potentially including also the related The Concept of Time (1924) and The Basic Problems of Phenomenology (1927). Major topics studied will be the primacy of the question of the meaning of being, the ontological difference, the phenomenological method, the critique against Cartesian subjectivity, and the existential characteristics of humans such as \"being-in-the-world,\" temporality, spatiality, historicity, sociality, thrownness, authenticity, inauthenticity, everydayness, and death. Further themes of the course may include the relationship between Heidegger's \"early\" and \"later\" works; the political question in Heidegger, especially after the publication of the Black Notebooks; Heidegger's refusal to apologize for his allegiance to National Socialism; the problematic of ethics within the Heideggerian existential phenomenological account; Heidegger's critique of the metaphysics of presence; Heidegger's critique of technology; the Heideggerian conception of art; Heidegger's understanding of the poetic; and historical and contemporary critiques of Heidegger's thought.", "prerequisite": "PHIL 102", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 486: Wittgenstein", "department": "Philosophy (PHIL)", "credits": "3-6 Credits/Maximum of 6", "description": "Examines Wittgenstein's early and late work, including logical atomism, meaning, language games, forms of life, and the private-language argument.", "prerequisite": "PHIL 204", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 490: Dewey", "department": "Philosophy (PHIL)", "credits": "3 Credits/Maximum of 6", "description": "Critically examines the metaphysics, epistemology, ethics, logic, aesthetics, education theory, and social and political philosophy of this major American pragmatist.", "prerequisite": "PHIL 401", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 494: Research Project", "department": "Philosophy (PHIL)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 494H: Research Project", "department": "Philosophy (PHIL)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"course_name": "PHIL 496: Independent Studies", "department": "Philosophy (PHIL)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 497: Special Topics", "department": "Philosophy (PHIL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "PHIL 499: Foreign Study--Philosophy", "department": "Philosophy (PHIL)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]