[{"course_name": "PLANT 129N: Chocolate Worlds", "department": "Plant (PLANT)", "credits": "3 Credits", "description": "This course will examine the \"world\" of chocolate throughout human history. First cultivated by the ancient peoples of the Americas and then manufactured by Europeans and Pennsylvanians alike, chocolate has played a privileged role as a luxury good. An interdomain course, \"Chocolate Worlds\" is interdisciplinary, taught by faculty in the departments of Plant Science, Anthropology, and History. As a team we investigate the how diverse societies have differentially interacted with this crop. Rather than be organized chronologically, this course will be divided into course Units, such as the history of cocoa uses and cultivation, cocoa plant science and farming issues, chocolate making and markets, and the state of the global chocolate industry. The course's lectures and assigned readings work in concert equally directed by scientific inquiry and the queries of the social sciences and humanities. Assignments will address real world questions relating to contemporary cocoa cultivation and production, and its role in international development and social justice. As a class we will take field trips to sites such as local chocolate manufacturing facilities and cocoa research sites and laboratories. The learning objectives of this course include students' broad knowledge of cacao production, its history, and ethnical issues surrounding its cultivation in today's global economy. Additionally, students will gain an historical appreciation for the role this crop his played in diverse human societies and a scientific understanding of its genetic structure.", "other": ["Cross-listed with: ANTH 129N, HIST 129N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Other Cultures", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PLANT 150S: Plant Science First Year Seminar", "department": "Plant (PLANT)", "credits": "2 Credits", "description": "Plant 150S is the First Year Engagement course for first-year students in the Department of Plant Science majors of Plant Sciences, Turfgrass Science, and Landscape Contracting at University Park campus. First Year DUS students may enroll. Students will explore the various academic fields of the plant sciences (horticulture and agronomy), turfgrass science and management, and landscape contracting through literature review, library searches, field studies, critical thinking, exercises, and exposure to appropriate Penn State faculty and staff. Students will also be introduced to the breadth of University resources at their disposal.", "other": ["First-Year Seminar"]}, {"course_name": "PLANT 200: Introduction to Agricultural Crop Growth, Form, and Function", "department": "Plant (PLANT)", "credits": "3 Credits", "description": "About 12,000 years ago, humans began harvesting their food from the natural biological diversity that surrounded them, resulting eventually to domesticated agricultural crops. Over thousands of years farmers selected for desirable traits in crops, and thus improved the plants for agricultural purposes. Agricultural Crop Growth, Form, and Function is a required introductory course for options in the Plant Science major. This course provides fundamental information on agricultural crop growth needed for understanding course content of upper level courses within the major. The major focus areas will include general crop growth and function, environmental and plant interactions in agriculture, Pests of agricultural crops, and breeding and genetics of agriculturally important crops. Upon successful completion of the course students should have a better understanding of the following topics: structural components of cells and plants; growth of tissue systems; plant interactions with their environment; physiological processes in plant growth; basic components of plant genetics; and the impact of human selection, genetic engineering, and climate modifications on plant development and food production.", "prerequisite": "BIOL 110", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PLANT 217: Landscape Soil and Water Management", "department": "Plant (PLANT)", "credits": "3 Credits", "description": "PLANT 217 Landscape Soil and Water Management (3) PLANT 217 is a course developed to meet the needs of the Landscape Contractors program. This course covers the following topics: Influence of weather on irrigation management; design, layout and management of residential and commercial landscape irrigation systems; sprinkler selection, scheduling and irrigation system management; irrigation uniformity and control systems; the importance of drip and subsurface irrigation; the effects of rainfall and irrigation on soil erosion and sedimentation on landscape sites especially under construction. The course also includes short field trips to various local industry-related facilities for educational evaluation."}, {"course_name": "PLANT 220: Gardening for Fun and Profit", "department": "Plant (PLANT)", "credits": "3 Credits", "description": "The objective of PLANT 220 (GN), Gardening for Fun and Profit is to provide students with science-based fundamentals of establishing and maintaining residential landscapes and gardens. The course provides information that is especially useful to those with minimal to intermediate knowledge of horticultural plants. A background in gardening or landscaping is not needed. Class topics are presented by guest speakers who are scientists and experts in the topic area. Major topics include proper plant selection, soil preparation for establishing plantings, the basics of seeding, growing transplants and planting, the basics of planting and maintaining trees and shrubs, avoiding common mistakes in the garden and landscape, gardening resources, storage and processing fruits and vegetables for home use and ideas for making profit from gardening activities. This course includes a weekly laboratory session where students gain practical skills needed for developing and maintaining residential landscapes and edible gardens through hands-on activities and field trips.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PLANT 240: Fundamentals of Cannabis: An Introduction to the Botany, Cultivation, and Harvesting of Hemp", "department": "Plant (PLANT)", "credits": "3 Credits", "description": "Fundamentals of Cannabis provides a broad overview of hemp's natural ecosystem, biology, domestication, phenotypic plasticity, industrial cultivation, and business models within the hemp industry that foster bioeconomic empowerment for growers. The course starts with the basic biology of Cannabis species the effects of light on the production of cannabinoids, the various uses in the economic fabric of industrialized nations, and concludes with what makes hemp (THC < 0.3%) a unique plant for industrial production. Despite the legalization of hemp, optimal conditions for indoor and outdoor cultivation of cannabis remain not well understood. The purpose of this course is to introduce students to basic principles, best horticultural practices, and specific concepts for getting started in industrial hemp production. Throughout this course, potential business opportunities are emphasized for various aspects of the hemp industry.", "prerequisite": "HORT 101", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PLANT 297: Special Topics", "department": "Plant (PLANT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PLANT 299: Foreign Studies", "department": "Plant (PLANT)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction."}, {"course_name": "PLANT 426: Nutrient Management Specialist Preparation", "department": "Plant (PLANT)", "credits": "1 Credits", "description": "Students in the College of Agricultural Sciences may wish to have professional certifications and licenses related to their anticipated area of employment. This course will assist students as they prepare for certification to write nutrient management plans for agricultural production and livestock operations. Professionals in the field will provide study materials and guide students as they study and prepare to complete the certification process. This course and successful completion of certification will make the student more employable than students that have not obtained this professional certificate. Upon completion of this course, students can take the licensing exam for Nutrient Management Specialist Certification offered by the Pennsylvania Department of Environmental Protection and Pennsylvania Department of Agriculture.", "prerequisite": "SOILS 101"}, {"course_name": "PLANT 427: Pennsylvania Pesticide Applicator Exam Preparation", "department": "Plant (PLANT)", "credits": "1 Credits", "description": "Graduates from the Crop Production option within the Plant Sciences Major may desire to have professional licenses related to their anticipated area of employment. This course will assist students as they prepare for the licensing exam which will allow them to legally apply pesticides. Professionals in the field will provide study materials and guide students as they study and prepare to take the licensing exam. Students will be guided through the technical material and requirements necessary to successfully complete the exam. This course and successful passing of the exam will make the graduate more employable than students that have not obtained this professional license. The course is intended for students in the Crop Production option, but students outside the option and with the necessary prerequisite may take the course. Upon completion of this course, students will be prepared to take the exam for the Pesticide Applicators License offered by the Pennsylvania Department of Agriculture.", "prerequisite": "AGRO 28"}, {"course_name": "PLANT 428: Certified Crop Advisor Exam Preparation", "department": "Plant (PLANT)", "credits": "1 Credits", "description": "Graduates from the Crop Production option within the Plant Sciences Major may desire to have professional certifications and licenses related to their anticipated area of employment. This course will assist students as they prepare for the exam to become Certified Crop Advisors. Professionals in the field will provide study materials and guide students as they study and prepare for the exam. Students will be guided through the technical material and requirements necessary to successfully complete the exam. This course and successful completion of the exam will make the graduate more employable than students that have not obtained this professional certificate. The course is intended for students in the Crop Production option, but students outside the option and with the necessary prerequisites may take the course. Upon completion of this course, students can take the licensing exam offered by the American Society of Agronomy to become a Certified Crop Advisor."}, {"course_name": "PLANT 461: Emerging Issues in Plant Sciences", "department": "Plant (PLANT)", "credits": "3 Credits", "description": "Emerging Issues in Plant Sciences is a capstone course designed for the Plant Sciences, and is also available to students from other majors. This highly participatory course emphasizes many of the interdisciplinary topics in the plant sciences today, with a focus on balancing plant production with environmental conservation. Topics include: conservation cropping systems and tillage, soil health; transgenic crops; managing landscapes for ecosystem services, climate change, pest and nutrient management alternatives; biofuels; urbanization and regional food systems. It is a team taught course with guest lectures by experts on specific topics and includes student analysis and discussion with the guidance of the instructors. Students will read and write about publications from the peer reviewed literature and research and present about an emerging issue.", "prerequisite": "AGRO 28"}, {"course_name": "PLANT 494: Undergraduate Research", "department": "Plant (PLANT)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by faculty supervisor a Plant Science faculty member.", "prerequisite": "junior or senior status, approval of a Plant Science faculty   supervisor, and approval of the Undergraduate Program Coordinator"}, {"course_name": "PLANT 494H: Honors Thesis Research", "department": "Plant (PLANT)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by faculty supervisor culminating in a Plant Science honors thesis.", "prerequisite": "junior or senior status in the Schreyer Honors College and   permission of a Plant Science honors advisor", "other": ["Honors"]}, {"course_name": "PLANT 499: Foreign Studies", "department": "Plant (PLANT)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction."}]