[{"course_name": "PNG 301: Introduction to Petroleum and Natural Gas Engineering", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits/Maximum of 3", "description": "The first part of the course will introduce the student to the design and implementation of the systems used in the extraction of oil and gas, including terminology and basic calculations in drilling engineering, geology, production, reservoir, and facilities engineering. The course will give an initial overview of the history of the oil industry and the origins of petroleum and natural gas reservoirs, followed by a description of the conventional and unconventional reservoir types. All aspects of petroleum engineering from upstream to downstream will be included in this discussion, including transportation, marketing, and environmental impacts. The remainder of the course will present the various key disciplines in petroleum and natural gas engineering in the chronological order of how the disciplines interact. Key problems in each of these disciplines will be reviewed and solved, using Excel and introductory statistics/computer programming (using Matlab). First, the discipline of drilling engineering will be presented. This will focus on the different types of wells, bits, casing designs, and completion techniques. Topics in the discipline of reservoir engineering will be presented next and will include basic petrophysics, reservoir types and fluids, as well as basic extraction methods. The life cycle of a reservoir and its efficient and environmental friendly management will be discussed, including enhanced oil recovery methods, such as carbon dioxide injection and surfactant flooding. Topics in production engineering will be presented next, and will center on tubing design, artificial lift, stimulation using acids and fracturing, and cased-hole logging. Topics in facility engineering, the last discipline to be discussed, will focus on surface facilities such as separators, gas and water gathering systems, pipelines, stock tanks, chokes, and recycle plants. Finally, differences between unconventional and conventional extractions and systems will be described as this is now critical to the energy security of the United States. Focus here will be on shale properties, fluid property changes owing to tiny pores, diffusion, absorption, and hydraulic fracturing. The course will explain how fracturing in shale reservoirs differs from conventional ones. Transport of oil or gas from these tight rock matrixes by diffusion through the fracture network will be presented. Environmental considerations will also be discussed.", "prerequisite": "PHYS 211"}, {"course_name": "PNG 397: Special Topics", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PNG 405: Rock and Fluid Properties", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "Reservoir rock properties, rock and fluid properties (interaction between rock and fluids), flow behavior in reservoir, and fluid properties. The objective of this course is to introduce students to basic reservoir rock and fluid properties. The course is divided into three sections: rock properties, rock and fluid properties (interaction between rock and fluids), and fluid properties. In the rock properties, Lithology of Reservoirs, Porosity and Permeability of Rocks, Darcy's Law, and Distribution of Rock Properties are discussed. In Rock and Fluid Properties Section, Existence of Multi-phases, Saturation, Wettability, Capillary Pressurem, Effective and Relative Permeability, concepts are covered. Fluid properties topics include Phase Behavior of Single and Multi Component Systems, Compositional and Black-Oil models, Solution Gas-Oil Ratios, Formation Volume Factor, Compressibility, Density, Viscosity, and Interfacial Tension. This is also the first course that Petroleum and Natural Gas Engineering students take in the major. Therefore, an introduction to petroleum and natural gas engineering is also made. This course is a pre-requisite for most of the Petroleum and Natural Gas Engineering major courses. It is an elective course for majors such as Environmental Systems Engineering. It is offered every Fall semester.", "prerequisite": "PHYS 211"}, {"course_name": "PNG 406: Rock and Fluid Laboratory", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "Systematic study of oil reservoir rocks and fluids; their interrelation applied to petroleum engineering.", "prerequisite": "PHYS 211"}, {"course_name": "PNG 410: Applied Reservoir Engineering", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "The broad course objectives are to introduce and implement techniques for analysis and prediction of reservoir performance by use of material balance and steady and non-steady state flow equations. Some specific objectives are: To introduce students to concept of material balance in oil and gas reservoirs. To learn to identify primary drive mechanisms in oil and gas reservoirs. To recognize important differences between production from conventional and unconventional shale reservoirs. To understand and apply concepts in single-phase transient flow in reservoirs. The course will commence with a discussion of rock and fluid properties including the properties of unconventional shale reservoirs and then move on to the analysis of the performance of dry gas reservoirs. After talking about the behavior of dry gas reservoirs with water influx, the topic of performance of gas condensate reservoirs will be discussed. Various schemes for analyzing the performance of gas condensate reservoirs using data from the field as well as based on laboratory experiments will be presented. This will be followed by a detailed exposition of material balance analysis of undersaturated oil reservoirs. Combination drives including water influx and gas cap expansion will be discussed. Laboratory analysis of pressure-volume-temperature relationships of saturated oils will be discussed. Prior to introducing models for water influx into reservoirs, essential concepts from the dynamics of fluid flow in reservoirs will be presented. This will enable students to better understand the concept of linear superposition that is essential to apply the water influx models.", "prerequisite": "PNG 406"}, {"course_name": "PNG 411: Introduction to Petroleum and Natural Gas Extraction", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "Introduction to the design and implementation of the systems used in the extraction of oil and gas.  Not intended for petroleum and natural gas engineering majors.", "prerequisite": "PHYS 211"}, {"course_name": "PNG 420: Applied Reservoir Analysis and Secondary Recovery", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits/Maximum of 999", "description": "P N G 420 Applied Reservoir Analysis and Secondary Recovery (3) This course addresses two major issues in petroleum engineering: water influx and water flooding. The displacement of oil or gas by water is a complicated physical process that has a great impact on recovery efficiencies. The first objective of the course is to merge the material balance method and transient flow solutions for the aquifer into one analysis tool for understanding and predicting water influx cases. Several analytical and numerical methods are presented including: linear and radial diffusion equation solutions, super position, Hurst simplified, Schilthuis and Hurst modified. The second objective of the course is to understand the fundamentals of displacement theory and practice. The extension of the Buckley and Leverett water flooding theory is presented for three-phase flow. Three-phase relative permeabilities are determined from experimental data. Several geometrical patterns are discussed in the course including: five spots, staggered line drive, direct line drive, four spots, seven spots, and nine spots. The efficiency of each pattern is determined. Strategies for selecting a pattern for special cases are presented. The behavior of each pattern with time, including oil recover, is an integral part of the course.The students use our computational facility throughout the course. They write material balance models and use large reservoir simulators for studying water influx cases.", "prerequisite": "MATH 251"}, {"course_name": "PNG 420H: Applied Reservoir Analysis", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "2 Credits", "description": "Water influx theory.  Application of principles of reservoir analysis to the determination of reservoir behavior and education.", "other": ["Honors"]}, {"course_name": "PNG 425: Principles of Well Testing and Evaluation", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "This course examines the mathematical basis for pressure analysis. Both theory and the practice of pressure testing techniques are considered. The objectives are to: 1) Understand fundamentals of pressure transient analysis (well testing) for estimation of key formation parameters for a variety of flow models, including the line source solution, finite wellbore radius with wellbore storage and skin, naturally fractured reservoirs, and infinite and finite conductivity fractures; 2) Solve pressure transient problems using analytical solutions, computer programs, classical graphical methods, and modern well test software; 3) Understand sources of error and assumptions made; and 4) Learn about practical well test evaluation and well configurations for both tight and conventional reservoirs.", "prerequisite": "MATH 251"}, {"course_name": "PNG 430: Reservoir Modeling", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "PNG 430 is a senior-level undergraduate class where the student explores the fundamentals of hydrocarbon reservoir simulation as the area of reservoir engineering in which computer power becomes essential for predicting complex processes and fluid behavior involved in fluid transport in porous media. In this class, numerical models are built on the basis of finite-difference and finite-volume approximations of governing equations of fluid flow in porous media, which integrate conservation of mass, isothermal fluid PVT behavior, and Darcy's flow approximations. Topics include the use of Taylor Series, volume integrals, grid types, treatment of external (reservoir limit) and internal (wellbore) boundary conditions, generalized transmissibility calculations, matrix solution methods and solution of systems of simultaneous algebraic equations, treatment of space and time-derivatives, explicit and implicit schemes, stability analysis, and applications to single-phase (incompressible, slightly-compressible and compressible fluid) numerical simulation. More advanced topics such as black-oil multiphase modeling and compositional modeling are introduced, including multiphase transmissibility calculations and multiphase solution techniques such as IMPES (Implicit-Pressure, Explicit Saturation) and multivariate Newton-Raphson.", "prerequisite": "MATH 251"}, {"course_name": "PNG 440W: Formation Evaluation", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "Formation Evaluation covers the characterization of oil and gas reservoir formations and methods for quantifying the volume of hydrocarbon resources therein. The course focuses on the petrophysical interpretation of wireline logs to meet these objectives, and also covers the operation and underlying physical principles of those tools. Topics covered include: the basic procedure of open hole logging, calculation of a geothermal gradient, understanding raster and digital well log files, quick look interpretation, reservoir volumetrics, understanding the physics of and cultivating the ability to interpret data from the traditional logging suite (gamma ray, spontaneous potential, resistivity devices, density, neutron, and sonic logs), coring, wireline formation testing, nuclear magnetic resonance logging, and interpretation in unconventional reservoirs. Best practices and limitations of the various well log tools are also discussed. Students are expected to perform complex engineering calculations using raw field data gathered from these tools, both from raster and digital well log files. As a \"writing across the curriculum\" course, students develop their technical writing skills through homework assignments that present their analyses in written reports.", "prerequisite": "P N G405 , P N G406", "other": ["Writing Across the Curriculum"]}, {"course_name": "PNG 450: Drilling Engineering", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "PNG 450: Drilling Engineering covers the design and analysis of oil-field drilling operations and equipment. This course addresses a critical issue in petroleum and natural gas engineering: how to drill and complete oil and gas wells in a sound, economical, and environmentally safe manner. Drilling technology has advanced greatly since the first commercial oil well in the U.S. was drilled in northwest Pennsylvania in 1859. The true vertical depth of the well has grown from 69.5 feet from then to more than 15,000 ft, with the deepest at more than 40,000 feet, today. The horizontal length of a well has grown from theoretically zero to more than 10,000 feet, with the longest at 40,000 feet. The temperature and pressure of the formation that petroleum engineers need to drill through could easily reach 350 F and 20,000 psi or higher, and the formation and fracture gradient window becomes narrower, all making drilling and completion more challenging. In summary, it is becoming increasingly more challenging to drill wells. Thus, engineering design becomes more critical. The objectives of this course are to introduce the students to the science of drilling and completion. This includes learning the fundamentals of drilling fluids and drilling fluid design, and applying fluid mechanics and quantifying drilling hydraulics for complex fluid flow through drilling string and annular spaces. The course will also discuss the concepts and quantify the formation pressure and fracture pressure gradients for different methods of drilling. A key task for students will be to learn the methods for characterization, selection and optimization of casing design, and optimized bit design, and finally the course will discuss how to design directional and horizontal wells to optimize production and recovery from mature fields and unconventional resources, such as coalbed methane, shale gas, and tight oil in Pennsylvania. This course is a prerequisite for petroleum and natural gas engineering major courses. It is an elective course for majors such as chemical engineering, mechanical engineering, civil engineering, etc. The knowledge, methods, and practical skills in this course could also be used in various other industries including geothermal HVAC, ground water drilling, mineral exploration, and scientific research.", "prerequisite": "EME 303"}, {"course_name": "PNG 451: Drilling Laboratory", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "PNG 451: Drilling Laboratory covers common practices in well-control procedures and measurement of drilling fluid properties. This course serves as the laboratory component for PNG 450. Students will apply the concepts and skills gained from lectures and discussions in PNG 450. The aim is for students to become familiar with drilling fluids and how to quantify the fluid properties analytically. Students will also receive practical experience with drilling equipment, and will practice solving practical well-control problems in the laboratory. Students in this course will gain experience using our state-of-the-art rig floor simulator and drilling fluid and cement laboratory, which are equipped with the advanced facilities currently used in the oil and gas industry.", "prerequisite": "EME 303"}, {"course_name": "PNG 456: Hydraulic Fracturing Analysis", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits/Maximum of 1", "description": "Industry professionals teach hydraulic fracture design and analysis."}, {"course_name": "PNG 457: Pump Systems for Oil and Gas Production", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits/Maximum of 1", "description": "Industry professionals teach about sucker-rod pump technology."}, {"course_name": "PNG 458: Assessment, Classification, and Reporting of Reserves and Resources", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits/Maximum of 1", "description": "Industry professionals teach how to define and estimate reserves."}, {"course_name": "PNG 459: Well Control Certification", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits/Maximum of 1", "description": "Using the most advanced simulator system, industry professionals teach students how to avoid and resolve operational difficulties. Students who successfully complete the course receive a certificate."}, {"course_name": "PNG 475: Production and Completions Engineering", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "Design and selection of mechanical components used in the production of fluids from subsurface reservoirs.", "prerequisite": "E MCH210"}, {"course_name": "PNG 480: Surface Production Engineering", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "3 Credits", "description": "Analysis and evaluation of surface production processes, fluid separation, storage, measurement, treating, custody transfer, transmission, disposal, corrosion, and other operations.  P N G 480 Production Process Engineering (3) Surface production engineering involves the extraction of reservoir fluids, their treatment at the surface and movement to a commercial market via a common carrier. It is the primary objective of this course to provide the fundamentals of surface production operations and underlying operational principles and design criteria for equipment utilized in the surface handling of petroleum production fluids. Surface production facilities are described in detailed as systems in charge of the separation of the wellstream fluids into three single-phase components (oil, gas, water) and of their transport and processing into marketable products or their disposal in an environmentally acceptable manner. A detailed overview of hydrocarbon fluid behavior, analysis of hydrocarbon and water separation processes, analysis and design of surface transportation systems and flow assurance problems is provided along with a comprehensive look at the engineering aspects involved in surface production operations. Topics include purpose and description of onshore and offshore surface production facilities and the function of the equipment used in these processes, including wellheads and Christmas trees, gathering systems, production manifolds, field processing of crude oil, field processing of natural gas, phase separation of gas, oil and water, water-in-crude oil emulsification, heater-treaters and dehydration of crude oil, natural gas dehydration, stock tank batteries and transportation. Discussion includes oil and gas quality checks, oil and gas metering, typical contractual hydrocarbon sales specifications, and typical specifications for produced waters and other by-products. Hydrocarbon fluid behavior topics includes an overview of hydrocarbon thermodynamics, hydrocarbon PVT behavior, thermodynamics of liquid and vapor separation, and fluid behavior prediction models including modern cubic equations of state. In the context of surface facility design, a process simulation or compositional simulation is implemented to predict how the components the make up the well fluids react to changes in pressure and temperature as they are processed through the facility through a succession of phase changes where liquids flash to vapor or vapors condense into liquid. Equipment design topics comprise design of 2-phase and 3-phase vertical and horizontal separators, derivation of design equations, design of crude and condensate stabilization trains, design and operation of glycol dehydrator towers, and flow assurance topics such as hydrate, corrosion, and wax prevention. The ultimate purpose of surface equipment design is to recommend the most suitable and cost-effective equipment type and size that meets the specified service and system condition, contractual obligations, and industrial health and safety and environmental regulations.", "prerequisite": "EME  301 , EME  303"}, {"course_name": "PNG 482: Production Engineering Laboratory", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "Measurement and analyses of the physical and chemical properties of hydrocarbon fluid systems in a production environment.  P N G 482 Production Engineering Laboratory (1) The task of production engineers is to optimize the extraction, treatment and delivery rate of hydrocarbons. For this optimization to be realistic, quantitative values of some relevant parameters and properties that characterize the system should be known preferably by way of measurements. It is the primary objective of this laboratory course to give the student an understanding of the available measurement techniques; an opportunity to gain hands-on experience in carrying out the experiments as well as operating the apparatus and some practice in the art of technical report writing. The Production Engineering Laboratory has been designed to expose the student to the principles and procedures of production engineering for oil and gas analysis (physicochemical characterization and quality control) and the transport of fluids in pipes and conduits. The main objective is to familiarize students with the basic measurements that must be taken in production monitoring and control, as well as basic production engineering principles. It is also aimed to enhance the error analysis, critical evaluation and technical report writing skills of the student. Major pieces of equipment in this laboratory include: viscosimeters, oxygen bomb calorimeters, gas chromatograph, densitometers, centrifuges, dead weight testers, dew point testers, and a meter run setup. Laboratory experiences include, but are not limited to, the determination of density of clear organic substances and petroleum distillates that can be handled as liquids at test temperatures between 10 and 40 &deg;C using digital density meters, the determination of the API gravity (or specific gravity) of crude oil, petroleum products normally handled as liquids (e.g. stabilized crude oil, stabilized gasoline, napthane, kerosene, gas oils, lubricating oils, and non-waxy fuel oils) and alcohols using hydrometer and pycnometer methods, the calibration of Bourdon type pressure gauges by means of a dead weight testers and constructing of calibration charts for gauges that are not adjustable, the determination of water and sediment in crude oils by means of the centrifuge procedure, the determination of the heat of combustion of organic substances ranging in volatility including oil samples with volatiles ranging from that of distillates to that of residuals, the measurement of viscosity of crude oil and liquid petroleum products by means of measuring the time for a volume of liquid to flow under gravity through a calibrated glass capillary viscosimeter, the determination of water vapor content of gases by measurement of the dew point temperature and the calculation there from of the water vapor content, and the determination of a gas flow rates in pipelines by means of orifice plates and axial full-flow turbine meters.", "prerequisite": "EME  301 , EME  303; Concurrent: P N G480"}, {"course_name": "PNG 490: Introduction to Petroleum Engineering Design", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "P N G 490 Introduction to Petroleum Engineering Design (1) The objective of this course is to introduce to the students the principles of engineering design as applied to petroleum and natural gas projects. The course focuses on the analysis of physical data with respect to error and use of this data in design. Other topics to be visited include a definition of what is a project deliverable and establishment of timelines for their implementation. The salient points of the course are as follows: (1)This course is the first capstone engineering design course in the sequence of three courses. In this portion of the course students' principal goal is to characterize the reservoir. In this process necessary basic sciences and engineering skills are utilized. (2)In reservoir characterization, students typically collect and analyze the data available in the literature and other related data provided by the operators. (3)In making a preliminary assessment towards field development students consider factors involving economic, environmental, social, ethical, health and safety considerations. (4)In this course, students work in teams. In each team, team members assume responsibilities as petrophysicist, drilling engineer, geologist, geophysicist production engineer, reservoir engineer and implement the necessary technical skill to fulfill their obligations. (5)This project starts from the ground level and ends with a complete field development plan. Within the context of the project (reservoir characterization) students have the opportunity to use the necessary skills to identify and formulate and solve the engineering problems and challenges that are faced. (6)In selecting the lease area the potential impact of project on the social and physical environments is considered and all the ethical responsibilities are studied in depth. (7)During every phase of the project the impact of decisions are considered within the framework of global, economic, environmental and societal context. (8)In this course the main contemporary issue the need for unconventional energy resources is the driving force behind the project. (9) In every phase of the project students are exposed to contemporary methodologies and engineering tools including forecasting, scenario planning and reservoir simulation. Also, whenever applicable the necessary engineering software is also incorporated in the development of the project.", "prerequisite": "PNG 405"}, {"course_name": "PNG 491: Capstone Design in Drilling and Completions", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "Application of the concepts of reservoir, production, drilling and completions, and economics to petroleum engineering design projects. Engineering design by definition is the integration of knowledge and skills acquired through experience, reading and formal instruction into a final product, the design. To that end, this course is the second course of a 3-course, 3-semester, sequence that will result in a comprehensive capstone-engineering project. As such, PNG 491 will utilize the knowledge gained from PNG 450, 451, and 475 to the project design initiated in PNG 490. The class will be divided into teams and students will be evaluated on the basis of their contribution to the team effort. All reports and presentations will be presented as a product of the team.", "prerequisite": "PNG 450"}, {"course_name": "PNG 492: Petroleum Engineering Capstone Design", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "Integration of petroleum and natural gas engineering concepts to project design. Engineering design by definition is the integration of knowledge and skills acquired through experience, reading and formal instruction into a final product, the design. To that end, this course is the third course of a 3-course, 3-semester, sequence that will result in a comprehensive capstone-engineering project. As such, P N G 492 will utilize the knowledge gained from three semesters of formal instruction to the project design initiated in P N G 490 and continued on in P N G 491. Course material will include the application of spreadsheet programming to petroleum and natural gas project design and its use in project economic analysis and risk analysis. The class will be divided into teams and students will be evaluated on the basis of their contribution to the team effort. All reports and presentations will be presented to the class as a product of the team.", "prerequisite": "PNG 491"}, {"course_name": "PNG 492H: Petroleum Engineering Capstone Design", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1 Credits", "description": "Integration of petroleum and natural gas engineering concepts to project design.  P N G 492 Petroleum Engineering Capstone Design (1) Engineering design by definition is the integration of knowledge and skills acquired through experience, reading and formal instruction into a final product, the design. To that end, this course is the third course of a 3-course, 3-semester, sequence that will result in a comprehensive capstone-engineering project. As such, P N G 492 will utilize the knowledge gained from three semesters of formal instruction to the project design initiated in P N G 490 and continued on in P N G 491. Course material will include the application of spreadsheet programming to petroleum and natural gas project design and its use in project economic analysis and risk analysis.The class will be divided into teams and students will be evaluated on the basis of their contribution to the team effort. All reports and presentations will be presented to the class as a product of the team.", "other": ["Honors"]}, {"course_name": "PNG 494: Thesis", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1-6 Credits/Maximum of 6", "description": "A problem in petroleum engineering involving review of the literature and experimental data obtained in the field or laboratory."}, {"course_name": "PNG 494H: Thesis", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1-6 Credits/Maximum of 6", "description": "A problem in petroleum engineering involving review of the literature and experimental data obtained in the field or laboratory.", "other": ["Honors"]}, {"course_name": "PNG 496: Independent Studies", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "PNG 497: Special Topics", "department": "Petroleum and Natural Gas Engineering (PNG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]