[{"course_name": "POL 1: Level One Polish A", "department": "Polish (POL)", "credits": "4 Credits", "description": "This course will provide an introduction to and basic understanding of Polish language. The objective of the course is to provide a comprehensive introduction to Polish language. Students are able to command a functional vocabulary of at least 500 words by end of semester; read basic Polish texts with understanding; engage in simple everyday dialogues; and write in elementary Polish by the end of semester. Adopting the communicative approach, instruction begins with simple in-classroom phrases to enable interaction exclusively in Polish from day one; and proceeds through building situational vocabulary and grammar, as well as activities and authentic materials that put it to immediate use. Students will be introduced to listening, speaking, reading, and writing in the Polish language, with equal emphasis on all the skills. Along with special Polish characters in the alphabet and Polish grammar, basic conversation involving real-life situational dialogues will be presented. Students will be exposed to some aspects of Polish culture via e.g. level-appropriate films and canonical children's poems. Because learning a new language requires not just regular attendance in class, but also considerable effort and preparation outside the classroom, students will be encouraged to practice vocabulary skills, pronunciation, and grammar on a regular basis as an aid to language acquisition.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "POL 2: Level One Polish B", "department": "Polish (POL)", "credits": "4 Credits", "description": "The course will build on the basic knowledge of reading, grammar and vocabulary acquired in the introductory course to impart fluency and command over written and oral expression; and to introduce further points of basic grammar and idiomatic usage. Students will practice reading, writing, listening and speaking in Polish through a series of structured exercises involving stories, news, grammar books, songs, games, situational dialogues and role-playing in an interactive classroom environment in which everyone feels comfortable to practice their language skills without hesitation. The objective of the course is to impart functional literacy to students: at the end of the semester, students should be able to read and understand instructions in Polish, carry on everyday conversations such as those involving ordering food, seeking directions, handling a medical emergency and common social situations. Students should be able to participate with understanding in conversations involving idiomatic expressions. Accordingly, an important element of classroom practice is skill with listening comprehension. The course will emphasize the progress on students' oral and written language competencies through constant practice.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "POL 3: Level Two Polish A", "department": "Polish (POL)", "credits": "4 Credits", "description": "The course lays equal emphasis on reading, writing, listening and speaking. Nuanced points of grammar and syntax are introduced. More complex reading and cultural exposure includes folk tales, poems, and essays selected from Polish literature and media. Writing and oral assignments focus on the use of culturally appropriate language, in a wide range of expressive settings, ranging from everyday conversation to more formal persuasive or descriptive essays. To encourage oral expression of ideas, class activities and debates are organized. Listening comprehension exercises introduce different styles of speaking popular in media and news.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "POL 197: Special topics", "department": "Polish (POL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "POL 199: Foreign Studies", "department": "Polish (POL)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "POL 299: Foreign Studies", "department": "Polish (POL)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]