[{"course_name": "PUBPL 120N: State, Society, and Public Policy", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "Alexis de Tocqueville called association the ¿mother science¿ of politics and saw voluntary associations as a pillar of American democracy. These associations must compete in what might be called a moral economy of public policy that preserves the value of equality. This course brings together ideas from political philosophy, history, political science, communication, sociology and economics to address an important question: How have voluntary, nongovernmental associations come to shape and implement public policy? The class begins with the core concepts in political thought and traces them through to contemporary ideas about civil society that span the political spectrum. After critically assessing these ideas, we integrate them into a framework for understanding the process of making public policy.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PUBPL 201: Introduction to Homeland Security", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "An introduction to homeland security, and defense, with a focus on policy, legal issues, organization, and administration.  PUBPL 201 Introduction to Homeland Security (3) Introduction to Homeland Security provides a baseline of common knowledge for understanding the nature of homeland security. The course achieves this goal by focusing on homeland security, the motivation and nature of terrorists, the policies established by governments, pertinent governmental plans to meet homeland security goals, who the key players are in homeland security, and the relevant legal issues framing efforts to defend the nation's security. As an introduction to the broad area of study, this course serves as a basis for specialized study such as critical infrastructure protection, emergency response management (including natural disasters), border security, security administration, national security, and terrorism. Understanding key principles of homeland security will be expected from students who complete this course.", "other": ["Cross-listed with: HLS 201"]}, {"course_name": "PUBPL 222N: Science and Politics of the Female Athlete", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "The purpose of this course is to explore gender differences in sport and politics that emerge from physiology, culture, history, politics, and policy. The engagement of women in sport has unique physiological considerations and ethical dilemmas as well as a rich history of defining moments and important ties to feminism and politics. In this course, students will learn how physiology differences affect female athletic performance and the effects of exercise on the female body, as well as how cultural, historical, and political forces shaped women's participation in sport. Students will also see how similar historical, cultural, and political forces affect women's involvement in politics. Combined, students will understand how similar forces shape gender norms and participation two different, yet related, aspects of society. Additionally, students will learn about the push for evidence-based policymaking and apply that knowledge to topics including doping, pregnancy, and gender verification. Students will integrate physiology and policy in a final assignment advocating for evidence-based sport policy. They will also educate their peers through a public education project.", "other": ["Cross-listed with: KINES 222N, PLSC 222N", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PUBPL 241: Computer Applications in Public Affairs/Criminal Justice", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "Introduction to computer applications for criminal justice and public affairs agencies.  CRIMJ 241 CRIMJ (PUBPL) 241 Computer Applications in Public Affairs (3)The student will gain a working knowledge of microcomputer and Internet applications to utilize them in course and/or job functions. The class will be treated primarily as a lab. The purpose is to make the student familiar with popular computer applications in current use. Applications covered include: Word Processing (Microsoft Word); Spreadsheet (Microsoft Excel); Presentation Package (Microsoft PowerPoint); Database (Microsoft Access). Internet Applications include: email - Webmail; World Wide Web Browser - Netscape Communicator and Internet Explorer; and creating a Homepage.", "other": ["Cross-listed with: CRIMJ 241"]}, {"course_name": "PUBPL 304: Public Policy Analysis", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "The use of analytic models for describing and explaining the forces shaping policy and the consequence of policy decisions.  PUBPL 304W Public Policy Analysis (3) This course provides an overview of the policy process and an examination of specific policy areas in the American political system. We will focus on what constitutes public policy and basic aspects of the policy process, including agenda setting, implementation, and policy evaluation. The course covers important contemporary policies such as health care, education, energy, welfare reform, and defense. It also will provide us with an opportunity to consider the utility of policy studies, and the various ways knowledge about particular issues is put to use by academics, partisan political figures, journalists, policy advocates, and policy makers.", "other": ["Writing Across the Curriculum"]}, {"course_name": "PUBPL 304W: Public Policy Analysis", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "The use of analytic models for describing and explaining the forces shaping policy and the consequence of policy decisions.  PUBPL 304W Public Policy Analysis (3) This course provides an overview of the policy process and an examination of specific policy areas in the American political system. We will focus on what constitutes public policy and basic aspects of the policy process, including agenda setting, implementation, and policy evaluation. The course covers important contemporary policies such as health care, education, energy, welfare reform, and defense. It also will provide us with an opportunity to consider the utility of policy studies, and the various ways knowledge about particular issues is put to use by academics, partisan political figures, journalists, policy advocates, and policy makers.", "other": ["Writing Across the Curriculum"]}, {"course_name": "PUBPL 305: Leadership Studies", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "Exposure to a wide range of leadership issues that will bring students to a new understanding of leadership as responsibility.", "prerequisite": "fourth-semester standing"}, {"course_name": "PUBPL 306: Introduction to Crisis and Emergency Management", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "An introduction to emergency management in mitigating, preparing for, responding to and recovering from hazards.  PUBPL 306 Introduction to Crisis and Emergency Management (3) The course offers an overview of the field of emergency management in dealing with routine emergencies, crises or disasters, and mega disasters. Specific topics emphasized include: the roles and interactions of the public, nonprofit, and private sectors in emergency management; the legal and organizational structure of the national emergency management system; and the problems and policy issues associated with emergency management. This is done by examining the four phases of emergency management: mitigation, preparedness, response and recovery as they relate to resilience, the attempt to; and an overview, including case studies, of various human-made and, technological disasters as well as disasters related to natural hazards. Emergency management as conducted within the U.S. integrated emergency management system (IEMS) by local state and national emergency management agencies, not terrorist incidents, is the course focus rather than the emerging field of homeland security and terrorist events.", "other": ["Cross-listed with: HLS 306"]}, {"course_name": "PUBPL 419: Race and Public Policy", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "Seminar format course in which sociological theory and research are applied to current race policy issues. The course examines a number of different aspects of race relations and public policy, including the social and biological constructs of race, historical race policy, modern race policy, affirmative action, criminal justice and other issues regarding race.", "prerequisite": "3 credits in Sociology", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"course_name": "PUBPL 475: Critical Infrastructure Protection", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "This course provides knowledge about protection of critical infrastructure as an aspect of homeland security.  PUBPL 475 Critical Infrastructure Protection (3) Critical Infrastructure Protection provides a definition of critical infrastructure and examines the importance of protecting it in the post-9/11 era. The course focuses on policies and programs designed to prevent catastrophic events and to protect and maintain the nation's critical infrastructure. It examines such activity through an understanding of the network of organizations at all levels of government and in the private sector responsible for protecting infrastructure. Case examples are provided of catastrophic events to provide an understanding of risks involved in infrastructure protection. Understanding key principles will be measured through preparation of a written analysis of a key homeland security/defense issue with alternative strategies consistent with current policy and legal constraints.", "prerequisite": "HLS 404"}, {"course_name": "PUBPL 476: Homeland Security Intelligence", "department": "Public Policy (PUBPL)", "credits": "3 Credits/Maximum of 3", "description": "The Homeland Security Intelligence course provides a depth of knowledge of key intelligence issues for homeland security professionals.", "prerequisite": "HLS 404"}, {"course_name": "PUBPL 481: Seminar in Environmental Policy", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "Fundamentals of evolution; impacts on natural resources; interaction of environmental issues, current decision-making process policy, enforcement mechanisms; future actions.", "prerequisite": "seventh-semester standing"}, {"course_name": "PUBPL 482: Seminar in Health Policy", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "Introduction to policy analysis of issues of current interest and importance to public administrators in the health industry.", "prerequisite": "seventh-semester standing"}, {"course_name": "PUBPL 483: Seminar in National Security Policy", "department": "Public Policy (PUBPL)", "credits": "3 Credits", "description": "This course provides a comprehensive overview of the process of U.S. national security policy - the principles, practices, and participants in the development and implementation of security strategy and policy. It applies theories and models to the bureaucratic policy making structure of the Executive Branch, looks at the roles of other governmental participants, and evaluates the many factors that constrain decision making. It assesses the impact of non-governmental entities such as the media, interest groups, and public opinion, and considers the effect of changing domestic factors on the process. Finally, it prepares students to be knowledgeable and effective participants in the process and presents them with a practitioner's framework for policymaking. The main themes of this course are that the U.S. Constitution established a federal government of separate institutions sharing powers within an intentionally inefficient system of checks and balances that has evolved by virtue of a dynamic process of Constitutional Amendments, legislative statutes, judicial decisions, and executive actions; and, that national security decisions are best understood by considering the bureaucratic context in which they are made within the Executive Branch, and as a result of the interaction of other governmental and non-governmental participants.", "prerequisite": "seventh-semester standing", "other": ["Cross-listed with: HLS 483, PLSC 483"]}, {"course_name": "PUBPL 490: Seminar in Public Policy", "department": "Public Policy (PUBPL)", "credits": "3 Credits/Maximum of 99", "description": "A survey of the major policy issues, actors and institutions involved in the policy-making system of contemporary society.  (May be repeated for credit.)", "prerequisite": "seventh-semester standing"}, {"course_name": "PUBPL 495: Internship", "department": "Public Policy (PUBPL)", "credits": "1-12 Credits/Maximum of 12", "description": "Experience in a public service agency related to knowledge gained through academic course work, reading, and discussion.", "prerequisite": "fifth-semester standing"}, {"course_name": "PUBPL 496: Independent Studies", "department": "Public Policy (PUBPL)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "PUBPL 497: Special Topics", "department": "Public Policy (PUBPL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]