[{"course_name": "RLST 1: Introduction to World Religions", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The course introduces students to the academic study of religion as well as to some of the major religious traditions of the world. Beginning with an introduction to polytheism, the course primarily focuses on the five major religions of the modern world--that is Buddhism, Christianity, Hinduism, Islam, and Judaism.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 3: Introduction to the Religions of the East", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Religious experience, thought, patterns of worship, morals, and institutions in relation to culture in Eastern religions. RLST 3 / ASIA 3 Introduction to the Religions of the East (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will explore the foundations, development, and diversity of religious traditions in Asia, focusing mostly on Hinduism, Buddhism, Confucianism, Daoism, and Shinto. It is organized according to two sections: Foundations and Developments. The Foundations section provides an introduction to the worldviews and practices of Eastern teachings. We will also discuss the structure of society, the social expectations on individuals based on gender and class, and rituals, which expose us to rich mythologies or intricate ceremonies. The second section, Developments, traces the evolution of religious doctrine and practice through history. Here, we learn to distinguish among large and small-scale movements and schools, and to familiarize ourselves with the geographical scope of each religion in South, Southeast, and East Asia. An abiding emphasis in this course will be on how to read and interpret the varied scriptures and primary texts of these religions.", "other": ["Cross-listed with: ASIA 3", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "RLST 4: Jewish and Christian Foundations", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course seeks to help students better understand the Bible and appreciate its role as an authoritative collection of sacred texts for Jews and Christians. The Bible is a difficult book, one that is demanding on many levels. In order to read the Bible intelligently, it is important to understand the historical and cultural backgrounds of the biblical writings. This course explores the history and geography of ancient Near Eastern civilizations that shaped the experience of ancient Israel and, later, the Greek and Roman imperial contexts that shaped Second Temple Judaism and early Christianity. The focus of the course, however, is on the biblical narrative itself and the particular ways that the story of Israel and its covenant with God was represented in scripture: in tales, poems, hymns, dialogues, and genealogies. A basic goal of the course, then, is to promote intelligent, well-informed reading of the Bible. Also important is the willingness to read the Bible closely and critically, with a view toward larger questions raised by biblical texts: how is God to be known and understood? What is the purpose of human life in the world? What moral obligations ought to structure our common life? Does human history have direction and purpose? What is the good and how do we follow it? The Bible takes up these questions and many more. Though an ancient anthology shaped by the succession of Assyrian, Babylonian, Persian, Hellenistic, and Roman empires, the Bible is not merely a product of its original contexts. Millennia of transmission and interpretation have made it a product of history in a much more extended and dynamic sense. In this course, we will examine larger questions raised by the biblical writers and consider the ways that the Bible has shaped, informed, and guided Jewish and Christian ways of life.", "other": ["Cross-listed with: CAMS 4, JST 4", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 12N: Lands of the Bible", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Utilizing the textual and archaeological evidence, this course introduces students to the lands, cultures, and peoples associated with the Hebrew Bible, New Testament, and Qur'an. Geographically, the lands of the Bible encompass what is often referred to as the Cradle of Civilization or Fertile Crescent - an arc-shaped region defined by the Nile, Jordan, Tigris and Euphrates river valleys. Today this crescent includes the modern countries and regions of Egypt, Israel, the Palestinian territories, Jordan, Syria, southeastern Turkey, and Iraq. Spanning ten millennia of history (ca. 9000 BCE-750 CE), this course explores a series of landmarks in the history of human development, which are considered together with Jewish, Christian, and Islamic traditions. These include the birth of religion and the agricultural revolution (Garden of Eden), the first cities and the invention of writing (Tower of Babel; Patriarchal/Matriarch traditions), Egyptian imperial rule in Canaan (Exodus), the collapse of the Bronze Age (Emergence of Israel), impact of empire (united and divided kingdoms of Israel and Judah), Alexander the Great and the Roman imperial expansion to the east (world of Jesus and development of rabbinic Judaism), Byzantine Palestine (expansion of Christianity), and the Islamic conquest of the Holy Land. Through an integration of numerous disciplines, including historical geography, archaeology, ancient history, biblical studies, epigraphy, and anthropology, students will investigate the interaction between the cultures of the ancient Near East and the religious traditions that developed in the lands associated with the Bible, a relationship that continues to shape the region and the world until today.", "other": ["Cross-listed with: CAMS 12N, JST 12N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 44: Ancient Near Eastern and Egyptian Mythology", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course provides a survey of all major Ancient Near Eastern mythological traditions in their cultural and historical context. The course also addresses the relation between myth and religion, as well as the relation between these mythological corpora and those of Ancient Greece and Rome and the tapestry of cultic traditions reflected in the Hebrew Bible.", "other": ["Cross-listed with: CAMS 44", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 70: Prophecy in the Bible and the Ancient Near East", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course will introduce students to the prophetic traditions of the Bible and the Ancient Near East. The course will explore the development of prophetic circles in the ancient Near East (including Egypt, Syria-Palestine, and Mesopotamia), and then focus on the major prophetic traditions of the Hebrew Bible (e.g., the books of Isaiah, Jeremiah, Ezekiel, Amos, Hosea, Micah, Haggai, Zechariah, and Daniel). It will also look at how these traditions were understood in early Judaism and nascent Christianity. Special attention will be paid to the roles of priests, kings, and prophets in ancient Israel to better understand Israelite and Judaean prophetic traditions in ancient Israelite society. The course will then examine the rise of apocalypticism and its medieval and modern manifestations including a brief look at Islam. Additional emphasis will be placed on the religious and political interactions which manifest themselves in prophetic movements - then and now - including the rhetoric of ideology and propaganda. Important figures and events illustrate these cultural and political trends.", "other": ["Cross-listed with: CAMS 70, JST 70", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 83: First-Year Seminar in Religious Studies", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Critical approaches to the dimensions and directions in Religious Studies.  RL ST 083S First-Year Seminar in Religious Studies (3) (GH;FYS)(BA) This course meets the Bachelor of Arts degree requirements. Students will be expected to master material relative to the introductory study of a major world religion or aspect thereof, as well as to acquire basic skills useful to the study of the liberal arts. Students will learn to read books and original documents, discuss them, formulate effective arguments, and write essays and papers. The course will challenge students to express themselves and to gather information through discussion and writing of papers about major world religion(s) or aspect(s) of world religion(s). It will challenge students to think about social behavior, the nature of community, and the value of scholarly endeavor as these relate to the particular topic of the seminar. Frequently, the course will deal with intercultural and international topics, though some of the variable topics may not readily lend themselves to such analysis. Through readings, discussions, lectures, and research projects, students will become acquainted with major figures and developments in a major world religion, as well as to acquire basic skills useful to the study of the liberal arts. Students will learn to read books and original documents, discuss them, formulate effective arguments, and write essays and papers. Analysis of this type will provide students with techniques for appreciating and judging arguments and presentations in many fields of learning distinct from religion, from scholarly to popular. By reading and understanding religious texts and the arguments based on them, students will learn to consider the cultural assumptions of different groups and societies and will come to discern and, perhaps, gain deeper insight into their own values and assumptions by contrast with these. Although the course will focus on a specific topic, the instructor will help the student to see the wider implications of the issues and controversies discussed. Whenever possible, the international and intercultural aspects of the topic will be considered. The course fulfills the first-year requirement as well as one of the humanities requirements in general education or a Bachelor of Arts humanities requirement.", "other": ["Bachelor of Arts: Humanities", "First-Year Seminar", "General Education: Humanities (GH)"]}, {"course_name": "RLST 90: Jerusalem: Past, Present, and Future", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Jerusalem, a city sacred to Judaism, Christianity, and Islam, is often depicted as the spiritual and physical center of the world. Throughout its 5000-year history, Jerusalem has attracted diverse cultures, empires, and peoples who have vied for control of this holy city. Jerusalem: Past, Present, and Future surveys the cultural, religious, political, archaeological, and historical record of Jerusalem, beginning with its earliest settlement during the third millennia BCE; through its expansion as a second millennium Canaanite urban center; its role as the capital of Israel and Judah during the first millennium BCE biblical periods; the influence of the Egyptian, Assyrian, Babylonian, Persian, Hellenistic, Roman, Byzantine, Crusader, Mamluk, and Ottoman empires; and its development under Jewish, Christian, and Islamic control. The significance of Jerusalem's past, its impact on contemporary society and politics in the modern Middle East, and differing visions for this contested city's future are examined in light of various interpretations of the textual and archaeological evidence.", "other": ["Cross-listed with: CAMS 90, JST 90", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 101: Comparative Religion", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Comparative or historical analysis of religious factors--worship, theology, ethics, scriptures, etc., in two or more religious traditions.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"course_name": "RLST 102: Canaan and Israel in Antiquity", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course is an overview of the ancient history and cultures of Canaan (the Mediterranean Levant of Syria-Palestine) and the emergence of Israel. It involves a critical view of biblical texts (especially the Hebrew Bible, aka Old Testament) in light of other ancient texts, archaeology, and historical methods, in order to explain the nature and the evolution of society, religion, and thought in the prebiblical and biblical era. We will be especially interested in the period from the end of the Late Bronze Age (c. 1200 BCE) to the Persian period (539-332 BCE), and will examine ongoing debates about the Bible and history, as well as the development of Israelite religion from polytheism toward monotheism and a distinctive worldview.", "other": ["Cross-listed with: CAMS 102, HIST 102, JST 102", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 103: Introduction to Hinduism", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Historical overview of the development of ideas that forms the basis of the south Asian religious culture. ASIA 103 / RLST 103 Introduction to Hinduism (3) (GH;IL)(BA). This course meets the Bachelor of Arts degree requirements. We begin with a discussion of the pre­-Vedic Indus Valley civilization reflecting upon its influence on later south Asian cultures. The course then traces how the Vedic ritual tradition, and the Vedantic philosophy gave rise to the concepts of Karma (individual action and its underlying motives), Samsara (the cyclical view of life), and the Atman (nature of the individual). Moreover, we pause here to explore the relationship between the emerging idea of civic responsibility (Dharma) and its relationship to the Vedic and Vedantic thought. Next we examine how the Vedantic philosophical tradition may have incorporated a diversity of philosophical views including both Brahmanical as well as non-­Brahmanical traditions of Buddhism, Jainism, Lokayata, etc. The class will read excerpts from the religious literature of the era. The first part of the course concludes with selected readings from the Bhagavadgita, Mahabharata, as well as some Buddhist and Jaina texts. All of these readings will be in English. Class discussions focus on how the classical Hindu worldview may have emerged from the philosophical foundation of the Vedantas, and later built the groundwork for the Hindu Bhakti (devotion) movements. The second part of the course focuses on the various regional Bhakti traditions from the middle ages onwards, analyzing how the regional cultures may have related with the great classical Brahmanic tradition. The course concludes with a discussion of how Hinduism in the post 1800s responded to the forces of colonization, exploring how the different religious and cultural traditions of south Asia may have interacted with other religious cultures (both indigenous and foreign) like Buddhism, Jainism, Islam, and Christianity. We shall read excerpts from noteworthy thinkers and writers of nineteenth and twentieth century to understand the very interesting dynamics between religion and civil society of more recent times. This course concludes with a discussion of how Hinduism in the post 1800s responded to the forces of colonization, exploring how the different religious and cultural traditions of historical south Asia may have interacted with other religious cultures (both indigenous and foreign) like Buddhism, Jainism, Islam, and Christianity. We shall read excerpts from noteworthy thinkers and writers of nineteenth and twentieth century to understand the very interesting dynamics between religion and civil society of more recent times.", "other": ["Cross-listed with: ASIA 103", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "RLST 103H: Introduction to Hinduism", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Historical development of Hinduism to the present.", "other": ["Honors"]}, {"course_name": "RLST 104: Introduction to Buddhism", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "A general survey of the basic doctrine, practice, and historical development of Hinayana and Mahayana Buddhism. RLST 104 / ASIA 104 Introduction to Buddhism (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is a general survey of the historical development, basic doctrines, and practices of Hinayana, Mahayana, and Vajrayana Buddhism. The course is structured around the \"Three Jewels\" of Buddhism: Buddha, Dharma, and Sangha.That is to say, we will learn about the Buddha as a historical figure and spirit; we will come to understand the basic elements of his doctrinal teachings; and we will examine the community of followers who have practiced his teachings. Special attention will be paid to the various \"geographies\" of Buddhism as expressed through different cultures in ancient India,Southeast Asia, and East Asia. At the conclusion of the course, we will encounter Buddhism as a relatively new cultural force in America. The course revolves around the discussion of key issues in the philosophy, ethics, and theology of various forms of Buddhism.", "other": ["Cross-listed with: ASIA 104", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "RLST 105: Buddhism in the Western World", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "A general survey of the development of Buddhism as a religious tradition in the West, focusing especially on America.  RL ST 105 Buddism in the Western World (3) (GH;US;IL) (BA) This course meets the Bachelor of Arts degree requirements.The academic study of religion is distinct from instruction in a religion in so far as one seeks simply to learn about religion, or religions, by considering the history, texts, major figures, and belief systems of one or more traditions. Because religions are always deeply intertwined with the entire cultural history of a region, studying a religion has always involved placing it in a larger cultural context. Buddhism in the Western World (RL ST 105) provides an intense concentration on a particular topic from the Buddhist religious tradition, focusing on historical, comparative, and phenomenological concerns. The course concentrates on the major figures involved, integrated with significant issues and religious practices in the development of the aspect of the Buddhist religious tradition under investigation. In many cases, across the face of Indian, Chinese, and Japanese Buddhism, gender, racial, and ethnic issues play critical roles in the development of the tradition studied, and these are explored in depth. Finally, the course examines the symbols, myths, and rituals of culture or cultures involved, which are radically different than our own, providing for each student the opportunity to compare, consider, and assess a wide variety of expressions of religiosity. Evaluation is research paper. Buddhist in the based on discussion, written assignments, and a major Western World, RL ST 105, offers a special focus on a particular aspect of one of the major religious traditions of the world. Because general approaches and methodologies in the academic study of religion are employed throughout the course, RL ST 105 is linked to all other courses in religious studies. RL ST 105 may be used to fulfill 3 credits in the Humanities, and may also be used to fulfill a US;IL requirement in the major or minor.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"course_name": "RLST 106: Mysticism and Kabbalah", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "A survey of the history, philosphy, and cultural impact of various mystical traditions in relation to world religions.", "other": ["Cross-listed with: JST 106", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "RLST 107: Introduction to Islam", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "An introduction to the basic history of the Islamic tradition and also to Muslim beliefs and practices, this course will give students insight into the diverse world of Islam. From its origin in Arabia in the seventh century, Islam today is professed by more than 1.5 billion people all over the world. This course includes an outline of that history, including the early Muslim community and the Muslim holy book, the Qur'an. It touches on major institutions, such as Islamic law, philosophy, theology, and mysticism, and covers key rituals in Muslim daily life. The impact of modernity will be considered, including Muslim life in the United States.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 108: Myths and Mythologies", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "World mythology: myths primarily of non-Western cultures, based on selected areas and traditions around the world. CMLIT 108 Myths and Mythologies (3) (GH;IL)(BA) This course offers a survey of several different cultural traditions as expressed in myth, as well as discussion of myth in its literary, social, geographical, political, and religious contexts. Various theories of the evolution and analysis of myth will be examined. Mythological traditions from around the globe will be compared in order to determine qualities which they share and examine ways in which they are unique. This course will help you see the world in new and exciting ways, based on the wide variety of global myths. At the same time, you will consider the permanent human issues which connect all of these traditions to each other, to the modern world, and to you. CMLIT 108 is one of the choices of survey courses, which count toward the Comparative Literature major and the World Literature minor. This course also fulfills the General Education humanities requirement, the Bachelor of Arts humanities requirement, and the International Cultures requirement.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "RLST 110: Introduction to the Bible: Old Testament", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The Old Testament (or, Hebrew Bible) is the record of the interaction between the people of ancient Israel and their God. As a religious text, the Bible is inextricably intertwined with the cultures of Israel's neighbors, including the Canaanites, Syrians, Greeks, Assyrians, Babylonians, Arabs, Egyptians, and the peoples of the eastern desert. To study the Hebrew Bible and its development during the first millennium BCE is to study the history, culture, and literature of the entire region. This course introduces students to the literature of ancient Israel, its rituals, the stories which established a people's identity, and which defined their moral behavior. Great figures of the texts, such as Moses, David, Solomon, Bathsheba, Ruth, Jeremiah, Daniel, and Ezra, teach us important lessons about life and how people of faith attempted to relate to one another, to God, and to people outside their ethnic group. Students will read from the biblical text, as well as from secondary source readings which contains scholarly opinion from a variety of sources. Recent archaeological and epigraphical studies will be incorporated into the course to enhance our work. The ultimate goal will be to assess the meaning of the texts in their ancient Near Eastern environment; to understand the development of Hebrew religion and the beginnings of Rabbinic Judaism; and to understand the connection between biblical studies and other fields of study, such as History, Religious Studies, Archeology, Linguistics, and Comparative Literature.", "other": ["Cross-listed with: CAMS 110, JST 110", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 111: Early Judaism", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Early Judaism will introduce students to the history of Judaism as reflected in Jewish literature from the period of the Babylonian exile (587/6 BCE) to the closure of the Babylonian Talmud (ca. 600 CE). This course will analyze the development of Judaism from its emergence out of the ancient Israelite religion through the formative period of rabbinic Judaism. Attention will be given to the diversity of ideas and practices that characterized early Judaism and the influence the larger Persian, Hellenistic, and Roman worlds had on Judaism's development. We will examine selections from the Hebrew Bible, and from other literature, including the Dead Sea Scrolls, the Apocrypha, the New Testament, the Mishnah, and the Talmudim.", "other": ["Cross-listed with: CAMS 111, JST 111", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 113: Jewish Myths and Legends", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Comparative study of diverse interpretations of stories from the Bible in Judaism and Christianity. CMLIT 113 / JST 113 / CAMS 113 / RLST 113 Myths and Legends of the Jews (3) (GH;IL) The impact of the Bible on Western Culture is immense. Beyond its religious importance, the motifs and images from its myths and stories permeate literature and art, providing a basic frame of reference that for much of history could be taken for granted. A degree of familiarity with these motifs so as to be truly fluent is no longer common, and so it requires special effort to discern allusions to biblical traditions. Moreover, these traditions are not static: religious communities continually re-interpret them and appropriate them in very different contexts. Many prominent traditions in Judaism, Christianity, and Islam do not appear explicitly anywhere in the Hebrew Bible, but are the product of imaginative and ingenious interpretation and re-tellings. Why, for example, is Noah an example of a righteous person in Christian tradition, but in rabbinic tradition is more often portrayed as a profane, earthly-minded man who was saved only because he was the least bad of an evil generation? Why is Moses commonly portrayed with horns in medieval art? Underlying such different traditions are centuries of debate and reflection on these texts as sacred scripture, and competing religious communities often authorized their distinctive beliefs and practices by reading them into scripture. The differences are often too subtle to discern apart from careful comparison. This course will explore the boundaries between Scripture and tradition by means of a close examination of the myths and stories in the Hebrew Bible and their subsequent interpretation and re-tellings in Judaism, Christianity, and Islam. Using methods from comparative mythology and folklore, as well as comparative midrash, our procedure will be to compare these traditions closely with the biblical text, asking: What are the main motifs in the mythology of Judaism? Does Judaism have a coherent mythology? How do their myths compare with the myths of their neighbors? Where did these myths come from? How do these traditions relate to the Bible? What was the function of these myths? Why are there competing myths? How is it possible that Judaism affirms belief in only one God, but has myths that include other divine beings? We will also compare with later interpretive traditions (Jewish, Christian, Islamic). Can we trace trajectories of interpretation? Can we discern particular interpretive methods in operation? We will seek to answer: what do these re-workings of the traditions tell us about the development and function of Scripture, and the social circumstances of the communities? Finally, we will seek to detect reflections of these interpretive traditions in literature and art from the medieval to the modern periods. The course is organized around major topics in the Jewish Scriptures: God, creation, heaven and hell, Torah, Sabbath, Abraham and other ancestors, Israel and holy land, exile, and Messiah. Throughout we will consider how sacred stories function to form ethical perspectives and values.", "other": ["Cross-listed with: CAMS 113, CMLIT 113, JST 113", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "RLST 114: Modern Judaism", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course will explore the developments in Judaism since the Enlightenment and the French Revolution. Major changes have come to the world since 1700-changes represented by terms such as the Enlightenment, Emancipation, Industrialization, Nationalism, Urbanization, Immigration, and Egalitarianism/Feminism. These broad social changes led to the break-up of traditional communities and, among other things, reformulations of Jewish Life and Jewish Religion. The effects can be seen in a number of Jewish responses-Assimilation, Hassidism, Self-Defense and Nationalism, Denominationalism, and Egalitarianism/Feminism-which we shall study in this class. In particular, we shall look at Jewish spirituality-its historical and theological development, its many historical and modern manifestations, and how it works.", "other": ["Cross-listed with: JST 114", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "RLST 115: The American Jewish Experience", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Chronological and topical survey of the story of Jewish life in America. We will trace the social, religious, cultural, and political developments in the Jewish community from the Colonial Period to the present. Topics to be covered include immigration, acculturation, ethnicity, gender, politics, and communal and religious innovation. While \"knowing the facts\" is obviously important to historical understanding, this course helps students develop critical thinking skills. These skills include: close and thoughtful reading and analysis of primary and secondary sources; looking for a broader coherence or \"order\" to the material; independent analysis and effective articulation (both in writing and in class discussion) of well-reasoned, well-crafted conclusions and interpretations and arguments (conclusions/interpretations/arguments which are supported by specific factual evidence derived from a variety of sources). The three specific course objectives underscore its scholarly dimensions: (1) Students will gain a knowledge and understanding of the relationship between the experiences of members of the American Jewish community and United States history as a whole. (2) Students will gain an understanding and knowledge of the political, economic, and social processes that shaped the American Jewish experience. (3) Students will learn how to \"think historically\" by placing documents written in the past in their historical contexts, and to consider the relationship of the past to the present. By the end of the course students will: Demonstrate an understanding of the chronology of American Jewish history. Demonstrate an understanding of the diverse experiences of different groups of Americans. Demonstrate an understanding of the social, political, and ideological structures that shaped the American Jewish experience and continue to shape the modern United States.", "other": ["Cross-listed with: HIST 115, JST 115", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 116: Muslims in America", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course is a study of Muslims in North America, primarily the United States. It examines the multiple racial, cultural, and national groups that comprise this diverse community, starting with the historical record of the Muslims that came to the Americas as African slaves. Next, we examine African American Islam in its myriad formations. The influx of immigrants in the 1960s from the Middle East, Africa and Asia, dramatically shifted demographics in U.S. Muslim communities. Finally, we consider the post-9/11 period, which has put Islam and Muslims at the center of U.S. political and cultural discourse.", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"course_name": "RLST 120: New Testament", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "CAMS 120 / JST 120 / RLST 120 New Testament (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. This course provides an introduction to the collection of early Christian writings that make up the New Testament. It begins with an examination of the first-century context in which these writings took shape-one overshadowed by the Roman empire, influenced by Hellenistic culture, and based, above all, on varieties of Judaism. From there, the course takes up a few guiding questions. How, in this ancient context, did the first Christians understand and portray the figure at the center of their communities, Jesus of Nazareth? What do the New Testament writings reveal about the beliefs and aspirations of these communities as they advanced a movement that would, in time, become among the most consequential in world history? By the end of the course, students will have gained knowledge of the historical context of New Testament writings and an understanding of why the New Testament has been such an important and influential collection of writings.", "other": ["Cross-listed with: CAMS 120, JST 120", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 121: Jesus the Jew", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Although Jesus of Nazareth is the object of Christian devotion, he was not a Christian himself, but a pious Jew. What can be known about the historical figure of Jesus the Palestinian Jew? How would his teachings and actions have fit in the context of Judaism of his day, in the Greco-Roman world? What did he mean when he proclaimed the coming kingdom of God? Because almost all of our source material espouses Jesus as the Christ of Christian faith, the first step is to understand the aims and perspectives of these Christian sources, including the canonical Gospels as well as non-canonical Gospels. Through careful examination of these sources in light of critical scholarship and the social and historical context of Judaism in the Greco-Roman world, we will consider how much the historian is able to reconstruct of Jesus using historical method, what the limits of this investigation are, and how relevant the task is. We will consider and evaluate a few of the different scholarly reconstructions of the historical Jesus. Major emphases will include the historical, social, religious, political, and cultural contexts of Jesus, including important precursors; the political, institutional, and cultural history of the teachings and actions of Jesus in their Jewish setting, and how these are reinterpreted by his followers after his death. Attention will be paid to the development of variant Christian traditions about Jesus including Jesus as Messiah, his death as a saving event, the resurrection as exaltation of Jesus as Lord, the memorialization of Jesus in Christian ritual practice, and the cultural and religious impact of Jesus throughout history. In addition to the early Christian sources on Jesus (especially the canonical Gospels, but also other New Testament texts and non-canonical writings), on each topic students will read selections from early Jewish writings in order to illuminate the cultural context. These include the Dead Sea Scrolls, Philo, Josephus, Jewish texts among the so-called Apocrypha and Pseudepigrapha, early rabbinic texts, and epigraphical writings. Relevant archeological evidence and Greco-Roman sources will also be considered. Broader issues of historical, cultural, linguistic, political and geographical context will be covered in lectures and secondary readings.", "other": ["Cross-listed with: CAMS 121, JST 112", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "RLST 122: Apocalypse and Beyond", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Apocalypse and Beyond is a topic (and title) meant to suggest that apocalyptic imagination about the end of the world, first begun in the Ancient Near East with certain Jewish and Christian writings, is constantly re-envisioned for each new age. Apocalyptic literature and world views are frequently produced by marginalized groups who perceive themselves to be persecuted, and who envision a violent (often divine) intervention, which alone will bring justice. In Part One of the course, we will examine the ancient literary genre of apocalypse, which was popular in the Ancient Near East from around 200 BCE to 200 CE, especially in Jewish and Christian writings both in the Bible (e.g., Daniel and Revelation) and outside of it (e.g., First Enoch, the Apocalypse of Peter, and the Apocalypse of Paul). The authors of these apocalypses expected the evil age in which they were living to dramatically end in their lifetimes; although that did not happen, apocalyptic thinking became foundational to the three world religions stemming from the Near East Judaism, Christianity, and Islam to varying degrees. In Part Two, we will examine the ideology, sociological underpinnings and some historical examples of apocalyptic groups and movements in medieval to modern times, and look at the impact that apocalyptic world views have had on the secular world, including philosophy, political movements, and popular culture, such as movies.", "other": ["Cross-listed with: CAMS 122, JST 122", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 123: History of God: Origins of Monotheism", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course examines the early history of God; that is, the concept of the divine as a single supreme being. In particular, it focuses on the origins of monotheism and the development of its three major traditions in the Near East: Judaism, Christianity, and Islam, from their respective beginnings to around 1000 C.E. The course will begin with an analysis of the polytheistic religious milieu of the Ancient Near East in the second and first millennia B.C.E., and will consider the question of how, when, and why belief in one God first appeared in ancient Israel. Various modern theories about the origins of Israel's national God (Hebrew Yhwh/Yahweh and Aramaic Yhw/Yaho) will be analyzed, with careful attention to the evidence of ancient texts and archaeology. Following a discussion of the nature of the religion(s) of early Israel, the course will then turn to the development of Judaism as the world's first monotheism. It will then examine the subsequent emergence of Christianity in Roman-era Palestine and Islam in Late Antique Arabia, with a brief glance at the Persian religion of Zoroastrianism, which shares some commonalities. Finally, the course will compare and contrast some of the major beliefs, practices, and significant historical trends and movements within the first centuries of the three major monotheisms.", "other": ["Cross-listed with: CAMS 123, JST 123", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 124: Early and Medieval Christianity", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course provides an introduction to the history of Christianity. It traces, specifically, the development of the Christian movement from its beginnings as a small Jewish sect in Jerusalem to its unlikely emergence as the religion of the Roman Empire and, finally, its subsequent spread and development in Europe, Asia, and Africa. In form and structure, the course is historical, following figures and events in a more or less chronological sequence and taking up questions of causality, influence, and social identity. Yet the course is also concerned with the ideas, concepts, and philosophical viewpoints that have shaped Christianity and given it a certain intellectual coherence over time. The course begins with first-century construals of messianic identity and also with the figure of Jesus, as he was portrayed in the New Testament gospels. It then follows the first generations of the Christian movement, considering it within the context of first-century Judaism and the early Roman empire. Topics include persecution, martyrdom, and the important contributions of Origen. The middle section of the course looks at the second, third, and fourth centuries through three lenses, as it were: the office of bishop, the rise of monasticism, and the realities of empire. Bishops, monks, and emperors all shaped Christianity in essential ways, creating a rich and complicated spiritual, moral, theological, intellectual, and geo-political legacy for generations to come. The final third of the course looks at the development of Christianity beyond the fourth century in geographical groupings including churches in Africa, Asia, the Middle East, western Europe, Byzantium, and the Slavic lands. It is hoped, in all of this, that students will gain an understanding not only of Christian history but also of what made - and what makes - Christianity a distinctive and influential religion.", "other": ["Cross-listed with: CAMS 124, JST 124", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 125W: Modern Christianity", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Analysis in cultural context of selected thinkers, ideas, and movements in Christianity from the sixteenth century to the present.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Writing Across the Curriculum"]}, {"course_name": "RLST 129: Philosophy of Religion", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course surveys perennial philosophical questions connected with religion: What is God, deity, or divinity? What is the nature and significance of religious experience? Is it rational to hold religious beliefs? How persuasive are arguments about the existence of God? How compatible is religion with modern science? What are the meanings of miracles, immortality, and creation? In what ways might morality depend on religion? What role ought religion to play in society and the public sphere? What lesson should we draw from profound religious experiences? Ought religious tolerance to be limited at all? Through the reading and discussion of relevant historical and contemporary texts, students will be encouraged to reflect on such questions from a variety of perspectives.", "prerequisite": "third-semester standing", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "RLST 130: The Ethics of Western Religion", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "History of theological-social ethics of the Judaeo-Christian tradition.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)"]}, {"course_name": "RLST 131: Introduction to Bioethics", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Studies questions of ethics in relation to biotechnology research and implementation, genetic engineering, medicine, animal and human rights. RL ST 131 Introduction to Bioethics (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. The course, as other 100-level Religious Studies Program and Philosophy courses, is intended for Liberal Arts majors and others likely to take Religious Studies and Philosophy courses rather than for Religious Studies majors. This course will provide a critical survey of key concepts, problems, and figures in the short history of bioethics and in contemporary studies and possible future directions. The course will develop the student's analytical and critical skills through study of different views on the nature of life and what experimentation with life-forms morally entails. The course will examine the increasingly techno-scientific definition of the nature of life and the human condition and evaluate such arguments and positions of practice in regard to opposing views of life as inherently sacred. It will investigate the extent and breadth of moral arguments in regard to differing life forms and consider the rights of humans and non-human animals. Students will be graded on participation, case study analyses, a group presentation, and a final paper. RL ST 131 satisfies the GH requirement and it may be used to fulfill major and/or minor requirements in Philosophy and Religious Studies. This course is offered every other year with an enrollment of 35-50 students.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)"]}, {"course_name": "RLST 133N: Ethics of Climate Change", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Climate change is not only a political, economic, and social crisis, it presents one of the great moral problems of our time. This course will cover the science, policy, and ethics of climate change. It fulfills general science requirements by giving an overview of the role played by such diverse scientific disciplines as chemistry, earth systems, ecology, and geology in understanding our changing climate while also exploring mitigation and adaptation strategies being developed in the fields of engineering, forestry, agriculture, and others. It fulfills humanities requirements by delving into the ethical dimensions of climate change, including religious and humanistic theories of human flourishing, deontological and teleological theories of ethics, and analysis of specific choices addressed by international negotiators. A hallmark of this course is using Penn State as a 'living laboratory' by taking advantage of both faculty expertise and the realworld activities of the Office of Physical Plant. Every week, students will interact with experts from various quarters of the University in order to see how climate change is being approached in a multi-disciplinary fashion. The first third of the course will feature guest lectures by EMS faculty working on paleoclimate, modeling, carbon sinks, ocean acidification and other aspects of climate science. The second portion will engage humanists, economists, historians, and artists at Penn State. The third will include tours of Penn State facilities, such as the East Campus Power Plant, and interviews with researchers developing new energy and sequestration technologies. In addition to exams and papers, students will prepare for a mock negotiation by learning about the energy profile and history of assigned countries. They will then have to set specific CO2 and temperature goals and come up with solutions to achieve these. The goal is to understand the role placed by ethical ideals in the pragmatic process of producing an equitable solution. In short, this course will give students the tools to understand the basic science of climate change and its ethical implications. Students will come away with a better sense of the moral dimensions of this phenomenon and the implications for human civilization and for the biosphere.", "other": ["Cross-listed with: METEO 133N, PHIL 133N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "RLST 135: Ethics in Jewish Tradition and Thought", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course takes as its starting point the idea that modern ethical frameworks are deeply rooted in the soil of older traditions. By examining the development of Jewish intellectual traditions and their roots in the Bible, it provides students with an opportunity to study ethics in a philosophically textured, culturally rich, and historically informed way. And by focusing on Jewish engagement with the Bible, the course illuminates other traditions that derive from biblical monotheism: for example, those associated with Christianity, Islam, and the Enlightenment. The first part of the course takes up the idea of tradition and includes a study of biblical texts that serve as the foundation for key moral concepts. Following the traditional division of the scriptures, it examines questions of human identity and responsibility in the Torah, social ethics in the Prophets, and the quest for wisdom in the Writings. The final topic in this unit is the development of ethical tradition among the great sages of Jewish antiquity. The second unit shifts focus to the appropriation of tradition in modern Jewish thought. After reviewing important developments in Jewish thought in the medieval and early modern periods, it turns attention to the ways that some recent figures have addressed perennial concerns in light of commitments and ways of being that are integral to Jewish identity. By reading closely the works of such seminal thinkers as James Kugel, Joseph Soloveitchik, and Abraham Heschel, we will gain a deep acquaintance not only with important vocabulary but also with the ways that traditional words and concepts may be used dynamically to produce fresh ways of looking at questions in moral philosophy.", "other": ["Cross-listed with: JST 135, PHIL 135", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "RLST 137: Gender, Sexuality, and Religion", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "WMNST 137 explores the history of different conceptions of gender and sexuality as they are understood within major religions (e.g. Hinduism, Judaism, Islam, Christianity, Buddhism, indigenous spiritual systems). The course emphasizes modern and contemporary contexts of gender/religion debates, introducing feminist historical methods in order to trace the origins and trajectories of today's controversies. Students should expect to gain a comparative historical perspective on at least three theological traditions. Possible topics include: history of gender and religious practices; femininities and masculinities in a spiritual context; the flesh and the spiritual body; and sexuality, and both ethical and theological approaches to theories of gender, feminism, and identity. We will explore ways in which religious teachings, in both historical and contemporary contexts, inform secular understandings of gender and the ways in which contemporary conceptions of gender inform religious practice. While religion plays a crucial role in defining sex and gender norms, changing sex and gender norms can pressure the doctrine, discourses, practices and organizational structures of faith institutions, some established centuries or millennia ago. The course considers not only the roles of women and men, or constructions of masculinity and femininity, but also the impacts of non-binary genders and sexualities that may be acceptable (even celebrated) in some religions and shunned in others. We will address urgent and perennial questions from different religious perspectives: what is the spiritual meaning of sexuality? Is sexuality an obstacle or a vehicle for spiritual fulfillment? Who are the voices of authority who set the sacred rules on sexuality and who gets to enforce them? How do we (or should we) balance the tensions of non-aligned government and religious concerns, as in contemporary debates around same-sex marriage; abortion and reproductive rights; legal definitions of \"family\"; the Muslim veil in secular contexts; divorce; trans rights; attitudes toward the body; gender mutilation and/or sex-reassignment surgery; sexual violence towards women, gay, and trans individuals around the world; child and sexual abuse among the clergy; and religious leadership and inclusion. The course also touches on the impacts of colonialism, globalization, and migration on gender and sexuality.", "other": ["Cross-listed with: WMNST 137", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 140Y: Religion in American Life and Thought", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The course aims to cast light on contemporary religious life in the United States by looking at the history of American religion. The course will provide students with a broad overview of American religious life from the colonial era to the present, focusing on the diversity and vitality of American religious traditions, as well as areas of intersection and conflict around race, ethnicity, gender, class, and sexuality. The course will also ask students to consider how aspects of these histories continue to shape religious belief, practice, and public discourse in contemporary life. Students will consider important religious and philosophical writings, as well a popular/mass cultural, ethnographic, or other documentary sources that shed light on both the intellectual and lived history of religious life and thought in the United States.", "other": ["Cross-listed with: AMST 140Y", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"course_name": "RLST 145: African Diaspora Religions and Spiritualities", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course is an introduction to religions and spiritual traditions of the African Americas including the United States, the Caribbean and Latin America, emphasizing present institutions and practices, their relationship to Africa and African spirituality, their shape and function during slavery, and their development from Emancipation to the present. Through various examples and case studies, we will trace the relationship between religion and resistance, race politics, gender and sexuality, religion and social change. The course addresses core ideas of the disciplines of religious studies and African Diaspora theory. The category of religion is explored through a diasporic framework that considers the legacy of slavery and contemporary racial and social hierarchies. The course approaches religions of the African Americas as epistemologies of resistance to white oppression introducing students to the diaspora condition as marked by historical violence and the dialectics of loss and displacement. Central to the course are concepts of religious orthodoxy and authenticity, cultural retentions and transformations and the dynamics of religious power and authority. The course follows a comparative framework in investigating religious life, introducing students to diaspora theory as a discourse of difference that engages critically with the particularities of the religious traditions of the African Americas without collapsing their differences. By addressing identity formations, the course focuses on religion as a discourse of power and one that articulates religious life as shaped by gender and race politics and by economics and social realities. To this end, the course follows an interdisciplinary approach and engages a variety of material including literary and historical texts, visual arts and music and dance makes it possible for students to understand the complexity of religious life in the African Americas.", "other": ["Cross-listed with: AFAM 145", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 146: The Life and Thought of Martin Luther King, Jr.", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "A survey of the civil rights leader including his religious beliefs, intellectual development, and philosophy for social change.", "other": ["Cross-listed with: AFAM 146", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"course_name": "RLST 147: The Life and Thought of Malcolm X", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The life of Malcolm X/El Hajj Malik El Shabazz (1925-1965) and his social, political, economic, and moral thought. AFAM 147 / RLST 147 The Life and Thought of Malcolm X (3) (GH;US)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine in-depth the life, speeches, and thoughts of Malcolm X/El Hajj Malik El Shabazz. While the Autobiography will be a major source, we will also use other sources to develop an understanding of the philosophy and thought of Malcolm X. We will explore the social, economic, political, cultural, religious, moral, and spiritual context of America in general and of African Americans in particular. We will examine Malcolm X's influence on the period in which he lived and since his assassination. We will compare and contrast his view on issues of race, culture, politics, education, crime, human rights, civil rights, morality, and economics with those of other African American leaders and with the prevailing views of most Americans on those subjects. We will devote a large portion of the course to the examination of the social movements that impacted on Malcolm and those that he influenced. The speeches of Malcolm X and the writings about Malcolm X are instructive and will be utilized along with other documents. Videotapes and audiotapes will also be employed as instructional materials. Students are expected to be ACTIVE participants in the learning/teaching experience. Students are required to participate in class discussions centered on the readings and related topics. There will be a written mid-term examination and a written final examination. Students are expected to complete an individual research project related to the course and write a paper on that research as well as to participate in a collaborative group project of their choosing on a subject related to the class. This course will count in the supporting courses category of the major and minors in African/African American studies. It also will fulfill credits in the Religious Studies Program. It may also be used to fill GH and US requirements.", "other": ["Cross-listed with: AFAM 147", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"course_name": "RLST 153: Dead Sea Scrolls", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The discovery of the Dead Sea Scrolls was one the most important archeological discoveries of the 20th century. This collection of over 900 scrolls found in caves by the Dead Sea includes the oldest manuscripts of the Hebrew Bible (Old Testament) and hundreds of other Jewish writings dating from the 2nd century BCE to the 1st century CE, many of which were previously unknown. In this course we will examine select examples of the Dead Sea Scrolls in order to understand how these writings have revolutionized our understanding of the formation of the Bible, Jewish groups in the Greco-Roman period, and the origins of Christianity and rabbinic Judaism, and why there is so much scholarly debate around them. We will consider such issues as Jewish law, biblical interpretation, messianism, apocalypticism, prayer and rituals. The course will include discussion of the archaeology of the Qumran settlement and caves, scribal practices and the production of scrolls, and scholarly methods in reconstructing and interpreting ancient texts. We will study this one sectarian movement as a microcosm of the issues related to Jewish identity in this critical period that birthed both rabbinic Judaism and Christianity. We will focus on the beliefs and practices by which this movement constructed their particular community identity and worked out their place in the world.", "other": ["Cross-listed with: CAMS 153, JST 153", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 160: Sacrifice in the Ancient World", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Sacrifice (from Latin sacer \"holy + facere \"to make\") is one of the most prevalent yet troubling aspects of religion. Its destruction and violence is often at odds with other rituals and core understandings within a religion, so why is it done and what good does it do? For the sacrificer, does it represent a gift to the gods, a renunciation, an exchange, a surrogate, or something else? This course will examine some competing definitions and theories of sacrifice, as well as its manifestations in the cultures and religions of the ancient Mediterranean world, especially those of Greece, Rome, Egypt, Mesopotamia, Hatti, Israel, and Phoenicia. A brief look at religious sacrifice elsewhere, such as ancient Mesoamerica and India, will conclude the course.", "other": ["Cross-listed with: CAMS 160, JST 160", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 164: Introduction to the Qur'an", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The Qur'an is the sacred text of Islam. Revered by over a billion Muslims today, it is little understood by non-Muslims. This course will introduce students to the literary and religious meanings of this important text, which is seen as both the very word of God as well as the premier example of Arabic style. Attention will be given to the many cultures which have been influenced by this text, especially the Middle Eastern world. All readings will be in English translation.", "other": ["Cross-listed with: ARAB 164", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 165: Islamic States, Societies and Cultures c. 600-1500", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "This course introduces students to the history and culture(s) of the Islamic world from c. 600-1500. The course develops a historical framework for understanding developments in religious and legal thought and practice, science, medicine, and technology, philosophy, and the arts. Students will learn about culture through lecture and discussion and through examination and analysis of a variety of texts and examples of material culture from different periods and regions.", "other": ["Cross-listed with: ARAB 165, HIST 165", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 181: Introduction to the Religions of China and Japan", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "A survey of the history, philosophy, and cultural impact of the major Far Eastern religions: Confucianism, Taoism, Buddhism, and Shinto. ASIA 181 / RLST 181 Introduction to the Religions of China and Japan (3)(GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This is an introductory survey of the historical, philosophical, and cultural dimensions of the major religious traditions in China and Japan. The course delineates and highlights the organic view of the universe and the hierarchical ordering of society in East Asia. It traces the evolution of the major traditions (Confucianism, Daoism, Buddhism in China, as well as Shinto, Buddhism and Confucianism in Japan) by examining their ideas of humanity and nature, morality and society, and metaphysics and ethics. It also reveals the interaction and interrelation between ideology, politics and society, and their impact on the development of the major religious traditions in history. A major focus is the relation between the popular and folk practices and beliefs of esoteric Daoism, devotional Buddhism, and fertility-cult Shinto and the elite and literate doctrines and precepts of Confucianism, philosophical Daoism, and monastic Buddhism. The course also devotes some attention to the influence of religion on various facets of culture, such as medicine, science, literature, art and food. The objectives of the course are first to acquaint students with the religious beliefs, values, and practices of China and Japan by looking at their historical formations and contemporary manifestations, and second, to locate them in a global and comparative context.", "other": ["Cross-listed with: ASIA 181", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning"]}, {"course_name": "RLST 194: Jerusalem: Sacred and Profane", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Jerusalem, a city sacred to Judaism, Christianity, and Islam, is often depicted as the spiritual and physical center of the world. Throughout its 5000-year history, Jerusalem has attracted diverse cultures, empires, and peoples who have vied for control of this city that is both religiously significant and a very ordinary site of urban life. Jerusalem: Sacred and Profane surveys the archaeological, religious, cultural, political, social, and historical record of Jerusalem in the ancient, medieval, and modern periods. We will explore a series of themes in the city¿s history: the built urban environment, political power in and over the city, sacred sites and pilgrimage, the everyday experiences of Jerusalemites, the changing cultural meanings of the city across various religious and national traditions, and war, violence, and memory in the urban landscape. The significance of Jerusalem's past, its impact on contemporary society and politics in the modern Middle East, and differing visions for this contested city's future are examined in light of various interpretations of the historical evidence.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 197: Special Topics", "department": "Religious Studies (RLST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 235: The Church and the Jews", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Examination of the relationship between Western church and the Jews from the First Century to Enlightenment.  HIST 235HIST 235 The Church and the Jews (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine a key aspect of western history - the complex relationship between the Western (Roman Catholic) Church and the Jews, from the first century to the present. We will analyze ideas and policies regarding Jews as expressed in different realms, from theology and canon law to church art and popular preaching. We will also examine how changing conditions led to striking changes in church attitudes and policy, and how church policy was often at odds with popular sentiments about Jews.The course will be designed to enable students to grasp the fluidity of attitudes over time, and the interplay of economic, social, political, and theological factors; to grasp of essential elements of a key area of conflict in western culture; and to develop their skills in the close reading of primary texts.Students will be evaluated on the basis of three quizzes and a final exam.The course would offer a chance for students to develop perspectives previously gained in a number of courses, particularly HIST 001 and 002 (The Western Heritage), RL ST 001 (Introduction to World Religions), RL ST 101 (Comparative Religion), HIST 107 (Medieval Europe), HIST 407 (Early Medieval Society), and J ST 010 (Jewish Civilization). It would complement such courses as HIST 108 (The Crusades), HIST 408 (Church and State in the High Middle Ages), HIST 412 (Intellectual History of the Middle Ages), HIST 414 (Renaissance and Reformation), J ST 111 (Early Judaism), J ST 110 (Hebrew Bible), RL ST 120 (New Testament), and RL ST l24 (Early and Medieval Christianity).The course will count for 3 credits toward a) the 22 credits required for the minor in Jewish Studies, b) the 33 credits required for the major in Jewish Studies, c) the 30 credits required for the major in Religious Studies, and d) the 36 credits required for the History major.", "other": ["Cross-listed with: HIST 235, JST 235", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "RLST 280: Gendering the Divine in Indian and South Asian Religions", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Throughout South Asia, ancient religious beliefs and cultural traditions interact with forms of modernity that constitute the daily lives and practices of women and men today. Focusing on conceptualizations of sex and gender over South Asia's long history, this course investigates the ways in which religious traditions and cosmologies have informed gender roles and hierarchies in India, Nepal, and other neighboring nations from the ancient period through the present day. In so doing, the course also explores how political realities-revolutions, terrorism, elections, nationalist movements, for example-can both exploit and challenge the gendered entanglements of religion and secular life. Students engage basic historical methods as well as feminist analytical methods (e.g., intersectionality) as they read a variety of cultural histories and ethnographies, as well as religious, philosophical and literary texts.", "prerequisite": "WMNST 83N", "other": ["Cross-listed with: JST 280, WMNST 280", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RLST 294: Research Project", "department": "Religious Studies (RLST)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 297: Special Topics", "department": "Religious Studies (RLST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 400: Theories of Religion", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Comparative and interdisciplinary study of two or more systematic theories of religion: anthropological, psychological, sociological, philosophical/theological.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 405: Jews and Food", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Jewish laws, customs and attitudes with regard to food production, agricultural policy and eating from biblical to modern times.  JST 405 / RLST 405 Jews and Food (3) (IL) This course examines Jewish laws, customs and attitudes with regard to food production, agricultural policy and eating from biblical to modern times. These tenets of the Jewish tradition presently underwrite modern movements concerned with land use and food sustainability, as well as ethical behaviors in food production. The goal of the course is to understand how Jewish tradition can inform and contribute to improvements in the modern food system.The starting point is the ancient world of the Israelites,. Students will study agrarian interpretations of the Hebrew Bible as well as extra-biblical sources and archaeological data. The biblical attitudes toward food, eating, and agricultural practices are then traced into the post-biblical period and rabbinic periods. The course then jumps ahead to the present day, to shed light on a number of modern Jewish agricultural and food initiatives concerned with issues such as healthy land use, sustainability, and justice in food production and distribution. These movements proceed from various interpretations of Jewish law and custom, and illustrate how some modern Jewish attitudes toward food and eating are responsible for reimagining, and in some cases reinvigorating, biblical ideas and practices.At the conclusion of this course, students will be able to identify and understand the historical and theological significance of diet and eating practices of ancient Israelites and will understand the development of Jewish food laws and practices in the post-exilic and early rabbinic eras. Students will be able to evaluate the extent to which ancient Jewish thought has influenced modern Jewish attitudes and actions regarding food and social responsibility, and will be able to envision the ways in which Jewish tradition, both ancient and modern, can contribute to current progress and future improvement in our systems of food production, distribution and consumption. While a wide variety of derivative topics will be discussed, this course is particularly appropriate for students pursuing programs of study dealing with the biblical world, the development of early Judaism, Jewish ethics, and/or modern Jewish thought, as well as those studying agriculture and food systems who are interested in how Jewish tradition addresses these universal concerns.", "prerequisite": "Third semester standing", "other": ["Cross-listed with: JST 405", "International Cultures (IL)"]}, {"course_name": "RLST 407Y: Antisemitisms", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Surveys the history of anti-Semitism from antiquity through the Middle Ages to the present.  HIST (J ST) 409Y (RL ST 407Y) European Anti-Semitism from Antiquity to the Present (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course analyzes major episodes in the history of anti-Semitism and tries to clarify the motives and dynamics involved. It seeks to understand what these episodes have in common and what is unique in each case--is there a single universal, eternal antisemitism? Or are there rather 'anti-Semitisms' each belonging to a unique historical context? Is there a single continuous line of development in anti-Semitism? What is the relationship of a particular anti-Semitism to the national culture in which it originates?We will be reading the major original texts of anti-Semitism from Roman and ancient writers, through early Christian texts and medieval Christian Blood Libels against the Jews, documents of the Spanish expulsion, Lutheran tracts, Voltaire's essays, German philosophical texts from Kant to Marx, Wagner's racial essays, the Protocols of Zion, and documents of Nazi anti-Semitism by Hitler and Streicher. The major part of the grade will depend on a short research paper which will be presented in various drafts, so that the final version represents the culmination of discussion and constructive criticism and advice. This course is a parallel course to J ST/HIST 416 (Zionist History) and J ST/HIST 118 (Modern Jewish History). This course will count toward the Religious Studies, Jewish Studies, and History majors and minors in the 400-level category.", "other": ["Cross-listed with: HIST 409Y, JST 409Y, RLST 409Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "RLST 409Y: Antisemitisms", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Surveys the history of anti-Semitism from antiquity through the Middle Ages to the present.  HIST (J ST) 409Y (RL ST 407Y) European Anti-Semitism from Antiquity to the Present (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course analyzes major episodes in the history of anti-Semitism and tries to clarify the motives and dynamics involved. It seeks to understand what these episodes have in common and what is unique in each case--is there a single universal, eternal antisemitism? Or are there rather 'anti-Semitisms' each belonging to a unique historical context? Is there a single continuous line of development in anti-Semitism? What is the relationship of a particular anti-Semitism to the national culture in which it originates?We will be reading the major original texts of anti-Semitism from Roman and ancient writers, through early Christian texts and medieval Christian Blood Libels against the Jews, documents of the Spanish expulsion, Lutheran tracts, Voltaire's essays, German philosophical texts from Kant to Marx, Wagner's racial essays, the Protocols of Zion, and documents of Nazi anti-Semitism by Hitler and Streicher. The major part of the grade will depend on a short research paper which will be presented in various drafts, so that the final version represents the culmination of discussion and constructive criticism and advice. This course is a parallel course to J ST/HIST 416 (Zionist History) and J ST/HIST 118 (Modern Jewish History). This course will count toward the Religious Studies, Jewish Studies, and History majors and minors in the 400-level category.", "other": ["Cross-listed with: HIST 409Y, JST 409Y, RLST 407Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "RLST 410: Jews in the Medieval World", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Trends in medieval Jewish society under Islam and Western Christendom.  HIST 410HIST 410 Jews in the Medieval World (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. The Jews lived in widely scattered communities under Christian and Islamic rule in the medieval period. This course will examine how Jews adapted the traditions they developed in Palestine and Babylonia in the early centuries C.E. to the new conditions they encountered in Europe and the Mediterranean region from the ninth to the fifteenth centuries. It will focus on the general problem of how traditional societies survive in rapidly changing circumstances, particularly when their members are a minority population. The course will aim at developing students' skills in comparative analysis as they compare the adaptive strategies of Jews in different cultural spheres (the Franco-German region versus Spain, for example). They will also be asked to compare the different polemical stances Jews adopted vis-a-vis Christianity, on the one hand, and Islam, on the other. They will be encouraged to understand the ways in which Jews internalized certain aspects of the majority culture and rejected others. It is hoped that they will come to see how deeply Jewish history was intertwined with medieval Christian and Islamic history, despite inter-religious hostilities and the frequent need for Jews to defend against majority aggression.Students will be evaluated on the basis of two mid-term exams (the first after the survey of the Muslim world, the second after the examination of the Franco-German region) and a comprehensive final exam.The course will be linked to most of the courses taught in the field of Jewish Studies, especially J ST 111 (Early Judaism), J ST 114 (Modern Judaism), and J ST 118 (Modem Jewish History from 1492). It will also be linked to offerings in Religious Studies: RL ST 001 (Introduction to World Religions), RL ST 101 (Comparative Religion), RL ST 107 (Introduction to Islam), RL ST 124 (Early and Medieval Christianity), and RL ST 165 (Introduction to Islamic Civilization). Further, it would complement HIST 001 and 002 (The Western Heritage), HIST 107 (Medieval Europe), HIST 108 (The Crusades), HIST 407 (Early Medieval Society), HIST 408 (Church and State in the High Middle Ages), HIST 412 (Intellectual History of the Middle Ages), and HIST 471W (Classical Islamic Civilization, 600-1258).The course will count for 3 credits toward: a) the 22 credits required for the minor in Jewish Studies, b) the 33 credits required for the major in Jewish Studies, c) the 30 credits required for the major in Religious Studies, and d) the 36 credits required for the History major. It will be offered once a year with an enrollment of approximately 60 students.", "other": ["Cross-listed with: HIST 410, JST 410", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "RLST 411: Jewish Studies", "department": "Religious Studies (RLST)", "credits": "3 Credits/Maximum of 9", "description": "Study of the life and thought of a particular period or movement in the history of Judaism.", "prerequisite": "Second semester standing", "other": ["Cross-listed with: JST 411", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "RLST 420: Major Christian Thinkers", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Systematic inquiry into the religious thought of one or more Christian thinkers, such as Paul, Augustine, Luther, Calvin, Kierkegaard, or Tillich.", "prerequisite": "3 credits in religious studies", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 422: Religion and American Culture", "department": "Religious Studies (RLST)", "credits": "3 Credits/Maximum of 6", "description": "Selected topics, problems, or historical movements in American religion; relation between religion and American culture.", "other": ["Cross-listed with: AMST 422", "Bachelor of Arts: Humanities"]}, {"course_name": "RLST 423: Orthodox Christianity: History and Interpretations", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Examines Orthodox Christianity from origins to present using critical historical analysis of primary and secondary sources. RLST 423 / HIST 423 Orthodox Christianity: History and Interpretations (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines Orthodox Christianity from its origins to the present by focusing on a series of four major problems using critical historical analysis of primary and secondary sources.1) The course provides students with the means to examine Orthodox self-understanding:Orthodox doctrine of God, its anthropology. 2)The issue of a world religion and the relationship of Orthodoxy to other world religions and secular authorities and other forms of Christianity, especially \"western\"Christians. 3) The challenge of alternate world religions--Judaism, Islam, western Christianities. 4)The challenge of modern Orthodoxy in the context of twentieth and twenty-first century developments and issues.", "prerequisite": "HIST 105", "other": ["Cross-listed with: HIST 423", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"course_name": "RLST 424: Monotheism and the Birth of the West", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The birth of monotheism and its relation to social organization, the idea of individuality, and science.  RL ST (J ST/HIST) 424H (PHIL 434H) Monotheism and the Birth of the West (3) (BA) This course meets the Bachelor of Arts degree requirements. Learn about the formation of Western culture, while learning to analyze the texts and other evidence about its formation from a critical, rather than naive, viewpoint. The idea of monotheism probably arose very early, and was even briefly implemented as a state cultic policy in Egypt in the 14th century BCE. Why, then, did it take another seven centuries to become widespread--appearing in ancient Judah, Babylon, and Ionia almost simultaneously? To answer this question, the course focuses on several developments, through the medium of primary texts and archaeology: the shift from a state hinterland based in extensive agriculture and household processing to one organized for intensive agriculture and industrial processing the rise of recognizably modern science; the promotion of individuation and an international elite culture in the context of Assyrian and Babylonian imperial ambitions; the development of the historical and archaeological arts in the context of archaizing in order to reinvent local traditions; and the socialization of monotheism and of democracy. Students will be evaluated on their discussion of the textual evidence as well as on reports in class and a final paper. This is the sole honors course treating the birth of the West. It expands on knowledge acquired in courses listed as prerequisites and in RL ST/CAMS/J ST 012; CAMS 044; ANTH/CAMS 133; CAMS/PHIL 200; HIST 100; HIST/J ST 102; and PHIL 200 and enriches the students experience in CAMS 400, CAMS 440, and CAMS 480; HIST 402; J ST 411; PHIL 437; PHIL 453, and PHIL 461. This course counts toward the major in Jewish Studies, History, Religious Studies and toward the minor in Jewish Studies and Religious Studies.", "prerequisite": "RL ST004 , RL ST102 , RL ST110 , or RL ST120", "other": ["Cross-Listed", "Bachelor of Arts: Humanities", "Honors"]}, {"course_name": "RLST 425W: Books of the Bible: Readings and Interpretation", "department": "Religious Studies (RLST)", "credits": "3 Credits/Maximum of 12", "description": "Study of a biblical book/topic in terms of literary, historical, and cultural contexts, history of interpretation, and critical scholarship.  CAMS (J ST/RL ST) 425W Books of the Bible: Readings and Interpretation (3 per semester/maximum of 12) The Bible is a diverse collection of writings sacred to Jews and Christians written over about 1000 years, in a variety of different genres and historical circumstances. This course allows students the opportunity to study in depth a particular book of the Bible, from either the Hebrew Bible/Old Testament or the New Testament. We will explore the literary, historical and cultural context of the book in question. A literary analysis of the book will include consideration of genre and literary devices, and a close reading of the text. A historical analysis will consider the date of composition, its source materials, comparative traditions in other cultures, and relevant historical and cultural factors relevant to understanding the text. The course will introduce students to various other approaches to interpretation of the Bible in modern scholarship, including feminist and post-colonial critiques. We will also explore the varied interpretations and uses of the book in Judaism, Christianity, and Islam throughout history, and its influences in Western culture, including art and literature. The course will be offered once a year with varying content, and students may repeat it when taught with different content.", "prerequisite": "ENGL 104", "other": ["Cross-listed with: CAMS 425W, JST 425W", "Writing Across the Curriculum"]}, {"course_name": "RLST 440Y: The Orthodox Christian Tradition", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "History, culture, and beliefs of the Eastern Orthodox religious tradition with special reference to Russia.", "prerequisite": "RL ST004 , RL ST124 , RL ST125W , RUS  100 or RUS  110", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "RLST 461: Sociology of Religion", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Contemporary religion in the global perspectives: beliefs, structure, and function of major religious traditions, denominations, and cults.", "prerequisite": "3 credits of sociology or religious studies", "other": ["Cross-listed with: SOC 461", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "RLST 471Y: Classical Islamic Civilization, 600-1258", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "Pre-Islamic Arabia; Muhammad; Arab conquests; Islamic beliefs and institutions; literary, artistic, and scientific achievements; relations with Europe; breakdown of unity.", "other": ["Cross-listed with: HIST 471Y", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "RLST 472: Islamic Philosophy", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "A survey of major texts from the Islamic philosophical tradition, focusing primarily on the classical period (ninth to twelfth centuries) and its influence on modern thinkers.", "prerequisite": "9 credits in RLST and/or PHIL, or 6 credits of PHIL at the 200-level", "other": ["Cross-listed with: PHIL 472", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "RLST 478: Ethics After the Holocaust", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The aim of this course is to explore various ways in which philosophers have responded to Auschwitz (a signifier, or name, which is in turn not without controversy and complexity). It will examine, in particular, the promise and failure of post-Holocaust ethical theory, with attention to evil, suffering, goodness, witnessing, testimony, trauma, and human rights. Authors include Levi, Agamben, Arendt, Adorno, Levinas, Jonas, and Jankelevitch. Through reading and discussion of primary sources, this course introduces students to these philosophers' leading questions, methods, and conclusions, with reference to their historical context and their impact on later philosophy. The course will make these writings accessible to students without unduly presupposing prior knowledge, while also encouraging students to rise to the challenge with their own critical analysis and creative interpretations.", "prerequisite": "One course in either JST or PHIL", "other": ["Cross-listed with: JST 478, PHIL 478", "Bachelor of Arts: Humanities"]}, {"course_name": "RLST 483: Zen Buddhism", "department": "Religious Studies (RLST)", "credits": "3 Credits", "description": "The development and current state of Zen Buddhist thought and practice.", "other": ["Cross-listed with: ASIA 487", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "RLST 494H: Research Project", "department": "Religious Studies (RLST)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"course_name": "RLST 495: Internship", "department": "Religious Studies (RLST)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, non-group instruction, including field experience, practica, or internships.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 496: Independent Studies", "department": "Religious Studies (RLST)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 497: Special Topics", "department": "Religious Studies (RLST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RLST 499: Foreign Study--Religious Studies", "department": "Religious Studies (RLST)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]