[{"course_name": "UKR 1: Elementary Ukrainian I", "department": "Ukrainian (UKR)", "credits": "4 Credits", "description": "Reading, writing, and speaking Ukrainian.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "UKR 2: Elementary Ukrainian II", "department": "Ukrainian (UKR)", "credits": "4 Credits", "description": "Reading, writing, and speaking Ukrainian.", "prerequisite": "UKR  001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "UKR 3: Intermediate Ukrainian", "department": "Ukrainian (UKR)", "credits": "4 Credits", "description": "Reading, writing, and speaking Ukrainian.", "prerequisite": "UKR  002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "UKR 99: Foreign Studies", "department": "Ukrainian (UKR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "UKR 100: Ukrainian Culture and Civilization", "department": "Ukrainian (UKR)", "credits": "3 Credits", "description": "Survey of Ukrainian culture and civilization from the Middle Ages to the present.  UKR 100 Ukrainian Culture and Civilization (3) (GH;IL)The course acquaints students with Ukrainian culture from the origins of Kyivan-Rus in the 9th Century to the present day. The course will examine the many facets that make up culture: history, politics, language, literature, folklore, religion, science, music, and art. The course will place Ukrainian culture in the broader context of the Slavic nations and peoples. It will focus on the development of national identity from the origins of the Ukrainian people through the colonial period under tsarist Russian domination, through Soviet domination, and finally to post-independence identity following the dissolution of the Soviet Union in 1991. The course will include films and expert guest lectures. The course format will consist of lectures, slide, video and audio presentations. Readings will all be in English. Questions and discussion on class lectures and readings and on topical matters will be strongly encouraged. At the end of the course, students will be familiar with the problems that post-colonial Ukraine faces at present. They will have a basic general knowledge of Ukrainian history and geography, and will be acquainted with representative achievements of Ukrainian high and folk culture. There will be a mid-term (30%), a final exam (30%), and a research paper (30%). The latter will be graded both for content and writing ability. Ten percent of the class grade will be for class participation, including attendance and active participation in discussions. Students may also receive extra credit by making a 10-1 5 minute oral presentation in class on a pre-approved topic, which will offer students the opportunity to practice public speaking. The exams will include written identification questions, brief essay questions, and a longer essay question that synthesizes knowledge acquired in class. As a General Education course, Ukrainian 100 incorporates the following four elements of active learning: international competence (a much lesser know part of the East European world), information gathering and analysis, active use of writing, and dialogue pertaining to social behavior, community and scholarly conduct. The case of Ukraine as a 'submerged nation,' subsumed under tsarist Russia and the Soviet Union, will provide students with a colonial paradigm of development of a minority culture and language under a politically stronger colonizing culture. Students need to write a 10-page paper for the course and will learn to explore library and internet resources. The paper will be graded for content, clarity, structure, and effective use of language. As an extra-credit option, students may volunteer to give a class presentation on their research topic or another topic of interest. Students may also acquire extra-credit by writing reaction papers on topical extracurricular lectures or visits to Ukrainian cultural sites (like the Ukrainian Museum in New York, the Ukrainian Embassy in Washington, DC, or historic Byzantine Rite Ukrainian churches). Ukrainian 100 is not required for the B.A. degree in Russian, but may be used under the rubric of 'Additional Courses' for the B.S. degree in Russian Translation. UKR 100 may be used to satisfy the Gen Ed Humanities and United States Cutures and International Cultures requirements.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)"]}, {"course_name": "UKR 197: Special Topics", "department": "Ukrainian (UKR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "UKR 199: Foreign Studies", "department": "Ukrainian (UKR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "UKR 299: Foreign Studies", "department": "Ukrainian (UKR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "UKR 399: Foreign Studies", "department": "Ukrainian (UKR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "UKR 494: Research Project", "department": "Ukrainian (UKR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group basis."}, {"course_name": "UKR 494H: Research Project", "department": "Ukrainian (UKR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group basis.", "other": ["Honors"]}, {"course_name": "UKR 499: Foreign Studies", "department": "Ukrainian (UKR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]