[{"course_name": "VBSC 50: Mechanisms of Disease", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Introduction to the study of disease pathogenesis and careers in Animal Health Research and Service.  VB SC 050S Mechanisms of Disease (3)Mechanisms of Disease is a first year seminar directed to students with an interest in a career in veterinary medicine or in bio-medical disciplines. Students are introduced to the concepts of epidemiology, cell biology, clinical medicine and toxicology through use of appropriate case material. The importance of basic science courses to the understanding of this material is emphasized. Reading and written assignments are related to the case study material as well as adaptation to the college experience. Grading is based on class participation and written assignments.", "other": ["First-Year Seminar"]}, {"course_name": "VBSC 97: Special Topics", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "VBSC 101: Careers in Veterinary Medicine and the Allied Professions", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1 Credits", "description": "Exploring career pathways in veterinary medicine and the allied health industry.  VB SC 101 Careers in Veterinary Medicine and the Allied Professions (1) The course is intended for first year students with an interest in careers in veterinary medicine or in the allied industries. Upon completion of the course students will have an understanding of the various careers possible in veterinary medicine; including types of specialization by species and/or by discipline. Students will have the opportunity to discuss careers in industries related to animal health and animal health research. Student learning will occur through the use of guest speakers, written assignments and on-line discussion groups. Student evaluation will be based on performance on assignments and on-line discussion groups."}, {"course_name": "VBSC 130: Understanding Human Disease", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "All humans are impacted by disease, either personally or through friends or family members who are affected. Understanding Human Disease is an overview of disease processes for individuals not majoring in a scientific field. Students will have the opportunity to study the basic knowledge tools required to understand how different diseases arise, how they progress, how they are treated and in many cases, how they can be prevented.The course material is divided into two segments: the first portion discussing the different ways that diseases develop and includes explanations on normal and abnormal inflammatory processes, different types of infectious diseases, genetic diseases and congenital abnormalities (birth defects), diseases that affect the immune system and metabolic diseases. Diseases that are affecting significant populations such as HIV, diabetes, cancer and heart disease will be discussed. The second segment includes a discussion of the significant diseases affecting different organ systems of the body. Student participation is encouraged through questions. Additional topics of immediate interest as identified by the news media or class interest will be discussed. The course is intended for those who wish to better understand published medical journalism, for individuals who want to be able to discern the caliber of medical information in the popular press, for those students who wish to make healthy choices in their lifestyle and for individuals who may not be destined for a career in a scientific field.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "VBSC 190: Careers in Veterinary and Biomedical Sciences", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1 Credits", "description": "Career strategic planning and opportunities for Veterinary and Biomedical Sciences."}, {"course_name": "VBSC 211: The Immune System and Disease", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Introduction to the immune system that emphasizes the immune response to infection and consequences of a defective immune response.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "VBSC 230: The Science of Poisons", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "An introduction to toxicology using real world examples to highlight the impact of toxicants on environmental, biochemical and physiological processes.  VB SC 230 The Science of Poisons (3) Toxicology is the study of poisons (natural and man-made) and how these agents adversely affect living organisms. It involves the prevention of harm and the development of measures to assess risk. As a science it borrows from many disciplines including biochemistry, chemistry, epidemiology, genetics, and physiology. It also has great societal impact with regard to the development and testing of consumer products, exposure to industrial chemicals, and maintaining safe food and water. The course format will be lectures that incorporate real world examples of the effects of toxicant exposure on many levels (cell, organ, whole body, environmental). Students will be evaluated by quizzes,exams, and class participation. Students are required to have a basic understanding of biology and chemistry. The course is offered once per year in the Fall semester.", "prerequisite": "CHEM 110"}, {"course_name": "VBSC 231: Introduction to Cancer Research and Medicine", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "An understanding of the terminology, basic concepts, techniques, multidisciplinary approaches and challenges in cancer research and medicine.  VB SC 231 Introduction to Cancer Research and Medicine (3) Introduction to Cancer Research and medicine is designed for second year undergraduate students preparing for careers in biomedical research. Students will develop an understanding of the theories, scope, approaches and challenges of cancer related biomedical research. The lectures and discussions will emphasize the interdisciplinary character of the discovery process. Students will be introduced to topics on cellular mechanisms responsible for cancer development and progression; techniques in cancer research involving generation and banking of research materials, and methods for performing molecular, genomic and proteomic analyses; approaches for discovery and validation of diagnostic and prognostic biomarkers as well as systems for high through put screening of targets for rational development of interventional therapeutics. Student evaluation will be based on performance on examinations and class participation.", "prerequisite": "BIOL 110"}, {"course_name": "VBSC 280: Current Issues in Veterinary Medicine", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "2 Credits", "description": "Discussion of the social, ethical and economic aspects of current and emerging issues related to animal ownership and veterinary medicine.  V B SC 280 Current Issues in Veterinary Medicine (2)Current Issues in Veterinary Medicine is designed to provide students with the opportunity to research, present and discuss the social, ethical and economic issues important in Veterinary Medicine. Students will be expected to research the literature on specific topics within the general area of discussion, prepare and deliver an in class presentation and discuss their findings. Students are evaluated on class presentations and on three written position papers during the semester. The course is offered every spring semester."}, {"course_name": "VBSC 290: Undergraduate Research Colloquium", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1 Credits", "description": "Presentations by appropriate faculty on research opportunities for undergraduates.  VB SC 290H Undergraduate Research Colloquium (1) The goal of the course is for students to acquire the skills necessary to obtain an independent research project of the scope and scale required to complete an Honors Thesis. Students will learn to use online tools to approach primary literature in order to familiarize themselves with faculty research topics. Department faculty will present overviews of their research programs, including potential opportunities for undergraduate projects. First year honors students in the Veterinary and Biomedical Sciences, Immunology and Infectious Disease, and Toxicology majors should take this course in their second semester. Other interested students may take the course with department approval.", "prerequisite": "permission of program", "other": ["Honors"]}, {"course_name": "VBSC 297: Special Topics", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "VBSC 331: Pharmacology I: Drug Actions and Reactions", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "This course teaches the general principles of pharmacology and mechanisms of drug action. The objectives of this course include: Explain fundamental principles of drug action, including how drugs affect the body and how the body affects drugs; Map a drug's path in the body based on route of administration; Explain factors contributing to varied drug response among a population; Describe the mechanism of action, general effect(s), and therapeutic use(s) for major drug classes, and ; Apply pharmacological principles in discussing novel or emerging therapeutic strategies. This course is designed for those interested in becoming health care professionals in the fields of medicine, nursing and pharmacy, as well as those interested in basic scientific research and biotechnology.", "prerequisite": "BIOL 230W"}, {"course_name": "VBSC 340: Introduction to Human and Veterinary Public Health", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "This course introduces students to the history of human and veterinary public health, the structure of the human and veterinary public health system (CDC, FDA, and USDA) and the various sectors of veterinary and human public health practice, in order to gain an understanding of the complex factors that determine the health status of a human and animal populations. National, state, and local level practices will be analyzed, as well as the roles that law and government play in human and veterinary public's health. The course will simulate the students' interest in other public health course and program offerings."}, {"course_name": "VBSC 395: Internship", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1-10 Credits/Maximum of 10", "description": "Independent study and supervised field experience related to the student's professional interest. Limited to students in animal agriculture majors.", "prerequisite": "fifth-semester standing in an animal agriculture major;   approval by department of proposed plan before registration", "other": ["Full-Time Equivalent Course"]}, {"course_name": "VBSC 402W: Biology of Animal Parasites", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits/Maximum of 3", "description": "An introduction to animal parasitology. Emphasis placed on host/parasite interactions, parasites of zoonotic importance, control programs and taxonomy.  VB SC 402W Biology of Animal Parasites (3) This course provides students an opportunity to obtain an introduction to the field of animal parasitology. Material presented emphasizes life cycle patterns of animal parasites, host-parasite interactions and pathology, disease patterns and zoonotic potential of parasites to human disease, economic importance of parasitic diseases, taxonomy and parasite control programs. Information presented in this course will be useful to students interested in pursuing a career in veterinary medicine or careers dealing with animal care and management. Evaluation of student performance is achieved by 6 quizzes, three examinations and 3 writing assignments. The course is offered each spring semester with an enrollment of 15 to 25 students.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: ENT 402W", "Writing Across the Curriculum"]}, {"course_name": "VBSC 403: Principles of Animal Disease Control", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Principles of disease control based on knowledge of the multiple causes of animal disease.", "prerequisite": "MICRB106 or MICRB201 . Prerequisite or concurrent: AN SC301"}, {"course_name": "VBSC 403H: Principles of Animal Disease Control", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Principles of disease control based on knowledge of the epidemiology of animal disease.  VB SC 403H Principles of Animal Disease Control (3) Animal Health and well being has emerged as a clear concern of society. The general public is concerned about the health and well-being of their companion animals as well as the animals that provide them with portions of their daily diet. The Foot and Mouth Disease outbreak that occurred in Great Britain in the spring of 2001 coming on the heels of increased concern about Bovine Spongiform Encephalopathy and its possible links to the human disease; variant Creutzfeldt Jacob Disease, resulted in an increased awareness for the potential for animal disease to have adverse effects on society. These effects range from availability of wholesome food products to the zoonotic transmission of diseases between humans and animals.The goal of this course is to introduce students to the principles of animal disease prevention. This requires the student recall relevant background knowledge in biology, nutrition, microbiology and animal husbandry and management. Students will develop an understanding of the complex physiological, biochemical and microbiological mechanisms of importance to the maintenance of health and the prevention of disease.Examples of certain diseases are used to illustrate the application of general principles of disease control. Diseases of world wide importance as discussed in addition to the major diseases of importance to Pennsylvania animal owners. Collectively, the course material should provide animal owners, managers and future animal health professionals with the background to improve the decision making process required to maintain animal health and prevent losses from disease. The inherent, environmental and special factors involved in the maintenance of health and the prevention of disease will be emphasized.", "prerequisite": "MICRB106 or MICRB201 . Prerequisite or concurrent: AN SC301"}, {"course_name": "VBSC 405: Laboratory Animal Science", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Principles involved in maintaining laboratory animals. Emphasis is on management, preventive medicine, and surgical considerations used in laboratory animal colonies.  VB SC 405 Laboratory Animal Science (3)This course in Laboratory Animal Science introduces students to the biology and characteristics of a variety of laboratory animal species, explores the care and use of animals in various research environments and examines ethical/legal issues pertaining to the use of animals in research and teaching. The laboratory section reinforces topics discussed in lecture and provides an opportunity for students to learn basic animal handling techniques in a safe and professionally supervised environment. Students work with live laboratory animals including mice, rats, hamsters, guinea pigs, and rabbits. They learn handling techniques, administration techniques (such as by injection), and sample collection techniques (such as blood collection). They also learn surgical principles and perform a surgical procedure using aseptic technique. The Laboratory Animal Science course appeals to and benefits several general groups of students. Those who plan to pursue careers involving animal research such as in academia or industry receive a broad foundation in the field of laboratory animal science as well as an introduction to techniques commonly employed when handling animals. Those pursuing careers involving veterinary medicine or veterinary technology receive training and the opportunity to develop clinical/technical skills focused on a unique group of species. Students that are undecided in their career choice find that the field of laboratory animal science holds many opportunities for those with animal knowledge, handling skills and an understanding of the societal issues surrounding the use of animals in research.", "prerequisite": "BIOL 110"}, {"course_name": "VBSC 407: Ruminant Herd Health Management", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "The course will provide students with basic and foundational knowledge regarding herd health programs in ruminant production systems. The student will explore crucial areas of managing production systems such as implementation and development of standard operating procedures (SOPs) and protocols and biosecurity programs for common diseases that threaten the sustainability of the human food supply worldwide, such as Brucellosis and Tuberculosis. Furthermore, the student will explore important concepts regarding diagnosis, treatment, management and prevention of ruminant diseases in an organized manner, moving from younger to older animals, and following them through their production cycle. In addition, the course will integrate on-farm field data collection with farm record analysis to provide students with critical thinking skills for troubleshooting a variety of health issues in production systems. Students enrolling in this course must possess basic information regarding animal biology and farm management. The information provided in this course will complement several courses regarding cattle operation management and prevention of diseases in production animals.", "prerequisite": "ANSC 308"}, {"course_name": "VBSC 409: Wildlife Diseases", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "The purpose of this course is to provide students with an appreciation of the changing role of wildlife diseases as they relate to wild vertebrate species. The student will learn disease terminology and mechanisms, wildlife disease information resources, selected diseases of historic and current importance for the major Taxa, legal aspects of wildlife diseases, the opportunities for careers in wildlife disease investigation, and scientific writing as it relates to wildlife disease. In particular, the student will gain detailed knowledge of the ecology of diseases that affect wildlife species as well as domestic animals and humans, wildlife diseases with zoonotic potential, those having a significant economic impact on humans, and those which may threaten species survival.", "prerequisite": "BIOL 110"}, {"course_name": "VBSC 410: Principles of Immunology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "The MICRB 410 / VBSC 410 Theories of immunity (3cr.) course provides a basic foundation in immunology with a focus on the progression from antigen recognition and innate immune responses to the development of acquired immunity. During the course, students will have the opportunity to learn about key topics that lead to an understanding of the how the human immune system functions. Such topics include the primary cells and anatomical sites of the immune system as well as the activation and processes of innate immunity. In addition, students will learn about the organization and generation of lymphocyte antigen receptors, major histocompatibility complexes, and antigen presentation. Topics will also be presented that allow students to build an understanding of how antigen recognition and presentation leads to the development, selection, and survival of B and T lymphocytes. T-cell mediated immunity, humoral immunity, and the dynamics of the immune response will also be discussed in depth. Topics such as the immunobiology of allergy, transplantation, autoimmunity, immunodeficiency, diseases, vaccines, and/or cancer will also be presented in order to help students build an understanding of the interplay between the immune system and health and disease will be discussed throughout the semester.", "prerequisite": "MICRB 201"}, {"course_name": "VBSC 418: Bacterial Pathogenesis", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "2 Credits", "description": "Study of molecular interactions between bacterial pathogens and their hosts.", "prerequisite": "MICRB201 , MICRB410"}, {"course_name": "VBSC 420: General Animal Pathology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "This is a lecture-based course that will incorporate pictures and photomicrographs of gross and histologic lesions. This course primarily emphasizes the fundamental mechanisms of disease at the molecular, cellular, and tissue level, with less emphasis on the gross and clinical manifestations of disease. Students are expected to attend class and participate in class discussion. Specific subjects that will be presented include cellular injury and death, inflammation, blood coagulation, hemodynamic disorders, diseases of immunity, cellular adaptation, neoplasia, microbial mechanisms of disease, introduction to gross pathology, and pathology in practice. This course utilizes knowledge previously attained from courses in biology, microbiology, and immunology.", "prerequisite": "VBSC 211"}, {"course_name": "VBSC 421: Comparative Anatomy of Vertebrates", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "4 Credits", "description": "BIOL 421 / VBSC 421 Comparative Anatomy of Vertebrates Students will study vertebrate anatomy from an evolutionary and developmental perspective. They will become familiar with important structures, terminology and function; a basic requirement of the biomedical sciences. Comparisons between representative vertebrate groups (including fish, amphibians, reptiles, birds and mammals) will be used to illustrate structural adaptations of each organ system from an evolutionary perspective. Specific examples comparing ancestral and descendant species will demonstrate the relationships between the lifestyle of an organism and the morphology of homologous structures. A study of early embryonic development, differentiation of primary germ layers and organ formation will provide a basis for understanding organ structure and function. Laboratory activities will involve work with preserved specimens and will focus heavily on anatomic structure identification and function. Topics include anatomic directional terminology, vertebrate classification systems, early embryonic development and a detailed examination of the various organ systems. Specimens are selected to illustrate the anatomy of ancestral vertebrate species, the evolutionary changes observed in descendant species and the association of morphology with lifestyle. Although students will invest the majority of their time becoming familiar with the anatomy of a representative mammal (the cat), multiple species will be examined, and students will be expected to recognize selected anatomic structures in each species studied.", "prerequisite": "BIOL 129", "other": ["Cross-listed with: BIOL 421"]}, {"course_name": "VBSC 423W: Pathology of Nutritional and Metabolic Diseases", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Overview of nutritional and metabolic diseases of animals integrating concepts from biochemical and physiologic abberrations to clinical applications.  VB SC 423W Pathology of Nutritional and Metabolic Diseases (3)Nutrition plays a critical role in health, disease and convalescence of man and animals. Understanding the role of nutrition in disease pathogenesis, recovery and prevention requires an integration of biochemical and physiologic sciences and clinical practice. The intent of this course is to help the student integrate their knowledge from various basic science disciplines to real-world clinical issues related to the role of nutrition in disease pathogenesis, management and prevention across various animal species. Common nutrition and metabolic disease of production and companion animals will be used to demonstrate various principles of disease pathogenesis from a biochemical to whole animal basis. Deficiency and toxicity diseases of all essential nutrients will be addressed. In addition, a secondary role of nutrition in disease susceptibility and recovery mediated through immunologic and physiologic processes will be highlighted. In completing the course, students will have an understanding of comparative gastrointestinal anatomy and how this influences essential nutrients required and unique nutritional disease conditions. Additionally, students will gain appreciation for clinical management of nutritional diseases from diagnosis to prevention. Course format will be lectures and case-based discussions. With the integrative approach to course content, students are required to have previous courses in biology, biochemistry and nutrition. The course can meet requirements for writing across the curriculum and satisfies 400-level course requirements for Animal Bioscience and Animal Science majors. Prerequisites fro the course include B M B 211 or B M B 401, and AN SC 301 or equivalent nutrition course.", "prerequisite": "B M B211 or B M B401 , AN SC301 or equivalent nutrition course", "other": ["Writing Across the Curriculum"]}, {"course_name": "VBSC 425: Principles of Avian Diseases", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Principles of pathogenesis and control of diseases in poultry and other avian populations.  Case material used where appropriate.  ANSC 425 / VBSC 425 Principles of Avian Diseases (3) This course discusses the major diseases of domestic poultry, with etiology, prevention, and treatment reviewed on each disease. Since many of these diseases also affect wild birds and pet birds these are also reviewed. Lastly, avian disease with zoonotic (human public health) potential are also discussed in the course. This course is required by those seeking a poultry minor.Previous coursework in pathogenic microbiology is beneficial.", "prerequisite": "MICRB 106", "other": ["Cross-listed with: ANSC 425"]}, {"course_name": "VBSC 430: Principles of Toxicology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Introduction to the biomedical aspects of toxicology with emphasis on the mechanisms and fate of chemical interaction with biological systems.", "prerequisite": "BIOL 110"}, {"course_name": "VBSC 431: Environmental Toxicology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Effects of pollutants on animal health at the chemical, physical, and cellular level.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: ERM 431"]}, {"course_name": "VBSC 432: Advanced Immunology: Signaling in the Immune System", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "The study of signaling pathways that regulate the immune response. BMB 432 / MICRB 432 / VBSC 432 Advanced Immunology: Signaling in the Immune System (3)This course will use the immune system as a model in which to study how cells communicate in order to coordinate an immune response. We will focus on signaling mechanisms that regulate such immune responses as T cell activation, Thl/Th2 differentiation, macrophage activation, and migration of immune cells to sites of inflammation. All lectures are based on recent reviews by key investigators in each field, as well as primary articles to present students with the most recent advances, techniques, and approaches used. The goal of the course will be to convey a basis understanding of intracellular signaling mechanisms that will pertain to all areas of biology, an appreciation for current questions and future directions in the field, and an in depth understanding of the signals that govern immune responses. The material presented will build on the basic concepts learned in BMB 400 and MICRB 410, and will lay the foundation for more advanced courses at the graduate level.", "prerequisite": "BMB 251", "other": ["Cross-listed with: BMB 432, MICRB 432"]}, {"course_name": "VBSC 433: Molecular and Cellular Toxicology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "In-depth coverage of processes by which drugs/chemicals interact with biological systems and the experimental approaches used to study these interactions.", "prerequisite": "BMB 401", "other": ["Cross-listed with: BMB 433"]}, {"course_name": "VBSC 435: Viral Pathogensis", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Viral Pathogenesis provides students with a general knowledge of medically relevant viruses, with a specific focus on important human viral pathogens. The course is meant to help students understand how viruses cause diseases in humans and animals. Lectures and in-class discussions will focus both on the fundamentals of viral infection and disease mechanisms, and on contemporary virology-related topics in the scientific literature. Topics discussed can be divided into two main areas: (1) general concepts related to viral pathogenesis and the control of viral infections; and (2) specific viruses that cause human disease including HIV-1, herpes viruses, papillomaviruses, influenza virus, West Nile virus, Ebola virus, and SARS virus. Although prior knowledge of virology is not required for taking this course, a working knowledge of molecular biology, cell biology, immunology, and some microbiology is helpful.", "prerequisite": "MICRB 201", "other": ["Cross-listed with: BMB 435, MICRB 435"]}, {"course_name": "VBSC 438: Introduction to Molecular Pharmacology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Upon completion of this course the student will be able to correlate their knowledge of basic and organic chemistry, biochemistry and physiology to the understanding of drug actions. The molecular interactions between drugs and their tissue receptors and possible modifications of drugs to target different receptors will be discussed. Drugs used to treat infectious disease, treat cardiovascular disease, modulate the immune system, and treat cancer will be examined for their molecular interactions. Students will understand the complexities of new drug design and development from the initial stages of laboratory development to final approval for use by the Food and Drug Administration.", "prerequisite": "CHEM 202"}, {"course_name": "VBSC 439: Mucosal Immunology and the microbiome", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Mucosal tissues are gateways into the body. Because of their direct interaction with the environment, a specialized immune response is needed. Unlike the systemic immune system, which functions in a sterile environment inside the body, mucosal immune responses must be able to discriminate between harmful pathogens and benign stimuli like commensal organisms and food. The emphasis of this course is to understand the unique properties of the mucosal immune system. This course will build on the general understanding of immunology presented in MICRB410 and provide a detailed discussion of the symbiotic relationship between the microbiome and the development and function of the mucosal immune system. The effects of disruptions in the microbiome and the effects on disease will also be a major theme of the course. The course will include lecture and discussion of the topics presented in the textbook. In addition, articles from the primary literature will be presented and discussed. These articles will also provide an experimental framework for understanding the mucosal immune system. The topics presented here will provide a greater understanding of mucosal immunology and its interactions with the microbiome for students majoring in Immunology and Infectious Disease, Veterinary and Biomedical Sciences, Animal Science, Biochemistry and Molecular Biology, Biology, Microbiology, Food Science and Nutrition. The course would also be appropriate for Graduate students seeking more information about mucosal immune responses.", "prerequisite": "MICRB 410"}, {"course_name": "VBSC 444: Epidemiology of Infectious Diseases", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Overall, the emphasis of this course will be on the core epidemiologic concepts of infectious diseases. Epidemiology is the study of how health and diseases are distributed in populations and the factors that influence or determine this distribution. Infectious disease epidemiology monitors the occurrence of diseases and develops strategies for preventing and controlling disease. In addition to understanding basic epidemiological methods, the course will provide an introduction to infectious disease epidemiology. It will focus on tools and epidemiological methods used for identifying, preventing and controlling infectious disease problems and present a review of epidemiology of many major infectious diseases. The lectures and discussions are designed to provide theoretical and practical framework and principles of infectious disease epidemiology to prepare students majoring in biology, pathobiology, animal science, food science, molecular biology and human nutrition to face the infectious diseases challenge in real world.", "prerequisite": "BIOL 110"}, {"course_name": "VBSC 445: Molecular Epidemiology of Infectious Diseases", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "A discussion and practicum of the molecular laboratory techniques used to study molecular epidemiology of infectious diseases.", "prerequisite": "STAT 200"}, {"course_name": "VBSC 448W: Current Topics in Immunology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "Study of current approaches and questions driving research in immunology and infectious diseases.", "prerequisite": "MICRB410 , B M B400", "other": ["Writing Across the Curriculum"]}, {"course_name": "VBSC 450: Medical Entomology", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits/Maximum of 3", "description": "Transmission of human and animal pathogens by insects, mites and ticks, including emergent pathogens, envenomization, and forensic entomology. This course presents principles of transmission of human and animal pathogens  by insects, mites and ticks. Non-transmission based aspects of medically important arthropods such as envenomization, forensic entomology and genomics will be discussed also. Basic arthropod biology with special attention to biological properties of vectors and their interactions with pathogens will be presented. We will cover basic components of arbopathogen disease cycles and principles of pathogen transmission dynamics. The major groups of arthropod--borne pathogens and vectors will be discussed. Special topics will include  emergent pathogens, vector genetics, traditional and modern disease control strategies and venomous arthropods.", "prerequisite": "ENT 313"}, {"course_name": "VBSC 451: Immunotoxicology of Drugs and Chemicals", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "An in depth discussion of the effect of xenobiotics and drugs on host immune mechanisms.  VB SC 451 Immunotoxicology of Drugs and Chemicals (3) Maintaining good health is a priority for most of us, and a key element in staying healthy is a properly functioning immune system. However, we are constantly exposed to a barrage of chemicals in the environment both natural and man-made. Some of the key questions asked included: 1) do environmental chemicals affect the generation of immunity?, 2) is our environment to blame for bad health? , and 3) can natural compounds cause immunotoxicity? These questions and more will be addressed in Immunotoxicology. This course will focus primarily on the effects of chemicals in the environment but will also cover the impact of other factors such as therapeutics, recreational drugs, and dietary factors on the immune system. Immunomodulatory mechanisms will be examined at systemic, cellular and molecular levels. Discussions will include theory, principles, and methodology and key issues in immunotoxicity, host immune mechanisms, and tumorigenesis. Key issues in regulatory immunotoxicology will be discussed to make students prepared for jobs in Federal Regulatory Agencies. Grading for undergraduates will include midterm and finals, and class participation; while graduate students will be required to also write a short, immunotoxicologically-related research proposal. Our intent is to provide a bridge between the two sciences and the undergraduate majors of Immunology and Toxicology, with an introduction to the basic mechanisms by which environmental, occupational, and therapeutic agents may interfere with immunologic systems. Immunotoxicology is offered every fall semester and is designed for undergraduate students from toxicology, immunology, and forensic science majors.", "prerequisite": "MICRB201 or B M B251"}, {"course_name": "VBSC 455: One Health", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "This course addresses the challenges and opportunities at the convergence of One Health/public health, animal health, and environmental/ecosystem health. This interdisciplinary course will introduce the concept of One Health as an increasingly important approach to a holistic understanding of disease prevention and the maintenance of human and animal health. The list of topics will include lectures that emphasize the bidirectional impact of animal health on human health, the impact of the earth's changing ecology on health, issues of food and water security and preparedness and the benefits of comparative medicine. The course will also explore short and long term approaches to address the problems that emerge from growing interaction between human and animal populations driven by growth in the human population, new trends in animal production practices, industrial pollution, changing patterns of wildlife populations, human intrusion on new ecosystems, and trans-border mobility of humans, animals, and food.", "prerequisite": "VBSC 340"}, {"course_name": "VBSC 456: Case Studies in Global One Health", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "The lectures will cover a variety of topics ranging from measures of health and disease in populations through events occurring in globalization of health. Students will do class presentations of case studies based on evidence-based reports that justify and elaborate upon the major one-health efforts that can and have changed the health status of millions of people globally. The case studies will cover key aspects of One Health including assessment, policy development and quality assurance on one-health programs. The case studies will reveal the magnitude and understanding of current health challenges facing the world. The case studies will show how countries with minimal financial resources and limited health infrastructure, through sensible and systematic efforts have improved the health of their people. Through these case studies, the students will learn to identify critical factors that have contributed to successes as well as failures of various institutions and initiatives intended to address one-health issues.", "prerequisite": "VBSC 455"}, {"course_name": "VBSC 485: Human Genomics and Biomedical Informatics", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "3 Credits", "description": "The purpose of this course is to introduce students to the field of Human Genomics and Biomedical Informatics, in particular in the context of genetic architecture of complex human diseases and traits. The field of Human Genomics has experienced a massive explosion in data generation technologies, new discoveries, and increasing popularity in many scientific fields. This course will cover the molecular, statistical, population, and analytical aspects of modern human genomics and translational aspects of this field in biomedical informatics. Current methods to uncover the complex underpinnings of disease including methods to explore gene-gene and gene-environment interactions and data integration will also be covered.", "prerequisite": "BIOL 322", "other": ["Cross-listed with: BMB 485"]}, {"course_name": "VBSC 494: Honors Thesis", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by a faculty supervisor that culminates in the production of a Veterinary and Biomedical Sciences honors thesis.", "prerequisite": "junior or senior status in the Schreyer Honors College and   permission of the Veterinary and Biomedical Sciences honors   advisor", "other": ["Honors"]}, {"course_name": "VBSC 496: Independent Studies", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "VBSC 497: Special Topics", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "VBSC 499: Foreign Studies", "department": "Veterinary and Biomedical Sciences (VBSC)", "credits": "0.5-4 Credits/Maximum of 10", "description": "Courses offered in foreign countries by individual or group instruction."}]