[{"course_name": "WILDL 101: Introduction to Wildlife Management", "department": "Wildlife (WILDL)", "credits": "3 Credits", "description": "Basic principles of wildlife management. Introduction to general ecology and wildlife population dynamics."}, {"course_name": "WILDL 103: Animal Identification", "department": "Wildlife (WILDL)", "credits": "4 Credits/Maximum of 4", "description": "Identification of mammals, birds, reptiles, and amphibians; introduction to their life histories."}, {"course_name": "WILDL 106: Wildlife Management Techniques", "department": "Wildlife (WILDL)", "credits": "4 Credits", "description": "This course is an overview of laboratory and field techniques for wildlife and natural resource research and management. The first third of the course prepares students to become proficient in land navigation by emphasizing topographical map, compass and Global Positioning System (GPS) use and basic surveying techniques and measurements. The second third of the course covers urban and suburban wildlife management, including techniques for encouraging native wildlife and discouraging human-wildlife conflict. The final third of the course addresses mark and recapture techniques, censusing methods and population estimation, and wildlife telemetry methods. In-field data collection, data entry, and management are emphasized throughout the course. This course satisfies the DuBois campus first year engagement (FYE) by introducing the student to campus, University, and professional resources.", "other": ["First-Year Seminar"]}, {"course_name": "WILDL 106T: Wildlife Management Techniques (Honors)", "department": "Wildlife (WILDL)", "credits": "4 Credits", "description": "This course is an overview of laboratory and field techniques for wildlife and natural resource research and management. The first third of the course prepares students to become proficient in land navigation by emphasizing topographical map, compass and Global Positioning System (GPS) use and basic surveying techniques and measurements. The second third of the course covers urban and suburban wildlife management, including techniques for encouraging native wildlife and discouraging human-wildlife conflict. The final third of the course addresses mark and recapture techniques, censusing methods and population estimation, and wildlife telemetry methods. In-field data collection, data entry, and management are emphasized throughout the course. This course satisfies the DuBois campus first year engagement (FYE) by introducing the student to campus, University, and professional resources. The honors section of the course includes an in-depth exploration of a survey technique or method or additional field experience(s). The activities for the honors section vary by semester and are related to the interests of the students enrolled in the course. Previous activities have included participating in a night-time owl playback survey and generating transects for a deer pellet count.", "other": ["First-Year Seminar", "Honors"]}, {"course_name": "WILDL 204: Wildlife Mensuration", "department": "Wildlife (WILDL)", "credits": "4 Credits", "description": "Estimation and analysis of animal populations and their habitats, including sampling considerations and basic biometry.", "prerequisite": "3 credits in mathematics"}, {"course_name": "WILDL 207: Outdoor Recreation", "department": "Wildlife (WILDL)", "credits": "3 Credits", "description": "Sociology, history, and economics of recreational demand; recreational areas and management procedures."}, {"course_name": "WILDL 208M: Terrestrial Wildlife Management (Honors)", "department": "Wildlife (WILDL)", "credits": "3 Credits", "description": "Ecological characteristics and manipulation of terrestrial habitats; control of wildlife populations. This course provides an overview of ecological characteristics of terrestrial habitats and the influence of those characteristics on wildlife populations. Course goals include (1) acquisition of knowledge related to how wildlife (at the individual and population level) interact with and are influenced by changes in their environment, (2) application of management and survey techniques (emphasized in the laboratory component of course), (3) understanding the application of techniques and principles learned in this class and others to wildlife management scenarios at the local, state, federal, and international level, (4) acquisition of critical thinking, reading, writing, and research skills, and (5) collecting and organizing data and presenting it in a professional format.Writing, editing, and peer review are emphasized. The honors section of the course includes an in-depth exploration of a survey technique or method or additional field experience(s). The activities for the honors section vary by semester and are related to the interests of the students enrolled in the course. Previous activities have included additional bird banding opportunities, a trip to a local workshop on disease, and preliminary analysis of saw-whet owl banding data.", "prerequisite": "FORT 150", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "WILDL 208W: Terrestrial Wildlife Management", "department": "Wildlife (WILDL)", "credits": "3 Credits", "description": "This course provides an overview of ecological characteristics of terrestrial habitats and the influence of those characteristics on wildlife populations. Course goals include (1) acquisition of knowledge related to how wildlife (at the individual and population level) interact with and are influenced by changes in their environment, (2) application of management and survey techniques (emphasized in the laboratory component of course), (3) understanding the application of techniques and principles learned in this class and others to wildlife management scenarios at the local, state, federal, and international level, (4) acquisition of critical thinking, reading, writing, and research skills, and (5) collecting and organizing data and presenting it in a professional format. Writing, editing, and peer review are emphasized.", "prerequisite": "FORT 150", "other": ["Writing Across the Curriculum"]}, {"course_name": "WILDL 209: Animal Handling and Care", "department": "Wildlife (WILDL)", "credits": "4 Credits", "description": "Techniques in capturing, marking, and maintaining wild animals in captivity. Wildlife physiology, parasitology, and necropsy procedures are covered.", "prerequisite": "WILDL101"}, {"course_name": "WILDL 211: GIS and Aerial Photo Interpretation in Wildlife Management", "department": "Wildlife (WILDL)", "credits": "4 Credits/Maximum of 4", "description": "Use of Geographic Information Systems and aerial photo technology with applications in wildlife management and natural resources."}, {"course_name": "WILDL 213: Wetlands and Fisheries Management", "department": "Wildlife (WILDL)", "credits": "4 Credits", "description": "Introduction to basic limnology. Ecology and management of swamp, marsh, pond, and stream habitats and their animal populations.", "prerequisite": "WILDL 101"}, {"course_name": "WILDL 295: Internship in Wildlife Technology", "department": "Wildlife (WILDL)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised off-campus field experience related to student's major.", "prerequisite": "prior approval of proposed assignment by instructor."}, {"course_name": "WILDL 296: Independent Studies", "department": "Wildlife (WILDL)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "WILDL 297: Special Topics", "department": "Wildlife (WILDL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]