[{"course_name": "WLED 300: Foundations of Second Language Teaching", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Critical understanding of basic concepts and principles in second language acquisition and teaching. WLED 300 Foundations of Second Language Teaching (3)This course is designed to give prospective World Languages teachers a critical understanding of basic concepts and principles in, first and second language acquisition and teaching. The core of the course explicates processes of language acquisition viewed from major theories of first and second language acquisition and common issues within these major theories are presented and debated. This course should be taken concurrently with WLED 295A (Early Field Experience for World Languages Teacher preparation). Using the field experience component, students will be able to critically examine language teaching methodologies derived and implied from first and second language acquisition theories and to apply them while in their field experience. This course requires participating in the field experience component, group-reflections and self-critique as well as to complete the required readings, and to develop a professional growth portfolio including the four domains stated in the Penn State model of Teacher Preparation (planning and preparing for student learning; teaching; inquiring and analyzing learning and teaching- and professionalism). This course should be taken concurrently with the Early Field Experience for World Languages Teacher Preparation (WLED 295A)."}, {"course_name": "WLED 399A: Language Learning Through Study Abroad", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Use of online technologies during study abroad to promote language and culture learning and to consider implications for teaching.", "prerequisite": "WL ED300"}, {"course_name": "WLED 400: Foundations of Language in Second Language Teaching", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Critical understanding of basic concepts and principles in second language acquisition and teaching. WLED 400 Foundations of Language in Second Language Teaching (3)This is an advanced course designed for practicing classroom teachers who want to further their knowledge of language acquisition/language teaching. It provides a critical understanding of basic concepts and principles in first and second language acquisition and teaching. The core of the course explicates processes of language acquisition viewed from major theories of first and second language acquisition and common issues within these major theories are presented and debated. Using their classroom experiences, students will be able to critically examine language teaching methodologies derived and implied from first and second language acquisition theories and to apply them in their classrooms. This course requires active participation, group-reflections and self-critique, and completion of required readings; 20-30 hours of volunteer work in an ESL setting; and development of a professional growth portfolio including the four domains stated in the Penn State Model of Teacher Preparation (planning and preparing for student learning; teaching; inquiring and analyzing learning and teaching; and professionalism) and the competencies for English Usage and Developing Linguistic Awareness stated by the Pennsylvania Department of Education.", "prerequisite": "Second semester standing"}, {"course_name": "WLED 411: Methods of Teaching World Languages in Grades 1-5", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Exploration of the complexity of teaching World Languages and development of curricular designs for teaching in grades 1-5 schools. WLED 411 Methods for Teaching World Languages in Grades 1-5 In this course prospective World Languages teachers will engage in a variety of theoretical, pedagogical and reflective events to explore the complex nature of language learning/teaching including (1) individual beliefs and knowledges, (2) issues related to language/power, (3) language/cultural diversity, and (4) development of curricular designs for teaching World Languages in grades 1 - 5. This course will be conducted in a workshop style. It will have three parallel strands: (a) we will review together basic concepts and principles of language learning/teaching through readings, class discussions and presentations; (b) make connections between the readings and the L2 experience in the Practicum-World Languages Teaching in grades 1-5 (WLED 495B); and (c) as a group, the class will design thematic units, class plans, activities and didactic materials.", "prerequisite": "EDPSY014 , EDTHP115 , WL ED295A , WL ED300;  Concurrent:  WL ED495B"}, {"course_name": "WLED 412M: Methods of Teaching World Languages in Grades 6-12", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Exploring the complexity of teaching World Languages and development of curricular designs for teaching World Languages in grades 6-12.  WL ED 412W Methods of Teaching World Languages in Grades 6-12 (3)The purpose of this course is to help students develop a principled approach to designing and implementing lessons in their World Language classroom. Specifically, students will work towards an understanding of the processes of developing abilities in a second language that acknowledges a range of theories and associated methods but that is also situated within a particular theoretical framework of language and language learning. In this way, students will be better positioned to make the myriad instructional decisions they will face in middle school and high school contexts, ranging from materials development to lesson planning and classroom management to assessment. This is a writing-intensive course. Students will engage in a variety of formal and informal writing activities both in and out of class. Taken together, these activities function to enhance students' abilities as both producers and consumers of a range of texts relevant to their teaching practice. In addition, writing is understood to be a process integral to the fulfillment of each of the course goals.", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "WLED 412W: Methods of Teaching World Languages in Grades 6-12", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Exploring the complexity of teaching World Languages and development of curricular designs for teaching World Languages in grades 6-12. WLED 412 Methods of Teaching World Languages in Grades 6-12 (3)The purpose of this course is to help students develop a principled approach to designing and implementing lessons in their World Language classroom. Specifically, students will work towards an understanding of the processes of developing abilities in a second language that acknowledges a range of theories and associated methods but that is also situated within a particular theoretical framework of language and language learning. In this way, students will be better positioned to make the myriad instructional decisions they will face in middle school and high school contexts, ranging from materials development to lesson planning and classroom management to assessment. This is a writing-intensive course. Students will engage in a variety of formal and informal writing activities both in and out of class. Taken together, these activities function to enhance students' abilities as both producers and consumers of a range of texts relevant to their teaching practice. In addition, writing is understood to be a process integral to the fulfillment of each of the course goals.", "other": ["Writing Across the Curriculum"]}, {"course_name": "WLED 444: Language, Culture and the Classroom: Issues for Practitioners", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Critical understanding of cultural linguistic diversity to facilitate the inclusion of English Language Learners in a globalized classroom.  CIED 444 WLED 444 Language, Culture and the Classroom: Issues for Practitioners (3) In this course we will focus on the issues of power raised by the use of Standard English as the school language while in its grounds there are an increasing number of students who are using more than one language/dialect to communicate. We will also discuss how language mutates into an exceptional hegemonic/counterhegemonic device central to the problematic regarding school socialization. Finally, we will critically understand teachers' and schools' roles in building a safe classroom where diversity of languages and cultures are welcome and encouraged.", "prerequisite": "WL ED300 or WL ED400", "other": ["Cross-listed with: CIED 444"]}, {"course_name": "WLED 483: Evaluating Schools Performances and Programs with English Language         Learners (ELLs)", "department": "World Languages Education (WLED)", "credits": "3 Credits", "description": "Using/adapting multiple techniques to asses English Language Learners (ELLs) language and other school subjects.  WL ED 483 Evaluating Schools Performances and Programs with English Language Learners (ELLs) (3) This course provides students with knowledge of a variety of assessment instruments to identify and monitor levels of second language and content proficiencies of English Language Learners (ELLs). Students will learn multiple assessment models used in English as a Second Language (ESL) programs. Students will establish connections between assessment and instruction for English Language Learners, as well as gain knowledge about services available, such as instructional support, multidisciplinary teams, and other assessment services for English Language Learners. This course requires active participation, group-reflections, discussions and activities as well as to develop a professional growth portfolio including the four domains stated in the Penn State model of Teacher Preparation (planning and preparing for student learning; teaching; inquiring and analyzing learning and teaching; and professionalism) and the competences for English Language Learners (ELLS) Language and Support Services Knowledge stated by the Pennsylvania Department of Education.", "prerequisite": "WL ED300 or WL ED400"}, {"course_name": "WLED 495: **SPECIAL TOPICS**", "department": "World Languages Education (WLED)", "credits": "3 Credits"}, {"course_name": "WLED 495B: Field Experience for World Languages Teacher Preparation in Grades 1-5", "department": "World Languages Education (WLED)", "credits": "3 Credits/Maximum of 3", "description": "WL ED 495B Field Experience for World Languages Teacher Preparation in Grades 1-5 (3) Practicum situation where Prospective World Language teachers will demonstrate acquired knowledge on second language learning/teaching and educational theories. Prospective World Language teachers will have assigned school placements and will attend a weekly seminar where issues in World Language learning and teaching will be discussed. At their assigned school placement, prospective World Language teachers will have many opportunities to observe/work with children in grades 1-5 (1) focusing on second language learning/teaching and the socio/cultural issues associated to classroom practices while implementing and self-evaluated own designed activities and lessons; (2) weekly seminars will engage students in reflective activities that will enable them to analyze each week's events; (3) inquiry projects on teaching and learning of World Languages.", "prerequisite": "EDPSY 14"}, {"course_name": "WLED 495C: Field Experience for World Languages Teacher Preparation in Grades 6-12", "department": "World Languages Education (WLED)", "credits": "3 Credits/Maximum of 3", "description": "WL ED 495C Field Experience for World Languages Teacher Preparation in Grades 6-12 (3) Practicum situation where prospective World Language teachers will demonstrate acquired knowledge on second language learning/teaching and educational theories. Prospective World Language teachers will have assigned school placements in grades 6-12 and will attend a weekly seminar where issues in World Language learning and teaching will be discussed. At their assigned school placement, prospective World Language teachers will have many opportunities to observe/work with students in grades 6-12 (1) focusing on second language learning/teaching and the socio/cultural issues associated to classroom practices while implementing and self-evaluating their own designed activities and lessons, (2) weekly seminars will engage students in reflective activities that will enable them to analyze each week's events, and (3) inquiry projects on teaching and learning of World Languages.", "prerequisite": "WLED 411"}]