[{"course_name": "WP 200W: Professional Careers in Forest Resources", "department": "Wood Products (WP)", "credits": "3 Credits", "description": "Introduction to managing forests for products and services to meet human needs; developing career goals and an academic plan.", "other": ["Writing Across the Curriculum"]}, {"course_name": "WP 203: Anatomical Properties of Wood", "department": "Wood Products (WP)", "credits": "1 Credits", "description": "Provide information on tree form/growth, cell wall formation/composition, structure of wood/bark cells; macroscopic/microscopic identification of hardwood/softwood cells.  W P 203 Anatomical Properties of Wood (1) The purpose of this course is to introduce students to the basic concepts of the anatomical properties of wood and bark cells. Students taking this class will learn: 1) basic information on tree form and growth 2)basic information on cell wall chemical composition, formation and structure 3) identification and differentiation of different hardwood and softwood cells. Course grade will be based on weekly quizzes. W P 203 is a foundation course for the wood products major and a basic information course for the forest science major. The course will be taken by students in the fall semester in their sophomore or junior year for Wood Products major and in the their sophomore, junior or senior year for the Forest Science major. This course provides essential background information for students in the Wood Products major. The information presented in this course will be needed for understanding advanced concepts present in 400-level courses. All wood products and forest science students will be required to take this course. It is listed as a prerequisite for most W P 400-level courses. The course is designed to provide information necessary for understanding advanced concepts presented in W P 400-level courses. Macroscopic and microscopic hardwood and softwood cell identification will be taught in a specialized laboratory made available by the School of Forest Resources."}, {"course_name": "WP 296: Independent Studies", "department": "Wood Products (WP)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "WP 297: Special Topics", "department": "Wood Products (WP)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WP 416: Wood Industries Management Development", "department": "Wood Products (WP)", "credits": "3 Credits", "description": "Managerial concepts and issues important to forest products organizations will help prepare students to assume management-level positions.  W P 416 Wood Industries Management Development (3) This course will introduce students to managerial concepts and issues important to wood products manufacturers. The design of the course is to help students think more critically about problems and issues that are directly related to efficiency and effectiveness within the wood-based industry, with an emphasis on utilizing human capital to increase competitive advantage. The overall goal of the course is to prepare students to assume management-level positions within wood-based businesses. Course content will be designed to meet the unique production environments our graduates will face. For example, managing an hourly workforce that is under-motivated with insufficient skills, in an environment that is often unpleasant and physically challenging. The course will include case studies from relevant industrial settings and will expose students to current managerial issues (i.e., via field trips to mills and guest lecturers from industry). Students will give oral presentations based on assigned readings from a best selling managerial book and will also be asked to complete numerous in-class and out-of-class exercises (e.g., learning styles inventory, conflict style assessment, to-do lists, resume, etc.).", "prerequisite": "W P  200W"}, {"course_name": "WP 495: Wood Products Internship", "department": "Wood Products (WP)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised field experience related to the student's major.", "prerequisite": "approval of proposed assignment by instructor prior to   registration.", "other": ["Full-Time Equivalent Course"]}, {"course_name": "WP 496: Independent Studies", "department": "Wood Products (WP)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "WP 497: Special Topics", "department": "Wood Products (WP)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WP 499: Foreign Studies", "department": "Wood Products (WP)", "credits": "1-12 Credits", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]