[{"course_name": "AERSP 1: Aerospace Explorer--First-Year Seminar", "department": "Aerospace Engineering (AERSP)", "credits": "1 Credits", "description": "First-Year Seminar explores aerodynamics, structural mechanics, flight mechanics, rotorcraft systems, high performance computers, air/space propulsion, and space systems. AERSP 1 Aerospace Explorer--First-Year Seminar (1) (FYS)Aerospace Engineering deals with vehicles that fly -- airplanes, sailplanes, jets, helicopters, rockets, satellites, the space shuttle, space stations, etc. Students with an interest in these subjects can learn more about the variety of challenges and opportunities in the aerospace field through the small-class environment of the Aerospace Explorer First-Year Seminar.An introduction to both the academic major and career paths in Aerospace Engineering, this seminar deals with the design, analysis and operation of aircraft and space vehicles. Students will learn about aerodynamics, structural mechanics, flight mechanics, rotorcraft systems, high performance computers, air-breathing propulsion, space propulsion, and space systems. The classes will include presentations by the Aerospace Engineering faculty, tours of the Aerospace Engineering laboratories, and presentations by student officers in the Penn State chapters of the American Institute of Aeronautics and Astronautics (AIAA) and the American Helicopter Society (AHS), as well as introductions to the use of scientific plotting, graphing, and analysis software.", "other": ["First-Year Seminar"]}, {"course_name": "AERSP 55: Space Science and Technology", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "The science and technology of space exploration and exploitation; physical principles; research and development; history, space policy, and social implications.", "other": ["Cross-listed with: STS 55", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "AERSP 97: Special Topics", "department": "Aerospace Engineering (AERSP)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "AERSP 199: Foreign Studies", "department": "Aerospace Engineering (AERSP)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "AERSP 204: Flight Vehicle Design and Fabrication I", "department": "Aerospace Engineering (AERSP)", "credits": "2 Credits/Maximum of 8", "description": "Integrated project management, design, fabrication, testing, and flight evaluation of an advanced composite flight vehicle.", "other": ["Honors"]}, {"course_name": "AERSP 299: Foreign Studies", "department": "Aerospace Engineering (AERSP)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "AERSP 301: Aerospace Structures", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Aerospace structural design concepts, flight safety. Stiffness, strength, stability of thin-walled structures under combined loads. Energy methods, finite element analysis. AERSP 301 Aerospace Structures (3) AERSP 301 covers essential topics in aerospace structures. The objectives of the course are to help students: 1) appreciate the roles that structures and structural materials play in aerospace vehicles; 2) understand general design concepts for aerospace structures: vehicles, components, and materials; 3) develop the analysis tools and skills needed to analyze the performance of aerospace structures; and 4) gain experience identifying, formulating, and solving aerospace structural engineering problems. AERSP 301 builds on structural mechanics topics from required foundational courses in mechanics, statics, dynamics and strength of materials. It prepares students for study of advanced topics such as plates and shells, composites, structural stability, finite element analysis, structural dynamics, and aeroelasticity. It also provides students with the basic background needed to contribute effectively to multidisciplinary trade studies in vehicle design activities. AERSP 301 begins with an overview of the general features of flight vehicle structures, with emphasis on thin-walled members and advanced materials. Then, the implications of assured safety of flight for structural design are explored, leading to coverage of: load cases, flight envelopes, load factors, factors of safety, kinds of structural failures, and margins of safety. Topics in structural analysis proceed from an initial review of topics in elasticity, structural materials, and beam bending. Then, the deflection and stress responses of thin-walled beams under transverse shear and torsional loading are addressed. More than a third of the course is devoted to energy principles and the development of the finite element method of structural analysis. The course finishes with a treatment of the structural stability of beams and panels, a key topic with respect to the behavior of thin-walled aerospace structures.", "prerequisite": "EMCH 210"}, {"course_name": "AERSP 304: Dynamics and Control of Aerospace Systems", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Vibrations of single, multiple, and infinite degree-of-freedom systems; operational methods applied to aerospace vehicles; design of controllers.", "prerequisite": "AERSP 313"}, {"course_name": "AERSP 305W: Aerospace Technology Laboratory", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Experiments in measurement systems, aerodynamics, aerospace structures, dynamics and control, and propulsion, technical report writing and presentations. AERSP 305 Aerospace Technology Laboratory (3) AERSP 305 is a junior-level experimental laboratory course in Aerospace Engineering. The purpose of this course is to expose students to the key principles and methods of experimentation as related to the field of aerospace engineering. Students learn the fundamentals of measurement techniques to determine quantities such as temperature, force, pressure, displacement, velocity, acceleration and strain in various laboratory situations. The course employs weekly \"set-up\" experiments that provide an opportunity for students to familiarize themselves with modern measurement techniques and gain valuable experience regarding the calibration and use of aerospace engineering research equipment. Students are expected to apply their knowledge of mathematics, science, and engineering in order to complete successfully the experiments encountered in the laboratory. The subsequent interpretation and analysis of the laboratory data requires the use of standard engineering tools and practices. Students work in lab groups to process data and then identify, formulate, and solve engineering questions associated with the experimental results.Throughout the semester, students communicate their knowledge and understanding of the course material through a series of class assignments, written technical reports, and one final exam. Because writing and revising laboratory reports significantly enhances the understanding and interpretation of the research data, this course is \"writing-intensive.\" As such, students are expected to improve their writing skills as they gain experience writing abstracts, informal reports and formal reports. Peer review of reports helps students to recognize good writing, and to learn how to provide constructive criticism. The course instructor provides written feedback for revised formal reports, and the quality of writing is a factor in determining final grades.", "other": ["Writing Across the Curriculum"]}, {"course_name": "AERSP 306: Aeronautics", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Lift and drag characteristics of aircraft; propulsion systems; airplane performance; introduction to stability and control.", "prerequisite": "AERSP 311"}, {"course_name": "AERSP 308: Mechanics of Fluids", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Kinetics and dynamics of fluids; perfect fluid theory using complex variables; introduction to viscous flow theory; fundamentals of compressible flow.", "prerequisite": "EMCH 212"}, {"course_name": "AERSP 309: Astronautics", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Introduction to space and space flight; laws of particle mechanics; orbits and trajectories; space vehicles and propulsion. AERSP 309 Astronautics (3) This course, required for aerospace engineering majors, focuses primarily on the dynamics of spaceflight, including both orbital and attitude (orientation) motion of spacecraft. Topics include: three-dimensional rotational kinematics (direction cosine matrices, vector components in different coordinate systems, Euler angles, the angular velocity vector, and velocity and acceleration in different reference frames), three-dimensional particle dynamics (Newton's laws of particle motion, energy, angular momentum, and systems of particles), two-body orbital mechanics (Newton's law of universal gravitation, the orbit equation, conic sections and orbit terminology, Kepler's equation, classical orbital elements, and representations of satellite position and velocity), orbital maneuvers and transfers (impulsive maneuvers, Hohmann transfers, simple inclination changes, and relative motion between spacecraft), rigid-body dynamics (angular momentum and energy, the inertia matrix, principal-axis system, Euler's equations of rigid-body motion, torque-free motion, and effects of external torques), rocket performance (the rocket equation, specific impulse, estimating propellant requirements for a mission, and a survey of propulsion technology), and the space environment (standard atmosphere, simple radiative heat-transfer analysis, the Van Allen radiation belts, meteors and debris hazards). The course relies upon a sound understanding of mechanics, matrix algebra and vector calculus. Assignments include analytical and numerical problems, some of which require computer programming.", "prerequisite": "EMCH 212"}, {"course_name": "AERSP 311: Aerodynamics I", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Fluid statics and kinematics; fluid dynamics of inviscid and viscous flows; Navier-Stokes equations; introduction to boundary layers. AERSP 311 Aerodynamics I (3) This is a first course in incompressible inviscid and viscous flows. It includes an introduction to fluids, fluid statics and hydrostatics. Fluid kinematics, including Eulerian versus Lagrangian viewpoint, steady versus unsteady flows, volume and mass flow rates, vorticity and circulation, and streamlines are described. Derivation of the governing equations for the conservation of mass, momentum and energy is presented. Dimensional analysis is covered. Potential flow with and without the effects of viscosity is analyzed. A derivation and exact solutions of the Navier-Stokes equations are given and boundary layers are introduced. This is the first of a two course sequence in aerodynamics, where both courses are required for senior-year propulsion and design courses. Evaluation of student performance will be by two midterm exams worth approximately 25% each, a final exam worth approximately 35% and weekly homework assignments worth approximately 15%.", "prerequisite": "EMCH 212"}, {"course_name": "AERSP 312: Aerodynamics II", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Fluid mechanics of viscous and compressible flows, laminar boundary layers, turbulent flows, isentropic flows, shock waves, supersonic life and drag.  AERSP 312 Aerodynamics II (3) Exact solutions of the Navier-Stokes equations for unsteady flow. Boundary layers solved by the methods of Blasius, Falkner-Skan and Thwaites. Boundary layer stability and transition to turbulence. Turbulent flow and solution methods. Fluid flow measurement techniques and numerical methods. Derivation of the governing equations for the conservation of mass, momentum and energy for compressible flow. Steady one-dimensional isentropic flow. Normal, traveling and oblique shock waves. Compressible flow with area change and converging-diverging nozzle flows. Prandtl-Meyer expansions and supersonic life and drag. One-dimensional flow with friction or heat transfer. Unsteady and linearized compressible flow. Introduction to the method of characteristics. This is the second of a two course sequence in aerodynamics and is a prerequisite for senior level courses in propulsion and design. Evaluation of student performance will be by two midterm exams worth approximately 25% each, a final exam worth approximately 35% and weekly homework assignments worth approximately 15%.", "prerequisite": "AERSP 311"}, {"course_name": "AERSP 313: Aerospace Analysis", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Mathematical methods applied to aerospace engineering: Fourier series, ordinary and partial differential equations, complex variables, numerical methods, data analysis.  AERSP 313 Aerospace Analysis (3) This course is designed to reinforce the mathematical concepts learned in the prerequisite mathematics and computer science courses and to present new mathematical material that is necessary for aeronautics, astronautics, dynamics and control, and fluid dynamics analysis. In practice, analytical and numerical approaches to problems solving are complementary, hence, this course will emphasize a combined analytical and numerical treatment.", "prerequisite": "MATH 220"}, {"course_name": "AERSP 397: Special Topics", "department": "Aerospace Engineering (AERSP)", "credits": "1-18 Credits/Maximum of 18", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "AERSP 399: Foreign Studies", "department": "Aerospace Engineering (AERSP)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "AERSP 401A: Spacecraft Design--Preliminary", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Conceptual and preliminary design of a spacecraft, its constituent subsystems, and related systems, to satisfy a given set of specifications.  AERSP 401A Spacecraft Design - Preliminary (3) AERSP 401A is the first of a two-semester sequence of senior capstone design courses. In this course, students will begin to learn the design process, complete a conceptual design, and to begin a preliminary design of a spacecraft, working in teams. This process is inherently multidisciplinary, requiring the use of engineering practices in such subjects as structures, dynamics, electrical and thermal systems, propulsion, controls, and information systems. In addition to the technical design content, this course seeks to enhance students' skills in verbal and written communications, ethical thinking, and the team approach to design, which is widely used in industry and government. Classes (115 minutes each, twice weekly) include lecture and time for team meetings. Students are evaluated on the technical merit of the designs (presented in written and oral reports), as well as their ability to function on a team.", "prerequisite": "AERSP 309"}, {"course_name": "AERSP 401B: Spacecraft Design--Detailed", "department": "Aerospace Engineering (AERSP)", "credits": "2 Credits", "description": "Detailed design of the constituent subsystems and related support systems for a spacecraft.  AERSP 401B Spacecraft Design -- Detailed (2) AERSP 401B is the second of a two-semester sequence of senior capstone design courses. In this course, students work in teams, continuing the design process begun in AERSP 401A. This process is inherently multidisciplinary, requiring the use of engineering practices in such subjects as structures, dynamics, electrical and thermal systems, propulsion, controls, and information systems. In addition to the technical design content, this course seeks to enhance students' skills in verbal and written communications, and the team approach to design, which is widely used in industry and government. Classes (115 minutes each, twice weekly) include lecture and time for team meetings.", "prerequisite": "AERSP 301"}, {"course_name": "AERSP 402A: Aircraft Design--Preliminary", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Conceptual and preliminary design of an aircraft, its constituent subsystems, and related systems, to satisfy a given set of specifications.  AERSP 402A Aircraft Design -- Preliminary (3) AERSP 402A is the first of a two-semester sequence of senior capstone design courses. In this course, students will complete the preliminary design for an aircraft such that it satisfies the assigned specifications. Students completing this course will have the ability to design a system, component, or process to meet desired needs in aircraft systems; they will have the ability to function on multi-disciplinary teams; and they will have the ability to identify, formulate, and solve engineering problems. In addition, students will have the background to help determine what the ethical responsibilities are to themselves, to employers, and to society. Classes (115 minutes each, twice weekly) include lecture and time for team meetings.", "prerequisite": "AERSP 306"}, {"course_name": "AERSP 402B: Aircraft Design--Detailed", "department": "Aerospace Engineering (AERSP)", "credits": "2 Credits", "description": "Detailed design of the constituent subsystems and related support systems for an aircraft.  AERSP 402B Aircraft Design - Detailed (2) AERSP 402B is the second of a two-semester sequence of senior capstone design courses. In this course, students will complete the detailed design for an aircraft, and all of its constituent and related support systems, such that it satisfies the assigned specifications. Students completing this course will have the ability to design a system, component, or process to meet desired needs in aircraft systems; they will have the ability to function on multi-disciplinary teams; and they will have the ability to identify, formulate, and solve the associated engineering problems. Classes (115 minutes each, twice weekly) include lecture and time for team meetings.", "prerequisite": "AERSP 301"}, {"course_name": "AERSP 404: Flight Vehicle Design and Fabrication II", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits/Maximum of 12", "description": "Project management, design, fabrication, aerodynamic and structural testing, and flight evaluation of an advanced composite flight vehicle.", "prerequisite": "AERSP 204", "other": ["Honors"]}, {"course_name": "AERSP 405: Experimental Methods and Projects", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Experimental methods involving a variety of aerospace engineering topics; teams of students focus on adanced measurement techniques and project engineering. AERSP 405 Experimental Methods and Projects (3) This is a senior-level elective laboratory course that builds on AERSP 305 \"Aerospace Technology Laboratory.\" The first part of AERSP 405 addresses the engineering of typical data acquisition systems through a series of lectures and laboratory experiments. Data acquisition and processing are covered as they relate to a broad range of engineering experiments. Several sessions in the laboratory provide students with hands-on experience with data acquisition, followed by computer program exercises to complete the assignments. Initially the lectures are twice a week (75 minutes each). This activity comprises approximately 20 % of the total course. The major portion of the course introduces students to \"real-world\" projects in engineering and laboratory research. Students work in teams to identify, formulate, plan and solve engineering problems associated with a design or system, the completion of an experiment, or an extensive computational simulation requiring a team of students. Teams of 2 to 4 students are assigned, following student input on preferences from a list of proposed projects. Students learn, through practice, the methodology of team project engineering. The teams each develop goals for the semester's project, performed following a careful work breakdown analysis with realistic time estimations and scheduling. Many of the projects involve the design and completion of an experiment. As part of the project, students will assemble, analyze and interpret relevant data, and prepare progress and final reports (written and oral). The reports should contain graphs that go with the text to provide the necessary data interpretation. The topics in the projects have application to a variety of research programs currently underway at Penn State. At the initiation of the project activity, lectures on principles of project planning including Gantt chart preparation, work breakdown structures and critical path considerations are presented. Common best practices for the preparation of project proposals, reports, presentations and general record keeping are discussed. Overall meetings with the course instructor become bi-weekly once the projects are underway. Many of the projects also have knowledgeable graduate student or faculty consultants to assist with project planning and implementation. Project consultants conduct occasional individual review meetings with each team. Much of the project coordination work is undertaken within the regularly scheduled hours for the course. The class meetings include a combination of informal presentations by the students and, occasionally, the instructor on important technical issues. Considerable class time is spent discussing the goals and progress of individual tasks, and each student gives several brief oral presentations.", "prerequisite": "AERSP 305W"}, {"course_name": "AERSP 407: Aerodynamics of V/STOL Aircraft", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Rotary wing aircraft; VTOL and STOL performance; propeller-wing combinations; jet flap; high lift devices.", "prerequisite": "AERSP 312"}, {"course_name": "AERSP 410: Aerospace Propulsion", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Analysis and performance characteristics of reciprocating engine, turbo-jet, turbo-prop, turbo-fan, ram-jets, and chemical rockets. Aerothermodynamics of inlets, combustors, and turbomachinery.", "prerequisite": "AERSP 312"}, {"course_name": "AERSP 412: Turbulent Flow", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Homogeneous turbulence; spectral transfer of energy, viscous dissipation; turbulent shear flow: mixing-length theory, eddy viscosity, scaling laws, energy budget.", "prerequisite": "one course in fluid mechanics"}, {"course_name": "AERSP 413: Stability and Control of Aircraft", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Static and dynamic stability and control of aircraft; open and closed loop systems.", "prerequisite": "AERSP 304"}, {"course_name": "AERSP 415: Spacecraft/Environment Interactions", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "This course examines the effects on spacecraft design and operation, both short and long term, by the four aspects of the space environment: the neutral environment, the plasma environment, the radiation environment, and the micrometeoroid and orbital debris environment, both in near-Earth as well as interplanetary space. The neutral space environment includes the three regimes of rarefied gas dynamics; slip, transition, and free molecular flow, as determined by the Knudsen number; spacecraft surface degradation due to physical, chemical, and mechanical processes, and an introduction to the Direct Simulation Monte Carlo (DSMC) computational method for calculating rarefied flows. The calculation of spacecraft drag, lift, and pitching moments in free molecular flow is detailed. The plasma space environment in space is examined and the confinement of plasma via magnetic fields is derived. Spacecraft charging of both spacecraft bodies and solar cell arrays due to the plasma environment with the resultant damage due to arcing is analyzed. The effect of spacecraft grounding scheme, positive, negative, or floating, on spacecraft charging is examined. The sources of space radiation; trapped radiation belts (Van Allen belts), galactic cosmic rays (GCR), and solar proton events (SPE) and coronal mass ejections (CME); are quantified and the various types of radiation, high energy photons or particles, are covered. The effects of radiation on spacecraft materials, in particular solar cells and electronic components, and biological occupants such as humans, along with means of shielding against them are quantitatively examined. The space micrometeoroid and orbital debris environments are examined with a particular emphasis on the increasing population of orbital debris. Impact dynamics to calculate cratering and penetration distances and current methods such as the Whipple shield for protecting spacecraft from micrometeoroids and orbital debris are covered. Methods to prevent the formation of orbital debris as accepted by the international community are discussed.", "prerequisite": "AERSP 308"}, {"course_name": "AERSP 420: Principles of Flight Testing", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "In-flight and analytical studies of airplane performance, stability, and control; reduction of data; instrumentation; flight test techniques.", "prerequisite": "AERSP 306"}, {"course_name": "AERSP 423: Introduction to Numerical Methods in Fluid Dynamics", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "This course provides an introduction to the important and growing field of Computational Fluid Dynamics (CFD). The student will become familiar with a short history and relevance of CFD, the basic differential models of fluid dynamics, discretization and linearization practices, and solution strategies of CFD. Fundamentals of algorithm classification, error and stability analysis will be covered. Also, several advanced topics of relevance to modern CFD analysis will be covered. A term project will involve coding a CFD model of one of several choices including: 2D shallow wave equations for application to a tsunami, unsteady conjugate flow+heat transfer analysis of a pin array, and others per the instructor's discretion.", "prerequisite": "AERSP 312"}, {"course_name": "AERSP 424: Advanced Computer Programming", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Engineering and scientific programming topics: object oriented programming, parallel programming, and various modern languages (e.g. C++, Java, and Ada).  AERSP 424 Advanced Computer Programming (3) This course presents an advanced view of computer programming, mainly using Java, C++, and Ada95. The use of current operating systems (e.g. Linus and Unix) and compilers (e.g. gcc) will also be presented. Object Oriented Programming will also be discussed in detail. Object Oriented Programming is quite different than functional or procedural programming, and it is difficult to learn on your own. The differences and similarities between Java and C++ and Ada95 will also be discussed. Hands-on programming will be a key part of the course. This course is one of the Core Courses for the Graduate Minor in High Performance Computing, and will also be a technical elective in Aerospace Engineering.", "prerequisite": "MATH 220"}, {"course_name": "AERSP 425: Theory of Flight", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Advanced wing and airfoil theory, conformal mapping, slender body theory.", "prerequisite": "AERSP 306"}, {"course_name": "AERSP 430: Space Propulsion and Power Systems", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Analysis and performance of chemical and nuclear rockets, electric propulsion systems. Introduction to solar, chemical, thermoelectric, and nuclear power sources.", "prerequisite": "AERSP 410"}, {"course_name": "AERSP 440: Introduction to Software Engineering for Aerospace Engineers", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Software engineering for safety- and mission-critical systems, including requirements, management, processes, designs, programming, validation/ verification, and other aspects of software development. AERSP 440 Introduction to Software Engineering for Aerospace Engineers (3) This course is an introduction to software engineering. Software engineering includes all aspects of professional software production, and is especially important for safety-critical and mission-critical software. It includes documentation, management, processes, requirements, design models, computer programs, validation, verification, and other aspects of the development process.Aerospace systems, including aircraft, spacecraft, onboard avionics, ground-based systems, flight simulators, and air transportation systems, rely heavily on software. Software is a major cost of all aerospace systems. For example, the Boeing 777 has more than 1000 onboard processors and more than 4 million lines of software which is primarily written in Ada. The F/A-22 fighter has more than 2 million lives of software onboard, and much of this is Ada also.Aerospace systems also demand a level of reliability far beyond that of most other systems, which means the software must be designed using rigorous mission-critical and safety-critical procedures, which makes the software quite unique compared to most other software. The FAA and DOD are both involved in certifying aircraft software, for example, through the DO-178B and DOD-2168 standards.This course is required option in Aerospace Engineering (take one of AERSP 440, EE 305, or EE 210). If not taken to satisfy that requirement, it can be used as a technical elective.This course is a required option in Aerospace Engineering (take one of AERSP 440, EE 305, or EE 210). If not taken to satisfy that requirement, it can be used as a technical elective.", "prerequisite": "CMPSC 201"}, {"course_name": "AERSP 450: Orbit and Attitude Control of Spacecraft", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Principles of mechanics and vector analysis applied to basic concepts of satellite motion and control, rocket ballistics, and gyroscopic instruments.", "prerequisite": "AERSP 304"}, {"course_name": "AERSP 458: Advanced Orbital Mechanics", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "This course is an introduction to the mathematics and practices in orbital mechanics as applied to spacecraft mission design and operation. The major topics are: the n-body problem, the two-body problem, Keplerian orbits, the Kepler problem (position as a function of time), three-dimensional specifications of Keplerian orbits (classical orbital elements and modified equinoctial elements), Lambert's problem (determining a conic section that joins two specified points for a given time of flight), impulsive transfers, the Hohmann transfer and its extension to other problems, spherical trigonometry and its use in plane-change maneuvers and in gravitational modelling, the sphere of influence, the patched-conic approximation, the circular restricted three-body problem, linear orbit theory (relative motion between vehicles in neighboring orbits), gravitational modelling via spherical harmonics, perturbation methods (Encke's method and variation of elements), orbit determination, tracking kinematics, and time systems.", "prerequisite": "AERSP 450"}, {"course_name": "AERSP 460: Aerospace Control Systems", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Design and analysis of feedback control systems for aerospace applications; stability, root locus, time- and frequency-domain, state-space methods.  AERSP 460 Aerospace Control Systems (3) This course is an introduction to the design and analysis of feedback control systems as applied to aerospace systems. The course covers control theory that is commonly used in the aerospace industry and presents practical applications of this theory to aerospace systems. The course does not emphasize rigorous mathematical derivation, but instead emphasizes the application of control theory. It provides a comprehensive overview of classical control theory and single-input/single-output (SISO) design methods. The course also presents an introduction to modern control theory and multi-input/multi-output (MIMO) design methods. Aerospace examples and applications are emphasized throughout the course.The course builds upon a required junior-level course in system dynamics and controls (AERSP 304), which provides students with basic dynamic system theory and a brief introduction to feedback control. The course also supplements required senior-level courses in either aircraft or spacecraft dynamics (AERSP 413 and 450) which provides background on vehicle dynamics. AERSP 460 provides an additional level of depth in dynamics and control theory, and prepares students for entry-level work or graduate studies involving the design of automatic control systems for aircraft and spacecraft.", "prerequisite": "AERSP 304"}, {"course_name": "AERSP 470: Advanced Aerospace Structures", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "Design and analysis of aerospace structures.  Plates and sandwich panels; composite materials; structural dynamics; aeroelasticity; damage tolerance.  AERSP 470 Advanced Aerospace Structures (3) AERSP 470 covers important topics in aerospace structures beyond basic stress and deflection analysis of thin-walled beams. The objectives of the course are to help students: 1) appreciate the roles that structures and structural materials play in aerospace vehicles; 2) understand general design concepts for aerospace structures: vehicles, components, and materials; 3) develop the analysis tools and skills needed to analyze the static and dynamic performance of aerospace structures; and 4) gain experience identifying, formulating, and solving aerospace structural engineering problems.AERSP 470 builds on structural, dynamics, and aerodynamics topics covered in PHYS 211, EMCH 11 & EMCH 13 (or EMCH 210), EMCH 215 & EMCH 216, AERSP 301, AERSP 306, and AERSP 304. It prepares students for entry-level work or graduate study in the analysis and design of aerospace structures. It also provides students with the strong background needed to contribute effectively to multidisciplinary trade studies in vehicle design activities.AERSP 417 begins with a review of the general features of flight vehicle structures and aerospace structural design concepts. Then, the deflection and stress responses of flat plates and sandwich panels under lateral and in-plane loading are addressed. About a third of the course is devoted to the behavior of advanced composite panels, and another third to structural dynamics and aeroelasticity. The course finishes with treatments of joining and damage tolerance, both key topics with respect to the design of aerospace structures.", "prerequisite": "AERSP 301"}, {"course_name": "AERSP 473: Composites Processing", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "An introduction to the principles of mechanics governing manufacturing, computer-aided design, and testing of composite materials and structures.", "prerequisite": "EMCH 471", "other": ["Cross-listed with: EMCH 473"]}, {"course_name": "AERSP 490: Introduction to Plasmas", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "This course provides the education on models that are used for description of plasma phenomena as applicable to plasma confinement, plasma assisted materials processing, astrophysical plasmas and plasmas in the near Earth's space environment. It provides practical training in solution of problems involving collisional and collisionless plasmas. In particular, it investigates dynamics of charged particles in specified uniform, non-uniform and time varying electric and magnetic fields. It explores collective behavior of plasmas, including various electrostatic and electromagnetic waves that can be excited and propagate in plasmas parallel and perpendicular to the externally applied magnetic field. The course considers non-linear effects in plasmas, as typically occurring in the sheath regions near the plasma confining walls. It discusses concepts of equilibrium and stability of plasmas, and various models of unstable plasma motions, especially in relation to plasma confinement.", "prerequisite": "EE 330", "other": ["Cross-listed with: EE 471, NUCE 490"]}, {"course_name": "AERSP 492: Space Astronomy and Introduction to Space Science", "department": "Aerospace Engineering (AERSP)", "credits": "3 Credits", "description": "The physical nature of the objects in the solar system; the earth's atmosphere, ionosphere, radiation belts, magnetosphere, and orbital mechanics.", "prerequisite": "EE 330", "other": ["Cross-listed with: EE 472"]}, {"course_name": "AERSP 494: Aerospace Undergraduate Thesis", "department": "Aerospace Engineering (AERSP)", "credits": "1-12 Credits/Maximum of 12", "description": "Individual problem investigations reported in written thesis and seminar lectures. Cooperative research with faculty guidance on topics of current interest.", "prerequisite": "Seventh-semester standing"}, {"course_name": "AERSP 494H: Aerospace Undergraduate Thesis", "department": "Aerospace Engineering (AERSP)", "credits": "1-3 Credits/Maximum of 6", "description": "Individual problem investigations reported in written thesis and seminar lectures. Cooperative research with faculty guidance on topics of current interest.", "prerequisite": "Seventh-semester standing", "other": ["Honors"]}, {"course_name": "AERSP 496: Independent Studies", "department": "Aerospace Engineering (AERSP)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "AERSP 497: Special Topics", "department": "Aerospace Engineering (AERSP)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "AERSP 499: Foreign Studies", "department": "Aerospace Engineering (AERSP)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]