[{"course_name": "AFR 105: African Biodiversity and Conservation", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "AFR 105 African Biodiversity and Conservation introduces the topic of Biodiversity in Africa, with a focus on how natural features, flora and fauna, and human livelihood systems interact. Additionally, the course will examine forces driving change Biodiversity Loss and Environmental Change in Africa and how humans are contributing to and adapting to these changes. The course uses an integrated approach to study how humans interact with their environments across different environments and scales. We will look at traditional human livelihood systems will include hunting and gathering, agriculture, and pastoralism. Drivers of environmental change and approaches to conservation will be critically compared, as well as how these impact human well-being. Concepts that will be covered include paired social-ecological systems, habitat and ecology, ecological change and thresholds, sustainable resource use, forces of change (including climate change) and impact of environmental change and uncertainty on human well-being and conservation.", "other": ["Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "AFR 110N: Introduction to Contemporary Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Consideration of influences and forces shaping modern African society; analysis of current local and global problems and issues facing Africa are the central focus of the course. \"Introduction to Contemporary Africa\" offers students a view of contemporary Africa as a complex, significant, and richly diverse continent which has been heavily impacted by its colonial history. The course presents an introduction to African history, politics and cultures by drawing on intellectual resources from the continent combined with those from the rest of the world. The course aims to expand students' knowledge of intersecting cultures, histories, policies, and economics in a globalized world. The course provides students with an opportunity to deconstruct some of the influences and forces that have shaped and continue to shape modern Africa and thus providing students with an opportunity to investigate, explore and analyze the current local and global issues facing Africa. In this course the student will engage with some of the literature about contemporary Africa and develop skills at reading, analyzing, and writing within the interdisciplinary approach of African Studies. The overarching goal of this course is to help students understand contemporary African societies and their socioeconomic characteristics. The course provides students the opportunity to investigate Africa's multifaceted realities, explore: (1) The continent and its history; (2) Africa's dichotomous political, economic and institutional systems and their impacts and implications for governance and development; (3) The continent¿s social and environmental conditions and their impacts and implications on issues, such as demography, urbanization, gender relations public and social services and lastly; and (4) Characteristics of African culture whereby we explore African literature, theater, cinema, the arts, and belief systems.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "AFR 132: Afro-Hispanic Civilization", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "A general introduction to human and cultural elements of African origin in Spanish- and Portuguese-speaking countries of Latin America. SPAN 132 / AFR 132 / AFAM 132 Afro-Hispanic Civilization (3) (IL) (BA) This course meets the Bachelor of Arts degree requirements. The nations and peoples of Latin America have a unique, interesting historyand cultural heritage that are rooted in the traditions, beliefs, experiences,values, and struggles of Native American, European, African and otherpopulations. This course focuses on the presence and participation of Africanpeoples and their descendants in the formation and development of societies andcultures in representative areas of the Caribbean, South America, and CentralAmerica and on the evolution, diversity, and richness of the African heritagetherein. Course content includes the African background, the experience andimpact of slavery, the social, cultural, and economic heritage of slavery, therole of race in Latin America, and Afro-Hispanic intellectual, literary, andartistic developments (e.g., aspects of folklore, music). The course aims toprovide students with a general introduction to human and cultural elements ofAfrican origin within the Spanish- and Portuguese-speaking nations of theAmericas so that they may be more knowledgeable of the meaning, significanceand widespread influence of the African diaspora. It proposes to provide thestudent with a better understanding of Africa's contribution to Latin Americanidentity, diversity, culture, and development; to promote appreciation for thevalues and practices of other cultures, and greater awareness of the relationsbetween the nations of the region and the United States.", "other": ["Cross-listed with: AFAM 132, SPAN 132", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "AFR 150: Africa in Cinema", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "The study of the image of Africa as seen in fiction and non-fictional feature length films, ethnographic and documentary films.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "AFR 191: Early African History", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "The course is an introduction to the history of Africa south of the Sahara from the origins of humankind to roughly 1750 with a focus on common themes in the cultural and historical development of African societies. Themes include (but are not limited to): Ancient Egypt, Africa's place in the Greco-Roman world, Early African Christianity, Islam in Africa, European contact, and the Atlantic Slave Trade", "other": ["Cross-listed with: HIST 191", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "AFR 192: Modern African History", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This course offers an overview of the history of Africa from 1750 to the present. The course introduces students to the diversity of Africa's geography, demography, and history and investigates the experience of modern history through specific, regionally distinct, examples. Students will learn about structures of power, society, and economy in the colonial and post-colonial era in comparative terms, and about a variety of cultural forms and expressions.", "other": ["Cross-listed with: HIST 192", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "AFR 192H: Modern African History", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This Honors course offers an overview of the history of Africa from 1750 to the present. The course introduces students to the diversity of Africa's geography, demography, and history and investigates the experience of modern history through specific, regionally distinct, examples. Students will learn about structures of power, society, and economy in the colonial and post-colonial era in comparative terms, and about a variety of cultural forms and expressions. The honors course takes time to go into greater depth in a few selected topics, with attention to primary sources, historical method, and historiographic trends.", "other": ["Cross-listed with: HIST 192H", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "AFR 197: Special Topics", "department": "African Studies (AFR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "AFR 199: Foreign Studies", "department": "African Studies (AFR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "AFR 202N: Women, Gender, and Feminisms in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This introductory course provides students with a broad interdisciplinary overview of scholarly research and theory related to women and gender studies in Africa, using both historical and contemporary examples from across the continent. We will explore the complex, and oftentimes contradictory, meanings attached to gender and sexuality in various African contexts. For example, what does it mean to be a \"good\" woman in Uganda today? How does this definition change (or not) if she comes out as a lesbian? What if s/he identifies as a transgender man or rejects gender binaries altogether? What if gender did not matter, or even, did not exist? In addition to exploring these types of questions, we will also examine African feminist thought, paying close attention to the ways in which African feminisms are similar to and/or different from other forms of feminism worldwide. We will also consider what these movements looked like in practice. What strategies did African feminists utilize to promote social change? What challenges did they face? What victories resulted from their efforts? Although topics may vary from semester to semester, key themes include environmental activism, anti-war/peace activism, political activism, sex worker rights activism, activism to support peoples living with HIV/AIDS, and activism against harmful traditional practices. Finally, we will examine the ways in which African feminists have contributed to global debates and initiatives on women's rights and gender equity. Students in this course can expect to engage with diverse texts from the humanities (esp. history, literature, film studies, and philosophy), as well as from the social and behavioral sciences (esp. anthropology, geography, sociology, and political science).", "other": ["Cross-listed with: WMNST 202N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "AFR 205: Development and Sustainability in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "AFR 205 Development and Sustainability in Africa introduces the development and sustainability strategies and theories in Africa, with a focus on how. This course will trace the history of change across the continent and critique the narratives about development in Africa, relative to colonial legacies and African peoples¿ hopes for autonomy. We will cover the concepts of development and sustainability at different scales, from local to international. Students will become familiar with Theories of Development and how they have impacted social, political and economic pathways in Africa. Students will be exposed to an array of development strategies (including agriculture, resource extraction, education and health) and will be asked to interrogate and critically analyze examples of development and sustainability policies and projects: those that have ¿worked¿ and those that have not. Students will learn to assess which future pathways are sustainable and ethically sound. Finally, the course will provide students with the opportunity to practice some participatory development methods used to build consensus and make decisions with communities.", "prerequisite": "AFR 105", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "AFR 209: Poverty in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "African countries are generally considered to be among the poorest countries on the planet. On average, their incomes are low as are their levels of education. Poor African countries also have a range of peculiar characteristics that negatively affect their living standards. As these standards decline, western audiences have increasingly been targeted by aid organizations seeking donations to help the African cause. Despite growing awareness of African poverty, however, few attempts have been made to locate discourses on African poverty within historical, theoretical, and contemporary contexts. This course provides an overview of the key issues foundational for understanding the dynamics of poverty and human development in African societies. It examines various academic conceptualizations of poverty, the dimensions of poverty in African countries, as well as poverty¿s various causes and consequences. The course also intends to highlight the complex nature of the social, political, and economic causes of African poverty and their implications. Furthermore, it will identify the important challenges to poverty alleviation in African societies, the effectiveness of foreign aid, and alternative strategies to poverty alleviation. The course will also provide unique opportunities for students to develop a focused understanding of specific issues that affect Africa's socioeconomically vulnerable groups as well as related issues relevant for understanding the dynamics of poverty in specific areas on the continent.", "other": ["Cross-listed with: SOC 209", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "AFR 230N: Language and Social Justice", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This course examines the contribution of language to a variety of social justice agendas by exploring how language is used to form and support unjust social structures. The course has two main aims. First, drawing from sociolinguistic theories of linguistic ideologies, the course aims to show the significance of language in how the hierarchization and ranking of languages in a society are produced, maintained, and reinforced. The second aim is to demonstrate the effects of such a hierarchization and ranking of languages on (in)equality in educational institutions and before the law. The topics covered in this course include the role of language in structuring individual identity and human relations and how this process characterizes the nature of social institutions in producing social inequality. As the course touches on issues pertinent to our daily lives, students' questions, comments, and relevant personal experiences and observations will play an important role in our exploration of how the language we use can affect opportunities and privileges in society.", "other": ["Cross-listed with: APLNG 230N", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "AFR 234: Environment, Climate Change and Resilience in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This course provides an overview of the relationship between environment, climate change and livelihood resilience in Africa. The AFR 234: Environment, Climate Change and Resilience (3 credits) course uses an interdisciplinary approach and a combination of conventional scientific and indigenous knowledge about environmental change, to enable students to develop a critical understanding of the concepts of environment, climate change, and sustainability and resilience in the face of environmental degradation in Africa. Topics to be covered in the course will include environmental change and extreme climatic conditions such as hurricanes, droughts, floods and winds in Africa; climate change and agriculture, natural resource conservation and conflicts, population growth and climate change, environmental sustainability, and indigenous resilience strategies to combat climate change and its sundry impacts on the continent and its peoples. Various ongoing resilient ecological management strategies, including indigenous knowledge, expertise of locally trained environmentalists, along with regional and global institutional perspectives of climate change, will be identified and discussed using case studies to provide a more comprehensive understanding of environmentally, friendly and climate change management policy debates in Africa. The course will be taught through class lectures, seminars, workshops, and scheduled field coursework in specific regions in Africa as a summer study abroad component of the course.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "AFR 294: Research Project", "department": "African Studies (AFR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "AFR 297: Special Topics", "department": "African Studies (AFR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "AFR 299: Foreign Studies", "department": "African Studies (AFR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "AFR 305: Introduction to Global Health Issues", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Course will develop awareness of contemporary issues in global health.  BB H 305 Introduction to Global Health Issues (3) This course is an introduction to health and related issues in the global context. It is intended to be an overview of fundamental perspectives about the historical, current, and future public health challenges facing developing and industrialized countries. The course will explore the interrelationships among social structure, culture, demography, health promotion/disease prevention, biology, ecology and health policy of various countries and international health organizations. This course will 1. present key issues related to the history, conceptual frameworks, economic conditions, and policy affecting public health in the global context, 2. examine reports and studies pertaining to major global health issues and comparative research, 3. discuss the role of social structure, culture, gender roles, government policies, and the increasing numbers of the elderly in preventive health behaviors and health promotion in the global context, and 4. critique theories and models used to inform health and development programs in non-Western nations.", "prerequisite": "BBH 101", "other": ["Cross-listed with: BBH 305", "International Cultures (IL)"]}, {"course_name": "AFR 310: Language Rights, Policy, and Planning", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This is a course on language rights, policy, and planning from individual, group, inter-ethnic, and national perspectives. Linguistic minorities are a consequence of colonization by European powers in different regions of the globe. Other effects of colonization and political conflicts include mass movement, migration, and the emergence of nationalism. In such contexts, minorities have made demands for language rights and used language policy and planning as strategies to realize demands for social justice. This course will examine how linguistic minorities secure opportunities to use their own languages and have them accommodated in official legislation as mother tongue, second, or foreign languages. The course will adopt a global perspective and analyze language rights as well as language policy and planning in diverse regions of the globe, including but not restricted to, Africa, Asia, and South America. Analysis will primarily focus on how language policies can be carried out from different perspectives (e.g., literary, linguistic, and political) in different geographical regions. After examining how language policies operate in and influence society, the course will use sociopolitical ideologies to explore the nature of the relationship between language policies and language rights and the ways this relationship enables one to achieve an expanded understanding of the impact of language policies and language rights on local language practices.", "other": ["Cross-listed with: APLNG 310, GLIS 310", "International Cultures (IL)"]}, {"course_name": "AFR 335: African Art", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Introduction to the visual arts of Africa, including contemporary African art and the influence of African art outside Africa. ARTH 335 / AFR 335 African Art (3)(GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. The course will examine the arts of various African peoples in historical, religious, sociological and geographic contexts, providing an introduction to the many visual art forms of Africa including masquerade, costume, and indigenous architecture. While many of the arts in this field of study are from west and central Africa, the course will also include materials from southern and eastern Africa. Contemporary African art, African Diaspora arts, and the influence of African art on European art are important topics that may be included. In addition to the traditional format of a geographic organization of the material, students will explore thematic approaches. Each of the assignments requires completion of essays which draw upon the multiple course texts and readings. Exams include image identification and short essays.", "other": ["Cross-listed with: ARTH 335", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "AFR 395: Internship", "department": "African Studies (AFR)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "AFR 397: Special Topics", "department": "African Studies (AFR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "AFR 399: Foreign Studies", "department": "African Studies (AFR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "AFR 403: South Africa Today", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "A course examining the South African government's policy of apartheid:  its history, why it exists, how it works, and the prospects for change.", "prerequisite": "AAA S110"}, {"course_name": "AFR 405: African Studies Methodologies", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Multidisciplinary research techniques for studying in and about Africa."}, {"course_name": "AFR 434: War and Development in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This course will examine the relationship between war and development in sub-Saharan Africa in the post colonial era. PLSC 434 / AFR 434 War and Development in Africa (3) (IL) This course will examine the relationship between development and war in sub-Saharan Africa in the modern era. Specifically, it will analyze the extent to which the processes of state building, nation building, and international intervention have contributed to the incidence of both civil war and international conflict in Africa. We will begin with a review of several theoretical arguments on the causes of warfare in Africa and then turn to a discussion of theses on African political development. This course complements present offerings in international relations and comparative politics in the PLSC department and can serve as an advanced undergraduate offering in the African Studies concentration in AFR. The course directly complements our present offerings in international conflict given that we don';t have a regularly offered course that focuses on conflict in a specific region. In addition, it will augment our comparative politics offerings with an examination of prominent issues in comparative politics such as political development, democracy, and modernization. The course will fulfill the IL requirement and encourage students understanding of the historical background as well as the political, economic, and cultural factors that influence African politics. African conflicts are often viewed as \"ethnic conflicts\" and in this class students have an opportunity to assess the extent to which ethnic, linguistic, or religious factors influence the likelihood of conflict and contribute to development in African states. Students will also be required to write essays evaluating the contribution of a range of theoretical arguments on Africa';s conflicts in order to assess the degree to which cultural more than political or economic factors contribute to their onset. Students will then have the opportunity to conduct more extensive research on a specific African case to develop their analyses further. These exercises will often require that students reevaluate their beliefs about social identities such as race (e.g. in Rwanda the difference between Tutsi and Hutu is often viewed as a \"racial\" difference between black Africans, which is at odds with most Western conceptions of race). They also require students to challenge stereotypes regarding the subordination of African values in conflicts to a simple concern with \"tribe\". Students will gain a broader knowledge and appreciation of the different values, traditions, and cultures evident in Africa and understand how these can both exacerbate and mitigate conflict. Evaluation in the course will consist largely of examination of the students' brief expository essays and larger case studies for which students will be encouraged to conduct original research. The course should be offered biannually with a class limit of about 40 students.", "prerequisite": "PL SC014 , PL SC003 , AFR  110", "other": ["Cross-listed with: PLSC 434", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "AFR 435N: Black Ecologies", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "African and African Diasporic peoples have been central to the creation and transformation of global ecologies and landscapes. As the birthplace of humankind, the African continent features the longest archaeological record in the world, with abundant, yet often underrepresented, material and historical evidence for remarkable Indigenous African innovations in the areas of technology, food production, and resource and land use. This course specifically examines Black ecologies preceding and then radically transformed by the Trans-Atlantic Slave Trade. Beginning in the late fifteenth century, the enslavement of millions of Africans and their forced translocation to the Americas and Caribbean precipitated ecological transformations on all sides of the Atlantic, as African peoples, knowledge, resources and ecological inheritances were appropriated by the European mercantile system. Enslaved Africans transformed American landscapes via extractive industries of plantations and mines and suffered the emergence of toxic landscapes and disease alongside Native American communities. Africans also recreated African ecologies as they created livelihoods and landscapes of resistance and freedom in the Americas. The legacies of the Atlantic Era maintain a persistent dynamic in which African and African Diasporic communities experience disproportionate burdens of environmental injustice today. The concept of Black ecologies reflects the marginality, systemic racism and dispossession experienced by Black peoples and their landscapes. Black ecologies also allow us to understand African and African Diasporic ecological innovations, resistance and resilience, and the pathways to future sustainability and justice they promise.", "prerequisite": "3 credits of ANTH", "other": ["Cross-listed with: AFAM 435N, ANTH 434N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "AFR 440: Globalization and Its Implications", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This course explores the socioeconomic implications of globalization.", "prerequisite": "AFAM 100N", "other": ["Cross-listed with: IB 440, PLSC 440", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "AFR 443: Ethnic Conflict in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "This course explores the various causes and impacts of ethnic conflicts in the African context.", "other": ["Cross-listed with: PLSC 443", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "AFR 444: African Resources and Development", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Ecological and cultural factors in the geography of Africa; natural resources and development. GEOG 444 / AFR 444 African Resources and Development (3) (BA) This course meets the Bachelor of Arts degree requirements. This course is designed to analyze the ecological, economic, political and cultural factors, which influence development in sub-Saharan Africa. The traditional system, colonialism, modernization, post-colonial philosophies are four conceptual artifacts used to address some of these issues. Within these broad frameworks, the course focuses on existing debates surrounding key development ideologies and narratives in the region, including, poverty, conservation, population, debt, food security, land reform, foreign intervention and global politics. The topics and texts for the course are chosen carefully to provide general factual material as well as exposure to the major discourses surrounding the region's development. The views of many Americans concerning Africa are often both unitary (Africa is a country) and unidimensional (Africa is a place of conflict, poverty, corruption and crisis). Assuming that a number of students are likely to join the class with this general background, the main objectives of the course will be :  (i) to provide a broad geographic and historical tutorial to dispel myths and stereotypes about the region;  (ii) to explore the literature, which analyzes the historical, geographic and political factors that underlie the region's present status in the global economy; and (iii) to gain insights into the intellectual and ideological dimensions of the \"raging\" debates surrounding issues like environment, conservation, population, corruption, and poverty in the region. By the end of the semester, students should have acquired the skills to accomplish the following goals: *develop a \"mental map\" of the broad physiographic, ecological, economic and political zones (blocs) in the region; *be able to discriminate between stereotype and reality on information pertaining to the region; *be able to interpret and analyze the internal (national, regional) dynamics of the region's development; *be able to interpret and analyze the global factors, which influence the environment, economy, and politics of the region; *develop an informed background on the ideological narratives that guide policy in the region, for example, population, sustainable development, post-colonialism, \"empire\" (whether, American, European, Indian, Chinese, South African?).", "prerequisite": "GEOG 123", "other": ["Cross-listed with: GEOG 444", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "AFR 446: Topics in African Art", "department": "African Studies (AFR)", "credits": "3 Credits/Maximum of 9", "description": "Topics vary from \"Arts of Eastern and Southern Africa\" to \"Art of West Africa.\"", "prerequisite": "3 credits of ARTH", "other": ["Cross-listed with: ARTH 446", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "AFR 447: Topics in the Art of the African Diaspora", "department": "African Studies (AFR)", "credits": "3 Credits/Maximum of 6", "description": "Selected topics in arts of the African Diaspora (South America, Caribbean, USA) including masquerades, textiles, architecture and other art forms.", "prerequisite": "3 credits of ARTH", "other": ["Cross-listed with: ARTH 447", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "AFR 449: Sport in African History", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Recent events in sporting history have precipitated changes in perception for many in Africa relative to the historic legacies of racism and colonial rule. These events lead to pivotal questions -What are the broader social and political meanings of sport in African society? And what does the study of sport in Africa tell us about Africa¿s place in world history? This course uses the lens of sport to examine the social and political histories of Africa and the wider diaspora in historical perspective. From the racial and gendered hierarchies of colonialism to the use of sport to protest against social injustices, students are challenged to analyze the interdisciplinary significance of sport far beyond the playing field. One of the main intellectual goals of this course is to use sport to deepen our understanding of specific outcomes in African sport (e.g. South Africa¿s remarkable transformation from pariah of international sport to host of global events like the 2010 World Cup, and Kenyan running successes) from a variety of perspectives. We also consider how Americans travelled to and engaged with African societies as athletes, ambassadors, and activists. Broadly, this course explores sport and social change in Africa from the late nineteenth century to the present. It examines the sporting lives of African athletes, fans, reporters, coaches, and organizers and then connects them to shifting racial identities and power relationships on the continent as well as elsewhere around the world. These histories shed light on the pivotal role of sport in the everyday lives of people across the continent. In the process, we pay attention to primary sources, analyzing the ways in which Africans thought, talked, and represented themes discussed in assigned readings. Ultimately, this course will strengthen student skills of critical thinking, oral communication, collaboration, research, and writing.", "prerequisite": "KINES 100", "other": ["Cross-listed with: KINES 449", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "AFR 454: Government and Politics of Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Contemporary African politics, institutions, and ideologies; patterns of change, social forces, and nation building in selected African states. PLSC 454 / AFR 454 Government and Politics of Africa (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. In this course, we will discuss the current democratization trend in Africa by focusing on the experiences of African countries.The course is divided into three sections. Part One considers a range of factors that affect politics in Africa. We will discuss in depth the following factors: colonialism, nationalism, the relationship between state and society, ruler-ship, the military, political parties, and economic development. Then, we will consider the experiences of our four cases, to gain a historical background. In part two, we will focus on democratic transitions. We will discuss the factors that enable transitions to occur, as well as the process that transitions follow. Then, we will consider four transitions: two that resulted in the installation of a democratic government (Nigeria in 1979, Sudan in 1986) and two that ended in continued authoritarianism (Angola in 1992, Kenya in 1978). Part three considers the prospects of democracy. We will discuss the probability of a democratic transition occurring in the near future.The goals of this class are four fold. First, students will gain detailed knowledge about four African countries. Second, we will learn how to compare countries. Third, students will have a better understanding of the democratization process in general, and will be able to explain or predict democratization beyond the four cases discussed in this class. Finally, the experiences of these four countries offer a deeper understanding of what democracy is and provide students with greater flexibility to fulfill requirements in either the African and African American Studies major or the Political Science/International Politics major. PLSC 454 / AFR 454 will be offered once per year with 35-50 seats per offering.", "prerequisite": "3 credits from: AFR  110 , PL SC003 , PL SC020 , or PL SC022", "other": ["Cross-listed with: PLSC 454", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "AFR 459: Culture and World Politics", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Role of culture in world politics.", "prerequisite": "PL SC014", "other": ["Cross-listed with: PLSC 459", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "AFR 464: Extractive Industries in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "Socioeconomic and environmental impacts of extractive industries in Africa.", "prerequisite": "AFR  110 or at least one of the following: PL SC003 or PL SC014 or PL SC022", "other": ["Cross-listed with: PLSC 464", "International Cultures (IL)"]}, {"course_name": "AFR 479: History of Imperialism and Nationalism in Africa", "department": "African Studies (AFR)", "credits": "3 Credits", "description": "A selective overview of the history of iumperialism and nationalism in Africa.  HIST/AFR 479 History of Imperialism and Nationalism in Africa. This course meets the Bachelor of Arts degree requirements. History/African Studies 479 will provide a selective introduction to major developments and issues concerning Africa's colonial and postcolonial history. The beginning of this course will concentrate on the meanings of imperialism and nationalism and the fact that there is no \"single\" African experience with either of them. This will be followed by a discussion of 19th and 20th century political history in specific contexts in North, East, West, and Southern Afria. The course concludes with a review of African decolonization and the most notable manifestations of recent nationalism on the continent. Special attention will be given to the methods of colonial takeover, methods of African resistance, the West's role in Africa, and Africa's formative role nstruon the West. Religion, the military, and racial/ethnic identity politics will be recurring themes in the course. The actual time devoted to each topic and the sequence of topics will vary from instructor to instructor. The objective of the course is to intrroduce to the causes, nature, and consequences of modern imperialism in Africa. In doing so, students will receive a comprehensive history about a region of the world that is often misunderstood and misrepresented. Also, the course emphasizes critical thinking and analytical writing. The course will consist of polls, pratice discussions, quizzes, response papers, and a final project. As a general education course, this class will provide an introduction to African political history for students of anyn major. Students majoring or minoring in History, African Studies, International Relations, or Political Science will learn vocabulary and information that is basic to the field and broaden their knowledge of History.", "prerequisite": "3 credits in HIST", "other": ["Cross-listed with: HIST 479", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "AFR 494: Research Project", "department": "African Studies (AFR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "AFR 495: Internship", "department": "African Studies (AFR)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "AFR 496: Independent Studies", "department": "African Studies (AFR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "AFR 497: Special Topics", "department": "African Studies (AFR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "AFR 499: Foreign Studies", "department": "African Studies (AFR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]