[{"course_name": "AGRO 28: Principles of Crop Management", "department": "Agronomy (AGRO)", "credits": "3 Credits", "description": "Biological and agronomic principles applied to production and management of major feed and forage crops of the northeastern United States. This includes an overview of agronomy in the world and the United States with emphasis in the Northeast region of the country, and downscales to practical aspects such as crop identification, crop physiology, soil water management, tillage and all the interactions that make farming such a complex enterprise for farm operators and society at large. The course spans over many subjects: crop, soil, nutrient, pathogen, insect, and weed management, and emphasizes managing both profitability and environmental integrity."}, {"course_name": "AGRO 410W: Physiology of Agricultural Crops", "department": "Agronomy (AGRO)", "credits": "4 Credits", "description": "Study of the relation of plants to their environment and the physiology of crop plant growth. AGRO 410 Physiology of Agricultural Crops (4) AGRO 410 is a course in plant physiology that presents fundamental aspects of plant metabolism and demonstrates how they are affected by environmental conditions such as light, water availability, temperature, and mineral nutrition. It describes how plants use photosynthesis to accumulate and partition biomass and how this contributes to crop productivity. The roles of abiotic stress such as drought and temperature extremes on crop productivity also are discussed. The course objectives are to 1] learn how plants \"work\" at the molecular, cellular, whole plant and population levels; 2] develop critical thinking skills by planning and conducting experiments related to the course topics and reviewing journal articles; and 3] develop and enhance communication skills through a variety of writing assignments. This course is appropriate for upper level undergraduates or beginning graduate students with interest in plant and agricultural science disciplines including, horticulture, agroecology, plant pathology, ecology, meteorology and entomology; and meshes with courses in these areas. Students will be evaluated by examinations/quizzes, writing assignments and class participation. The course is offered annually and the optimal enrollment is 20 students.", "prerequisite": "AGRO 028", "other": ["Writing Across the Curriculum"]}, {"course_name": "AGRO 423: Forage Crop Management", "department": "Agronomy (AGRO)", "credits": "3 Credits", "description": "Application of agronomic, ecological, and physiological principles to the production and management of pasture and forage crops.", "prerequisite": "AGRO 028"}, {"course_name": "AGRO 425: Field Crop Management", "department": "Agronomy (AGRO)", "credits": "3 Credits", "description": "Application of agronomic, ecological, and physiological principles to management systems for the efficient production of the major field crops.", "prerequisite": "AGRO 028"}, {"course_name": "AGRO 438: Principles of Weed Management", "department": "Agronomy (AGRO)", "credits": "4 Credits", "description": "The study of weeds and their management is a challenging and demanding task that requires diverse abilities. The term weed is an anthropocentric construct meaning it is a human colored definition. We will study the biology and ecology of weedy plants drawing on examples from a wide range of plant systems; those systems include agricultural fields (agronomic and horticultural crops) and forests. Of course our knowledge of the biology and ecology of weedy plant populations will then be used to underpin and assess control tactics and their integration. The discipline has a history of equating management with herbicidal control and in fact some 80% of the pesticides used in U.S. agriculture are herbicides. However through novel farmer designed management systems, through a research community focused on alternative methods of management and through increased focus on invasive species, exciting breakthroughs are occurring in alternative methods of management and prevention. This course seeks to introduce you to the breadth of management approaches in use and under study. The specific objectives are for students to describe and identify: 1) the local weed flora, 2) the fundamental aspects of weed biology and ecology relevant to managed landscapes, 3) the control methods used in managing weed populations, 4) how control measures can be integrated to accomplish acceptable levels of pest suppression, 5) operationalizing a weed management plan, 6) how herbicides enter and move to their site of action in plants, 7) classifying herbicides by their site of action, and 8) the distinction between herbicide concentration in soils and plant available herbicide concentration.", "prerequisite": "AGRO 28", "other": ["Cross-listed with: AGECO 438"]}, {"course_name": "AGRO 460: Advances and Applications of Plant Biotechnology", "department": "Agronomy (AGRO)", "credits": "3 Credits", "description": "This course provides a comprehensive overview and current status of plant biotech research. The course provides knowledge of plant systems that fall in the category of GMOs. BIOTC 460 / AGRO 460 Advances and Applications of Plant Biotechnology (3)This course will provide a comprehensive overview and status of current plant biotech research. The focus is on providing knowledge of the biology of plant systems. Consequences of development of a transgenic plant either for food (crops) or as a tool to understand molecular, genetic, and inheritance mechanisms of a trait will be discussed in detail. The course will deliver the current literature and understanding of mechanisms involved in herbicide resistance in transgenic plants. Specific topics that will be of interest to students from various disciplines include disease and insect resistance, quality traits, and secondary metabolites. Molecular biology of different pollination systems will be examined so that students will understand the concept of gene flow from transgenic to non-transgenic crops. Examples from recent developments on the beneficial use of transgenic plants as producers of modified compounds, starches, antibodies and their use in phytoremediation of toxic and organic pollutants will be discussed from the perspective of genetic and molecular plant systems. Gene expression of transgenic plant traits and the stability of an engineered crop will be discussed. Specific emphasis will be on different modes of inheritance that a transgenic plant can follow after its development and release into the environment. The course also prepares students for understanding the regulatory processes that are required for testing, moving, and environment release of transgenic crops. The laboratory component of the course will introduce students to the common technique of molecular biology that are used to detect expression in transgenic plants. Transgenic maize plants will be grown in a greenhouse and analyzed for expression of introduced genes.", "prerequisite": "BMB 251", "other": ["Cross-listed with: BIOTC 460"]}, {"course_name": "AGRO 495: Internship", "department": "Agronomy (AGRO)", "credits": "1-5 Credits/Maximum of 5", "description": "Supervised field experience related to the student's major.", "prerequisite": "approval of proposed assignment by instructor prior to   registration."}, {"course_name": "AGRO 496: Independent Studies", "department": "Agronomy (AGRO)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "AGRO 496A: **SPECIAL TOPICS**", "department": "Agronomy (AGRO)", "credits": "3-4 Credits"}, {"course_name": "AGRO 497: Special Topics", "department": "Agronomy (AGRO)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]