[{"course_name": "ARTH 1S: First-Year Seminar in Art History", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "An introduction to the field of art history, through an examination of a selected issue in a seminar setting. ARTH 1S First-Year Seminar (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This First-Year Seminar is open to all majors and to those who have yet to decide upon a major. It is also a 3-credit General Education in the Arts course (GA). The course will introduce entering university students to the field of art history through a case study on a selected topic. Each semester the topic will be different, potentially covering such diverse subjects as the purpose and function of Ancient Egyptian architecture to the role of sculpture in Renaissance Florence to the development of abstract painting in the early 20th century. Some semesters, the seminar may also focus upon a single exhibition at the Palmer Museum of Art. Such a focus upon a single topic will allow the class to look at a particular issue in the field from many different perspectives. The course will not be a broad survey of the history of art, but it will introduce students to the breadth of methods and approaches of art history. The seminar approach of the course will emphasize how to tackle an issue in art history, how to critically read selected texts, how to discuss in a small group the various dimensions of a problem, how to do art historical research in the library and on the internet, and how to present your own research and perspectives through public speaking and writing.", "other": ["Bachelor of Arts: Arts", "First-Year Seminar", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ARTH 100: Introduction to Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "An approach to the understanding of art through a critical analysis of selected works of architecture, painting, and sculpture. ARTH 100 Introduction to Art (3) (GA;IL)(BA). This course meets the Bachelor of Arts degree requirements. Art History 100 provides an introduction to the history of art from prehistory to the present, through selected topics, rather than a comprehensive survey. Areas covered usually include prehistoric art, art of the Near East and Egypt, ancient Greek and Roman art, medieval art culminating with the Gothic, Renaissance art both in Italy and northern Europe, Baroque and Rococo art, and modern developments often highlighting Romanticism, Impressionism, Cubism, Dada, Surrealism, Abstract Expressionism, Pop, Feminist, and contemporary art. The course also introduces selected artistic traditions in Africa, Asia and the Americas. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and to help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts, both historical and contemporary. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender and the incorporation of non-European art forms into the Western tradition. Requirements typically include examinations combining short answer and essay questions, and one paper based library research or intensive examination of an actual work of art. As a general education course in the arts, this course provides an introduction to selected themes in the broad history of art for students in any major. It has no prerequisite and presumes no prior exposure to fine art. This course is not a requirement of Art History major or minors, and is therefore directed essentially to students outside the field. Students who have passed ARTH 110 may not schedule this course.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 105N: Pictures and Power", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "ARTH 105N Pictures and Power (3) (GA) (GS) (BA)  In an era in which information is increasingly visual, and in an age in which our environment is ever more packed with imagery, students need powerful tools with which to interpret, compare, use and challenge images. This class is about the ways in which popular imagery pleases, informs, persuades, and otherwise exerts power. The class will analytically explore popular imagery and the influence it has exerted historically and today. The class will also acquaint students with works of art that have informed, attempted to draw upon or even contested the power of popular imagery. Particular emphasis will be placed on the interrelatedness of imagery; just as religious paintings of the Renaissance often exerted their force their meaning by virtue of their companionship with architectural sites, music and ritual practices, contemporary popular imagery (from graffiti to broadsides to memes) depends upon the larger constellation of events and artifacts in which they are embedded. The class will equip students with interpretive techniques by which they can examine and think critically about the power worked by pictures, those that exerted influence in the past as well as those students are likely to encounter day-to-day, including selfies, fashion spreads, and corporate logos and product labels.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 107N: Rocks, Minerals, and the History of Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This online course investigates select rocks and minerals used in the production of art between the Prehistoric Era and the Early Modern period. Topics covered include chemical and physical properties, occurrence in nature, the processes by which natural materials are acquired and worked, their symbolic and monetary value, and specific works of art in which they are found. Each material (ochre, garnet, lapis lazuli, rock crystal [quartz], igneous rocks [basalt, diorite and porphyry], alabaster and marble) is addressed in a 2-week unit. The seven units are split equally between scientific analysis of the materials and art historical case studies. A final project integrates Geosciences and Art History topics to investigate the use of a chosen natural material in a specific work of art. Each material addressed in the course plays a crucial role in the history of art, and each one was particularly prized for its physical and material properties (color, hardness, etc.). Ochre was the first known pigment, and was in use by early humans for bodily adornment and for drawing and painting in caves and shelters as early as 100,000 years ago for bodily adornment and 40,0000 years ago in cave art. Its availability worldwide and in multiple strong colors made it a desirable choice. Lapis lazuli, by contrast, was difficult to obtain, and difficult to refine as a pigment. It was first used to make small sculptures and cylinder seals in the Ancient world, and was prized for its brilliant blue color. The difficulty in grinding and purifying blue pigment from lapis lazuli made it one of the most expensive pigments in the Medieval and Renaissance world--it was worth its weight in silver! Pure blue lapis pigment, when found in a painting, is always a sign of great expense and importance. Rock crystal was valued for its clarity and purity, and its extreme brittleness meant that works made from it were valued for their intricacy and fragility. Nero reportedly destroyed two elaborate crystal goblets in a rage, and in so doing, deprived future generations of masterpieces of the sculptor's art. In the Ancient Near East and Ancient Egypt, rock crystal was frequently used for amulets and other magical objects, while in the Medieval world, its purity was seen as a metaphor for the Virgin Mary. Garnet had a similar symbolic value in the Middle Ages: its red color was related to the blood of Christ, and it was thus used frequently in liturgical vessels. In the Ancient world, the rich red tone of garnets was prized in jewelry and in small-scale relief carvings. Igneous stones like porphyry, basalt and diorite were particularly prized for their extreme hardness and permanence, and thus the Law Code of Hammurabi was iinscribed on basalt to ensure its permanence. Other Ancient Near Eastern rulers had images of themselves made from basalt and diorite in order to ensure that those works would survive for centuries. Imperial porphyry, an igneous stone with a rich red-purple color, came from a single remote quarry in the Egyptian mountains. Its use was reserved just for the Imperial family in Rome, and it was used for carved sarcophagi, for columns, for colored veneers on floors and walls, etc., as a sign of Imperial authority. Marble is of course one of the most familiar of all art materials, used frequently for sculpture from the very beginnings of art production. The Greeks and Romans in particular took great pains to obtain different types of marbles with specific colors, veining patterns, etc., for use in both sculpture and architecture. Finally, alabaster is one of the easiest of all stones to work: it is so soft that one can make a mark simply with a fingernail! Its intricate banding and translucency made it a favorite material for thin-walled bowls and vases in the Ancient Near East, Ancient Egypt, and in the Classical world. Later, in Early Christian and Medieval Italy, it was used for windows instead of glass--sun shining through alabaster casts a golden glow into a church interior. By the Late Gothic period, alabaster was being exploited as an easily sculpted material throughout Europe, with major quarries and workshops in England (Nottingham), France, and Northern Spain.", "other": ["Cross-listed with: GEOSC 107N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 111: Ancient to Medieval Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course is an introduction to Western art before the Renaissance, to CE 1423. The topics covered in this course include prehistoric art in Europe; art of the Near East and Egypt; Aegean art; Greek and Roman art; Early Christian, Jewish, Islamic and Byzantine art; and Medieval art including Romanesque and Gothic developments. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and to help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender and the incorporation of non-European art forms into the Western tradition. Typical requirements include exams and a paper. As a general education course in the arts, this course provides an introduction to Ancient through Medieval art to a student of any major. This course has no prerequisite and presumes no prior exposure to art history. As a course in the Art History major, it teaches students both the common vocabulary of the field and the outlines of the field that form the foundation for future study. ARTH 111 serves as a companion course to ARTH 112, which deals with art from the Renaissance to Modern Times. ARTH 111 also complements ARTH 201, \"Ancient to Medieval Architecture.\"", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 111U: Ancient to Medieval Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Survey of Ancient Egyptian, Greek, Roman, Byzantine, Early Medieval, Romanesque, and Gothic art, with an emphasis on sculpture and painting.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 111Z: Ancient to Medieval Art Z", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course is an introduction to Western art before the Renaissance, from ca. 25,000 BCE to AD 1423. The topics covered in this course include prehistoric art in Europe; art of the Near East and Egypt; Aegean art; Greek and Roman art; Early Christian, Jewish, Islamic and Byzantine art; and Medieval art including Romanesque and Gothic developments. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and to help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender and the   incorporation of non-European art forms into the Western tradition. Typical requirements include exams and a paper. As a general education course in the arts, this course provides an introduction to Ancient through Medieval art to a student of any major. This course has no prerequisite and presumes no prior exposure to art history. As a course in the Art History major, it teaches students both the common vocabulary of the field and the outlines of the field that form the foundation for future study. Art History 111 serves as a companion course to Art History 112, which deals with art from the Renaissance to Modern Times. Art History 111 also complements Art History 201, \"Ancient to Medieval Architecture.\" ¿ARTH111Z is a linked course with CAMS 5Z.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 112: Renaissance to Modern Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course is a broad survey of the most important artists and developments in Western art from the early 14th century to the present, including architecture, sculpture and painting. In addition to being a survey of major monuments in art, the course is also intended as an introduction to the field of art history: to its studies of artistic style, iconography (the study of subject matter and its meaning), patronage and contextual history. Art history not only studies the formal elements of art, like the use of color and line, but also analyzes the historical circumstances (social, political, economic) that surround the production of art, and it questions the meaning of works of art for viewers of the time and for later generations. Around 1310, an artist known as Giotto painted several major series of frescoes (mural painting done on wet plaster) in which we see the beginnings of a modern Western notion of composition, dramatic narrative, and the illusion of perspective. We will look at the refinements of these elements of art through the late nineteenth and early twentieth centuries, when artists we now call avant-garde-notably Cézanne but also predecessors such as Courbet and Manet, and successors such as Picasso and Matisse-presented serious challenges to these fundamental elements of painting. We will look at the extraordinary art produced between the time of Giotto and Cézanne, as well as the consequences of the modernist challenge to art, including 20th-century abstract painting and conceptual art.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 112U: Renaissance to Modern Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Survey of Renaissance, Baroque, Rococo, Romantic, Modern, and Contemporary art, with an emphasis on painting, sculpture, and graphic arts.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 115N: Arts of Love", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course will familiarize students with expressions of love in Western arts and literature. Students will analyze the artistic, philosophical and literary representations of courtship, friendship, homoeroticism, sexuality, marriage, adultery, and familial bonds and explore how the preceding phenomena are inflected by gender roles, race and miscegenation, and class and religious differences. We will also trace the way particular narratives about love have been adapted by different artistic media. Love is a universal human experience and its study transcends disciplinary boundaries. It is a linchpin of human existence, uniting and enriching nearly any subject worthy of serious study.", "other": ["Cross-listed with: ENGL 115N", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ARTH 120: Asian Art and Architecture", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course surveys Asian art and architecture from the earliest civilizations to the present day, focusing more on the arts and monuments from China, Japan and India but also introducing those from Korea, Southeast and Central Asia. We will study how artistic traditions develop, transmit and become localized in those distinctive yet interconnected societies, and how those traditions interact with the political, religious, social and cultural contexts in which they grow. Issues investigated include (but are not limited to) the spread and metamorphosis of Buddhist, Hindu and Islamic art and architecture, the production and consumption of art as related to political power (including colonialism, decolonization and nationalism), social hierarchies and market mechanisms, and various forms of modernity in Asian art and culture. In addition to regular class meetings, requirements include slide identification exams, essay exams and short papers. We will also have field trips to museums with collections of Asian art that are suitable for this course, and you will curate an online exhibition of artworks of your choice. As a general education course, this class provides an introduction to Asian art for students of any major. Art History majors will broaden their vocabulary, methodology and knowledge of the discipline.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 120Z: Asian Art and Architecture -LINKED", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course surveys Asian art and architecture from the earliest civilizations to the present day, focusing more on the arts and monuments from China, Japan and India but also introducing those from Korea, Southeast and Central Asia. We will study how artistic traditions develop, transmit and become localized in those distinctive yet interconnected societies, and how those traditions interact with the political, religious, social and cultural contexts in which they grow. Issues investigated include (but are not limited to) the spread and metamorphosis of Buddhist, Hindu and Islamic art and architecture, the production and consumption of art as related to political power (including colonialism, decolonization and nationalism), social hierarchies and market mechanisms, and various forms of modernity in Asian art and culture. In addition to regular class meetings, requirements include slide identification exams, essay exams and short papers. We will also have field trips to museums with collections of Asian art that are suitable for this course, and you will curate an online exhibition of artworks of your choice. As a general education course, this class provides an introduction to Asian art for students of any major. Art History majors will broaden their vocabulary, methodology and knowledge of the discipline. ARTH 120Z is linked to ASIA 100Z", "other": ["International Cultures (IL)", "General Education: Arts (GA)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 125: Islamic Architecture and Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Survey of the art and architecture of Islamic lands from the late seventh century until the eighteenth century. ARTH 125 Islamic Architecture and Art (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 125 provides an introduction to the arts of Islam from its birth and early formation in the seventh-eighth centuries to the eighteenth century through the examination of architecture, painting and calligraphy, and the decorative arts (metalworking, ceramics, glassware, ivory carving). The focus is on the traditional Islamic areas including Spain, North Africa, the Middle East, and South Asia, although the spread of Islam to other regions (e.g., Southeast Asia and especially Indonesia, the world's most populous Islamic country) may also be included. Each of the major traditions of Islamic art will be examined in a generally chronological sequence; these include the Abbasids, the Ummayads of Spain, the Fatimads of Egypt, the Seljuqs, the Ilkhanids (Mongols), the Timurids, the Mamluks of Egypt, the Safavids of Persia, the Ottoman Turks, and the Mughals of India. The course will conclude with a discussion of \"Orientalism\" and more recent developments in Islamic art and architecture. The course is designed to meet two principal goals. The first is to develop skills of visual analysis and a critical vocabulary for discussing the media, technologies, styles, and composition of Islamic art. The second is to foster an understanding of art--and visual culture in general--according to social, economic, political, and religious contexts. Key topics include: patronage, issues of reception and aesthetics, the important link between art and text in the Islamic tradition, the organization and use of sacred space, gender issues, relationships between the art of various regions and cultures, and the western interpretation of Islam as part of the discourse on \"Orientalism.\" Requirements include essay exams and at least one paper. As a general education course, this class provides an introduction to Islamic art and architecture for students of any major. It has no prerequisites, and presumes no prior exposure to art history. Students majoring in Art History will learn vocabulary, methodology, and theory that is not only basic to the field, but which will also broaden their knowledge of the discipline as a whole.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ARTH 130: Art of Africa, Oceania, and the Americas", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A selective overview of the indigenous art of Africa, Oceania and the Americas. ARTH 130 African, Oceanic, and Native American Art (3) (GA;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. ARTH 130 provides a selective introduction to major developments and issues in African and Oceanic art. The beginning of this course will concentrate upon the art and architecture of selected regions of Africa, during the pre-colonial, colonial, and post-colonial periods. This will be followed by a discussion of the traditional arts of Oceania in Polynesia, Micronesia, Melanesia, and Australia. The course will conclude with an introduction to the Pre-Columbian art and architecture of the Americas and art from the Eastern Woodlands, Great Plains, the Southwest and Pacific Northwest of North America. Art will be examined within its cultural and social contexts. Special attention will be given to the role that art serves in a culture's religion, rituals, ceremonies, political structure, gender roles, and ethnic identity. The impact of the West upon the art of these regions, both in colonial and post-colonial contexts, will be a reoccurring issue in this course. The actual time devoted to each topic and the sequence of topics will vary from instructor to instructor. The objective of the course is to introduce students to diversity in art. In so doing, negative stereotypes associated with traditional notions of the \"primitive\" will be challenged. Also, the course emphasizes visual analysis and critical thinking. The course requirements will consist of exams and a paper. As a general education course, this class provides an introduction to African and Oceanic art for students of any major. The course has no prerequisites, and presumes no prior exposure to art history. On the other hand, students majoring in Art History will learn vocabulary, methodology, and theory that is not only basic to the field, but which will also broaden their knowledge of the discipline as a whole.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 140: Introduction to the Art and Architecture of the Mayas, Aztecs, and Incas", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course examines the artistic and architectural production of Pre-Columbian Mesoamerica and the Andes.  ARTH 140 Introduction to the Art and Architecture of the Mayas, Aztecs, and Incas (3)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the art and architecture created by the Pre-Columbian indigenous cultures of Mesoamerica and South America, geographical regions today defined by the nations of Mexico, Guatemala, Belize, Honduras, Ecuador, Peru, Chile and Argentina. Its content spans a deep expanse of history, in Mesoamerica ranging from the Pre-Classic period (1200 BCE) through the Post-Classic period (CE 1521) and in South America, from the Early Horizon (1200 BCE) through the Late Horizon (1532). Culturally, we will pay particular attention to the Maya, Aztecs and Inca, but the precursors of these societies, the Olmec, Teotihuacan, Chavin de Huantar, the Moche, will also be studied. This introductory course approaches the material both thematically and chronologically, addressing how different cultures of the Pre-Columbian world utilized art, architecture, and their production in the cultural arenas of urbanism, public ritual, politics, myth-history and intercultural exchange. In addition to lectures, the course's required reading and class discussion will aid students in acquiring a basic knowledge of Pre-Columbian cultural practices.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 197: Special Topics", "department": "Art History (ARTH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 199: Foreign Study--Art History", "department": "Art History (ARTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 201: Ancient to Medieval Architecture", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A survey of Prehistoric, Ancient Near Eastern Egyptian, Greek, Roman, Early Christian, Byzantine, Early Medieval, Romanesque, and Gothic architecture. ARTH 201 Ancient to Medieval Architecture (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is an introduction to architecture from the Prehistoric to the Gothic periods. Some of the topics covered in this course include prehistoric architecture in Europe and the Mediterranean, architecture of the ancient Near East, Egyptian architecture, Minoan and Mycenean architecture, the classical architecture of ancient Greece, ancient Roman architecture throughout the empire, the Early Christian architecture of western Europe and Byzantium, early medieval architecture, Middle Byzantine architecture, Islamic architecture, and the Romanesque and Gothic architecture of Western Europe. Selected major individual buildings and architectural complexes will be emphasized and will include types of buildings/complexes such as the sanctuary, temple, tomb, forum, basilica, cathedral, monastery, and castle. Architecture will be analyzed with regard to materials' construction, engineering and design, and in the contexts of culture, society, and urban or rural setting. Political, economic, religious, ethnic and gender-related issues will be presented as they are part of the dynamics contributing to many of these structures. The course has no prerequisite and is intended for both students of architecture/art and students unfamiliar with the field. This course also serves as an introductory foundation course for students in the arts, particularly architecture and landscape architecture. The companion course to ARTH 201 is ARTH 202, \"Renaissance to Modem Architecture,\" which examines Western architecture after A.D. 1400. ARTH 201 is a required course for the Major in Art History and the Interdisciplinary Minor in Architectural History.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "ARTH 202N: Renaissance to Modern Architecture", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course is an introduction to the history of architecture, primarily in Europe and North America, but also in Asia and South America, from approximately 1400 to the present. Selected architects, structural ideas, buildings, and urban developments will be emphasized. Architecture will be considered within the contexts of religion, politics, philosophy, economics, gender, society, technology, engineering, landscape architecture, urban planning and interior design. This course has no prerequisite and is intended for both students of architecture/art and students unfamiliar with the field.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ARTH 204: The Art of Marvel: Italy and Spain 1600 - 1750", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This class is intended to provide a general introduction to the art and architecture of Italy and Spain from roughly 1590-1750. Discussion will concentrate on what constitutes the baroque and its interpretation in each geographic area as well as issues such as patronage, primary sources, iconography, and historical context. The goal is to increase your visual analysis skills and help build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second goal is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "ARTH 207: The Eternal City: Rome from Antiquity to the Present", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This class provides an introduction to the architecture and urbanism of the city of Rome from its founding to the present. The class will examine the ways in which the city came into being and was shaped over time, thereby allowing students to come away with a profound understanding of the different ways human societies have used the arts to both reflect and reinforce social and cultural traditions. Selected architects, structural ideas, buildings, and urban developments will be emphasized. In the ancient period, the class will look at the founding myths of Rome and buildings from the republican and imperial periods. With the fall of the Roman empire, the class will look at the city during the period it was controlled by the papacy, examining projects of various popes, ecclesiastical institutions, and secular patrons. The final portion of the course will look at how Rome was remade into the capital of modern Italy, and how the image of Rome was used in film. Throughout the course, buildings and urban spaces will be considered within the contexts of religion, politics, philosophy, economics, gender, and society. This course has no prerequisite and is intended for both students of architecture/art and students unfamiliar with the field.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 215: Architecture and Art of South and Southeast Asia", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Survey of the architecture/art of South/Southeast Asia (emphasis on India) from the Bronze Age to a globalizing present. ARTH 215 / ASIA 215 Architecture and Art of South and Southeast Asia (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course has a focus on the architecture and art of South Asia (India, Pakistan, and Bangladesh) and Southeast Asia (particularly Thailand, Cambodia, and Indonesia). Topics will span a time period that begins with Bronze age urbanization in South Asia and concludes with the emergence of globalized architecture in the context of modern nation states. The course will be an opportunity for students to engage with artistic traditions and patronage systems that have adapted to cross-cultural currents, including the more recent forces of colonialism and globalization. Early Buddhist and Hindu architecture and sculpture, the medieval Hindu temple, the advent and adoption of Islam and its artistic forms, the emergence of an early modern empire under the Mughals and their patronage of architecture and painting, British colonial architecture and contemporary interpretations of Modernist architecture and art, are some of the topics that will be covered. Besides paying attention to the formal aspects of buildings, cities and objects, lectures will incorporate information on the emergence of Art History as a discipline in South and Southeast Asia. Lectures, exams and reading assignments will aid in providing students with an intensive introduction to the region's cultural and artistic diversity.", "other": ["Cross-listed with: ASIA 215", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ARTH 220: Chinese Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A general survey of the great periods of Chinese art from the Shang dynasty until the modern period. ARTH 220 Chinese Art (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. ARTH 220 provides an introduction to the art of China from the Neolithic period through the twentieth century. Emphasis will be placed on the major dynastic periods (Shang, Zhou, Qin, Han, Tang, Song, Ming, Yuan, and Qing); however, regional developments throughout China are examined as well. Students are introduced to a variety of artistic traditions and media, including jades, bronzes, ceramics, sculpture, painting, and architecture. The course is designed to meet two principal goals. The first is to develop skills of visual analysis and a critical vocabulary for discussing the media, technologies, styles, compositions and iconographies of Chinese art. The second is to foster an understanding of art--and visual culture in general--according to social, economic, political, and religious contexts. Key topics include: the ritual use of objects, patronage, issues of reception and aesthetics, Buddhist art, the organization and use of sacred space, depictions of gender, and regional developments/interactions. Requirements include essay exams and at least one paper. As a general education course, this class provides an introduction to Chinese art for students of any major. This course has no prerequisites and presumes no prior exposure to art history or the history of China. Students majoring in Art History will learn vocabulary, methodology, and theory that is not only basic to the field, but which will also broaden their knowledge of the discipline as a whole. Because China (currently the world's most populous nation) has one of the longest recorded and continuous artistic traditions, the course also contributes to a broader understanding of important global issues.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 220Z: Chinese Art - Linked", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A general survey of the great periods of Chinese art from the Shang dynasty until the modern period. ARTH 220Z Chinese Art - Linked (3) (GA;IL)(BA) ARTH 220Z provides an introduction to the art of China from the Neolithic period through the twentieth century. Emphasis will be placed on the major dynastic periods (Shang, Zhou, Qin, Han, Tang, Song, Ming, Yuan, and Qing); however, regional developments throughout China are examined as well. Students are introduced to a variety of artistic traditions and media, including jades, bronzes, ceramics, sculpture, painting, and architecture. The course is designed to meet two principal goals. The first is to develop skills of visual analysis and a critical vocabulary for discussing the media, technologies, styles, compositions and iconographies of Chinese art. The second is to foster an understanding of art--and visual culture in general--according to social, economic, political, and religious contexts. Key topics include: the ritual use of objects, patronage, issues of reception and aesthetics, Buddhist art, the organization and use of sacred space, depictions of gender, and regional developments/interactions. Requirements include essay exams and at least one paper. As a general education course, this class provides an introduction to Chinese art for students of any major. This course has no prerequisites and presumes no prior exposure to art history or the history of China. Students majoring in Art History will learn vocabulary, methodology, and theory that is not only basic to the field, but which will also broaden their knowledge of the discipline as a whole. Because China (currently the world's most populous nation) has one of the longest recorded and continuous artistic traditions, the course also contributes to a broader understanding of important global issues. This course is linked to CHNS 120Z", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "General Education - Integrative: Linked", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 222N: Intersections between Art History and the History of Psychology", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "ARTH 222Q: Intersections between Art History and Psychology Why is there a cultural association between mental illness and artistic creation? What is the history of this association? Is there a psychological foundation for it or is it a cultural stereotype with no basis in reality? To address these questions this course will explore the integrated histories of modern psychology and avant-garde art from the late 19th century to the present, comparing the different approaches to the topic in the disciplines of art history and psychology. We will discuss the possible benefits and drawbacks of each approach. By celebrating genius, art history has often been complicit in perpetuating the stereotype of the \"mad\" artist, even romanticizing it and discounting the reality of disease; whereas psychologists often view images as symptoms, misinterpreting the art historical context in which artists work. Interestingly, avant-garde art has often been associated with \"insanity\" with both negative and positive connotations. As a history of art and psychology course, the syllabus is organized as a chronological survey focusing on points of intersection between avant-garde art and psychology. Many of these points will be the lives and works of individual artists who either suffered mental illness, such as Vincent van Gogh, or engaged with psychology and mental illness as the subject of their art, as did Edvard Munch, the creator of the famous image, The Scream. In each case it is interesting to look at the reciprocity between the two disciplines: how the artists represented mental illness and transformed psychological theories into visual art and how psychologists and the medical establishment have responded to these artists, using them as diagnostic subjects. We will look specifically at bi-polar disorder and the psychological debates surrounding its relationship to artistic creativity. We will also look at larger avant-garde movements such as Expressionism and Surrealism, movements inspired by therapeutic practices, the art of mental patients, and psychoanalytic theory. We will look at the legacy of each of these movements in contemporary avant-garde art, including attitudes toward Outsider or Visionary artists and modern art therapy. Particular emphasis will be placed on psychoanalytic theory. Sigmund Freud's interest in art impacted his work and has rendered his writings conducive to artistic interpretation even today, although his theories have been rejected by many contemporary psychologists. We will look at artists who directly responded to Freud's writings such as Max Ernst and Salvador Dali, female surrealists such as Leonora Carrington, and issues surrounding \"hysteria\" as it was adopted by both male and female surrealists as a model for creative expression, and which continues to inform feminist art practices today. While contemporary avant-garde artists continue to respond to various psychological theories and practices, contemporary psychologists use formal analysis to understand the art of mental patients and employ artistic practices in the development of modern art therapy.", "prerequisite": "ENGL 15", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "International Cultures (IL)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ARTH 222Q: Intersections between Art History and the History of Psychology", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "ART H 222Q: Intersections between Art History and Psychology Why is there a cultural association between mental illness and artistic creation? What is the history of this association? Is there a psychological foundation for it or is it a cultural stereotype with no basis in reality? To address these questions this course will explore the integrated histories of modern psychology and avant-garde art from the late 19th century to the present, comparing the different approaches to the topic in the disciplines of art history and psychology. We will discuss the possible benefits and drawbacks of each approach. By celebrating genius, art history has often been complicit in perpetuating the stereotype of the \"mad\" artist, even romanticizing it and discounting the reality of disease; whereas psychologists often view images as symptoms, misinterpreting the art historical context in which artists work. Interestingly, avant-garde art has often been associated with \"insanity\" with both negative and positive connotations. As a history of art and psychology course, the syllabus is organized as a chronological survey focusing on points of intersection between avant-garde art and psychology. Many of these points will be the lives and works of individual artists who either suffered mental illness, such as Vincent van Gogh, or engaged with psychology and mental illness as the subject of their art, as did Edvard Munch, the creator of the famous image, The Scream. In each case it is interesting to look at the reciprocity between the two disciplines: how the artists represented mental illness and transformed psychological theories into visual art and how psychologists and the medical establishment have responded to these artists, using them as diagnostic subjects. We will look specifically at bi-polar disorder and the psychological debates surrounding its relationship to artistic creativity. We will also look at larger avant-garde movements such as Expressionism and Surrealism, movements inspired by therapeutic practices, the art of mental patients, and psychoanalytic theory. We will look at the legacy of each of these movements in contemporary avant-garde art, including attitudes toward Outsider or Visionary artists and modern art therapy. Particular emphasis will be placed on psychoanalytic theory. Sigmund Freud's interest in art impacted his work and has rendered his writings conducive to artistic interpretation even today, although his theories have been rejected by many contemporary psychologists. We will look at artists who directly responded to Freud's writings such as Max Ernst and Salvador Dali, female surrealists such as Leonora Carrington, and issues surrounding \"hysteria\" as it was adopted by both male and female surrealists as a model for creative expression, and which continues to inform feminist art practices today. While contemporary avant-garde artists continue to respond to various psychological theories and practices, contemporary psychologists use formal analysis to understand the art of mental patients and employ artistic practices in the development of modern art therapy.", "prerequisite": "ENGL 15", "other": ["International Cultures (IL)", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ARTH 224N: Authors and Artists", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course explores the many links between modern art and literature, including fiction about artists, illustrations of fiction and poetry, efforts to write in the styles associated with modern art, and practices of ekphrasis (the evocation of visual art in language). These links between authors and artists have exerted a formative influence on the development of modern fiction and poetry as authors and artists in various avant-garde groupings collaborated and competed to generate modes of artistic expression appropriate to modernity. This course examines those interactions. Course objectives are to bring together for comparative examination: * Formal or generic relationships between texts and images at particular historical moments; under this rubric we will consider issues such as ekphrasis. * Creative collaboration and cross-pollination between writers and artists, which have been crucially important in the history of literature and poetry; examples include Pre-Raphaelite poetry and painting, Virginia Woolf and Post-Impressionism, Gertrude Stein and Cubism * Conceptions of creativity as these have been expressed by writers using the figure of the artist; texts in this category range from Balzac's The Unknown Masterpiece, through Hawthorne's The Marble Faun, to Paul Auster's appropriation from the performance artist Sophie Calle This course explores the ways knowledge of literature and skills in critical reading can be rewardingly brought to bear on the visual arts, and considers how visual art can illuminate the workings of literature both for individual readers and in the classroom.", "other": ["Cross-listed with: ENGL 224N", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 225N: Sexuality and Modern Visual Culture", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "ENGL 225N / ARTH 225N / WMNST 225N Sexuality and Modern Visual Culture (3) (GA;GH) An examination of the visual expression of gender and sexual identities in English-speaking cultures since the late nineteenth century. The terms \"feminist\" and \"homosexual\" were invented by the Victorians and reflect profound shifts in conceptions of identity. Another invention of the nineteenth century was the idea of the literary and artistic \"avant-garde\" as a minority contingent with politically and/or aesthetically advanced views. These ideas of minority culture were deeply enmeshed with one another, and have exerted profound influence ever since. This course explores that history with the objectives of expanding students' knowledge of modern art and literature, and of fostering more sophisticated understandings of how evolving socio-political ideas affect our sense of who we are and how we relate to texts and images. The course is relevant to students of American and English studies, art, art history, and women's, gender and sexuality studies.", "other": ["Cross-listed with: ENGL 225N, WMNST 225N", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ARTH 226: The Comic Book: A History of Sequential Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "An overview and examination of the history of sequential art with a focus on comic books and graphic novels.  ART H 226 The Comic Book: A History of Sequential Art (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Art History 226 will lead students on a journey through one of the world's most interesting and yet most misunderstood art forms. In this class, students will familiarize themselves with various styles, terminology, and major examples of sequential art beginning with the cave paintings of Lascaux and ending with the more popular and critically acclaimed comic books of recent years. Students will not only learn a bout and appreciate sequential art, but they will also understand how deeply and significantly these works have melded into various aspects of our culture and society.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"course_name": "ARTH 250: A Chronological Survey of Photography", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A survey of photography's place and influence in a social, cultural, and historical context.  ART H 250 A Chronological Survey of Photography (3) This course explores the role played by photography over time in providing understanding and insight in a social, cultural, and historical context of the impact of the development of the photographic medium and its effect on social, political, cultural and technological events. Emphasis will be given to understanding the context that surrounds the scientific and aesthetic development of photography. This is a survey of the chronology of events in western culture that transpires from the inception of photography until the year 2000. It includes the influences and outcomes of photographers and those associated with the medium on our culture. Emphasis will be placed on the influence of photography on the world around it, and significant events and individuals in the development of the medium as a vital art form. The structure of the course will consist of research and discussion of events and individuals that characterized years selected for examination. Each week one or two decades of western culture will be highlighted. Although the thrust of research will relate to photographic subject matter, the events studied will span the culture. We will explore the development of art, literature, music, and photography, as well as, historic landmarks, and the events that have shaped present society. Each week a selection of visual material will be presented highlighting selected events, students will read literature from the period of discussion, significant pieces of music will be introduced, and accounts of periodic events will be surveyed.Each week, a group of students will be assigned to research at least one decade. Each student will gather information about a significant figure or event that occurred in the course of a given period. The student will be expected to prepare a short paper and give a five-minute oral presentation about his/her assigned year, historical figure or event. As each student presents, the chronology of events becomes clear and the multiple threads of history weaves a brilliant tapestry of our culture. For the final presentation the student will prepare a ten-page research paper about a historical figure or event.Students will be graded on the quality of the weekly oral presentations and the demonstrated level of commitment to research. Another significant part of their grade will be derided from the length of committed scholarship given to the ten-page term paper. Students must exhibit a level of originality, clarity, and insight. The student must demonstrate the capacity for the assimilation of facts and events relative to their subject and demonstrate how their subject relates to other events that occurred around the same time of their event. Toward this end students will be encouraged to work together to illustrate the interconection of the chronology.", "other": ["Cross-listed with: PHOTO 201"]}, {"course_name": "ARTH 260: Museum Marketing & Communications", "department": "Art History (ARTH)", "credits": "1-3 Credits", "description": "This course provides a well-rounded introduction to strategic communications, marketing, and publicity in arts institutions. In this course, students will gain an understanding of marketing and communications theory while also acquiring the practical skills used by art-world professionals. The ever-changing world of digital marketing, content, and messaging are essential to the success of museums, galleries, auction houses, art fairs, publishers, and other arts institutions responsible for branding and promoting the arts. This course will serve art history majors and minors by giving them practical, career-oriented skills and knowledge; non-majors will likewise benefit from theoretical and practical knowledge of strategic communications, publicity, and marketing as they are practiced in arts institutions."}, {"course_name": "ARTH 280: The Secret Lives of Things: Design and Decorative Arts since the 18th Century", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course will study the meanings of ordinary and extraordinary objects of daily life. Ranging from pre-Revolutionary France to the global present, we will look at furniture, interiors, graphics, appliances, ceramics, and other ornamental and useful goods in Europe and America within their aesthetic, historical, economic, social and political contexts. Among other issues, the course will consider the effects of technological change such as changing conditions of labor; industrialization and new means of production and distribution of objects; the advent of synthetic materials; and effects of production and consumption on the environment. We will discuss the relationship of objects to gender-how gender roles are encoded in, defined and redefined by objects-and patterns of domestic life. Another theme of the course will be habits of consumption, where goods are bought and sold, how meaning is attached to consumption and purchases become linked to the presentation of a social self. The course addresses the General Education objectives of Effective Communication, Key Literacies and Global Learning, and will fulfil the objectives of a GA course by demonstrating the essential methodologies of art history and visual culture, including formal analysis, formal comparison, cross-cultural comparison how historical evidence, especially primary source accounts of objects, enable us to understand a work in its original context. In familiarizing students with examples of styles, makers, and types of object, the course teaches students how works of visual and material culture embody and express cultural values and social categories and expand students' knowledge and comprehension of the role that the arts play in various aspects of human endeavor.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 292N: Witches and Witchcraft from the Middle Ages to the Present", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course will explore the social and cultural history of witches and witchcraft from the late Middle ages in Europe and the U.S. to the present. The very nature and broad scope of the topic lends itself to an interdisciplinary approach that combines history, folklore, religious studies, criminology, women's studies, art history, English literature and popular culture. Historically, real individuals were accused of witchcraft and suffered persecution and punishment accordingly. Others proclaimed themselves to be witches and the practice continues to attract adherents today such as in the modern Wiccan movement. However, modern consensus views witches as fictions: figures of magical power in folklore, literature, visual art and popular culture. From Shakespeare's Macbeth to the characters in the popular Harry Potter books and films, fictional witches have haunted European and American culture for centuries. This course will explore the complex interplay of fact and fiction in the history of witches and witchcraft. In other words, how do fictions become powerful enough to inform history? The course will also focus on the historical status of witches as a source of power outside of, and in opposition to, established political, religious and social structures. Since those accused of witchcraft were predominately women, how has witchcraft functioned as a means of empowerment for women as well as a tool for their persecution? And how has the representation of witches influenced attitudes towards women both historically and today? The course will begin with an historical inquiry into the belief in witchcraft during the late Middle Ages in Europe and the social and cultural role witches played in society. We will look at texts such as the Malleus Maleficarum (Hammer of Witches) published in 1486 as a guide for hunting and destroying witches, as well as studies on the more constructive role witchcraft may have offered women and communities. The course will be organized chronologically and move back and forth between history, such as the Salem witch trials, and the representations of that history in art, literature and film. Particular emphasis will be placed on the visual arts, from the engravings of German Renaissance artists such as Albrecht Durer and Hans Baldung Grien, the gothic paintings of Francisco Goya during the Romantic period, to contemporary artist Louise Bourgeois' monument to those executed as witches in Norway. The course will end with analysis of images of witches in popular culture, movies and television, and with a discussion of the modern representations of the domesticated witch and the femme fatale.", "other": ["Cross-listed with: HIST 292N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "ARTH 296: Independent Studies", "department": "Art History (ARTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 297: Special Topics", "department": "Art History (ARTH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 299: Foreign Study--Art History", "department": "Art History (ARTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 301: Egyptian and Mesopotamian Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "ART H 301 Egyptian and Mesopotamian Art (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art history 301 provides an introduction to the arts of the Ancient Near East including those of Egypt and Mesopotamia. The class is dealt with chronologically. Works studied in class include papyri, seals, fabric, codices as well as sculpture, architecture, and painting. Additional readings of primary sources focused on mythology, and religion will form a key element in the structure of the class. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to Ancient Near Eastern and Egyptian art to a student of any major. This course has no prerequisite, and presumes no prior exposure to fine art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 302: Early Medieval Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A survey of the art of Western Europe from the Early Christian era through the Ottonian Empire, c.300-1050 CE. ART H 302 Illuminating the Dark Ages (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 302 concentrates on the art of northern Europe between 600 and 1050 CE, from the years which saw the art and culture of the migration period in Europe meet and merge with the Greco-Roman traditions of the Mediterranean, to the beginnings of Romanesque art. Arts of the Jewish and Islamic traditions will also be discussed. Works studied include architecture, manuscript painting, ivory carving and goldsmith work, most of which were produced by or for members of the clergy, royalty or the lay aristocracy. The basic structure of the course is chronological. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender, sexuality, and race. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to early Medieval art to a student of any major. This course has no prerequisite, and presumes no prior exposure to art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "ARTH 303: Italian Renaissance Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "The major arts in Italy from the thirteenth century CE through the Renaissance; emphasis on sculpture and painting. ARTH 303 Italian Renaissance Art (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 303 provides an introduction to the art of the early and \"high\" Renaissance in Italy, conceived in chronological terms as the period from c. 1300 to c. 1530, and embracing developments from the emergence of the Mendicant orders on the later 13th century to the rise of Mannerism in the 16th century. Monuments form all parts of the Italian peninsula will be considered, with emphasis on the major centers of Florence, Siena, Venice, Rome, Milan, and Naples, as well as Mantua, Ferrara and Urbino. The basic structure of the course is chronological, and is divided into three sections corresponding to the three centuries defined by Giorgio Vasari in his Lives of the Artists. In each section, an attempt will be made to present the careers and major works of the most significant artists in relation to their historical and cultural context. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to Italian Renaissance art to a student of any major. This course has no prerequisite, and presumes no prior exposure to art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "ARTH 305: Romanticism and Revolution", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A survey of painting and sculpture in Europe 1780-1860, from the origins of Neoclassicism through Romanticism and Realism. ARTH 305 European Art from 1780-1860 (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 305 provides an introduction to the painting, sculpture, and graphic arts of Europe between ca. 1780 and 1860, with an emphasis on selected developments in France, Spain, England, and Germany. The course begins with the origins of Neoclassicism and the revolutionary art of Jacques Louis David. Art is examined within the context of the tumultuous history of this period, such as the decline of the French monarchy, the French Revolution and the rise and fall of Napoleon. The course will examine the rise of Romanticism, as seen in such diverse expressions as Goya's horrific images of inhumanity, Fuseli's dreams, Tumer's sublime landscapes, Friedrich's frozen visions of Gothic ruins, Delacroix's colorful battles of beasts. Realism emerges in the biting social conunentaries of Daumier, the meticulous detailed paintings of the English Pre-Raphaelites, and the raw reality of Courbet's paintings. The course ends with the extraordinary art of Manet. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. As a general education course in the arts, this course provides an introduction to European art, 1780-1860, to a student of any major. This course has no prerequisite and presumes no prior exposure to fine art. Students majoring in Art History will learn both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ARTH 307N: American Art and Society", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "History of art in the English colonies and the United States from the seventeenth century to the present. AMST 307N / ARTH 307N American Art (3) (GA;US)(GH)(BA) This course meets the Bachelor of Arts degree requirements. American art, from the colonial period to the present, is examined through paintings, sculpture, buildings, prints and photographs, as well as exhibitions and national/world fairs. The class places special emphasis upon the predicament of national identity by examining the ways in which the very notion of the \"American\" has historically been highly contested. Special points of emphasis include: negotiations between indigenous, colonial and European artistic styles, representations of and by displaced populations (colonial subjects, Native Americans, African Americans), myths of the American landscape, the cult of domesticity and the gendering of American citizenry, later transatlantic experiences of expatriate artists, conflicts between urban and rural conceptualizations of the \"typical\" American experience, the role of the American avant-garde after World War II, and debates over federal funding for the arts. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender, race, and ethnicity. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to American art to a student of any major. This course has no prerequisite and presumes no prior exposure to fine art. Students will learn both the common vocabulary of art history and method of critical analysis in the field.", "other": ["Cross-listed with: AMST 307N", "Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 308N: American Architecture", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "History of the architecture of the United States, as well as its Native American and colonial antecedents. AMST / ARTH 308N American Architecture (3) (GA;GH;US)(BA) This course meets the Bachelor of Arts degree requirements. This Art History course (cross-listed with American Studies) will cover the history of American architecture and its historical contexts, from its Native American roots and colonial antecedents, through the formation of the United States, to the present. A sample of the topics that will be covered are the architecture of: Native Americans, Spanish Colonial missions, 17th-century Virginia, Puritan New England, Georgian America, Southern Plantations and Slave Cabins, Thomas Jefferson, the new federal city of Washington, D.C., the Greek Revival, the industrial revolution, utopian religious communities such as the Shakers, Gothic Revival cottages and villas, Victorian Philadelphia, Henry Hobson Richardson, the birth of the skyscraper in New York and Chicago, the City Beautiful Movement, Frank Lloyd Wright, Arts & Crafts California, Henry Ford's Michigan, Art Deco New York, Mies van der Rohe and the glass box, Levittown, Disneyland, Louis I. Kahn, Post-Modernism, Frank Gehry, and Green Buildings. Selected major buildings, architects, ideas, and urban developments will be emphasized. Architecture will be considered within the contexts of religion, politics, philosophy, culture, economics, gender, race, society, technology, engineering, landscape architecture, urban planning and interior design. This introductory survey has no prerequisite and is intended for both students of architecture/art and students unfamiliar with the field. This is an Inter-Domain General Education course exploring American architecture from both the perspectives of the Arts (GA) and Humanities (GH). An exploration of the art, aesthetics and styles of American Architecture will be balanced with using architecture as a vehicle for understanding American history, culture, religion, society, and government.", "other": ["Cross-listed with: AMST 308N", "Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 311: Greek and Roman Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "ART H 311 Greek and Roman Art (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 311 provides a survey of Greek and Roman art. Included are the Orientalizing, Archaic, Classical and Hellenistic periods of Greece and the Republican and Imperial Rome. Special attention is paid to politics, culture, and literature. The focus of this class is painting, sculpture and architecture; ceramics and other minor arts are also addressed. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to Ancient Greek and Roman art to a student of any major. This course has no prerequisite, and presumes no prior exposure to fine art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 312: Romanesque and Gothic Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Survey of the architecture, sculpture, and painting of the Christian church in western Europe from 1000 to 1500. ARTH 312 Romanesque and Gothic Art (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 312 concentrates on the art of northern Europe between A.D. 1000 and 1500, from Ottonian art to Romanesque art continuing to the beginnings of Gothic art. Works studied include architecture, manuscript painting, ivory carving and goldsmithwork, most of which were produced by or for members of the clergy, royalty or the lay aristocracy. The basic structure of the course is chronological. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to Romanesque and Gothic art to a student of any major. This course has no prerequisite, and presumes no prior exposure to fine art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "ARTH 313: Northern Renaissance Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Art in northern Europe in the fifteenth and sixteenth centuries, emphasizing painters such as Van Eyck, Durer, and Bruegel.  ART H 313ART H 313 Northern Renaissance Art (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 313 explores the relationship of the visual arts to power structures, political events, and social and religious issues in the Netherlands and Germany, c. 1380-1585. Topics include the forms and functions of religious art, the place of visual representation in the governing strategies of the cra's rulers, the rising status of the artist, the new technology of printing, the complex role of visual culture in bringing about the Protestant Reformation, and the wave of destruction and censorship known as the Great Iconoclasm of 1566. Particular attention is paid to the works and careers of Jan van Eyck, Hieronymus Bosch, Albrecht Diirer and Pieter Bruegel. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to Northern Renaissance art to a student of any major. This course has no prerequisite, and presumes no prior exposure to fine art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)"]}, {"course_name": "ARTH 314: Art in the Age of Rembrandt", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Dutch and Flemish painting in the seventeenth century.  ART H 314ART H 314 Art in the Age of Rembrandt (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 314 explores the relationship of the visual arts to power structures, political events, and social and religious issues in the Netherlands and Flanders, c. 1585-1672. Topics include the function of art in constructing national and urban identities, social distinctions and gender roles, the contrasting needs burgher and court patrons, the effect of the open market on both the production of and the look of artwork, the impact of foreign investment and exploration on visual imagery, and the processes of artistic collaboration and competition. Particular attention is paid to the works and careers of Hendrick Goltzius, Frans Hals, Clara Peeters, Hendrik Terbrugghen, Rembrandt van Rijn, Peter Rubens and Jan Vermeer. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. Requirements include essay exams and at least one paper. As a general education course in the arts, this course provides an introduction to the Age of Rembrandt to a student of any major. This course has no prerequisite, and presumes no prior exposure to fine art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)"]}, {"course_name": "ARTH 325: Impressionism to Surrealism", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "A survey of European painting, sculpture, and photography from ca. 1850 to ca. 1940. ARTH 325 Impressionism to Surrealism (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. Art History 325 is a survey of European painting and sculpture from approximately 1860 to the Nazi occupation of Paris in 1940. This course will provide an introduction to Impressionism (Manet, Monet, Renoir, Morisot), Post-Impressionism (Seurat, Czanne, van Gogh, Gauguin), Symbolism, the Nabis, Edvard Munch, Rodin, Fauvism (Matisse), Cubism (Braque, Picasso), Italian Futurism (Boccioni), Expressionism (Kirchner, Kandinsky), Dada (Duchamp), De Stijl (Mondrian), Suprematism (Malevich), Russian Constructivism (Tatlin), the Bauhaus, Paul Klee, Marc Chagall, and Surrealism (Ernst, Miro, Dali). The course will close with Surrealist work done prior to the onset of the Second World War. The course is designed to meet two principal goals. The first is to increase students' powers of visual analysis and help them build a critical vocabulary for discussing an art object's medium, composition, style, and iconography. The second is to foster an understanding of the deep implication of the visual arts in their social and cultural contexts. The course therefore involves significant material relating to political, economic and religious issues. It investigates problems in patronage, function, reception and censorship. It considers such intra- and cross-cultural issues as representations of gender. As a general education course in the arts, this course provides an introduction to European art to a student of any major. This course has no prerequisite, and presumes no prior exposure to fine art. Students majoring in Art History will learn in it both the common vocabulary of the field and the outlines of the field that form the foundation for future study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ARTH 326: Art Since 1940", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "An international survey of painting, sculpture, photography and other media since 1940.  ART H 326 Art Since 1940 (3) (GA;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course offers a survey of art objects and practices after 1940. The class is international in scope, exploring the ways in which artists of different countries have responded to each other's work, and to international cultural and political events. Though the class will develop chronologically, lectures will be thematic in their emphasis. Topics to be covered include Abstract Expressionism, Pop Art and other forms of art relying upon methods of appropriation, Minimalism, Conceptualism, Fluxus and Performance Art, Land Art and Site-Specificity, and Art in protest movements (such as the Civil Rights movement). The course will also address such larger issues as: 1) the means by which art works engage in critiques of racial, sexual and national identity; 2) the political uses to which contemporary art has been put (often by figures other than the artists); 3) the dominant critical paradigms through which art has been filtered; 4) the relationship of art works to commodity culture and late capitalism; 5) and the ways in which contemporary art works challenge notions of exhibition, patronage, and ownership of art. This course should be of interest to students of Art History as well as to students interested in post-war history, literature and intellectual culture. It should also be of use to those enrolled in studio art, architecture and other practicum areas.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "ARTH 335: African Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Introduction to the visual arts of Africa, including contemporary African art and the influence of African art outside Africa. ARTH 335 / AFR 335 African Art (3)(GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. The course will examine the arts of various African peoples in historical, religious, sociological and geographic contexts, providing an introduction to the many visual art forms of Africa including masquerade, costume, and indigenous architecture. While many of the arts in this field of study are from west and central Africa, the course will also include materials from southern and eastern Africa. Contemporary African art, African Diaspora arts, and the influence of African art on European art are important topics that may be included. In addition to the traditional format of a geographic organization of the material, students will explore thematic approaches. Each of the assignments requires completion of essays which draw upon the multiple course texts and readings. Exams include image identification and short essays.", "other": ["Cross-listed with: AFR 335", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ARTH 350W: Undergraduate Seminar in the History of Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "An introduction to original research, methodology, analysis, and writing on a scholarly level.", "prerequisite": "Fourth-semester standing and 6 credits of ARTH", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"course_name": "ARTH 397: Special Topics", "department": "Art History (ARTH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 399: Foreign Study--Art History", "department": "Art History (ARTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 401: Greek Art and Architecture", "department": "Art History (ARTH)", "credits": "3-9 Credits/Maximum of 9", "description": "Developments in Greek art and architecture, tenth century B.C. to first century B.C.; emphasis on the importance of Greek sanctuaries.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 402: The Illuminated Manuscript", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Specific stylistic periods in manuscript painting from A.D. 500-1500 in Western Europe and Byzantium.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 405: Pioneers of Modern Architecture", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 6", "description": "Selected period or theme in the development of modern architecture during the nineteenth and/or early twentieth centuries.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "ARTH 409: Museum Studies", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "An introduction to the professional activities that occur in art museums. ART 409 / ARTH 409 Museum Studies (3)(BA) This course meets the Bachelor of Arts degree requirements. This course introduces students to the broad field of art museum work, specifically museum administration, education, curatorial work, registration, and exhibition design. Readings by authors in each field provide current theoretical and philosophical frameworks for all areas, which are then followed by discussions and practical experiences with professional museum practitioners, including the staff of a museum, for example, the Palmer Museum of Art, and invited guests. Museum Studies is open to students who have complete six credits in art, art education, or art history. This course is especially beneficial for majors in art, art education, and art history who are considering a career in an art museum or who want to become more aware about how an art museum functions. In addition to providing an in-depth introduction to art museum work, the course encourages students to build the critical thinking and response skills that are crucial to success in the real-world environment of a museum. The readings provide a solid foundation for later reference or further study in the student's chosen field. Offered every spring, this course will have a maximum enrollment of 20 students. Grades are based on class participation, four out-of-class projects, and a final project. Extra credit is offered for an off-campus visit to a museum, among other options.", "other": ["Cross-listed with: ART 409", "Bachelor of Arts: Arts"]}, {"course_name": "ARTH 410: Taste and Criticism in Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "History and literature of art criticism demonstrating the varied philosophic, cultural, iconographic, technical, and visual approaches.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 411: Roman Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Roman sculpture and painting from Augustus to Constantine.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 412: The Gothic Cathedral", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Specific aspects of Romanesque and Gothic church architecture of western Europe, especially France and England, between 1000-1500.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 413: Architecture of the Medieval Monastery", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course will examine design, construction, function and symbolism in the monastic architecture of Western Europe during the Middle Ages.", "prerequisite": "3 credits of ARTH"}, {"course_name": "ARTH 415: The Skyscraper", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Origin and evolution of the skyscraper as seen against the background of cultural conditions and technological factors.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)"]}, {"course_name": "ARTH 416: Studies in American Art", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 6", "description": "Selected time periods and/or issues in the art of the United States.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)"]}, {"course_name": "ARTH 420: Russian Architecture", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Russian architecture from the first Orthodox churches of the late tenth century to the end of the Soviet Union.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 422: Studies in Medieval Sculpture", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 9", "description": "Specific studies of western European sculpture, 300-1500, with attention to sources, styles, type, and iconography.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 423: Studies in Italian Renaissance Art", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 9", "description": "Specific studies of Italian Renaissance art, including the work of artists such as Leonardo da Vinci, Michaelangelo, and Raphael.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 426: Iconoclasm: Powerful Images and their Destruction", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Iconoclasm: exploring the political, religious, and social motivations behind the destruction of powerful imagery throughout history.  ART H 426 Iconoclasm: Powerful Images and their Destruction (3) (US;IL) (BA) This course meets the Bachelor of Arts degree requirements.Images have been granted extraordinary powers in many human societies, and their purposeful destruction has been a recurrent feature of political, religious and social strife around the world. This course explores how and why humans have granted such power to images, and the subsequent reactions that have resulted in periodic outbreaks of iconoclasm. Topics include the historical specificity of image destruction, the role of art and its detractors in precipitating the Protestant Reformation, and the manipulation of iconoclasm in modern mass media. Victimized images covered may include the bronze bust of Sargon (3rd millennium BCE) and early Renaissance altarpieces through the statues of Saddam Hussein and beyond. We will read primary and secondary materials ranging from Biblical texts to letters to the editor in the New York Times. Through careful consideration of iconoclasms' historical contexts, we will explore art's ability to function as a societal lightning rod. This course has two major objectives: to introduce students to a subject matter that holds great relevance for our time, and to train them in the methods and ethics of scholarly research. This course fulfils elective and 400-level requirements in Art History and General Education (US and IL), but it is intended also to complement concentrations in History, Visual Studies, Religion, and Communications. It would be offered every two to three years. Evaluative criteria include analytical reading and discussion, written components such as critical essays and a research projects, and analysis of relevant current events and their media coverage. Requires a classroom with digital audio-visual capability. Course may include museum visits or field trips where appropriate.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "ARTH 427: Topics in Global Artistic Communication", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 6", "description": "Explores a specific time period in art history cross-culturally in Europe, Asia, Africa, and/or the Americas.  ART H 427 Topics in Global Artistic Communication (3 per semester/maximum of 6) (IL) This course explores specific time periods and/or issues in global artistic exchange among several diverse cultures. The course may be taken up to two times, if the topics are different. One semester the topic might be \"Ca. 1800: Arts and their Global Colonial Contexts.\" Another semester the topic might be \"Global Modernisms ca. 1930,\" or \"Ca. 1600: Global Artistic Exchange in an Era of Increased Contact.\" Each offering will include theoretical discussion of the goals and challenges of such intercultural study. It will then explore the artistic traditions and responses to foreign contact of diverse cultures. The course will consist of lectures, discussions, and, in many cases, visits to the Palmer Museum of Art for the study of objects in its collection. Through critical reading, listening and looking students will develop an appreciation for the range and diversity of cultural production, and the historical specificity of responses to contact with the unfamiliar. Themes touched upon may include ethnic or religious identity, gender, cultural resistance, rejection or embrace. Learning evaluation may depend upon a combination of class participation, analytical reading, essays or research papers, and examinations.", "prerequisite": "3 credits of ARTH", "other": ["International Cultures (IL)"]}, {"course_name": "ARTH 429: Studies in Baroque Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Selected topics in the painting, sculpture, and architecture of seventeenth-century Italy, France, Flanders, Holland, and Spain.  ART H 429 Studies in Baroque Art (3) (IL)This course addresses aspects of European art of the seventeenth century, a rich and complex period in which illusionism and powerful visual effects in the arts reached maturity. Baroque painters went beyond the realism of their Renaissance predecessors to explore both the sensuous aspects of the medium of oil painting and their own increasingly subjective vision. In all the visual arts Baroque masters explored space, mass, and form with a heretofore unheard of freedom and drama. Lectures and discussion in the course may focus on painting, sculpture and/or architecture, in Italy, Flanders, France, Holland, and/or Spain. The course may include selected artists such as Bernini, Borromini, Caravaggio, A. Gentileschi, Poussin, Rembrandt, Rubens, Velazquez, and/or Vermeer. The style and meaning of Baroque art may be studied within its political and cultural setting. For example, new approaches in the visual arts in Italy, and particularly in Rome, may be explored in relation to the rise of the counter reformation. The Spanish war in the Netherlands, and the Dutch struggle for freedom, may be connected with the art of Flanders and Holland. Attendant developments in other fields such as natural philosophy (science) and literature may be related to the visual arts. For example, the use of the camera obscura may be discussed with the art of Jan Vermeer and the poetry of Giambattista Marino may be related to the art of Nicolas Poussin. Aesthetic, critical, interpretive, and theoretical ideas of major artists and writers of the seventeenth century as well as of today's art and cultural historians may be considered. The emergence of new genres such as landscape and still-life may be examined, as well as the continuing themes of mythology, portraiture, and religion. Course objectives may include students' understanding of the national and regional development of styles and schools within seventeenth-century art, the particular approaches to style and meaning by major artists of the period, the analysis of symbolism and meaning within art works of the period; the interrelationship between the art of the period and other disciplines such as natural philosophy and literature, and particular ways in which seventeenth-century art relates to the politics of particular countries, regions, and patrons. This course may serve as an elective for undergraduate students interested in the visual arts and art history, and for graduate students seeking a deeper exposure to art history. Evaluation may be accomplished through a combination of exams, quizzes, term papers, special projects, and participation in class discussion. Special facilities include a darkened room with dimmable spot lighting, computer, computer projector, and a large projection screen.", "prerequisite": "3 credits of ARTH", "other": ["International Cultures (IL)"]}, {"course_name": "ARTH 430: British Art in Context", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course examines the history of art in Britain, with particular attention to the 18th and 19th centuries (1707 to 1914). Works of visual art are considered in close relation to history, especially the history of the British imperialism and evolving notions of British culture and identity. Among the artists whose works are addressed in this course are William Hogarth, Angelica Kauffman, Joshua Reynolds, Mary Moser, J.M.W. Turner, William Blake, the Pre-Raphaelites, Julia Margaret Cameron, James McNeill Whistler, and Vanessa Bell. Along with contextualizing works of art in their socio-historical milieu, this course also attends to the historiography of British visual culture to show how art historical scholarship propels or disrupts prevailing beliefs regarding aesthetic value, nationalism, and cultural identity. Study of the visual arts will be further augmented by selected works of relevant literature by such authors as Henry Fielding, William Wordsworth, George Eliot, and Virginia Woolf.", "prerequisite": "3 credits ARTH", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 435: Studies in Modern Art", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 6", "description": "Lectures focusing on a selected movement of nineteenth- or twentieth-century art.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 440: Monuments of Asia", "department": "Art History (ARTH)", "credits": "3-9 Credits/Maximum of 9", "description": "An exploration of major Asian sites and monuments through a focus on their historical and cultural significance.  ART H (ASIA) 440 Monuments of Asia(IL)(BA) This course meets the Bachelor of Arts degree requirements. In this course, major Asian monuments are introduced in their physical, historical and cultural contexts. Students are also exposed to various theoretical approaches through which these monuments will be studied. Some of the themes around which the course is structured include patronage, religious practice, cultural meaning, political relevance and the shifting meanings of monuments over time. Students will learn to understand and discuss ways of defining monuments, their formal character and lineage, historical and cultural contexts and their representation across space and time.Each semester monumental sites will be organized around a common theme such as, Hindu and Buddhist Sites across Asia: Historical Significance and Contemporary Relevance, Patronage and Religion, Islam across Asia: Global Ideas and Local Contexts, Political and Symbolic Centers in Asia: Between Early Modernity and the Nation State or Early Modern Asia: Empire and the Built Environment. Alternately, these topics will be incorporated within a multi-themed structure.The objective of the course is to expose students to the histories and cultures of Asia in a globalizing world. Another objective is to equip students with the methodological tools of art history as a discipline, even as they learn about specific monuments. The course will build on the foundation laid by survey courses in Art History, Architectural History and Asian Studies. Weekly readings will be assigned and discussed in class. The development of analytical and writing skills will be stressed, and grades will be based partly on essay exams and short response papers. In addition, students will write a research paper, to be completed by the end of semester.", "prerequisite": "ARTH 100", "other": ["Cross-listed with: ASIA 440", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "ARTH 442: Late Antique and Early Christian Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Survey of the architecture and visual culture of Christian society from the beginning of the mid-sixth century.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 445: Oceanic Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Survey of the arts of Oceania (Polynesia, Micronesia, Melanesia), including masks, sculpture, textiles, architecture and other art forms.  ART H 445 Oceanic Art (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is a one-semester survey of the sculpture, masks, textiles, architecture and other traditional art forms of the Pacific Ocean area known as Oceania, which is usually divided into the sub-areas of Polynesia, Micronesia and Melanesia. The material examined during the semester is organized according to ethnic groups and culture areas. Objects are discussed on the basis of style, style relationships, iconography and the uses to which they were put in their traditional religious, political or social contexts. The time period covered is primarily from the period of European contact up to the present, with occasional references to archaeological findings such as the Lapita culture's (3,000 -4,000 years ago) tracing of the movement of peoples into Polynesia. Lectures, films, reading assignments, quizzes, writing requirements (term paper) and exams will aid in providing students with an extensive introduction to the region's cultural and artistic diversity.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "ARTH 446: Topics in African Art", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 9", "description": "Topics vary from \"Arts of Eastern and Southern Africa\" to \"Art of West Africa.\"", "prerequisite": "3 credits of ARTH", "other": ["Cross-listed with: AFR 446", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "ARTH 447: Topics in the Art of the African Diaspora", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 6", "description": "Selected topics in arts of the African Diaspora (South America, Caribbean, USA) including masquerades, textiles, architecture and other art forms.", "prerequisite": "3 credits of ARTH", "other": ["Cross-listed with: AFR 447", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "ARTH 450: The History of Photography", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "The history of photography from 1839, with particular emphasis on the relationship with the plastic arts.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "ARTH 452: Byzantine Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "Monumental and minor arts of Byzantium and related areas from the reign of Justinian to the Turkish conquest of Constantinople.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 456: Renaissance and Baroque Palaces", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course examines palace architecture and decoration in Italy, France, England, and Germany from 1450-1700.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 458: The City 1600-1800", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course examines the architecture and urbanism of cities from 1600-1800. This course will examine what transformed the cities into centers of power, culture, and learning. We will look at new building types, the creation of civic institutions, and changes in the urban plan. The course will therefore provide an overview of the architecture and urbanism of the period and also explore the political and social contexts that made them possible. Topics include capitals of great political importance such as Paris, Beijing, and London as well as smaller centers like Turin and Lisbon that underwent major urban and architectural transformations. The social function of buildings that mark these capitals, from poor houses to opera houses, will also be explored. Primary and secondary reading, ranging from Pepy's Diary to Habermas' examination of the public sphere will offer period accounts as well as conceptual frameworks for understanding the capital. The objective is to challenge students to think deeply about our urban environment and its debts to this earlier era. This course fulfills elective and 400-level requirements in Art History and General Education (IL), but it is also designed to complement concentrations in History, Music, and Architecture.", "prerequisite": "3 credits of ARTH", "other": ["International Cultures (IL)"]}, {"course_name": "ARTH 460: Art and Empire: Aztec, Inca and Spanish", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course is a comparative study of the artistic production used in Aztec, Inca and Spanish empires.  ART H 460 Art and Empire: Aztec, Inca and Spanish (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course compares the diverse visual culture of the pre-Columbian world's two most powerful empires, the Aztec and Inca, to ascertain how art, architecture and public ritual functioned as tools of hegemony. In the aftermath of the Spanish physical and \"spiritual\" conquests of the sixteenth century, colonists continued to exploit the central role played by Aztec and Inca imagery as a means to assert and maintain colonial control, co-opting preexisting channels of training and also imposing foreign sign systems. This course queries, how did the visual arts effectively communicate competing imperial ideologies, how was art production appropriated as a site of indigenous resistance, and how do these artifacts continue to construct communal identities, both past and present?", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "ARTH 462: Studies in Latin American Art", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 6", "description": "Specific studies of the visual and material culture created in Latin America from the colonial through the modern era.  ART H 462 Studies in Latin American Art (3 per semester/maximum of 6) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course analyzes the art and architecture created in Latin America from the first moments of European contact (1492) until the modern era. Each time it is taught, the class will refine its focus to study the artistic production of a specific time period (such as the early colonial period, the nineteenth century, or the modern period), a specific geographic expanse (such as the modern nation state of Mexico), or perhaps a distinct cultural group (indigenous artists). Core to this course is the study of the interaction of seemingly divergent social groups and the ways in which artistic production both reflects and reinforces the resulting cultural systems.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "ARTH 464: French Art and Architecture, 1589", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "This course examines painting, sculpture, and architecture in France from the Wars of Religion through the French Revolution. Over the course of a dynamic two centuries architects and patrons shaped, refined, and innovated upon distinctly French classical styles. Through an examination of some of the leading figures, such as François Mansart and Jules Hardouin-Mansart, Claude Perrault, Claude-Nicolas Ledoux, and Étienne-Louis Boullée, the course will introduce not only a wide range of key buildings, but also a distinct idea about the status of the architect in French society. Classes will also be devoted to specific themes, such as the role of academies in standardizing training, and the influence of public opinion on specific works. We will also examine the urban transformation of Paris into the capital of a centralized French state.    This course examines painting, sculpture, and architecture in France from the Wars of Religion through the French Revolution, from the close of the sixteenth century through the end of the eighteenth. In the seventeenth century with the art of Poussin, French painting can be seen to have come into its own, as Poussin broke with his contemporaries in establishing a particularly French mode of classicism in Rome. We see the efflorescence of classicism in history and landscape painting in the work of Poussin and Claude Lorrain, monumental realism in the work of the Le Nain brothers, and the development of complex allegories of power in the work of Peter Paul Rubens in France. We examine the Rococo style in terms of its eroticism, its artisanal ethic, and the new patterns of aristocratic patronage that emerge in the eighteenth century. We will also consider the rise of the public sphere and its impact on artists such as Jean-Baptiste Greuze, Jacques-Louis David, and David's pupils. With regard to sculpture, we will look at a range of styles from the baroque to the neoclassical.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "ARTH 470: Contemporary Art", "department": "Art History (ARTH)", "credits": "3 Credits/Maximum of 9", "description": "A focused investigation of a special topic relating to art made after 1940.", "prerequisite": "3 credits of ARTH", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 475: Contemporary Women Artists", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "An interdisciplinary course that investigates women artists who were integral to the production of contemporary art primarily in the Americas, Europe, and Asia.", "prerequisite": "3 credits of ARTH", "other": ["Cross-Listed", "Bachelor of Arts: Arts", "United States Cultures (US)"]}, {"course_name": "ARTH 476: History and Theory of Digital Art", "department": "Art History (ARTH)", "credits": "3 Credits", "description": "History and theories of contemporary digital art emphasizing humanistic approaches to technology. ART 476 / ARTH 476 History and Theory of Digital Art (3)(BA) This course meets the Bachelor of Arts degree requirements. Approaches to Digital Art is a survey class that will offer the web designer, cyberspace architect, MUD traffic controller or enthusiastic surfer an opportunity to examine the humanistic aspects of contemporary digital art. Through readings and direct interaction with digital media and digital artists, the class will develop an appreciation of the ways in which the interface between human beings and technology has been historically constructed and is subject to critical investigation. The goal of the class is to prepare each student so that she or he may engage with digital media in a way that is every more historically and socially self aware.Students will address the ways in which digital technologies transform artistic practices such as museum display, the writing of art criticism, the definition of works of art, changing role of the artist and the changing space of the art studio. More important, however, by engaging with digital works of art students will learn to think critically about technology and its engagement with culture at large. They will be encouraged to think about the political, economic and social impact of digital technologies. This humanistic approach to technology would make this course particularly useful to students of art history, philosophy, comparative literature, art education, and the visual/plastic arts. A significant portion of the course will be devoted to the ways in which art on the internet and digital art in general challenge the integrity of categories such as race and national identity. For example, students will have an opportunity to engage with African American artists such as Keith Obadike, whose on-line performances include an attempt to put his \"blackness\" up for sale on ebay.com in August of 2001. Students may also look at the ways in which net.art (Art made to be viewed on the internet) can critique commercial cooptation of global culture: etoy.com, for example, is an international and collaborative artist's group that satirizes global capital by camouflaging itself as a multinational corporation.This class will depend largely upon written responses and class discussion, rather than upon tests. Thus, students will learn how to approach difficult theoretical sources that have been assigned to them, and they will learn how to ask the kinds of questions that will help them understand such sources. This course will emphasize critical thinking rather than memorization, so students will develop analytical skills that will be useful in many other contexts. Because students will be given weekly writing assignments, they will be able to improve their skills in composition.", "prerequisite": "3 credits of ARTH", "other": ["Cross-listed with: ART 476", "Bachelor of Arts: Arts"]}, {"course_name": "ARTH 495: Internship", "department": "Art History (ARTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written or oral critique of activity required."}, {"course_name": "ARTH 495H: Internship", "department": "Art History (ARTH)", "credits": "1-18 Credits/Maximum of 999", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written or oral critique of activity required.", "other": ["Honors"]}, {"course_name": "ARTH 496: Independent Studies", "department": "Art History (ARTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 496H: Independent Studies - Honors", "department": "Art History (ARTH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts", "Honors"]}, {"course_name": "ARTH 497: Special Topics", "department": "Art History (ARTH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "ARTH 499: Foreign Study--Art History", "department": "Art History (ARTH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}]