[{"course_name": "ASM 309: Measurement & Monitoring of Hydrologic Systems", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "This course is an introduction to measurement and monitoring equipment/techniques commonly used in analyses and design of hydrologic systems and will provide students the opportunity to learn and apply basic measurement techniques that serve as critical tools in professional practice in water resources. During the first part of the course, the instruments and techniques commonly used in water resources assessment, including rainfall monitoring, flow monitoring, and interest as part of the Sustainability Institute's Sustainable Communities Collaborative. Data generated over the course of  the semester are used to develop a report that is shared, along with the data with a community partner. In the second part of the course, mapping development is explored, which serves as a critical aspect of water resources engineering and planning. ArcGIS serves as a primary software tool used in engineering design and water resources planning, and students will learn to develop maps to present and process various watershed - data including land use data, soils data, and hydrography data. Various aspects of the course will coalesce around the concept of the watershed being the basic unit of water resources analyses and design, and students will experience how various measurement techniques and approaches are necessary tools for practicing professionals. This course will be useful to any undergraduates seeking degrees in a major related to water resources planning, engineering, or technology.", "prerequisite": "CHEM 110", "other": ["Cross-listed with: ERM 309"]}, {"course_name": "ASM 309H: Measurement & Monitoring of Hydrologic Systems", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "Introduction to measurement and monitoring equipment/techniques commonly used in analyses and design of hydrologic systems.", "other": ["Cross-Listed"]}, {"course_name": "ASM 310: Power Transmission in Agriculture", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "Selection and maintenance of mechanical, hydraulic, and pneumatic power transmission components and systems.  Electric motor principles and controls. ASM 310 Power Transmission in Agriculture (3) After successful completion of ASM 310, students will apply the physical principles, of mechanical power transmission system components such as shafts, belts and sheaves, chains and sprockets, gears, torque limiters, clutches, and universal joints by selecting suitable mechanical drives and specifying proper maintenance procedures. Students will be able to read hydraulic and pneumatic schematics, size fluid power components such as pumps, lines, valves, cylinders, and troubleshoot hydraulic and pneumatic systems. Students will also be able to explain the electrical and physical principles of AC and DC electric motor operation. They will be able to identify torque, speed, voltage, and current operating characteristics and will be able to select controls and circuit protection devices necessary to achieve proper performance. As a required course in the Agricultural Systems Management major, ASM 310 is a prerequisite for other courses.", "prerequisite": "BRS 221"}, {"course_name": "ASM 320: Combustion Engines for Mobile Equipment", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "After successful completion of ASM 320, students will explain and evaluate the theoretical and practical aspects of internal combustion engines. Students will evaluate and compare alternative engine thermodynamic cycles, alternative fuels (gasoline, diesel, biodiesel, compressed natural gas), performance enhancing attachments (turbochargers, intercoolers), and supporting systems (fuel injection, lubrication, starting, cooling, emissions cleansing). Students will be able to properly select engines and related systems for mobile applications. Students will employ important maintenance procedures required for economical useful life and proper operation. Students will be able to troubleshoot engine systems.", "prerequisite": "ASM 310"}, {"course_name": "ASM 327: Soil and Water Resource Management", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "This course equips students with the ability to understand land measurements, mapping, soils, hydrology, channel flow, erosion control techniques with emphasis on RUSLE2, subsurface drainage techniques, and water impoundments for use in storing water, managing stormwater, and capturing suspended sediment. The class concludes with a 3-week section on irrigation, which teaches water needs and pipe flow. Basic hydrology is presented using both the Soil-Cover-Complex and Rational Methods. Manning's equation is developed and discussed for use in understanding flow in open channels. The various components of the RUSLE2 soil erosion model are presented with emphasis in agricultural erosion. Irrigation is taught from both a supplemental agricultural and environmental perspective.", "prerequisite": "PHYS 250"}, {"course_name": "ASM 420: Principles of Off-Road Machines", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "ASM 420 covers the technical aspects of off-road power machinery, such as tractors, self-propelled harvesters, and military, logging and construction equipment. Upon successful completion, students will understand the many facets of design and management of such vehicles (such as mechanical power generation, power allocation, power transmission, traction, operator enclosures, and electrical and electronic systems). Laboratory exercises will involve full-scale equipment with instrumentation used to measure performance. While ASM 420 is not a prerequisite for any other course, it complements engineering and technology courses related to machinery. This course is a technical selection in the Biological Engineering and BioRenewable Systems majors and is required for the Off-Road Equipment minor. It complements other courses for anyone interested in the off-road machinery industries. ASM 420 covers several aspects of function and design related to off-road machinery.", "prerequisite": "BE 306"}, {"course_name": "ASM 424: Precision Agriculture Technology", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "Precision agriculture is a data-based approach to optimize crop production and reduce environmental footprint. This course provides an overview of major concepts in precision agriculture (such as GPS, GIS, remote sensing, and spatial variability) and case studies illustrating decisions and management. In this course, computer processing, data analysis and management, robotics, and other related advancements in technologies will be emphasized to provide necessary technical skills in precision agriculture to students. The first part of the course will cover agricultural machinery combined with GPS such as planters, combines, fertilizer application equipment, and sprayer. Students will learn how to manage these tools efficiently. The second part of the course will emphasize how to manage and analyze field variability data including yield data, soil properties with real-time sensors and create prescriptions based on actual data. The last part of the course will emphasize on how precision agriculture technology can benefit a farm's financial sustainability.", "prerequisite": "BE 301"}, {"course_name": "ASM 424H: Selection and Management of Agricultural Machinery", "department": "Agricultural Systems Management (ASM)", "credits": "3 Credits", "description": "Function and operation of field and farmstead machines; energy, quality, and loss considerations; selection and utilization; precision agriculture technology.  A S M 424 Selection and Management of Agricultural Machinery (3) A S M 424 covers the many aspects of mobile agricultural machinery and fleet management. Integration of economic analysis and functional performance topics are the focus. Optimization, sizing criteria and cycle diagrams, repair and maintenance, reliability of machinery, and precision agriculture technology are major topics covered. Students will give demonstrations of machines as part of the course. Software will be used to select proper sets and sizes of machinery as well as predict impact of machinery selections that may be non-optimal.Grading will be based on homework, laboratory exercises, a demonstration project as well as mid-term and final examinations. Laboratory exercises will involve full-scale equipment with instrumentation used to measure performance.While A S M 424 is not a prerequisite for any other course, it complements engineering and technology courses related to machinery. This course serves as a technical selection in the Agricultural and Biological Engineering major or as an agricultural selection in the Agricultural Systems Management major. It complements other courses for anyone interested in the off-road machinery industries. A S M 424 covers several aspects of selection and management of agricultural production and processing machinery."}, {"course_name": "ASM 496: Independent Studies", "department": "Agricultural Systems Management (ASM)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}]