[{"course_name": "BISC 1: Structure and Function of Organisms", "department": "Biological Science (BISC)", "credits": "3 Credits", "description": "This course is an introduction into the cellular structures and processes that take place in living organisms, and how life displays unity even in its diversity. This course is a basic overview of several subdisciplines within biology, including biochemistry, cell biology, genetics, evolution, taxonomy, and ecology. Students will learn about basic biological chemistry and metabolism, cell organelles and their functions, and photosynthesis, and how these processes sustain life. Students will also learn about the cell cycle, basic genetics, and evolution, which are responsible for species diversity, and why genetic diversity is so important. We will also do a brief overview of taxonomy and phylogenetics, and a survey of some of the major groups of organisms found on Earth. Throughout the semester, we will discuss the ethical ramifications of medical research on humans, how informed consent has come about, and why informed consent is important in today's information-based society. Students who have passed BIOL 27, 110, or 141 may not schedule this course.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "BISC 2: Genetics, Ecology, and Evolution", "department": "Biological Science (BISC)", "credits": "3 Credits", "description": "In BISC 2 (GN;3cr.), students will explore concepts, current issues, and the relationship between three core areas of biological sciences: Genetics, Ecology and Evolution. In studying genetics, students will discover how genetic information is inherited from one generation to the next and gain an appreciation for the potential impact of genetic mutations. In learning ecological concepts, students will explore interactions between organisms and the environment. By investigating the processes of evolution, students will learn how changes in an organism's genetics and environment can lead to changes in physical or behavioral traits of a species over time. By gaining a deeper understanding of these three, interrelated areas of science, students will construct evidence-based arguments regarding current global challenges or ethical dilemmas such as environmental issues, genetic engineering, and health and disease. Specific examples covered each semester may vary based on student and instructor interest. As a course that meets general education (GN) requirements, students will increase their scientific literacy, their integrative thinking, and societal responsibility and ethical reasoning skills. Students who have passed BIOL 110, 133, 220W, or 222 may not schedule this course.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BISC 3: Environmental Science", "department": "Biological Science (BISC)", "credits": "3 Credits", "description": "We are living in extraordinary times. Our numbers have now become so large, our power so great, and our consumption so rampant that we are despoiling our home. Indeed, over the past half-century environmental scientists have been calling attention to the deterioration of Earth's atmosphere, Earth's oceans, Earth's forests and Earth's soils, along with the loss of Earth's biodiversity, from the tropics to the poles. The evidence is unequivocal: Planet Earth is under duress. Though we need Earth for our survival, Earth does not need us! So, will Earth shake us into oblivion or will we wake up, before it is too late, and become respectful members of Earth's community of life? This is a critical question for humankind as a whole; and it is the reason that BISC 3 exists at Penn State. So it is that, in this course, we will explore the root causes of today's environmental crisis and, in so doing, consider scientific, technological, sociological, psychological and personal responses to what is, arguable, the most significant crisis in the history of our species. If you commit to fully engaging with this course, you can expect to: 1-Discover how questions can be powerful catalysts for learning; 2-Grow in your ability to see both yourself and Planet Earth from new and liberating perspectives; 3-Appreciate the power of critical thinking and personal reflection as a means to both personal and global transformation 4-Realize that you¿should you choose¿can play a significant role in the healing of our world.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BISC 4: Human Body: Form and Function", "department": "Biological Science (BISC)", "credits": "3 Credits", "description": "BISC 4 Human Body: Form and Function (3) (GN) (BA) This course introduces students to the biological principles fundamental to understanding human life. Cell structure, biochemistry and metabolism, and the structure and function of major organ systems are explored in the course. Special emphasis on the relationship of the functioning of the human body to human disease is also emphasized. Upon completion of the course, students will be able to describe the basic biochemical, structural and functional characteristics of cells. They will learn the roles of carbohydrates, lipids, proteins and nucleic acids in cells and in the body as a whole. They will understand how these molecules are used in building cell and body structures, in energy-releasing metabolism and in the copying and use of genetic information. Students will also be expected to explain how different organ systems enable the body to meet the need for support structures, oxygen, nutrients, waste elimination, internal communication, defense against infectious disease and cancer, coordination of internal activity, and reproduction. To provide context for the normal workings of the human body, students will also analyze human diseases and the current understanding of the underlying pathophysiology. As a course that meets general education (GN) requirements, students will increase their scientific literacy, their critical and analytical thinking, and ethical reasoning skills. Students will ultimately be able to use the knowledge gained in this course to better understand disease processes, and will be able to make better informed decisions regarding to their health and well-being. Students who have passed BIOL 129, 141, 161 and 163 may not schedule this course.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}]