[{"course_name": "BRS 221: Engineering Principles of Biorenewable Systems", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "This course provides an overview of engineering principles to students in non-engineering majors, but who are likely to encounter challenges that require quantitative solutions. Problem solving skills are extremely important to technology. At the end of the course, students will be able to: solve problems related to biorenewable systems using a structured, logical method combining concepts from physics and math; recognize and apply unit factoring and dimensional analysis to problem solving; quantify physical relationships and apply engineering principles to evaluate basic engineering technology problems involving electrical systems, structural members, fluid mechanics, heat transfer, and psychrometrics. Hands-on examples are used throughout the course to tie the course material to applications in agricultural and biorenewable industries. Examples include residential wiring; sizing structural members made of wood, steel, and other materials; non-moving and flowing fluids in bioproduct and agricultural processing; heat transfer through wall, windows, and other materials likely to be found in construction and processing facilities; psychrometrics in environmental growth and drying facilities. This course provides the groundwork for topics explored in more detail later in the BioRenewable Systems curriculum.", "prerequisite": "MATH 110"}, {"course_name": "BRS 297: Special Topics", "department": "Biorenewable Systems (BRS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BRS 299: Foreign Studies", "department": "Biorenewable Systems (BRS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BRS 300: Introduction to Biorenewable Products", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "Overview of bioproducts and their related industry sectors, including forest products, biocomposities, biofuels, bioenergy, bio-based adhesives, biochemicals, and bioplastics.  BRS 300 Introduction to Biorenewable Products (3) This course provides an overview of the nature and utilization of bioproducts, which are defined as products created from biologically derived, renewable industrial feedstocks. These materials are renewable and can be sustainably produced; as such, they will be increasingly utilized as society recognizes the opportunity cost of mining and using other non-renewable industrial feedstocks. The class focuses on overviewing the relevant industry sectors.", "prerequisite": "CHEM 110"}, {"course_name": "BRS 350: Introduction to Life Cycle Assessment", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "Life cycle assessment (LCA) is a quantitative approach to assessing the environmental, economic, and/or social impacts associated with the entire supply chain of a product, process, or service. LCA is a systematic and holistic approach that enables designers and planners to identify the most impactful stages of a supply chain so that we might strategically intervene to improve the system. In this course students will learn about the LCA standards developed by the International Organisation for Standardisation (ISO). Students will also develop estimation, data verification skills, how to consider uncertainty in analysis, and learn how materials and energy flows lead to impacts to ecological and human systems. Over the course of the semester students will build their own LCA project by finding appropriate data, developing a life cycle inventory, entering data into LCA software, completing an impact assessment, and finally analysis and interpretation of the results generated. LCA is a flexible methodology and students will be encouraged to focus their project on a topic relevant to their broader learning and career objectives. Learning to complete an LCA also develops critical thinking skills, or life cycle thinking, which enables people to develop the skillset to pay attention to the larger system in which they are working in order to develop the human, materials and energy transactions that can lead to more renewable and sustainable systems. Class projects will allow the students to apply LCA to biorenewable systems, including agricultural and biological processes and product development.", "prerequisite": "MATH 110"}, {"course_name": "BRS 391: Communication Skills for BE and BRS Students", "department": "Biorenewable Systems (BRS)", "credits": "2 Credits", "description": "BE/BRS 391 is one part of a two-semester experience in discipline-specific communication and leadership skills training. A key facet of this training is contextual approach. To meet the needs of BE and BRS students, the course emphasizes communication skills that are critical for their professional development, appreciating the technical content of students' work and the industries within which the students will ultimately work. The primary focus for BE/BRS 391 is communication skills (oral and written) with a secondary focus on leadership and career skills. Students will be evaluated through various methods, such as writing and speaking projects, professional presentations, written homework and worksheets in class and out, creation of portfolios and reports, and in-class group and individual exercises. BE/BRS 391 provides a foundation in General Education, Writing and Speaking (GWS) for students in the Biological Engineering (BE and BioRenewable Systems (BRS) majors.", "prerequisite": "Fifth semester standing or higher", "other": ["Cross-listed with: BE 391", "General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "BRS 392: Leadership Skills for BE and BRS Students", "department": "Biorenewable Systems (BRS)", "credits": "2 Credits", "description": "B E/BRS 392 is one part of a two-semester experience indiscipline-specific communication and leadership skills training. A key facet of this training is the contextual approach. To meet the needs of BE and BRS students, the course emphasizes leadership skills that are critical for their professional development, appreciating the technical content of students' work and of the industries within which the students will ultimately work. The primary focus for BE/BRS 392 is leadership skills, supported by training in communication, ethical decision-making, and management. Students will be evaluated through various methods, such as writing and speaking projects, professional presentations, written homework and worksheets in class and out, creation of portfolios and reports, and in-class group and individual exercises. BE/BRS 392 provides a foundation in General Education, Writing and Speaking (GWS) for students in the Biological Engineering (BE) and BioRenewable Systems (BRS) majors.", "prerequisite": "Fifth semester standing or higher", "other": ["Cross-listed with: BE 392", "General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "BRS 393: Industry Tour", "department": "Biorenewable Systems (BRS)", "credits": "1-2 Credits/Maximum of 2", "description": "A week-long tour of bioproducts and agricultural systems industries.  BRS 393 Bioresources Industry Tour (1) This is a week long course, in which students will travel to tour relevant manufacturing facilities. Roughly half of the time (2.5 days) will be dedicated to the bioproducts industry, and the remaining time will be focused on agricultural systems. Bioproducts and agricultural systems are the two key components of the BioRenewable Systems major.", "prerequisite": "Junior standing in BRS or B E"}, {"course_name": "BRS 399: Foreign Studies", "department": "Biorenewable Systems (BRS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "BRS 402: Foundations of Sustainable Business", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "Emphasis on understanding business strategies for enhancing sustainable operations, including issues related to the natural environment and corporate social responsibility. ERM 402 / BRS 402 Foundations of Sustainable Business (3) This course will provide students with an understanding of how environmental and sustainability issues are impacting business strategies and ultimately profits. We will also examine the external stakeholders, such as environmental groups, policy-makers, and \"green\" consumers, that impact business management. Business students will benefit by a better understanding of environmental/sustainability issues that impact their operations and strategies. Non-business students will benefit by understanding how business decisions can impact the natural environment. An emphasis will be on a thorough understanding of making a business case for sustainability. We will also discuss the triple bottom line and its use. Some Specific Issues to Cover: 1. How are organizations shifting business models to work with sustainability trends? 2. How can we make a business case (justification) for being \"green\"? 3. Can firms differentiate themselves by being responsible/sustainable? Do consumers and other stakeholders care? 4. Thorough understanding of stakeholders and how they impact operations. 5. How can the \"business\" side of the world work with the \"environmental\" side? 6. Use of packaging as an example of where parts of the supply chain are working together to be more sustainable. 7. How \"waste\" in its many forms can be seen as a surrogate for unsustainable practices. 8. Pros and cons of metrics used to measure sustainability. 9. Impacts of business operations on the environment.", "prerequisite": "ECON 102", "other": ["Cross-listed with: ERM 402"]}, {"course_name": "BRS 411: Bioproducts Science and Technology", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "This course investigates fundamental aspects of biorenewable polymers (bioproducts) and ties their underlying chemical structure to macroscale properties. These bioproducts are created from biologically derived, renewable industrial feedstocks such as wood, cotton, grasses, and bast fibers (e.g. jute, hemp, kenaf, sisal, etc.). The course begins with an overview of descriptive organic chemistry that is relevant to biorenewable polymers. Students will build on this knowledge to identify, compare, and contrast various industrially relevant plastics. Material science of polymers, including determining molecular weights and measuring mechanical properties of bioproducts is then investigated. These properties are relevant to compare the performance of existing plastics with emerging bioproducts. A survey of the several classes of synthetic and natural polymers, fibers, and composites is the focus of the third unit in the class. Final course subjects include manufacture of soft materials and their decomposition to form recalcitrant waste and microplastics. These will be discussed in the context of 21st-century western culture predicated on the existence of cheap and disposable plastic products, and how design and deployment of new bioproducts could eliminate plastic waste, reduce the environmental impact of plastics, and enhance the economics of industrial biorefining.", "prerequisite": "CHEM 110"}, {"course_name": "BRS 417: Processing and Manufacturing Systems for Bioproducts", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "Overview of systems and processes used in the manufacture of bioproducts. This course reviews major bioproducts and details how they are manufactured industrially. A fundamental understanding of petrochemical refining, pulp and papermaking, and sawmill operations is the foundation of the beginning of the course, since the majority of existing and emerging bioproducts are manufactured using these processes or new hybrids of these. Next, thermochemical conversion of biomass is covered, including existing technologies such as torrefaction and barrel production, and emerging technologies such as catalytic fast pyrolysis and biomass gasification. Students will then prepare and deliver presentations on traditional and emerging wood and paper products. The final portion of the course will include biomass fractionation technologies that provide cellulose, hemicellulose, and lignin to produce fuels and chemicals in a manner analogous to petrochemical refining.", "prerequisite": "BRS 221"}, {"course_name": "BRS 422: Energy Analysis in Biorenewable Systems", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "Energy management, energy conversions, renewable energy alternatives, engineering economic analyses, national and international perspectives on energy resources.  BRS 422 Energy Analysis in Biorenewable Systems (3) This course focuses upon first understanding the various forms of energy in common use today and then analyzing the energy equivalents of various forms of energy. Forms of energy to be studied most extensively include electricity, fossil fuels, and renewable energy sources. Principles and applications of engineering economic analyses will be emphasized because these principles are needed to evaluate the feasibility of converting from one energy form to another. Specific application areas of emphasis include buildings, motors, and lights. For each application area, there will be discussion of the alternatives available for using energy in a more efficient and economical manner. The infrastructure systems needed for providing electricity and natural gas to a specific location will be described as well as typical rate structures for the energy provided. Alternatives to the conventional energy systems will be identified and the course will conclude with discussion of energy strategies throughout the 21st century. Local, national, and international perspectives on energy resources will be infused throughout this course.", "prerequisite": "BRS  221"}, {"course_name": "BRS 423: Deterioration and Protection of Bioproducts", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "Timber, wood, and bioproduct deterioration from fungi, insects, fire; treatment of bioproducts for in-service protection.", "prerequisite": "BRS  300;  Concurrent:  BRS  411"}, {"course_name": "BRS 426: Safety and Health in Agriculture and Biorenewable Industries", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "BRS 426 explores management aspects of occupational safety and health specifically as it pertains to both the agricultural and biorenewable systems industry sectors. Employers are increasingly demanding students have training in safety and health. Topics to be covered include principles of safety and health, hazard analysis, hazard prevention and control, human behavior and safety, training and education, safety and health regulations, agricultural emergencies and developing a written safety program."}, {"course_name": "BRS 428: Electric Power and Instrumentation", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "Principles and application of electric circuits for power distrubtion, motors, automatic controls, and instrumentation used in agricultural and biorenewable industries.  BRS 428 Electric Power and Instrumentation (3) Nearly every facet of our modern society relies on electricity and electronics. Whether engaged in product development, manufacturing, production, testing, or management, graduates of technical programs benefit from a fundamental understanding of electrical/electronic systems. This course prepares students to analyze electrical/electronic systems applicable to agricultural and biorenewable industries. Upon completion of this course, the student will be able to: demonstrate correct use of common electronic measurement tools including multimeters, oscilloscopes and others; demonstrate sound electrical construction techniques including cable preparation, soldering, circuit board construction, and others; demonstrate sound troubleshooting skills for electrical and electronic systems; understand common elements of power distribution systems; understand simple measurement and control circuits represented by schematics or ladder diagrams; understand and apply various sensors to measure temperature, pressure, strain, force, proximity, speed etc.; understand the application of dataloggers, programmable logic controllers, and computer software to collect data and/or control simple processes; understand the function of common circuit components such as resistors, capacitors, inductors, diodes, op-amps, transistors, and transformers in simple circuits; understand basic maintenance and safety requirements for facility electrical systems.", "prerequisite": "BRS  221"}, {"course_name": "BRS 429W: Biorenewable Systems Analysis and Management", "department": "Biorenewable Systems (BRS)", "credits": "3 Credits", "description": "BRS 429W covers systems analysis and optimization techniques including an introduction to systems theory, qualitative and quantitative analysis, linear programming, waiting line models, PERT/CPM, minimal spanning tree, calculus methods, simulation modeling for decision making, inventory, and energy audits. All topics are presented in the form of case studies that require the students to solve problems in realistic production and processing scenarios. The course also provides a writing-intensive structure. The course targets BRS students in their last semester because it integrates knowledge and experiences acquired in prior BRS, business, and agricultural science courses.", "other": ["Writing Across the Curriculum"]}, {"course_name": "BRS 430W: Biorenewable Systems Capstone 1", "department": "Biorenewable Systems (BRS)", "credits": "1 Credits", "description": "Students in Biorenewable Systems learn to apply technology, business, and science to sustainable agricultural and biologically-based product systems development and management. The capstone experience is a two semester, senior year sequence required of all BRS students. This course is the Fall component of the sequence and introduces the student to concepts critical for analyzing real-world biorenewable systems. This includes selecting a capstone topic, technical writing review, team building, systems analysis tool application, project proposal development, and proposal presentations. The course also provides iterative writing experiences to enhance the student's ability to create technically sound and grammatically correct reports. At the end of this course, the student will be able to: Write a technically sound biorenewable systems project proposal; be able to function in teams to address a biorenewable systems problem; be able to assess a system and apply appropriate analysis and/or business tools.", "prerequisite": "BRS 391", "other": ["Writing Across the Curriculum"]}, {"course_name": "BRS 431W: BioRenewable Sys Capstone 2", "department": "Biorenewable Systems (BRS)", "credits": "2 Credits", "description": "Students in Biorenewable Systems learn to apply technology, business, and science to sustainable agricultural and biologically-based product systems development and management. The capstone experience is a two semester, senior year sequence required of all BRS students. This course is the Spring component of the sequence. The students apply quantitative systems and business tools to analyze real-world biorenewable systems, interpret the results, and provide recommendations for management decision making. The course also provides iterative writing experiences to enhance the student's ability to create technically sound and grammatically correct reports. At the end of this course, the student will be able to: Effectively work as a team to manage the time and resources of a biorenewable systems analysis project; execute a systems analysis of a real-world problem; interpret results to provide a management recommendation; effectively present results and recommendations in a technical report.", "prerequisite": "BRS 430W", "other": ["Writing Across the Curriculum"]}, {"course_name": "BRS 437: Bioproduct Marketing and Sales", "department": "Biorenewable Systems (BRS)", "credits": "4 Credits", "description": "Business-to-business bioproduct sales and marketing fundamentals and market overview of key forest industry sectors including biorefinery value chain outputs.  BRS 437 Bioproduct Marketing and Sales (4) This course covers business-to-business (B2B) bioproduct marketing fundamentals and a market overview of key forest industry sectors (solid wood, composite panels, and engineered wood products) including biorefinery value chain outputs (environmental services, energy, fuels, and co-products) and personal selling of bioproducts. Students will apply B2B market principles and concepts toward an understanding of bioproducts industries and markets. Personal selling techniques will be developed and applied to enhance understanding of the industrial sales function within bioproduct firms. Marketing research for decision-makers will be examined.", "prerequisite": "ECON 102"}, {"course_name": "BRS 490: BioRenewable Systems Colloquium", "department": "Biorenewable Systems (BRS)", "credits": "1-2 Credits/Maximum of 2", "description": "This course introduces students to various aspects of the biorenewable systems industries with an emphasis on professional career information and insights. Outside speakers will provide perspectives on current challenges, opportunities, and future trends in bioproduct and related industries."}, {"course_name": "BRS 494: Undergraduate Research", "department": "Biorenewable Systems (BRS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group basis."}, {"course_name": "BRS 494H: Honors Thesis", "department": "Biorenewable Systems (BRS)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by a faculty supervisor that culminates in the production of a BioRenewable Systems honors thesis.", "prerequisite": "junior or senior standing in the Schreyer Honors College and   permission of a BioRenewable Systems honors advisor", "other": ["Honors"]}, {"course_name": "BRS 495: Internship", "department": "Biorenewable Systems (BRS)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required."}, {"course_name": "BRS 496: Independent Studies", "department": "Biorenewable Systems (BRS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "BRS 497: Special Topics", "department": "Biorenewable Systems (BRS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "BRS 499: Foreign Studies", "department": "Biorenewable Systems (BRS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]