[{"course_name": "CAS 83: First-Year Seminar in Communication Arts and Sciences", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course offers a dynamic introduction to major theoretical, critical, research and pedagogical issues in human communication. Specifically, it will introduce students to essential aspects of the communication sciences as an academic discipline. The field of Communication Arts and Sciences involves a wide variety of approaches to the study of human communication, including within the communication sciences. For that reason, different versions of CAS 83 will vary depending on the expertise of the instructor. All versions of the course, however, will be designed according to common learning objectives and major topics in order to introduce first-year undergraduates to essential aspects of communication science. Previous versions of the course, for example, have focused on: communication about women's health issues; the dark side of interpersonal communication; and the effectiveness of various persuasive campaigns. Whatever the specific focus of the course in a given semester, CAS 83 benefits students by introducing them to important dimensions of communication science during their first year at the University. Doing so allows potential majors or minors to our department to develop skills in studying communication science early in their undergraduate careers while gaining a functional knowledge of the field in general. Opportunities to plan a double major, a minor, and explore other miscellaneous forms of academic or professional training naturally follow from this early experience. ***CAS 83 fulfills both a first-year seminar and general education or Bachelor of Arts social/behavioral science requirements.***", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 84: First-Year Seminar in Communication Arts and Sciences", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course offers a dynamic introduction to major theoretical, critical, research and pedagogical issues in human communication. Specifically, it will introduce students to essential aspects of the study of rhetoric. The field of Communication Arts and Sciences involves a wide variety of approaches to the study of human communication, including within the humanities-based area of rhetorical studies. For that reason, different versions of CAS 84 will vary depending on the expertise of the instructor. All versions of the course, however, will be designed according to common learning objectives and major topics in order to introduce first-year undergraduates to essential aspects of the humanistic study of communication using the tools of rhetorical studies. Previous versions of the course, for example, have focused on: the role of women's voices in modern social movements; rhetorical messages in popular music; and the rhetoric of environmentalism. Whatever the specific focus of the course in a given semester, CAS 84 benefits students by introducing them to important dimensions of rhetorical studies during their first year at the University. Doing so allows potential majors or minors to our department to develop skills in studying the humanistic study of communication early in their undergraduate careers while gaining a functional knowledge of the field in general. Opportunities to plan a double major, a minor, and explore other miscellaneous forms of academic or professional training naturally follow from this early experience.", "other": ["Bachelor of Arts: Humanities", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 100: Effective Speech", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Introduction to speech communication: formal speaking, group discussion, analysis and evaluation of messages.", "other": ["General Education: Writing/Speaking (GWS)"]}, {"course_name": "CAS 100A: Effective Speech", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This general education course explores how people use techniques of oral communication to address practical, professional and civic problems. It is designed to introduce students to principles of effective public speaking, implemented through the design and presentation of individual speeches. Class size is limited to ensure that scheduled meetings can support students in focusing on the development of public speaking skills through in-class activities, collaborative learning, peer critiques, and examinations of various communication practices.  Drawing upon concepts from the study of both rhetoric and communication science, the course aims to foster habits of ethical self-reflection alongside practical speaking skills. To that end, course content centers on the diverse ways that students participate in practices of citizenship and civic engagement. Linking content to practice, students are expected to demonstrate course concepts through the situational, generic, and ethical choices they make in composing their major speech assignments.  At least three individual graded speeches are required in this course. Additional presentations (graded or non-graded) may be required by some instructors. Following major speeches, students may compose reflective essays engaging in the critique and assessment of their own and others' work. Assessment may include evaluation by a combination of exams (although no final exam is given in the course) and/or occasional quizzes and other activities, all of which emphasize the mastery and application of the conceptual content of the course. Presentations are evaluated for content, organization, and presentation.  Numerous sections of CAS 100A are offered throughout the university system in any given semester. For that reason, different versions of the course may vary slightly depending on the expertise or professional preferences of the instructor. ALl versions of the course, however, will be designed according to common learning objectives and major topics in order to introduce undergraduate students to essential aspects of effective oral communication.", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "CAS 100B: Effective Speech", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This general education course introduces students to principles of effective communication with a specific focus on collaborative communication and group problem solving. The goal of CAS 100B is skill development in effective group communication, with less emphasis on formal public speaking and message evaluation compared to other versions of CAS 100. Toward that end, class size is limited and class meetings involve considerable attention to group dynamics, teamwork, and effective communication within groups. Through in-class activities, peer critiques, and analysis of both process and product, this course is designed to allow students to actively work in groups and engage in self-analysis of their own group processes. Structurally, this course begins with discussion of the principles of effective communication and public presentations. It then substantively addresses both the theory and practice of group communication and group process. This course enables students to work more effectively in groups and to make effective group and individual presentations. At least one speech, several group communication activities, and regular analytical writing are required. Evaluation methods include evaluation beyond formal exams. Public presentations are evaluated for content, organization, and presentation; group work is evaluated for process effectiveness and outcomes; critical evaluation of messages is assessed in individual analytical writing assignments; and all course content is covered on quizzes. Numerous sections of CAS 100B are offered throughout the university system in any given semester. For that reason, different versions of the course may vary slightly depending on the expertise or professional preferences of the instructor. All versions of the course, however, will be designed according to common learning objectives and major topics in order to introduce undergraduate students to essential aspects of effective oral communication in group settings.", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "CAS 100C: Effective Speech", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This general education course introduces student to principles of effective communication with a specific focus on the analysis and evaluation of messages. It thus offers a specialized variant of the university's required course in effective public speaking skills. Through in-class activities, lectures, and group discussions, students develop skills in effective communication skills based on a combination of practice, theory, and analysis. Class size is limited to ensure that scheduled meetings can support students in focusing on the development of effective communication skills through in-class activities, collaborative learning, peer critiques, and the analysis of written and spoken discourse. In addition to developing presentational skills, students learn some essential components of rhetorical theory. Through analysis and evaluation afforded by those components, students will be able to listen more effectively to persuasive messages, draw on the content of persuasive messages as resources for their own civic engagement, and see how the persuasive messages of others can offer models for their own persuasive efforts.  Students will deliver a minimum of two public speeches. Speeches will be evaluated for content, organization, and presentation. Graded preparation assignments will test students' ability to synthesize and apply course concepts from the textbook and lectures in the analysis and evaluation of messages. Student speeches will be prepared, by utilizing such resources, to present such analysis and evaluation. In sum, student will develop a deeper understanding of the persuasive messages they receive and an improved ability to persuasively communicate their own messages. Numerous sections of CAS 100C are offered throughout the university system in any given semester. For that reason, different versions of the course may vary slightly depending on the expertise or professional preferences of the instructor. All versions of the course, however, will be designed according to common learning objectives and major topics in order to introduce undergraduate students to essential aspects of effective oral communication.", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "CAS 100S: Effective Speech", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Principles of communication, implemented through presentation of speeches, in addition to the importance of analysis, group discussion and message evaluation.", "other": ["First-Year Seminar", "General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "CAS 101N: Introduction to Human Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 101 introduces students to the field of communication studies and to the most important concepts, questions, and ideas that surround the study of communication today. This class is essential for any student who wishes to consider a major or minor in Communication Arts and Sciences. The course is also an important elective for students who want to understand processes of communication in a variety of social forms or settings, including: interpersonal, small group, organizational, intercultural, public, and technological. The main objectives of the course are: 1) to expose students to the concepts and best practices that cut across every aspect of modern communication, 2) to prepare students to excel in advanced classes within the Department of Communication Arts and Sciences, and 3) to help non-CAS majors incorporate essential communication principles into their own fields of study and future professions. Students from every major or college are welcome. Student grades may be determined by a variety of assignments, including quizzes, exams, in-class discussions, and major individual or group projects. This course invites students not only to learn about major concepts or ideas in the study of communication, but to explore their practical implications.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CAS 126: Developmental Listening", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Introduction to effective strategies of listening, with an emphasis on studying, note taking, test taking, and research paper writing.  CAS 126CAS 126 Developmental Listening (3) This course designed to assist first year students in developing a comprehensive understanding of their role as students, the nature of the learning process and the role of communication in successful learning. A critical objective of the course is for students to understand the integral relationship of communication to academic success. Therefore, considerable attention is given to learning processes and the significant impact of communication on these processes and subsequent learning outcomes. Within this larger context students will be provided opportunities to engage in activities designed to enhance their skills in the following areas: listening, speaking and writing; self awareness and self monitoring; classroom management; time management; study management and learning strategies; exam management; resource management; and researching and developing a thesis in a research paper. Student achievement is evaluated through class participation, including working in groups; a research paper and oral presentation based on developing an effective argument; an academic planning project; reflection papers; quizzes; and two exams. CAS 126 is available only to students participating in the Comprehensive Studies Program, Penn State's Act 101 Program."}, {"course_name": "CAS 137H: Rhetoric and Civic Life I", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Rhetoric and Civic Life (RCL) is a year-long honors course offering comprehensive training in oral, written, visual, and digital communication. It unites these various modes under the flexible art of rhetoric and uses rhetoric both to strengthen communication skills and to sharpen awareness of the challenges and advantages presented by oral, written, visual, and digital modes. This portion of the course, CAS/ENGL 137 focuses particularly on two critical academic capacities: analyzing and contextualizing. In this semester, students learn to rigorously examine the rhetoric surrounding them, compellingly present their findings in various modes, and thoughtfully contextualize their research. In this course, students will: -Develop a rich understanding of rhetorical concepts -Practice application of concepts and terms in expressing understanding of effectiveness of rhetoric through analysis and contextualization of existing texts -Enhance communication skills by practicing and applying in a variety of communication modes (written, oral, digital)", "other": ["Cross-listed with: ENGL 137H", "General Education: Writing/Speaking (GWS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CAS 138T: Rhetoric and Civic Life II", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course builds rhetorical skills in oral, written, visual, and digital contexts and introduces deliberation and advocacy in civic and disciplinary spheres. CAS (ENGL) 138T Rhetoric and Civic Life II (3) (GWS)ENGL/CAS 138T, Rhetoric and Civic Life II, expands knowledge and aptitudes built in ENGL/CAS 137H by asking students to use rhetorical skills and principles to develop strategies for persuasion and advocacy in the context of civic issues. The course continues the multimodal emphasis-the focus on oral, written, visual, and digital communication-used in 137H and adds new components as well. Students will develop a repertoire of communication skills through hands-on practice at composing and delivering speeches and essays, and they will work with digital media to create multimedia texts, podcasts, and websites. Students will reflect on these different modes as themselves rhetorical choices. The course's civic and ethical components take center stage as students learn how to deliberate important public issues thoughtfully and with civility and respect. They will learn the difference between persuasion and advocacy and develop strategies for both in the context of pertinent local, national, and global issues. They will participate in a public deliberation forum on topics they generate and vote on. The forum will be organized to allow small deliberative action groups as well as large forum-style meetings. The course focuses on ethics in many contexts, e.g., community action and public deliberation; ethics of persuasion; ethical controversies in the disciplines. Students will be encouraged to explore percolating disciplinary interests and to share knowledge in online disciplinary communities. Students will work throughout the semester to design and build a final electronic portfolio that represents their academic work with an eye to their imagined professional futures. The portfolio assignment offers students an opportunity to reflect on their work, assessing the merits and themes of inquiries, and to curate and present their work to both targeted and broad online audiences.", "prerequisite": "ENGL 137H", "other": ["Cross-listed with: ENGL 138T", "First-Year Seminar", "General Education: Writing/Speaking (GWS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 162N: Communicating Care", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Communicating Care ENGL 162N / SOC 162N / CAS 162N What do we talk about when we talk about health? Our states of well-being and illness are topics that, like the weather, drive our daily conversations, but we rarely have time to study and practice these vital exchanges. Spoken in emergency rooms or on long-distance calls, by medical professionals, family members, or strangers making small talk, the languages we use to share pain and recovery require our knowledge of long-established scripts and our willingness to improvise. By exploring how these encounters draw from and work as textual and dramatic performances, this course will guide students to achieve a new level of literacy in the most essential communicative art of caring. Students will analyze health conversations in literary texts, such as short stories, poems, memoirs, and graphic novels. They will explore real-life scenarios drawn from their own experiences, fieldwork, social science theories, and published case studies. Developing skills in the humanities (GH), they will see how subjective, often individual experience, historical perspectives, and creative expression help people to communicate about health and care. Developing their abilities in the social and behavioral sciences (GS), they will see how theory provides insights to predict and understand health and practices of care, investigate objective perspectives and recognize the contributions of fieldwork and data-driven studies to analyzing and improving communication when health is a main concern. They will integrate these methodologies especially to pursue these fields' common goals of making beneficial connections between individuals and groups, and managing private and public life.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 170N: What is Information?", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "\"What is Information?\" considers the material and social nature of information in historical and contemporary contexts. How has information been managed and valued? How have information infrastructures served as sites of social and political connection or antagonism? How have ideas about information changed over time and how have they remained the same? The course integrates perspectives from the social sciences and the humanities, and prepares students to think about (and act in) a world in which information (and its linked concepts, like data) play an increasingly important social and political role. The course addresses the history of information as both a concept and as a matter of social practice, and then focuses on three major topics: how information is presented, how information is organized, and how information is put to social and political use. Moving from the earliest periods of human history and their \"information ages\" (including the birth of writing and the dawn of printing and mass literacy), the course leads students into our contemporary \"information society,\" and the ways in which both the use and manipulation of information shape our lives.", "other": ["Cross-listed with: IST 170N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 175N: Persuasion and Propaganda", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Propaganda, in common usage, is a deliberate, systematic attempt to manipulate beliefs and emotions, usually through methods considered deceitful and unethical. Persuasion, on the other hand, is an everyday activity in our personal, social, and civic lives. Persuasion is considered acceptable, even necessary in a free society. This course will explore the distinction historically and theoretically between propaganda and persuasion, with an emphasis on developing the critical skills necessary to distinguish between the two. There are many different definitions of propaganda, and the term often is used to label and discredit political opponents. This course allows students to develop a more precise understanding of propaganda and the techniques of the propagandist. In more practical terms, students will learn to recognize, describe, and evaluate propaganda in all of its various forms and contexts. Toward this end, it includes important cases from the history of propaganda as well as contemporary cases of public advocacy that raise questions about the distinction between persuasion and propaganda.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 182N: Communication and Sport", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 182N: Communication and Sport is an introduction to the unique relationship between communication and sport in our society at any level. This course allows students to understand how we play, watch, interpret and evaluate sport through communication. However, this course is also about the reciprocal relationship of how sport impacts our communication, especially as it relates to how we function and interact on a daily basis. Examples of topics that will be discussed include but are not limited to: the participants of a sports community, the role of the media in sport, fan dynamics and culture, gender roles in sport, race and ethnicity in sport, the use of sport in politics, communication between parent and child, teammates, player and coach, crisis communication in sport, and commodification of sport. Course objectives: - Describe and define the foundational relationships between communication and sport. - Identify and dissect the roles of the \"players\" who collectively constitute the community of sport - Explain the modern evolution of sports media in the United States and hypothesize how new media and social media will further alter the sports landscape. - Synthesize the student's own fan experiences and rituals with the motivations and typology of fandom. - Examine the creation and function of mythology in sport - Explore and debate gender issues in sport through constructs such as hegemonic masculinity, current coverage and exposure afforded to men's and women's sport, gendered language differences in sports media, and current opportunities and struggles for women in modern sport society. - Recognize and articulate the impact of race and ethnicity on sports culture including discussion of \"stacking\" practices and media dialogues. - Discover the extent of the historical relationship between politics and sports - Analyze the relationship between sport and the body and interpret what the relationship communicates about performance expectations based on dimensions of identity, such as gender, sexuality, race and ethnicity and disability. - Demonstrate how the shifting of youth sports from game culture to sport culture has led to disturbing trends in parent-child interaction such as evolving participation models and sports rage. - Recognize different leadership behaviors used by coaches. - Judge the importance of group and team cohesion in sport success. - Determine whether commodification of sport outweighs and harmfully diminishes the other roles sports offers to society. - Distinguish, evaluate and apply crisis management skills specific to sport, particularly apologia and image repair. Instructional Methodology: This class is not simply about sport but an ongoing discussion on how to operate effectively in a world that is constantly impacted and influenced by sport. It is expected that students will participate and engage in discussion, activity and assignments relative to different sport contexts. Differences of opinion are encouraged and fans and critics of sports are equally welcome. We will spend time in class on a combination of lecture, case study, debate, student presentation and role play situations. Students who have received credit for COMM 412 may not schedule COMM 182N.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 195: Careers in Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "1 Credits", "description": "An introduction to a variety of careers in the field of communication arts and sciences."}, {"course_name": "CAS 197: Special Topics", "department": "Communication Arts and Sciences (CAS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CAS 199: Foreign Studies", "department": "Communication Arts and Sciences (CAS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CAS 200: Language, Culture, and Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Introduction to language, language development, cultural literacy, culture, and intercultural communication.  CAS 200CAS 200 Language, Culture, and Communication (3) (US;IL) This course defines culture broadly, including how people conceptualize and enact reason, rationality, race/ethnicity, sex/gender, power, and age. Course content is organized into three large units: (1) how culture shapes language use; (2) how language use shapes culture; and (3) how culture and language (both verbal and nonverbal) operate together and influence each other, including how language is used to create, and negotiate understandings of culture. In the first unit, the class examines the effects of preconceived cultural beliefs on behavior; that is, how beliefs that a culture takes for granted as being true filter persons' perceptions of reality. This unit also covers the concepts of self-fulfilling prophecies, cultural stereotypes about age, the possibility of cross-cultural universals (e.g., politeness), and African-American culture. In the second unit, the class examines how the structure of different culture's languages (e.g., their vocabulary and grammar) shapes how persons experience the world and thus shapes their \"reality.\" In the third unit, the class takes the position that various aspects of culture (e.g., race/ethnicity, sex/gender, power, and age) are constantly being constructed and re-constructed through language. This unit examines how persons accomplish being \"a woman,\" \"African American,\" \"old,\" \"polite\", \"powerful,\" etc. This class is interdisciplinary and incorporates materials from anthropology, applied linguistics, linguistic anthropology, communication studies, and sociology. Grades are based on three in-class exams (two midterms and a final), which are closed-book and involve short-answer and essay-type questions. Attendance is mandatory. This is one of the three core/required courses for the major. This course ties into another core course, Communication Theory, by discussing several key Communication Theories in different ways, such as the Sapir/Whorf hypothesis, Politeness Theory, and various theories of language. This course ties into those dealing with race and gender.", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "CAS 203: Interpersonal Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "The phenomenon called interpersonal communication encompasses the complexities of interaction between people in any of a variety of situations. The expectations people form prior to a conversation, the messages that they produce using language and nonverbal cues, the ways in which they attach meaning to the behaviors of others, and the systemic qualities of the dyad are all part of interpersonal communication. And interpersonal communication occurs in contexts as varied as strangers sharing a seat on a bus, neighbors passing each other in the street, college roommates or married couples coordinating their lives, and co-workers negotiating office politics. In the home, at school, at work, and in public, interpersonal communication is an intricate process that weaves the fabric of our lives as social beings. This class is designed as an opportunity to explore the complexities of interpersonal communication and to develop a repertoire of interpersonal communication skills.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 204: Communication Research Methods", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Overview of the skills necessary to evaluate commonly reported communication research."}, {"course_name": "CAS 206: Mediation and Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Presentation of the history, theory, and practice of mediation as a means of resolving conflict through communication.  CAS 206 CAS 206 Mediation and Communication (3) There are two overall objectives to this course. First, the course will acquaint students with conflict as a normal part of the human condition, and with the efforts of humans for thousands of years to resolve conflict in a peaceful way. The specific method of conflict resolution addressed by the course is mediation, which involves the intervention of a third party who is neutral in the conflict. Modern uses of mediation to resolve conflict extend from the playground to essential functions in society, for example, labor relations, legal systems, government operations, including international relations, and family disputes. While Western methods will be emphasized, mediation also plays an important role in non-Western cultures. For example, Hawaiian, Palestinian, Native American, and Chinese cultures rely on mediation to resolve conflict and rebuild relationships. In fact, mediation is the most popular means of conflict resolution in China, Taiwan, and Japan. Second, the course will acquaint students with the essential means by which mediation is accomplished, communication. The success of the mediation depends on the ability of the mediator to communicate well in specific ways when addressing the assembled parties, and when interacting with them individually. The course will also acquaint students with communication issues in mediation under study by both professional mediators and communication scholars. This course relates to lower-division Communication Arts and Sciences courses in rhetoric and interpersonal communication, in that it demonstrates how the different theories and practices they discuss can be integrated to produce important positive outcomes not only to individuals in conflict, but also to cultures. This course relates to upper-division Communication Arts and Sciences courses in rhetorical theory, interpersonal communication theory and research, conflict resolution and family communication theory and research, by providing an introduction to communication issues arising from an important context of communication, mediation, issues that can stimulate both further theory and research. This course relates to upper division courses in Labor Studies and Industrial Relations dealing with workplace dispute resolution and collective decision-making, and in Human Development and Family Studies dealing with interventions and resolving problems, to the extent that these courses discuss mediation. This course introduces the communication bedrock on which mediation rests.", "other": ["General Education: Humanities (GH)"]}, {"course_name": "CAS 208N: Introduction to Managing Conflict and Bargaining", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 208N introduces students to the nature of interpersonal conflict and emphasizes how this knowledge, in turn, helps students become more effective negotiators. Students apply both objectivist and interpretive theories to different communication contexts and across various communication channels (face-to-face and mediated). Students learn affective communication skills (e.g., how to be an empathetic listener) and instrumental communication skills (e.g., how to manage interpersonal conflict). Much of the class focuses on relational power dynamics in interpersonal contexts. Thus, students learn the importance of empathetic listening, especially when another person disregards students' core concerns (ego, affiliation, appreciation, status, and role). Students will also learn distributive and integrative bargaining strategies, including how best to negotiate across cultures. The class integrates an array of theories where intellectual traditions from both the Humanities (GH) and the Social and Behavioral Sciences (GS) are covered equally.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CAS 209: Democratic Leadership", "department": "Communication Arts and Sciences (CAS)", "credits": "1 Credits", "description": "Penn State has a special opportunity to create new leaders who learn deliberative approaches to politics and public life. This one-credit course provides a background for this approach to democratic leadership, and it also prepares students for the Nevins Fellows paid internship program. Those who complete this course will have first priority when awarding these internships each year. The centerpiece of this course are day-long workshops that introduce students to effective civic leaders in government or the non-profit sector. Bracketing these workshops are a handful of seminars, which introduce ideas, discuss reading assignments, and reflect on the workshops. In addition to short reaction papers, students will produce a narrative essay at the end of the course that describes how they could see themselves advancing democracy in the United States (or elsewhere) and what kind of internship experience will help them prepare for such a career. For those who opt to seek an internship, this essay will supplement their formal application. Credit for the course requires attendance at every class meeting and workshop, or equivalent makeup assignments, if permitted.", "other": ["Cross-listed with: PLSC 209", "Honors"]}, {"course_name": "CAS 210: Landmark Speeches on Democracy and Dissent", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Landmark Speeches on Democracy and Dissent offers a survey of key speeches, debates, and controversies making up the rich tradition of U.S. civic life. The course is designed to introduce students to the basic historical contexts within which these key events arise; engage them in close readings of speeches, tracts, and polemical writing; and develop skills in critical thinking and writing. Students will attend to a broad spectrum of voices, including those of historically under-represented peoples as well as canonical figures. Landmark Speeches on Democracy and Dissent thereby encourages students to develop a broad rhetorical literary in the diverse democratic voices that have long contributed to essential U.S. arguments about nationhood, protest, war, race, gender, religion, and more. The course presupposes that students will be able to apply this rhetorical literary to both participation within and critical thinking about contemporary forms of democracy and dissent.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 212: Professional Public Speaking", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Organizing, adapting and presenting ideas in public informative, persuasive, technical and ceremonial speeches.", "prerequisite": "CAS 100"}, {"course_name": "CAS 213: Persuasive Speaking", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Planning, organizing, and adapting techniques of persuasion to achieve personal and public goals; engaging in critical assessment of persuasive messages.", "prerequisite": "CAS 100"}, {"course_name": "CAS 214W: Speech Writing", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Due to time pressures, media scrutiny, and sadly under-developed rhetorical talents, powerful people in the public and private sectors need speechwriters. Because writing in the character of someone else and writing for the ear present the two biggest challenges for speechwriters, this course trains students in speech analysis and oral/aural composition. Throughout, students apply what they are learning, writing several genres of public speech in the voices of others and for various audiences and occasions. In accordance with the 'WAC' designation, students work through various drafts during structured and facilitated peer-review sessions. The majority of assessments is comprised of original, written work.", "prerequisite": "ENGL 15", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"course_name": "CAS 215: Argumentation", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course provides an in-depth examination of argumentation in both public and private contexts. The course requires students to investigate the process of researching sound evidence, constructing legitimate argumentative claims, and participating in live debates. Fundamental to this endeavor is a strong attention to research, ethics, and strategy. Major topics may include essential components of effective arguments, in-depth examination of different types of evidence, introduction to forms of reasoning, negative and affirmative cases, and debate rules or strategies. Students may be evaluated with a range of assignments, from oral debates or presentations to written assignments, quizzes, and exams. This course thereby offers students opportunities to enhance their skills in effective inquiry and advocacy, useful for academic as well as professional success. Understanding the theoretical foundation of argumentation will enable students to accomplish four objectives: 1) to understand the significant role argumentation plays in public and private discourse, 2) to research, gather and organize supporting material into argumentative discourse so as to become a skilled advocate, 3) to be familiar with the physical and virtual PSU libraries, and 4) to become an effective critic of argumentative discourse.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "CAS 216: Practical Parliamentary Procedure", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Practice in presiding over and participating in meetings conducted under rules of order.", "other": ["Cross-listed with: AEE 216"]}, {"course_name": "CAS 220: Persuasion", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "The course aims to impart knowledge of scientific theories of persuasion by engaging students in the design and execution of a persuasion campaign. The applied component of the course involves (a) selecting a consequential issue, (b) evaluating the extent to which that issue might be amenable to solution via persuasion, (c) learning how members of the target audience view the issue via formative research, (d) designing theoretically-informed messages adapted to the target audience, (e) implementing a campaign that utilizes multiple messages in multiple modalities, and (f) evaluating the impact of the campaign. Classic and contemporary concepts of persuasion science are brought to bear on each stage of this sequence.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 222N: Foundations: Civic and Community Engagement", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Through readings, discussion, deliberation, listening, and individual as well as collaborative action, this course gives students the opportunity to learn about and practice theories and habits of civic and community engagement and public scholarship with the goal of helping to build democratic capacity and sustain participatory democracy. This course emphasizes concepts and case studies that focus on the people's role in shared governance. The course also provides a foundation for understanding how a wide range of other individual and collective practices have an equally important role to play in building and sustaining community. The course draws from studies in demography, political science, sociology, psychology of racial identity formation and education to help students communicate better about and in shared governance. Among the core concepts are the role of students and other citizens in sustaining and transforming their communities, the historical and contemporary mission of Land Grant universities, the centrality of rhetoric and communication to collaborative judgment, and the relationship among media, cultures, and politics as they affect civic and community engagement. Students also learn together about the range of ways that citizens do, can, and might participate in democratic decision-making and will observe and practice these forms in several communication media and across a range of differences. Finally, learn about models of and opportunities for engaging other citizens across and beyond Penn State, including in global environments.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AYFCE 211N, CIVCM 211N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 232N: Identity, Citizenship, and the Rhetoric of American Horror Film", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Concentrated on American horror film from the 1930s to the present, the course will address the role of horror in the creation of stories told about the United States, its history, and its people. The course examines horror films rhetorically and social scientifically. Specifically, the course incorporates a rhetorical lens by exploring horror films as acts of constitutive rhetoric, that dramatize and interrogate the ways people use language and images to tell stories and foster identification within and between citizens and to constitute an \"American identity.\" The course also incorporates a social scientific lens by examining horror films' association with identity/US identities using media effects theories, which include perspectives associated with audience use and reception. Both perspectives (rhetoric and media effects) are used to consider the roles of U.S. social, political, and economic contexts in the production/construction of horror films for the stories they tell and the characters they construct. For example, the course will examine the ways that American horror films respond to fear and anxiety in response to specific cultural contexts such as the emergence of science, xenophobia/marginalized populations, various social movements, economics, and war.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 250: Small Group Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "People learn the basic features of society, and social relationships, through interaction. Small groups are especially important because they are the smallest possible social unit in which bargaining, negotiation, and deliberation can occur. Every student has practical life experience in groups, and the course syllabus draws on those experiences to contextualize the material students learn. At the same time, without a formal study of group communication, students lack the necessary perspective and training to work most effectively and ethically in groups. This course addresses that knowledge and skill deficit by walking students through the major concepts, theories, underlying research methods, and ethical dilemmas faced in small groups. Students come to understand how groups fit into larger organizations and society-often making up the building blocks of both small and vast social units. Students come to appreciate the dynamic quality of groups, which often develop in relation to group members' needs and external social forces. The course teaches students the importance of group cohesion, conflict, bonding, and group culture, as well as the hazards those can face when groups wish to engage in effective group problem analysis and decision making. Throughout, students are learning the ethical principles of democratic deliberation and leadership in groups-a subject that was at the center of communication pedagogy in the early twentieth century and that has become particularly important once again early in this century. Finally, students learn practical abilities, such as group agenda setting, discussion management, and presentation skills.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 251: Communication, Advocacy, and Entrepreneurship", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Communication, Advocacy, and Entrepreneurship empowers students to utilize the process of entrepreneurship as a form of advocacy to enhance the human condition and improve public life. Students in this course learn the \"Lean Startup\" methodology of entrepreneurship through the simulated team-based activity of launching a startup to address an important societal exigence. Student startup teams will interrogate the rhetorical constructs that enable and constrain advocacy-based solutions to exigencies such as economic inequality, mental health, racism and sexism, and political disenfranchisement, and utilize qualitative research methods to develop key social venture hypotheses around their own simulated startups that will be tested through a minimum of 30 ¿client discovery¿ interviews and secondary research. This course offers a critique of the business paradigm of ¿maximize shareholder value,¿ which privileges rapid scalability and growth, maximized profit, and ROI (Return on Investment), and invites students to consider the impact this dominant view of business has on companies¿ commitment to environmental performance, social responsibility, employee well-being, and organizational mission. Students are encouraged to adopt the ethical business framework of nonprofits and emerging alternatives such as B Corporations and social enterprises, which provide assessments to help companies raise their standards for legal transparency, environmental responsibility, and worker and community well-being. Student simulated startups are designed to give voice to those disenfranchised by systems and discourses of power, and student teams are encouraged to see their solutions as offering services and/or interpretive frameworks that remedy inequity and promote healing, justice, and empowerment within the constraints of a specific moment in time. For example, students concerned about the impact of substance abuse on mental well-being and academic success could create a startup to help colleges/universities alter their messaging about alcohol use and/or implement sober living option best practices, or a student victimized by developmental sexual trauma could draw upon the latest research on healing and the body to propose a startup to raise awareness about natural treatments for posttraumatic stress disorder. Students who complete Communication, Advocacy, and Entrepreneurship are encouraged to consider advancing their idea from simulated startup to real startup by participating in the vast array of educational and fundraising opportunities within Penn State¿s entrepreneurship ecosystem (e.g., Happy Valley Launchbox, Invent Penn State, Startup Week, Global Entrepreneurship Week)."}, {"course_name": "CAS 252: Business and Professional Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Review and practice of various communication forms used in modern organizations. Topics include persuasive speaking, speech writing, multi-media presentations and business and report writing. Interviewing, briefing, conferring, and decision making; analyzing and evaluating formal and informal patterns of communication in organizations.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 253: Health Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 253 introduces students to principles of health message design and the general theories and models used to guide these efforts. This course is designed to provide students with theoretical principles for practice in planning and evaluating health messages for dissemination by health organizations, policy makers, and other interested publics. CAS 253 emphasizes the potential positive and negative outcomes associated with specific messages designed to impact individuals' knowledge and behavior with health consequences. It emphasizes the importance of audience segmentation on goal selection in guiding health message design, as well as the effects and effectiveness of source and channel selection for reaching particular audiences. The CAS 253 Health Communication course is one of a series of electives for Communication Arts and Sciences majors or minors interested in pursuing careers in organizational communication, health communication, sales, and training and development in small groups. The course is possibly linked to those with interests in biobehavioral health.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 255: Communicating Gender", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course is designed to offer opportunities for exploring how gender is socially constructed partly through communication. The course offers a survey of concepts from rhetorical theory and gender theory that help explain how the norms for gender¿including as it intersects with other categories such as sexuality and race¿are communicated within multiple domains in a culture. Students develop skills for thinking critically about diverse perspectives on these norms. The course emphasizes the agency of students in developing their own ethical frameworks for how to enact gender performances in their communication, as well as how to respond through communication to the performances of others.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 271N: Intercultural Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Focus on topics such as language, identity, prejudice, and intergroup relations on a domestic/ international level. This course fulfills an intercultural and international competence (US/IL) requirement. CAS 271N is designed to give undergraduate students an introduction to the various issues, trends, and historical perspectives pertaining to communication within U.S. domestic and international cultures. It integrates social and behavioral sciences and humanities disciplines so that students can compare and contrast what different disciplines bring to a topic. CAS 271N is an introductory survey course that is highly recommended to students as a course preceding several other 300 and 400-level courses on interpersonal, group and intercultural communication, relationships, and processes.", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 272N: Political Communication and Technology", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course examines how interactive communication technologies reshape political rhetoric, discursive civic culture, deliberation in the online public sphere, and participatory democracy. It traces the evolution of the public sphere and explores theoretical and empirical issues related to online political discourse (blogs, political discussion fora, viral politics of social networking sites), cyberactivism, smart mobs, networked publics, and peer-to-peer production (You Tube, Wikis). CAS 272N concentrates on online rhetorical and discursive strategies of candidates for public office, and individuals and organizations campaigning on specific issues and causes. It emphasizes civic engagement and includes topical areas such as mechanisms of online public spheres, citizen generated discourse and content, viral politics, connections between social networking sites and political discourse, and behaviors such as networked activism. It examines how various interactive communication options have affected political discourse, campaign communications and public deliberation. It provides students with hands-on experiences in analyzing the rhetorical and persuasive strategies involved in creating video content, writing blogs, creating wikis and twitter messages. It teaches students how they could use these communication options in working for political campaigns, civic action groups and non-profit institutions. The goal of the course is to help students understand the opportunities and constraints involved in using interactive communication technologies for civic and political actions, and facilitate their development as informed citizens. Class activities focus on identification and critique of rhetorical strategies employed when using interactive communication technologies, and learning to create content such as weblogs, wikis, and mashups. Students will be graded on exams, participation in discussion groups, analyzing and connecting course concepts to real world examples, creating content such as mashups, and analysis of rhetorical strategies of political candidates and activist groups. CAS 272N is highly recommended to students interested in examining the potential of interactive communication technologies for civic and political action.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 280W: Storytelling and Speaking", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Principles of oral performance from storytelling to the printed page; includes oral performance of stories, speeches, prose, drama, and poetry.", "other": ["Writing Across the Curriculum"]}, {"course_name": "CAS 283: Communication and Information Technology I", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This is an introductory course in the theory and application of technology for communication and self-presentation using the Internet. A major emphasis is placed on Computer-mediated Communication (CMC) ¿ the study of the social effects of communication and information technology. Areas covered include factors that distinguish mediated from face-to-face interaction, theories of mediated interpersonal communication, self-presentation online, Internet-based relationships, and online communities. Upon completion of this course, the student should have knowledge of how the Internet influences communication and a better understanding of how to use CMC for self-presentation.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 295: Internship", "department": "Communication Arts and Sciences (CAS)", "credits": "1-16 Credits/Maximum of 16", "description": "Supervised nongroup instruction, including field experiences, practicums, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "CAS 296: Independent Studies", "department": "Communication Arts and Sciences (CAS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CAS 296A: **SPECIAL TOPICS**", "department": "Communication Arts and Sciences (CAS)", "credits": "1-6 Credits"}, {"course_name": "CAS 297: Special Topics", "department": "Communication Arts and Sciences (CAS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CAS 299: Foreign Studies", "department": "Communication Arts and Sciences (CAS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CAS 301: Rhetorical Theory", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "History and theory of public advocacy and civic discourse.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 302: Social Influence", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Explores how humans influence others through communication."}, {"course_name": "CAS 303: Communication Theory", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course is intended as a foundational course in communication theory for Communication Arts and Sciences majors and others interested in social science theory in general. It is designed to show how communication theory can be applied to understand and improve communication in your professional (and personal) life. The theories examined will span the range of communication contexts, including interpersonal, group, organizational, mediated, and cross-cultural interactions. At the conclusion of this semester, students should be able to demonstrate: - Knowledge of major ideas from a substantial number of communication theories - Ability to apply theories of human interaction to explaining and improving communication behavior, especially in professional contexts In addition, students should have: - Improved skills at both creative and analytic writing that includes practice in giving helpful feedback on others - writing, and facilitating discussion", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CAS 303H: Introduction to Communication Theory- Honors", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This honors course provides an overview of conceptual perspectives and theories of human communication. Students will apply theories to analyze and solve problems in different applied contexts (e.g., interpersonal, political, and health, etc.). Students will learn to recognize and present clear descriptions of communication theories in both general instances and specific contexts. Students will learn to understand communication theories apply them to the analysis real-world problems. Students will learn to defend their analyses, justify their arguments, and prepare counter-arguments with articulate logic and appropriate empirical evidence. Additionally, students will learn to synthesize scholars' logically related, testable statements devised to explain the same group of facts or the same phenomena: their definitions, claims, assumptions, and rationale from published, empirical research. CAS 303H is designed to provide the opportunity to pursue this course more in depth and rigorous level.", "other": ["General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "CAS 304: Quantitative Methods for Communication Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "The purpose of this course is to instruct students on concepts and issues of quantitative research methods in Communication. Students will learn how Communication researchers conduct and evaluate research from using a variety of quantitative methodologies. By the end of the course, students will possess the knowledge necessary to understand and evaluate arguments utilizing research to persuade, as well as, to conduct sound research on their own. A primary goal of the course is to enable students to become a critical consumers and producers of information that defines the world around them. The course will educate on the proper terminology/concepts used in research methods. The end result of the course should be a fundamental understanding of how to critique and conduct research in the field of Communication.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 304H: Communication Research Methods (Honors)", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "The purpose of this course is to acquaint students with the basic concepts and issues of research methods in Communication. Students will learn how Communication researchers conduct and evaluate research from a variety of traditions (e.g., quantitative, qualitative, rhetorical). By the end of the course, students will possess the knowledge necessary to understand and evaluate arguments utilizing research to persuade, as well as, to conduct simple, yet, sound research on their own. A primary goal of the course is to enable students to become a critical consumer and producer of information that defines the world around them. The course will educate students on the proper terminology/concepts used in research methods. The end result of the course should be a fundamental understanding of how to critique and to conduct research in the field of Communication. This course sets itself apart as an honors course because of the depth of the investigation of course theory/concepts and through the conducting and writing of a significant research project. Further, the significance of cultural contexts is made central to the consideration of research, theoretical application, and communication of research findings, highlighting the importance of a global thinking relative to communication problem-solving.", "other": ["General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 311: Methods of Rhetorical Criticism", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Rhetorical Criticism introduces students to the most common methods of rhetorical criticism within the field of communication. These methods are designed to help students analyze and evaluate commonplace forms of rhetoric. Examples include historical or contemporary speeches, debates, political campaigns, social movements, or mass mediated messages intended to influence the public at large. The course not only provides a survey of essential methods of rhetorical criticism, but also requires students to produce works of rhetorical criticism themselves based on substantive research and written evaluation of a rhetorical artifact. Methods of rhetorical criticism are distinct from analytic methods used by other academic disciplines. Scholars of communication began to establish methods of rhetorical criticism in the early twentieth century in an effort to distinguish the aims of their scholarly pursuits from those of literary criticism or historical research. Rhetorical criticism evaluates the rhetoric of public communication (speeches, debates, or mediated messages intended to shape public understanding of real-world social, political, or moral issues). Such methods enable rhetorical critics to do so, moreover, not only by examining who said what at a given moment in history, but by closely analyzing how and why strategic uses of language or symbolic communication influenced public beliefs or behaviors. Rhetorical Criticism thus provides students with a variety of adaptable analytic tools that they may use to better understand and evaluate the nature as well as impact of rhetorical messages throughout history and in everyday life.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 315: Debate and Civic Life", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course provides historical background on debate in politics and in civic life, examining both public and competitive debate practices. Debate has been a vital part of democratic engagement in the United States since the founding of the country. This course explores the role debate has played in the United States, focusing primarily on debate practices in the 20th and 21st century. This course provides historical background on debate in politics and in civic life, examining both public and competitive debate practices. Course material will expose students to theories and practices of debate including the history of important debate moments in the United States, analysis of contemporary political debates, and practical debate techniques inside the classroom and in a public setting.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CAS 321: Rhetoric and Law", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "A survey of the literature on the role of rhetoric in law, including trial advocacy, appellate argument, and judicial reasoning. Rhetoric and Law explains how knowledge of rhetorical principles enhances the understanding of legal documents, reasoning, and performance. This course surveys classical to contemporary rhetorical literature demonstrating its utility to the study of law. Students will examine the role rhetoric plays in jury deliberation, trial advocacy, appellate argument and judicial reasoning. Students will demonstrate their understanding of rhetorical theory by participating in a mock trial. In this exercise, students will deliver opening statements, closing arguments as well as conduct direct and cross-examination of witnesses. Finally, the class will examine United States Supreme Court majority and dissenting opinions as rhetorical documents.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "CAS 340: Communication and Civility", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Communication behaviors contributing to civil and uncivil discourse; their implications in business, public life, across cultures and in interpersonal relationships."}, {"course_name": "CAS 352: Organizational Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course combines theory, research, and practical application to explore the role of communication in today's organizations. Students will learn communication skills applicable to modern work-related issues. Topics include organizational culture, problem solving in teams, organizational conflict, communication technology, social media, and ethical leadership.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CAS 360: Communication for Teachers", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Analysis of dynamics of instructor-student communication implemented through structured exercises in instructor listening, verbal and nonverbal message- making.", "prerequisite": "CAS 100"}, {"course_name": "CAS 373: The Rhetorics of War and Peace", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course explores how war and peace are advocated.  CAS 373 The Rhetorics of War and Peace (3)In The Wealth of Nations (1776), the first classic of capitalism, Adam Smith speaks of \"the art of war,\" deploying a phrase from Sun-Tzu's The Art of War that would later appear in Baron von Clausewitz's On War and also in contemporary U.S. military handbooks. This course argues that war is indeed an art, and a thoroughly rhetorical one in which the political economy of persuasion is as important as high-tech weaponry and whiz-bang battle plans. By considering some of war's most thoughtful theorists, by discussing wars past and present, and by reading powerful defenses and trenchant critiques of war, this course will help students understand how wars are managed rhetorically. This course satisfies a grave need: for living in the post-9/11 world requires the critical rhetorical skills necessary to understand not just how war is waged or how it structures our lives but how war is advocated and defended. The trajectory of this course will thus make the full arc from war to peace. Perhaps most importantly in this time of grave post-modern warfare, this semester's readings and discussions will make us all better rhetorical scholars capable of imagining alternative futures. From the realities of war comes the possibility of peace.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 375: Rhetoric and Public Controversy", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Debates, arguments, and other forms of communication in public life often address various kinds of ongoing controversies. Resolving those controversies often influences our collective social, political, and moral decision-making. This course provides students with concepts, vocabularies, and practices necessary to study historical and contemporary public controversies. Understanding how to use rhetoric collaboratively and constructively for the public good is therefore valuable in both evaluating and helping to resolve controversies. CAS 375 will allow students to learn about well-known and lesser-known controversies that affect social and political life in Pennsylvania, at Penn State, and throughout the nation. Students will do so by examining primary and secondary texts (or historical documents as well as academic research). The course requires students to collaboratively research controversial topics of their choice, thereby enabling them to practice both analytic and communicative skills that help to promote constructive public discourse. In these respects, the course offers students an academically rewarding and civically engaged experience. Different versions of CAS 375 will vary depending on the specialties of individual instructors within the broad and diverse scholarship on public controversies. All versions of the course, however, will be designed according to common learning objectives and major topics in order to provide students with substantive points of academic coherence and consistency across slightly differing iterations of the course.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 383N: Culture and Technology", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "The aim of this course is to examine the relationship between technology and culture in the broadest sense, from the role of tools used in society to the impact of high technology in post-industrial societies. The course begins with an overview of the theoretical approaches to the linkage between technology, culture and society. Students will examine the role of technology as a determinant of culture. Particular attention will be given to the diffusion and transfer of new technology and its impact on social and cultural issues. This course is designated as Integrated Domain because of the interdependence of humanities and social sciences as fundamental to understanding the role technology plays in the transformation of the nature and influence of cultural properties such as education, work and economics, politics, and human relationships. Using communication theories that focus on technology, students will grapple with ethical questions of power and justice and the way dominant cultural ideologies and technological developments shape norms that get solidified in attitudes, norms, and workplace and public policies.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "CAS 390: Qualitative Research Methods", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "An overview of Qualitative Research Methods, including how to conceive, design and execute a research study.  CAS 390 Qualitative Research Methods (3) (GS) This course provides students with an understanding of both qualitative research methods and the theoretical frameworks that inform qualitative inquiry. Additionally, this course focuses on tools for data collection such as individual and focus-group interviewing and observing and recording interaction. This course provides practical experience for students in collecting and analyzing qualitative data with and without the use of technology and examines particular difficulties in the interpretation and reporting of qualitative findings. Qualitative Research Methods is course that bridges disciplinary boundaries and is useful to any student who will be investigating human interaction.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 395: Forensics Practicum", "department": "Communication Arts and Sciences (CAS)", "credits": "1-2 Credits/Maximum of 16", "description": "Provides students in forensics the opportunity for supervised participation in the activity in class and in intercollegiate competition."}, {"course_name": "CAS 398: Special Topics", "department": "Communication Arts and Sciences (CAS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "CAS 399: Foreign Studies", "department": "Communication Arts and Sciences (CAS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CAS 402: Speech and Human Behavior", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "General semantics, thought, and human behavior; not offered at University Park campus."}, {"course_name": "CAS 403: Interpersonal Communication Theory and Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 403 is an advanced introduction to social scientific theory and research on interpersonal communication. Course foci center on contemporary theory and research, interpersonal communication in personal and professional relationships, and a research practicum in which students conduct an original research study. The course is intended for juniors and seniors in Communication Arts and Sciences and other liberal arts majors who have a serious interest in interpersonal communication processes. Assignments and readings address theory, research, and practical application.", "prerequisite": "3rd Semester Standing or 6 credits of CAS", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CAS 404: Conflict Resolution and Negotiation", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Conflict and its management are critical issues that pervade the fabric of our society. This class is designed as an opportunity to explore the complexities of conflict, to understand the forces that make conflict challenging, and to develop a repertoire of skills for thinking about and managing conflict more effectively. In this pursuit, we first examine the features that define and set the stage for conflicts. We then turn to the communication behaviors that people use to manage conflicts. Finally, we consider some of the dynamics that make constructive conflict management a challenge. The objective of this course is to expose students to the scholarly study of interpersonal communication in a way that both captures the vitality of the discipline and enhances interpersonal communication skills. As a General Education course contributing to the social and behavioral science requirement, this class is also expected to (a) survey existing knowledge in the subject domain, (b) promote an understanding of social scientific methods, (c) clarify the multiple nature of causality in social settings, (d) demonstrate the relationships between the study of interpersonal communication and other disciplines, and (e) encourage students to integrate empirical knowledge and theoretical views of the social world. The course content, assignments, and exams were developed to attend to these concerns. Recommended Preparation CAS 100", "prerequisite": "3rd Semester Standing or 6 credits of CAS", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 405: Family Communication Theory and Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Family relationships are powerful. They represent our foundation, our growth, and our potential. Family relationships are complicated. They endure change, hardship, and adversity. And family relationships are ever changing. They shift with the diversity of family systems, they blend blood, legal ties, and social connections, and they move with the experiences of the individuals embedded in the family unit. In the midst of all that family is communication, functioning as the creator, the designer, the mediator. Without communication, the family unit would have no identity. This course centers on family communication as the means through which family identity is constructed. Family communication is the way in which families (re)define themselves, how they make sense of their experiences, and the way they adapt to changing circumstances. The course focuses on family communication as a vibrant and cross-disciplinary field, one that is dedicated to understanding the unique experiences and issues facing families. Theory and research are the foundation of the course with the goal of building bridges between theoretical frames and praxis, identifying ways in which theory illuminates many of the challenges facing families, while exploring how research can help to resolve these problems. By the end of this course all students should be able to comfortably negotiate the tension between theory and practice.", "prerequisite": "3rd Semester Standing or 6 credits of CAS"}, {"course_name": "CAS 406: Honors Course in Communication Arts and Sciences", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Individual study and seminar in selected areas or issues of speech communication.", "prerequisite": "5th Semester standing", "other": ["Honors"]}, {"course_name": "CAS 408: Interpersonal Influence", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Because humans live in groups, they must grapple with who is in charge and how to get along with each other. All social animals have devised various means of answering these basic questions, but humans have the added complexities associated with the use of language and argument. This course aims to show how basic problems of sociality play out in common contemporary interactions such as getting help from others, enforcing rules and obligations, providing advice, and changing opinions. It covers theories of message production and of message effects, all of which are evaluated from evolutionary, social, and cognitive meta-perspectives.", "prerequisite": "6 credits in CAS and 3rd semester standing"}, {"course_name": "CAS 409: Democratic Deliberation", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Explores the theory and practice of democratic deliberation in elections, town meetings, juries, legislatures, and other public institutions.  CAS (PL SC) 409 Democratic Deliberation (3) Many modern democracies have made strides to become more deliberative in how they make decisions. This course looks closely at the most promising innovations in self-government while also reviewing the persistent anti-deliberative and undemocratic features of modern societies and governments. Topics covered in the course include deliberative democratic theory, political conversation, common forms of public meetings, mediated deliberation, campaigns and elections, the jury system, and deliberative democracy on larger social scales.", "prerequisite": "PLSC 1", "other": ["Cross-listed with: PLSC 409"]}, {"course_name": "CAS 411: Rhetorical Criticism", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Principles of rhetorical criticism examined through analysis of selected texts and critics.", "prerequisite": "3rd Semester Standing or 6 credits of CAS", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "CAS 415: Rhetoric of Film and Television", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Rhetorical analysis of the artistic forms and cultural structures of film and television; intensive study of selected examples.", "prerequisite": "3rd Semester Standing or 6 credits of CAS", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "CAS 420: Rhetorical Theory", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Ancient, medieval, Renaissance, Enlightenment, and contemporary theories of rhetoric.", "prerequisite": "3rd Semester Standing or 6 credits of CAS", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "CAS 421: Communication and Aging", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Concentrates on the pivotal role that communication plays in the social process of aging.  CAS 421 CAS 421 Communication and Aging (3) Communication and Aging is a course that concentrates on the pivotal role that communication plays in the social process of aging. An understanding of the communicative behavior of older adults can result in significant improvements in our ability not only to describe the essential components of a quality life, but to actively intervene in the various factors that help each of us adapt to the many physiological, psychological , social and economic challenges of the aging process. Topics covered in this course include: the theories of social aging; attitudes and ageism; mass media use and portrayals; work, leisure, and retirement; family relationships such as siblings, grandparent-grandchild, parent-child; friendships; health and aging; death and dying; and successful aging. This course places communication and our interactive behavior at the heart of the aging process and helps us combine the growing bodies of literature in physical, psychological and social aging as we attempt to grasp the process of life long development.", "prerequisite": "3rd Semester Standing or 6 credits of CAS"}, {"course_name": "CAS 422: Contemporary African American Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "A focused study on the continuities between African and African American culture and communication. CAS 422 / AFAM 422 Contemporary African American Communication (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. At least once a year, this multidisciplinary course is designed to serve both Speech Communication and African and African American Studies. It is concerned with the relationship between a people's culture and world view and their systems of rhetoric/communication. It also provides a focus on the continuities between African and African American culture and communication. Specifically, it offers an approach to ascertaining the salient features of African and African American communication for community development. Special emphasis is given to the development and rhetoric of the Civil Rights Movement. The course utilizes videos, guest lectures, tapes of speeches, etc. to clarify objectives and stimulate classroom discussion. Students will be evaluated on two exams, one oral report, a final paper and class participation. Even though students need 400-level courses for their major and minor, this course is not required for Speech Communication majors. However, it does meet the Intercultural and International Competency requirement because it focuses on the communication of African Americans and how that communication has affected all Americans. The course will accommodate ten students in Speech Communication and ten students in African and African American Studies to ensure active discussion of issues.", "prerequisite": "3rd Semester Standing", "other": ["Cross-listed with: AFAM 422", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"course_name": "CAS 426W: Communication Ethics", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Ethical issues in public and private communication; role of communication in expressing and realizing individual and social values.", "prerequisite": "CAS 100", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"course_name": "CAS 438: Rhetoric of Documentary", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Rhetorical analysis of the documentary in film, television, and other media; historical and critical analysis of functions and form.", "prerequisite": "3rd Semester Standing or 6 credits of CAS"}, {"course_name": "CAS 450W: Group Communication Theory and Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This writing-intensive course provides students with an overview of a broad range of theories and perspectives on group interaction and their implications for communication, including topics such as group formation, development, maintenance, and behavior.", "prerequisite": "CAS 137H", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "CAS 452: Organizational Communication Theory and Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 452: Organizational Communication Theory and Research explores the nature and function of communication in organizations; emphasis is placed on theoretical concepts, tools, and skills for effective management of communication. The goal is to open students' minds to the importance and centrality of the communicative process within formal and informal organizations. The course explores communication theories which focus on and help explain the complex interactions that occur at numerous levels within modern organizations. The course culminates in a semester long \"communication audit\" of an organization to test the explanatory power of communication theories in the working world. There is also a writing intensive version of this course, CAS 452W. Students may only receive credit for one of the versions of CAS 452.", "prerequisite": "CAS 100", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 452W: Organizational Communication Theory and Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 452W explores the nature and functions of communication in organizations; emphasis on writing and exploring concepts, tools, and skills for effective management of communication. This course is designed to further introduce students to the field of Organizational Communication. Emphasis is placed on macro-organizational variables that can systematically affect micro-communication behaviors; in other words, how could something like the hierarchy of the organization influence who someone talks with as an organizational employee. The purpose of the course is to provide students with a basic understanding of communication-relevant behaviors and activities in organizations. This includes things like leadership, teamwork, conflict management, and diversity. Additionally, this course examines various theories of and approaches to studying communication within organizations. This version of the course is writing intensive, there is also one that is not. Students may only receive credit for one: CAS 452 or CAS 452W.", "prerequisite": "CAS 100", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"course_name": "CAS 453: Health Communication Theory and Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Principles of communication about health across the lifespan and within health-care contexts.  CAS 453 Health Communication Theory and Research (3) This is an upper division course designed to provide students with a comprehensive introduction to multiple discourses about health and health care. CAS 453 emphasizes the communication about health and health care that reaches us everyday through many and varied professional, personal, and mediated forms. Interactions with health care providers were once limited primarily to physicians and nurses. Today, careers in health care are among the most rapidly expanding job areas, and a bewildering array of technicians and technical and professional titles greets the client of formal health care. Awareness and understanding of how to assess these various roles increases the ability of students to interact competently with care providers. Family, friends, and the cultural groups that nurture our youth and sustain our adulthood interact with us about health on a regular basis as well. Awareness and understanding of the impact that interactions with these primary social network members has on interactions with health care providers increases the likelihood that both provider and client will be better understood and better served.Every message about health and health care carries an ethical dimension in its content. The course will increase a students' critical thinking and informed decision-making skills associated with others efforts to influence them regarding their own health practices. It also frames discussion about the ethics of and ethical decision-making associated with health communication. Students will examine communication about health in many situations and contexts to illustrate how it reflects efforts to assign labels to illness and disease, and sometimes the environmental and political contributors to the situation. Students will assess whether communication about health and health care places the responsibility on individuals, institutions, society, or some combination for the particular health condition or situation. Finally, students will evaluate how communication is used to invoke personal, professional, and societal norms of conduct associated with standards of conduct that should promote health and well-being.The course is linked to the courses in interpersonal communication, organizational communication, health communication, and small group communication, as discourse about health crosses societal, cultural, and personal contexts. CAS 453 is one of the upper division courses that may be used to fulfill Major or Minor students' requirements for upper division credits.", "prerequisite": "3rd Semester Standing or 6 credits of CAS"}, {"course_name": "CAS 455: Gender Roles in Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Explores the literature on gender research in the discipline of human communication.  CAS (WMNST) 455 Gender Roles in Communication (3) (US) This 400-level course is a theory and application course which also satisfies an intercultural requirement. CAS/WMNST 455 strives to ensure that students understand female and male differences and similarities in communication patterns, perceptions of the opposite sex, and expectations and stereotypes regarding the opposite sex. Many researchers find that gender communication is 'cross cultural' i.e., that women and men come from two different cultures, and therefore misunderstanding of each others' intent and expectations may frequently occur. This course examines how distinctions in meaning and interpersonal dynamics may create these two differing cultures, and promotes understanding and possibilities for adaptation. It also investigates when and if changing communication styles is desirable, and in which settings. A goal of the course is to help students to solve puzzles toward understanding those we work with and relate to, as well as to apply their knowledge to their own lives and contexts. The course content and format reflects these goals. CAS/WMNST 455 begins with theoretical information, later applying it to situations of interest to most -- relationships, language use differences (verbal and nonverbal), media messages, and workplace issues. Lecture incorporates considerable discussion and exploration of gender issues, and most topics are followed by activities, which illustrate how theories work in real life. This course is useful for any students seeking an intercultural course. It is recommended to Communications Arts and Sciences and Women's Studies majors and minors due to emphasis on communication theory and gender issues. Business, counseling, psychology, sociology, education and any social science majors may fulfill a US requirement through 455.", "prerequisite": "3rd Semester Standing", "other": ["Cross-listed with: WMNST 455", "United States Cultures (US)"]}, {"course_name": "CAS 460: Introduction to Honors Thesis", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course will guide students through steps that result in Honors Thesis Proposal.", "prerequisite": "Student must be in good standing in Schreyer Honors College. CAS  201 or CAS  202 or CAS  204", "other": ["Honors"]}, {"course_name": "CAS 470: Nonverbal Communication", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Examining ways nonverbal messages, such as gestures, posture, vocal intonation, and facial expressions, affect us on a daily basis.", "prerequisite": "3rd Semester Standing or 6 credits of CAS"}, {"course_name": "CAS 471: Intercultural Communication Theory and Research", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "CAS 471 Intercultural Communication Theory and Research (3)(US;IL) This upper division course provides a comprehensive overview of intercultural communication theories and research. Students will apply theories to analyze and solve problems that affect intra-group and intercultural communication within and across national boundaries. Course includes a variety of activities, including interactions that cross cultural, linguistic, or national boundaries.issues of humanity, tolerance, values, and communication.", "prerequisite": "5th Semester standing", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "CAS 475: Studies in Public Address", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "History and criticism of public discourse; intensive analysis of selected public addresses and social movements.", "prerequisite": "3rd Semester Standing or 6 credits of CAS", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "CAS 478: Contemporary U.S. Political Rhetoric", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "In this course students will learn how to analyze selected discourses and movements in recent U.S. political history and to compose and deliver their own discourses--written, spoken, and mediated by digital information technologies. The discourses students will learn to analyze include speeches, debates, news stories, commentaries and other written arguments; audio, visual, and video messages; and persuasive campaigns. This course provides students the opportunity to study contemporary U.S. political rhetoric in order to contribute to improving its quality. Using rhetoric's analytic and productive capacities, students will read, listen to, and view examples of public discourse on vital issues of the day. Informed by the diverse, millennia-long history of rhetorical theory in general and argumentation and public memory studies in particular, this course offers variously mediated texts as points of departure to enable students to learn and deliberate together about the causes and consequences of and the possible remedies for the state of U.S. political rhetoric in the past, present, and future. This course thus serves as one kind of culmination of undergraduate rhetorical study, equipping students with the skills, habits, and practices they need to be informed and capable citizens of a democratic republic. Further, the course enables students to synthesize what they have studied in various disciplines across their undergraduate education because the course focuses on public problems and public memory. While different sections of the course will focus on different public problems and political issues, the rhetorical theory and criticism core of the course will remain consistent across sections. Over the course of the semester students will learn through practice how to compose and deliver factually correct and rhetorically credible discourses for different audiences. Students will learn through practice how to analyze and produce rhetorically sound arguments. Students will learn the histories of social and political movements in the United States as those histories pertain to contemporary political discourses and controversies.", "prerequisite": "3rd Semester Standing or 6 credits of CAS", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "CAS 483: Communication and Information Technology II", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "Theory and application of interactive internet-based communication and information management; for students who want a Liberal Arts approach.", "prerequisite": "3rd Semester Standing or 6 credits of CAS"}, {"course_name": "CAS 490: Peer Tutoring for Public Speaking", "department": "Communication Arts and Sciences (CAS)", "credits": "3 Credits", "description": "This course will prepare students to become peer tutors in public speaking.  CAS 490 Peer Tutoring for Public Speaking (3) This course will prepare undergraduates for work as peer tutors in the area of public speaking. Students will begin by considering peer tutoring as an opportunity for civic engagement, and public speaking as integral to the democratic process. Students will review and practice elements of the speaking process both to become excellent speakers themselves and also highly competent tutors for their peers across the university's curriculum. In addition to instruction on elements of public speaking, students will study and practice the art of critique. This course will include in-class instruction, discussion, and activities, as well as a practicum in which students will participate in reviews of peers' work at all stages of the speaking process.", "prerequisite": "CAS 100A"}, {"course_name": "CAS 493: Undergraduate Teaching Assistantship", "department": "Communication Arts and Sciences (CAS)", "credits": "1-3 Credits/Maximum of 6", "description": "As a Teaching Assistant, you'll activate your learning in a way that will reinforce and enrich your understanding of course material. In addition to this intellectual benefit, working as a Teaching Assistant is great professional experience that enhances other skill sets including: organization, time management, planning and executing effective meetings, and, of course, effective communication. Finally, teaching assistantships are great ways to cultivate strong relationships with faculty and graduate students who may become mentors and personal and professional resources. Specific duties of undergraduate teaching assistants might include leading discussions, holding office hours, doing research or creating materials for the instructor, and performing tasks related to the course (e.g., taking attendance or keeping records). Grading of exams and assignments is not an appropriate task for undergraduate TAs."}, {"course_name": "CAS 494: Research Topics", "department": "Communication Arts and Sciences (CAS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group basis.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "CAS 494H: Research Topics", "department": "Communication Arts and Sciences (CAS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group basis.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Honors"]}, {"course_name": "CAS 495: Internship", "department": "Communication Arts and Sciences (CAS)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "CAS 496: Independent Studies", "department": "Communication Arts and Sciences (CAS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CAS 496H: Introduction to Thesis Research", "department": "Communication Arts and Sciences (CAS)", "credits": "1-3 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "CAS 497: Special Topics", "department": "Communication Arts and Sciences (CAS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CAS 498: Special Topics", "department": "Communication Arts and Sciences (CAS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CAS 499: Foreign Studies", "department": "Communication Arts and Sciences (CAS)", "credits": "1-9 Credits/Maximum of 9", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]