[{"course_name": "CHNS 1: Level One Chinese A", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Introductory study of Chinese language, with audio-lingual practice of Mandarin Chinese and attention to structure and the writing system.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "CHNS 2: Level One Chinese B", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Continued audio-lingual practice of Mandarin Chinese, further study of structure, practice in reading and writing Chinese.", "prerequisite": "CHNS 001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "CHNS 3: Level Two Chinese A", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Continued audio-lingual practice of Mandarin Chinese, more extensive practice in reading and writing; study of Chinese culture.", "prerequisite": "CHNS 002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "CHNS 97: Special Topics", "department": "Chinese (CHNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CHNS 99: Foreign Studies", "department": "Chinese (CHNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CHNS 110: Level Two Chinese B", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Readings in selected modern Chinese literature (short stories, plays, essays, poems) and other texts; practice in conversation and simple composition.  CHNS 110 Conversation, Reading, and Composition (4)(IL) (BA) This course meets the Bachelor of Arts degree requirements.As the fourth course in the Chinese language series, CHNS 110 continues to focus on the four skills of listening, speaking, reading, and writing. It intends to introduce students to frequently-used grammatical constructions in the Chinese language and to give students an active vocabulary of about 800 words. Building on the skills students acquired in Chinese 001 to 003 (the prerequisites to Chinese 110), this course expands their knowledge of the language and cultures of the Chinese-speaking peoples in China, Hong Kong, Taiwan, and around the world. To that end, there are both language-learning objectives and socio-cultural ones in this course. About 85% of the class time will be spent in language learning and about 15% in cultural issues. Research indicates that the more knowledge students have about the context in which the target language is used, the higher their overall linguistic proficiency level will be. To facilitate students' learning of Chinese culture, CHNS 110 also incorporate into the curriculum a variety of culture-related activities, including interviewing native speakers, film screening, calligraphy workshops etc.Class activities include group discussion, mini-presentations, and in-class conversation practice. Evaluation will be through means such as vocabulary and sentence pattern quizzes, weekly journals and reaction papers, chapter exams, in-class oral presentations, writing assignments, and a final oral interview with instructor. Chinese 110 counts towards the Chinese minor and may also fulfill other requirements, such as providing credits towards the major in Comparative Literature or the major in Asian Studies- check with advisors in those majors.", "prerequisite": "CHNS 003", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "CHNS 120: Introduction to Chinese Literature and Culture", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "This course provides an introduction to Chinese cultural production from ancient times to the postmodern era, with an emphasis on literature. In its more recent segments, the course will include film as well as considerations of Chinese cultures in the Chinese diaspora (such as the United States) and throughout the Chinese-speaking world. Students will learn about major eras of Chinese literature and the diversity of Chinese cultures in such locations as mainland China, Taiwan, Hong Kong, and the worldwide Chinese diaspora. Readings will represent several genres, such as poetry, folktale, short story, novel, prose fiction, drama, and historical annals. Through this course students can develop a historical and cultural perspective in order to understand the contexts and value systems that have inspired literary works. Students will investigate such topics as the relation between social institutions and the individual, the traditional patriarchal system, the changing roles of women, westernization, and post modern consumer culture, among others. Students will read literature and related materials from different periods, with examples from other media such as films where appropriate. Class work may include lectures or presentations by the instructor and student participation through means such as guided discussions, group discussions, and students' presentations. This participatory approach is intended to deepen students' appreciation of the texts, to help them understand value systems that may differ from, or else be shared with, those predominant in modern Western cultures, and to assist students in developing analytical and expressive abilities. CHNS 120 is designed to be suitable for all students generally interested in China and the Chinese-speaking world, or interested in literature and other fields of humanistic study, whether or not they have previously studied Chinese culture. All materials will be available in English. Taught in English.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CHNS 120W: Introduction to Chinese Literature and Culture", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "This course provides an introduction to Chinese cultural production from ancient times to the postmodern era, with an emphasis on literature. The course may include film, as well as considerations of Chinese cultures in the Chinese diaspora (such as the United States) and throughout the Chinese-speaking world. Students will learn about major eras of Chinese literature and the diversity of Chinese cultures in such locations as mainland China, Taiwan, Hong Kong, and the worldwide Chinese diaspora. Readings will represent several genres, such as poetry, folktale, short story, novel, prose fiction, drama, and historical annals. Through this course students can develop a historical and cultural perspective in order to understand the contexts and value systems that have inspired literary works. Students will investigate such topics as the relation between social institutions and the individual, the traditional patriarchal system, the changing roles of women, Westernization, and post modern consumer culture, among others. Students will read literature and related materials from different periods, with examples from other media such as films where appropriate. Class work may include both lectures and student participation through means such as guided discussions, group discussions, and students' presentations. This participatory approach is intended to deepen students' appreciation of the texts, to help them understand value systems that may differ from, or else be shared with, those predominant in modern Western cultures, and to assist students in developing analytical and expressive abilities. CHNS 120W is designed to be suitable for all students generally interested in China and the Chinese-speaking world, or interested in literature and other fields of humanistic study, whether or not they have previously studied Chinese culture. All materials will be available in English. The course is designed to count as General Education (Humanities), Writing Across the Curriculum, international cultures, and B.A. \"Other Cultures\" course. Taught in English.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"course_name": "CHNS 120Z: Introduction to Chinese Literature and Culture - Linked", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "CHNS 120Z This course provides an introduction to Chinese cultural production from ancient times to the postmodern era, with an emphasis on literature. In its more recent segments, the course will include film as well as considerations of Chinese cultures in the Chinese diaspora (such as the United States) and throughout the Chinese-speaking world. Students will learn about major eras of Chinese literature and the diversity of Chinese cultures in such locations as mainland China, Taiwan, Hong Kong, and the worldwide Chinese diaspora. Readings will represent several genres, such as poetry, folktale, short story, novel, prose fiction, drama, and historical annals. Through this course students can develop a historical and cultural perspective in order to understand the contexts and value systems that have inspired literary works. Students will investigate such topics as the relation between social institutions and the individual, the traditional patriarchal system, the changing roles of women, westernization, and post modern consumer culture, among others. Students will read literature and related materials from different periods, with examples from other media such as films where appropriate. Class work will include lectures or presentations by the instructor and student participation through means such as guided discussions, group discussions, and students' presentations. This participatory approach is intended to deepen students' appreciation of the texts, to help them understand value systems that may differ from, or else be shared with, those predominant in modern Western cultures, and to assist students in developing analytical and expressive abilities. CHNS 120Z is designed to be suitable for all students generally interested in China and the Chinese-speaking world, or interested in literature and other fields of humanistic study, whether or not they have previously studied Chinese culture. All materials will be available in English. The course is designed to count as General Education, as international cultures, and as a B.A. \"Other Cultures\" course. It is linked with ARTH 220Z. Taught in English.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education - Integrative: Linked", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CHNS 121N: Chinese Film and New Media", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "Survey of Chinese film and new media in the twentieth century and beyond, with attention to changing cultural settings. Taught in English. CHNS 121N Chinese Film and New Media (3) (GH;GA;IL) (BA) This course meets the Bachelor of Arts degree requirements. This is intended to provide an introduction to modern and cutting-edge forms of cultural production in the Chinese-speaking world from the twentieth century to the present day. Prior study of China is not required and materials will be available in English. Students will learn about major technologies and forms of media, including film, TV, and various forms of new media (cell-phone novels, blogs, MMOGs, IM, and Web 2.0 for instance). Readings and screenings will cover several artistic modes including formalism, historiography, documentary, period drama, and experimental works. The course, or individual units within the course, will be structured so that students develop an historical perspective, allowing them to understand the cultural contexts that have inspired the creative works under study. By examining Chinese-language film and new media with attention to changing cultural settings, students will investigate such topics as the relation between social institutions and the individual, the formation and expression of identity, changing gender roles and family structures, the impact of technological and economic trends on social structure, and changing climates of censorship and freedom of expression. In addition, students will learn to think critically about various media's techniques and aesthetics of representation, and will become more engaged, critical spectators of film and related media. Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. This participatory approach is intended to deepen students' appreciation of the works, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytical and expressive abilities. Through critical reading, group discussion and interpretive writing, students will hone skills for evaluating modes of cultural production and consumption in the Chinese-speaking world. The course is designed to be suitable for all students generally interested in China, or interested in various fields of humanistic study, whether or not they have previously studied Chinese culture. It is designed to count as General Education and as a B.A. \"Other Cultures\" course. This course will be taught in the active-learning mode, featuring a variety of instructional components such as lecture, discussion, oral presentations, web-based activities, etc., to provide students abundant opportunity for expressing their opinions. As a general education course, all versions will include writing, speaking, self-expression; information gathering, synthesis, and analysis; and international/intercultural components.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "CHNS 197: Special Topics", "department": "Chinese (CHNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CHNS 199: Foreign Studies", "department": "Chinese (CHNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CHNS 295: Internship", "department": "Chinese (CHNS)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "CHNS 296: Independent Studies", "department": "Chinese (CHNS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CHNS 297: Special Topics", "department": "Chinese (CHNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CHNS 299: Foreign Studies", "department": "Chinese (CHNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CHNS 397: Special Topics", "department": "Chinese (CHNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CHNS 399: Foreign Studies", "department": "Chinese (CHNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "CHNS 401: Level Three Chinese A", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Emphasis on oral proficiency through discussions of aspects of contemporary Chinese culture.  CHNS 401 Advanced Conversation (4) (IL) (BA) This course meets the Bachelor of Arts degree requirements.This course aims to enhance students' abilities in speaking, listening, reading, and writing. The objectives in this course are; 1)to review, reinforce, and expand the basic grammar, 2)to expand knowledge of characters, vocabulary and idioms, 3) to be able to speak not only in single sentences, but in dialogues to perform basic communicative functions,4) to be able to read and understand simple essays and stories, 5) to be able to write short compositions.", "prerequisite": "CHNS 110", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "CHNS 402: Level Three Chinese B", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Readings in representative works of traditional and modern literature; practice in composition; study of aspects of Chinese culture.", "prerequisite": "CHNS 401", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 403M: Level Four Chinese A", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Continuation of CHNS 402.  Aims to improve students' proficiency in all four language skills, with a special emphasis on writing.  CHNS 403W Level Four Chinese A (4) This is a four credit course designed for those who have completed Level Three Chinese B or the equivalent. The course aims to further develop students' proficiency in all four language skills, with a special emphasis on writing. Students will study several topics on current social issues in modern Chinese society, such as education and housing issue, woman's status, through a selected textbook, news reading, and by interviewing native speaker of Chinese from different regions. Via all the debatable topics, students will be guided to explore and practice various writing styles, such as description, narration, argumentation, and expository writing throughout the semester. Comparison of rhetorical strategies between Chinese and English writing will also be introduced to help students think and write more like a native when using the target language. The majority of reading and writing assignments will be done outside of class, with some guidance from the instructor. Class time will be used mainly for discussions of content, feedback on writing. All class activities will be conducted in Chinese. Writing exercises include short response papers on topics, summarizes of the readings, and short essays. Through the writing exercises, students will reflect more deeply on certain topics, synthesize information from course materials, provoke critical thinking and express their opinions and support ideas by referring to and citing from source texts. This will help students be prepared for a longer thesis in the next course in the sequence. This course will help students further advance their writing skills by continuously building their vocabulary, understanding the target culture, and its social issues through various sources of structured and authentic materials. Students will also write a resume and formal letter that help them start building their career in Chinese.", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "CHNS 403W: Level Four Chinese A", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Continuation of CHNS 402.  Aims to improve students' proficiency in all four language skills, with a special emphasis on writing.  CHNS 403W Level Four Chinese A (4) This is a four credit course designed for those who have completed Level Three Chinese B or the equivalent. The course aims to further develop students' proficiency in all four language skills, with a special emphasis on writing. Students will study several topics on current social issues in modern Chinese society, such as education and housing issue, woman's status, through a selected textbook, news reading, and by interviewing native speaker of Chinese from different regions. Via all the debatable topics, students will be guided to explore and practice various writing styles, such as description, narration, argumentation, and expository writing throughout the semester. Comparison of rhetorical strategies between Chinese and English writing will also be introduced to help students think and write more like a native when using the target language. The majority of reading and writing assignments will be done outside of class, with some guidance from the instructor. Class time will be used mainly for discussions of content, feedback on writing. All class activities will be conducted in Chinese. Writing exercises include short response papers on topics, summarizes of the readings, and short essays. Through the writing exercises, students will reflect more deeply on certain topics, synthesize information from course materials, provoke critical thinking and express their opinions and support ideas by referring to and citing from source texts. This will help students be prepared for a longer thesis in the next course in the sequence. This course will help students further advance their writing skills by continuously building their vocabulary, understanding the target culture, and its social issues through various sources of structured and authentic materials. Students will also write a resume and formal letter that help them start building their career in Chinese.", "prerequisite": "CHNS 402", "other": ["Writing Across the Curriculum"]}, {"course_name": "CHNS 404: Level Four Chinese B", "department": "Chinese (CHNS)", "credits": "4 Credits", "description": "Continutation of CHNS 403W.  Aims to improve students' proficiency in all four language skills through content-based language learning.  CHNS 404 Level Four Chinese B (4) This is a four credit course designed for those who have completed Level Four Chinese A or the equivalent. The course aims to further develop students' proficiency in all four language skills. Students will study several topics on current social issues in contemporary Chinese society. For example, economic spurt in China, environmental protection, values conflict between traditional Chinese culture and Western culture, etc. Students will learn those topics via a textbook, interviewing native speakers of Chinese from different regions, and variety of media, such as newspaper, TV news, and movie. The majority of reading and writing assignments will be done outside of class, with some guidance from the instructor. Students will be guided to use appropriate resources such as dictionaries, reference books, online dictionaries and other online resource to facilitate their learning. Class time will be used mainly for discussion of content, feedback on writing, and presentations by students. All class activities will be conducted in Chinese. Students will be mainly evaluated by writing exercises and presentations. Writing exercises include short response papers on topics, summarizes of the readings, short essays and a final thesis. Through the writing exercises, students will reflect more deeply on certain topics, synthesize information from course materials, provoke critical thinking and express their opinions and support ideas by referring to and citing from source texts. Presentations include debates, individual and group presentation, which will help students advance their communication and presentational skills. E-portfolio will sample the work students have done in the course.", "prerequisite": "CHNS 403W"}, {"course_name": "CHNS 410: Chinese Through Film", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "This course is designed for students who finish Level Two Chinese or higher and aims to help them develop Chinese proficiency through movies.  CHNS 410 Chinese Through Film (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course aims to provoke students' critical thinking on China-related issues and improve their Chinese language proficiency by encouraging them to reenact and remake selected scenes from the movies, investigate and discuss the social issues as shown from the movies. This is a three credit course designed to go beyond the day-to-day topics to further develop students' understanding of the social issues in contemporary China and thus enhance their Chinese language proficiency. Through watching movies in Chinese, students will listen to authentic Chinese and expose to broader aspects of Chinese people's lives and Chinese society. In addition, they will have opportunities to conduct culture comparisons between China and the U.S., East and West, which will enable them to make in-depth analysis when examining a complex social, political or economic issue in China. The follow-up class activities include both speaking and writing assignments. Depending on the topics, speaking assignments may include: reenactment or recreation of a selected scene from the movies, class or group discussions, debates and presentations. Writing assignments may include: writing a new story or different ending for the movies, and reflection essays.", "prerequisite": "CHNS 110", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "CHNS 411: Chinese Written Characters", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "This course aims to establish a solid foundation of students' Chinese orthography and prepare students for continuing study in subsequent Chinese courses.  CHNS 411 Chinese Written Characters (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course aims to equip students' knowledge and skills of Chinese orthography through both cognitive and meta-cognitive approach of learning, where it is expected to lay a solid foundation for students' continuing study of subsequent Chinese language courses. Students will learn and apply radical and component-building approach to synthesize their already-acquired characters, and further learn approximately 500 additional characters. Characters selected for study in this course are based upon the references of HSK (Hanyu Shuiping Kaoshi) Level V and TOP-Huayu (Test of Proficiency- Huayu) Intermediate level. Building upon these characters, students will further expand their vocabulary volume through character association strategy and extensive reading. Cooperative learning approach will be largely incorporated to promote in-class active learning, such as developing and sharing character learning strategies through keeping learning journal, group reading, discussing cultural connotations of selected amount of characters, etc. Students will also learn the origin, history and evolution of Chinese characters through textbook reading and multimedia materials learning, such as DVD and You Tube video clips that help visualize the evolution process of selected characters for demonstration. Instructional Objectives (what the student is expected to learn; what skills s/he will develop): 1. Understand the origin, history and evolution of Chinese characters 2. Develop and apply strategies on learning Chinese characters 3. Familiarize with available resources that assist Chinese characters learning and memorizing 4. Strengthen and synthesize students' existing knowledge of Chinese orthography 5. Learn approximately 500 new characters 6. Expand vocabulary volume derived from the acquired characters 7. Expand reading experience by reading semi-authentic and authentic articles that are constituted of the acquired characters 8. Strengthen listening and speaking skills of the target language through intensive in-class discussions and lectures", "prerequisite": "CHNS 110", "other": ["International Cultures (IL)"]}, {"course_name": "CHNS 412: Business Chinese", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "This is a three-credit course designed for those who have completed Level Two Chinese or the equivalent. Business knowledge is presented as a means to facilitate language learning, while the content-based materials enhance cultural awareness. Emphasis will be given to helping students gain the linguistic skills that characterize advanced level second language learners, especially linguistic conventions essential to functioning in business environments. Real cases involving successful multinational Chinese and foreign companies and issues such as marketing, branding, mergers and acquisitions, OEM, and international expansion will be used as texts. The selected textbook is in Chinese with English explanations, but students will be guided through in-class discussions in Chinese. Approximately 80% of the instructional language will be conducted in Chinese. This course is designed to give students exposure to China's vibrant business scene and to enhance both their Chinese skills in the business context and their understanding of the social and cultural aspects of \"doing business\" in China and the impact of Chinese economy in the globalization era. Students will discuss real business cases from multinational companies that have successfully entered the Chinese market and from large Chinese corporations that have been successful in the global market, especially in the United States. By reading, discussing, and performing communicative tasks related to those cases, students will learn how to use Chinese as a \"carrier of culture\", thus acquiring a better understanding of China in economic and cultural terms. In addition to the business case analysis, supplementary reading, writing and listening exercises as well as media materials, such as clips of Chinese talk shows and television interviews, will also be provided. Highlights of these exercises are: listening comprehension of business news reports on current issues; analysis of the Chinese financial market; discussion of Chinese business laws, translation of business terms and documents, and commercial language and word processing. Students are supported and guided through the course as they develop the skills they need to continue learning on their own. Students are encouraged to explore and keep up to date with new developments in China's economy through their own efforts, thus developing an independent learning style and connecting classroom learning to the real world.", "prerequisite": "CHNS 110"}, {"course_name": "CHNS 414: Chinese Language, Culture and Society", "department": "Chinese (CHNS)", "credits": "3 Credits/Maximum of 3", "description": "The study of Chinese language and culture and a perspective on the way of life in contemporary Chinese society. Through this course, the students are introduced to a cognitive approach to the study of Chinese language and culture and a broad perspective on the Chinese way of life in contemporary Chinese society. In particular, we will study how the interaction between Chinese language and culture frames the worldview of Chinese speakers, how the usage of the Chinese language manifests the underlying conceptual structure, which in turn is shaped by the physical (including bodily) and cultural experience of its speakers, and how conventional usage of linguistic expressions of Chinese reflects, and possibly influences, the ways in which Chinese speakers see or conceptualize the world. We will focus on conventionalized expressions, which include compound words, idiomatic phrases, and proverbial sayings, in the Chinese language, and study the Chinese conventional ways of talking about reality, both external and internal, as windows into Chinese culture and cognition. More generally, we will try to understand the embodied nature of human cognition as we see how abstract thought is grounded in bodily experience in and with the physical and cultural world. We will also look at various domains of life in contemporary China in order to gain a better understanding of Chinese society. The objectives of this course are threefold: (1) to lead Chinese language students to a linguistic approach to language analysis so that they learn about how individual linguistic expressions fit into a coherent linguistic system; (2) to enable them to see how linguistic structures reflect underlying cognitive, conceptual structures which are derived from the interplay between human embodiment and cultural environment; and (3) to provide them with a broad perspective on contemporary Chinese society.", "prerequisite": "ASIA 4", "other": ["Cross-listed with: ASIA 414", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 415: China Beyond China", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "Study of modern and contemporary Chinese culture in its diversity and its intercultural contexts. CHNS 415 China Beyond China (3) (IL) In order to begin to understand Chinese culture, we cannot treat it as a monolithic, unified whole. This course will give an introduction to modern and contemporary Chinese culture (focusing on the 20th and 21st centuries) by paying special attention to China's inner diversity, as well as the continuous shaping of Chinese culture in contact, dialogue, and tension with other cultures. Through the study of literary texts, films, and other cultural material - as well as a small number of theoretical essays - this course will focus on: 1) Chinese culture in its variety by focusing on Chinese cultural spheres beyond the People's Republic (Taiwan, Hong Kong), the Chinese diaspora, as well as other ethnicities and cultures within Mainland China; and 2) the ways in which Chinese modernity was impacted by intercultural impulses, as well as the recent self-representation of China in the context of globalization. Course Objectives include: 1. Understand modern and contemporary China in its cultural diversity, as well as shaped by intercultural and global processes. 2. Critically analyze processes of cultural contact and the representations of cultural differences. 3. Think critically about globalization with its impact on such categories as the local and the national. 4. Question your assumptions about the world, re-examine your own points of view, and understand cultures and value systems that may different from (or be shared with) your own.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 416: Gender and Sexuality in China", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "Study of gender roles and the imaginary of sexuality in the literary, filmic, and artistic production of modern China. CHNS 416 Gender and Sexuality in China (3) (IL) This course explores gender roles and the imaginary of sexuality in the literary, filmic, and artistic production of modern China (from the end of the 19th century up to today), paying attention also to developments in Chinese cultural spheres beyond the People's Republic, such as Taiwan, Hong Kong, and the Chinese diaspora. This course will use the representation of gender, sex, and sexuality as a lens through which modern and contemporary Chinese culture can be understood in its historical, social, and aesthetic changes. The analysis of representations of gender and sexuality throughout the class will focus on literary and filmic texts, as well as art, rather than on theoretical work on gender and sexuality (in China or in general). Course Objectives include:1. Critically assess the complex construction of gender roles and sexuality in modern and contemporary Chinese literature and film2. Reflect critically on different ways of understanding and representing gender difference.3. Critically assess the connections between gender and sexuality and changing political, historical, and cultural contexts.4. Question your assumptions about gender and sexualities in the context of cultural difference, understand cultures and value systems that may be different from (or be shared with) your own.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 417: The Warrior, the Courtesan and the Ghost in Classical Chinese Novels", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "This course provides an introduction to major classical Chinese novels by focusing on three character types: the warrior, the courtesan, and the ghost. CHNS 423 417 The Warrior, the Courtesan and the Ghost in Classical Chinese Novels (3) (IL) A narrowly defined notion of modern literature is a relatively recent phenomenon that dates back only to the early twentieth century in the Chinese context. There is, however, a long tradition of the vernacular novel that remains influential till today, in spite of its marginalization by the Western-influenced Chinese Enlightenment project. This course provides an introduction to major classical Chinese novels by focusing on three character types: the warrior, the courtesan, and the ghost. The warrior is commonly found in historical romances, tales about errant knights and assassins, and martial arts fiction. Although the typical setting for the courtesan is in novels about prostitution (Xia Xie Xiaoshuo), this course will relate this figure to other female types in various domestic space, thereby tracing the genealogical connections between the domestic fiction and the courtesan fiction. The ghost can be found in Accounts of the Strange (Zhi Guai) and Tales of the Miraculous (Chuan Qi). This course will relate this figure in these narrative genres with other types of the supernatural being, such as Gods and Demons. Most readings will be drawn from the Mind-Qing period (14th -20th c) but modern and contemporary literature as well as visual or media culture that consciously continue or rewrite these narrative traditions will be considered as well. All readings and class discussions will be in English. Knowledge of Chinese or Chinese literature is not assumed or required. From year to year the content we cover might change, but this course will always explore:1) Major classical Chinese narrative traditions that are radically different from the Western-influenced narrative modes of the twentieth century.2) Pre-modern practices of literary reading and criticism and pre-modern notions of literacy, literature, and modes of circulation. Course Objectives include:1. Critically analyze major texts and genres of the classical Chinese novel.2. Understand pre-modern practices of story-telling, literary circulation, reading, and criticism.3. Think critically about pre-modern societies and their connections with the contemporary world.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 418: Confucius and the Great Books of China", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "This course familiarizes students with the critical texts and intellectual cultures of Warring States and early imperial China. CHNS 418 / ASIA 418 / HIST 482 Confucius and the Great Books of China (3) This course exposes students to the key texts, thinkers, and ideas that form the foundation of the Chinese classics and classical period, providing an integral foundation for the study of Chinese history, culture, or literature. While the emphasis is on the texts and their main themes, the course will encourage historical engagement with the texts by placing them into a context of competing cultural, social, political trends. Readings may be grouped around categories of teachings such as Confucianism, Buddhism, and Daoism, or around thinkers such as \"(Confucian) ritualists,\" \"statesmen,\" \"military strategists,\" \"rebels,\" \"recluses,\" and \"spiritual leaders.\" Students will learn how each of these types of teachings and thinkers related to each other, as well as how they responded to the emergent, centralized political order of the day. This will help students better understand many of the recurrent intellectual, political, and religious themes that arise in later Chinese history as well.", "prerequisite": "ASIA 3", "other": ["Cross-listed with: ASIA 418, HIST 482", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 419: The Chinese Rhetorical Tradition", "department": "Chinese (CHNS)", "credits": "3 Credits/Maximum of 6", "description": "Study of the rhetorical works in ancient China as well as multiple facets of modern Chinese rhetoric. CHNS 419 The Chinese Rhetorical Tradition (3 per semester/maximum of 6) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course surveys the Chinese rhetorical tradition dating back two and a half millennia. Rhetoric is defined here as the study and practice of artful means of communication, including poetic, expository, and argumentative modes. The class will first delve into the works of competing intellectual schools in pre-imperial China (pre-221 BCE), which set a corner stone for thoughts and practice of communication in the imperial period (221 BCE - 1918). These schools, including the Daoist, the Confucian, and the Legalist, developed their rhetorical notions through engaging with the political, intellectual, and ethnic Other. From here the class will examine the multiple facets of modern Chinese rhetoric, which has undergone a continual contact and conflation with other rhetorical traditions in the global contact zone. The class will focus on topics such as feminist discourse, Chinese-American rhetoric, and the teaching of writing, which bear direct implications on our contemporary social life.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: ASIA 419", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 452: Contemporary China: Culture and Trends", "department": "Chinese (CHNS)", "credits": "3 Credits/Maximum of 6", "description": "Survey of aspects of the contemporary Chinese-speaking world.  Includes readings from Chinese newspapers, magazines, and fiction.  Topics may vary each semester.  CHNS 452 Contemporary China: Culture and Trends (3) (IL) BA - This course meets the Bachelor of Arts degree requirements. This course surveys Chinese cultural production in the contemporary period , with an emphasis on literature. Taught in Chinese; readings and assignments in Chinese. The course will examine the diverse forms of cultural expression (literature, film, new media, theater, television) throughout the Chinese-speaking world. Students will learn about major cultural trends in such locations as mainland China, Taiwan, Hong Kong, and the worldwide Chinese diaspora. Readings will represent several genres, such as poetry, folktale, short story, novel, prose fiction, and drama. Through this course students can develop a historical and cultural perspective in order to understand the contexts and value systems that have inspired literary works in the contemporary period. Students will investigate such topics as the relation between social institutions and the individual, the traditional patriarchal system, the changing roles of women, westernization, and postmodern consumer culture, among others. Class work will includes lectures or presentations by the instructor and student participation through means such as guided discussions, group discussions, and students' presentations. This participatory approach is intended to deepen students' appreciation of the texts, to help them understand value systems that may differ from, or else be shared with, those predominant in modern Western cultures, and to assist students in developing analytical and expressive abilities. Chinese 452 is designed to be suitable for students (Chinese majors) who have completed Chinese 401. The course is designed to count as international cultures, and as a B.A. 'Other Cultures' course. This course will be taught in the active-learning mode, featuring a variety of instructional components such as lecture, discussion, oral presentations, web-based activities, etc., to provide students abundant opportunity for expressing their opinions. The course will include writing, speaking, self-expression; information gathering, synthesis, and analysis; and international/intercultural components.", "prerequisite": "CHNS 401", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 453: Chinese Film", "department": "Chinese (CHNS)", "credits": "3 Credits/Maximum of 6", "description": "Selected films and directors representing various aspects of Chinese culture and cinema.  Topics may vary each semester.  Taught in Chinese.  CHNS 453 Chinese Film (3) (IL) BA - This course meets the Bachelor of Arts degree requirements.This course surveys Chinese film from the early twentieth century to the present time, with an emphasis on film and national history. Taught in Chinese; readings and assignments in Chinese. The course will examine the diverse forms of film language in the works of filmmakers from mainland China, Taiwan, and Hong Kong. Readings will include interviews, reviews, film criticism, and other relevant texts (such as a short story that inspired a film). Through this course students can develop a historical and cultural perspective in order to understand the contexts and value systems that have inspired Chinese-language films. Students will investigate such topics as the relation between social institutions and the individual, the traditional patriarchal system, the changing roles of women, westernization, and postmodern consumer culture, among others. Class work will includes lectures or presentations by the instructor and student participation through means such as guided discussions, group discussions, and students' presentations. This participatory approach is intended to deepen students' appreciation of the texts, to help them understand value systems that may differ from, or else be shared with, those predominant in modern Western cultures, and to assist students in developing analytical and expressive abilities. Chinese 453 is designed to be suitable for students (Chinese majors) who have completed Chinese 401. This course will be taught in the active-learning mode, featuring a variety of instructional components such as lecture, discussion, oral presentations, web-based activities, etc., to provide students abundant opportunity for expressing their opinions. The course will include writing, speaking, self-expression; information gathering, synthesis, and analysis; and international/intercultural components.", "prerequisite": "CHNS 401", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 454: Introduction to Classical Chinese", "department": "Chinese (CHNS)", "credits": "3 Credits/Maximum of 6", "description": "Basic patterns and structures of Classical Chinese to the first millennium B.C. to the 19th century.  CHNS 454 Introduction to Classical Chinese (3) (IL) BA - This course meets the Bachelor of Arts degree requirements.This course introduces students to the basic patterns and structures of Classical Chinese. Classical Chinese is a language shaped in the latter half of the first millennium B.C. that still persists as a living medium of expression today. Knowledge of Classical Chinese is important to help students read and understand sophisticated modern Chinese texts, which make frequent use of Classical allusions and constructs. In this course, students will learn basic grammar, syntax, and commonly-used vocabulary. The cultural and literary implications of classical Chinese will be discussed throughout the course in order to provide the students not only with the linguistic knowledge of classical Chinese, but the rich historical backgrounds implied in this particular style of Chinese. The main goal of the course is for students to acquire skills in reading Classical Chinese and expand their knowledge and understanding of ancient Chinese culture, society and history in relation to modern and contemporary Chinese culture, such as Confucianism and family values. With this knowledge and training, not only will students be more comfortable reading the Chinese Classics, they will also thereby increase their proficiency in modern Chinese and their knowledge of Chinese culture. This course will fulfill the Intercultural Cultures and B.A. 'Other Cultures' and foreign language requirements.", "prerequisite": "CHNS 401", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 455: Masterpieces of Traditional Chinese Literature", "department": "Chinese (CHNS)", "credits": "3 Credits", "description": "Survey of traditional Chinese literature, including poetry, historical narratives, philosophical texts, and drama and novel.  CHNS 455 Masterpieces of Traditional Chinese Literature (3) (IL) BA - This course meets the Bachelor of Arts degree requirements.CHNS 455 Masterpieces of Traditional Chinese Literature presents an overview of China's literary tradition, focusing, in particular, on literary techniques used in a variety of text types such as poetry, essays, fiction and drama. This course aims to develop students' advanced knowledge of the features of traditional Chinese literature and its intellectual, cultural, and social background. Through close reading of selected major works, students will become familiar with the features of various genres. For example, students will study prose writings, the major poetic forms and some of the important poets from the Tang period, and aspects of literati culture through close reading of texts from the late imperial period. At the end of this course, a student will have read and discussed sample writings from philosophical and poetic traditions and well as sample writings on the cultural and scholastic activities of the literati. Students should also be able to deal with classical texts on a reasonable level, to identify problematic passages and to be able to clarify them with the help of secondary reference material. Students should also be able to appreciate some of the civilizing aspects of Chinese culture as well as literary and poetic devices such a tonal patterns, rhyme schemes, structure and writing techniques, and discussion of the poets and their work, and have an understanding of the main genres in classical Chinese literature and philosophy.", "prerequisite": "CHNS 401", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "CHNS 494: Research Project", "department": "Chinese (CHNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "CHNS 494H: Research Project", "department": "Chinese (CHNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "CHNS 496: Independent Studies", "department": "Chinese (CHNS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "CHNS 497: Special Topics", "department": "Chinese (CHNS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "CHNS 499: Foreign Studies", "department": "Chinese (CHNS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]