[{"course_name": "DA 101: Introduction to Data Analytics", "department": "Data Analytics (DA)", "credits": "3 Credits", "description": "This course is designed around storytelling with data. It is designed to introduce students to foundational concepts in data analytics. Students will learn key concepts used in the data analytics industry to understand and frame projects. The core dimensions of analytics prescribed by current data analytics professional guidelines will be introduced and demonstrated through case studies.  Students will be exposed to spreadsheets, scripting languages for analytics, and current statistical software packages. The importance of communicating findings to different constituents will be emphasized throughout this class.", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "DA 201W: Descriptive Analytics", "department": "Data Analytics (DA)", "credits": "4 Credits", "description": "DA 201W is a four-credit course with lecture and writing components. (DA201W, DA 302W, and DA 401W each carry only one credit of \"writing\"; completion of all three courses is required to meet the writing requirement.) This course introduces students to the core areas of descriptive analytics, where the main objective is to answer \"what happened\" in the project. Students will learn how to accurately describe the attributes of data variables available to them for their projects. Students will have the opportunity to work on real-life projects and cases throughout the course. The course will expose students to spreadsheets, scripting languages for analytics, and current statistical software packages. The instructor will emphasize the importance of communicating findings to different constituents throughout this class.", "prerequisite": "PSYCH 200", "other": ["Writing Across the Curriculum"]}, {"course_name": "DA 301: Diagnostic Analytics", "department": "Data Analytics (DA)", "credits": "3 Credits", "description": "This course introduces students to the core areas of diagnostic analytics. The diagnostic analysis takes descriptive data a step further by examining the relationships between variables through root cause analysis. Students will learn current tools and techniques, including external environmental factors, that allow analysts to explain why the patterns are observed in data and discover relationships between two or more attributes of the data. Students will have the opportunity to review case studies and work on real-world projects throughout the course.", "prerequisite": "DA 201W"}, {"course_name": "DA 302W: Predictive Analytics", "department": "Data Analytics (DA)", "credits": "4 Credits", "description": "DA 302W is a four-credit course with lecture and writing components. (DA201W, DA 302W, and DA 401W each carry only one credit of \"writing\"; completion of all three courses is required to meet the writing requirement.) The principal objective of this course is to help students predict ¿what will happen¿ in future events based on historical data. This course exposes students to predictive analytics techniques that are consistent with best practices in the data analytics industry. Students will learn how to properly examine problem contexts to use the most appropriate method to develop the best predictive model. Students will also learn how to evaluate their results and interpret findings to users at different levels of an organization. This course focuses on the application of spreadsheets, scripting languages for data analytics, and current statistical software packages.", "prerequisite": "DA 301", "other": ["Writing Across the Curriculum"]}, {"course_name": "DA 305: Data Ethics and Privacy", "department": "Data Analytics (DA)", "credits": "3 Credits", "description": "DA 305 will cultivate students¿ awareness of ethical, privacy, and security rules and standards to guide how to use and analyze data and communicate the report findings. The course will demonstrate appropriate ethical, privacy, and security standards. This course will utilize case studies to demonstrate the realworld implications of these topics in data analytics and identify the appropriate communication styles. The course will emphasize ethics at various stages of data analytics. This includes the communication of the implications of the data analysis to stakeholders, including how data are collected and stored as well as how it is analyzed and presented to different stakeholders. Students will be able to define who has access to which data, where and how long the data will be stored, and which procedures will be implemented for further use.", "prerequisite": "DA 101"}, {"course_name": "DA 401W: Prescriptive Analytics", "department": "Data Analytics (DA)", "credits": "4 Credits", "description": "DA 401W is a four-credit course with lecture and writing components. (DA201W, DA 302W, and DA 401W each carry only 1 credit of \"writing\"; all three courses must be taken to meet the writing requirement). This course will introduce students to how data analytics assists in making decisions and advocating for a course of action. The core objective of this course is to help students develop a set of viable decision options (based on considerations including costs and benefits, key stakeholder preferences, ethical guidelines, etc.), ranking those decision options to create alternative courses of action, and how to achieve an optimal decision. Topics covered will include optimization, sensitivity analysis, decision making, linear programming, and simulation.", "other": ["Writing Across the Curriculum"]}, {"course_name": "DA 402: Qualitative Analytics", "department": "Data Analytics (DA)", "credits": "3 Credits", "description": "The majority of non-numeric data is unstructured (e.g., blogs, emails, forums). DA 402 is an overview of data analytics techniques for non-numeric data (e.g., text, videos or images). The methodological reasons for a qualitative rather than a quantitative approach, and the underlying challenges with this type of data depend on the hypothesis or research question. Often, research questions and organizational problems can best be answered by qualitative, non-numeric data. Students in data analytics will be exposed to situations and conditions where these practical analyses would be applicable rather than students in data sciences who create or improve the algorithm for analysis. This course will enable students to pursue further study in these types of practical applications. Students need a strong background in statistics before scheduling this course.", "prerequisite": "DA 201W"}, {"course_name": "DA 475: Data Analytics Implementation Capstone I", "department": "Data Analytics (DA)", "credits": "3 Credits", "description": "DA 475 is the first semester of a two-semester sequence and completion of the BS in Data Analytics. The course requirements enable the student to demonstrate the student's ability to use industry or organization data to develop a descriptive, diagnostic, predictive, and prescriptive analysis. This portion of the capstone addresses the understanding of the industry data, project scope, data journalism, and descriptive analysis."}, {"course_name": "DA 476: Data Analytics Implementation Capstone II", "department": "Data Analytics (DA)", "credits": "3 Credits", "description": "DA 476 is the second semester of a two-semester sequence and completion of the BS in Data Analytics. The course requirements will include a continuation of industry project (assigned in DA 475) and the remaining three-part analysis of organization-specific analysis (diagnostic, predictive, and prescriptive).", "prerequisite": "DA 475"}]