[{"course_name": "EDMTH 301: Mathematics in Elementary Education I", "department": "Education Mathematics - CA (EDMTH)", "credits": "3 Credits", "description": "Survey of content, pedagogy, and psychology of mathematics instruction relating to numbers, operations, geometry, measurement, and algebraic thinking for pre-school through fourth grade. EDMTH 301 Mathematics in Elementary Education I (3). The course will provide students with the opportunity to explore and develop research-based practices needed to teach elementary mathematics in alignment with national and state content standards. This course will focus on the big ideas and learning trajectories associated with the mathematical content strands of numbers and operations, geometry, measurement, and algebraic reasoning across grades PK - 4. Course content will also focus on curriculum materials and considerations, planning effective lessons, pedagogical practices, and assessment of students' knowledge related to these mathematical content areas. The course will also emphasize the use of manipulatives and technology to represent the essential understandings needed to help students make sense of mathematical operations and make mathematical connections. Throughout the course, students will engage in mathematical tasks and mathematical discussions, and observe videos of elementary mathematics classes to explore the focus, coherence, and rigor needed across PK-4 grade levels relative to the content strands of numbers and operations, geometry, measurement, and algebraic reasoning. They will also learn about various formative and summative assessment strategies to identify students' misconceptions and learn various intervention strategies to clarify students' mathematical understandings. The course will also emphasize instructional approaches designed to help all students develop the mathematical behaviors associated with the Common Core Mathematical Practices across grade levels."}, {"course_name": "EDMTH 302: Mathematics in Elementary Education II", "department": "Education Mathematics - CA (EDMTH)", "credits": "3 Credits", "description": "Survey of content, pedagogy, and psychology of mathematics instruction relating to rational numbers, algebraic thinking and functions, geometry, measurement, data analysis, and probability for fourth through eighth grades. The course will provide candidates with the opportunity to explore and develop research-based practices needed to teach elementary mathematics in alignment with national and state content standards. This course will focus on the big ideas and learning trajectories associated with the mathematical content strands of rational numbers, algebraic thinking and functions, geometry, measurement, data analysis, and probability across grades fourth through eight. Course content will also focus on curriculum materials and considerations, planning effective lessons, pedagogical practices, and assessment of students' knowledge related to these mathematical content areas. The course will also emphasize the use of manipulatives and technology to represent the essential understandings needed to help students make sense of mathematical operations and make mathematical connections. Throughout the course, teacher candidates will engage in mathematical tasks and mathematical discussions, and observe videos of elementary mathematics classes to explore the focus, coherence, and rigor needed across 4- 8 grade levels relative to the above content strands. They will also learn about various formative and summative assessments strategies to identify students' lack of knowledge or misconceptions and learn various intervention strategies to clarify students' understanding. The course will also emphasize instructional approaches designed to help students develop the mathematical behaviors associated with the Common Core Mathematical Practices across grade levels."}, {"course_name": "EDMTH 441: Geometry and Measurement Across the K-12 Curriculum", "department": "Education Mathematics - CA (EDMTH)", "credits": "3 Credits", "description": "The course presents participants with investigations of reports, research, and recent trends related to teaching geometry and measurement.  EDMTH 441 Geometry and Measurement Across the K-12 Curriculum (3)This course addresses the areas of Geometry and Measurement as defined by the National Council of Teachers of Mathematics (NCTM) standards and the Pennsylvania academic standards. Designed for graduate students who teach mathematics in K-12 grades or are leaders in mathematics education, the course focuses on discussions and teaching practices related to the fundamental concepts of geometric and measurement. Also, participants will become familiar with current research, reports and recent trends related to the teaching of a geometry or measurement topic.", "prerequisite": "permission of program"}, {"course_name": "EDMTH 442: Algebra and Functions Across the K-12 Curriculum", "department": "Education Mathematics - CA (EDMTH)", "credits": "3 Credits", "description": "The course presents participants with investigations of reports, research, and recent trends related to teaching algebra and function concepts.  EDMTH 442 Algebra and Functions Across the K-12 Curriculum (3)This course addresses the areas of Algebra and Functions as defined by the National Council of Teachers of Mathematics (NCTM) standards and the Pennsylvania academic standards. Designed for graduate students who teach mathematics in K-12 grades or are leaders in mathematics education, the course focuses on current research and recent trends related to teaching algebra. The course will also focus on teaching algebraic concepts and algebraic reasoning from patterns, mathematical modeling, and variables of change using manipulatives, graphical representations, and technology.", "prerequisite": "permission of program"}, {"course_name": "EDMTH 443: Data Analysis and Probability Across the K-12 Curriculum", "department": "Education Mathematics - CA (EDMTH)", "credits": "3 Credits", "description": "The course presents participants with investigations of reports, research, and recent trends to teaching data analysis and probability concepts.  EDMTH 443 Data Analysis and Probability Across the K-12 Curriculum (3)This course covers the concepts of Data Analysis and Probability as defined by the National Council of Teachers of Mathematics (NCTM) standards and the Pennsylvania Academic Standards. Designed for K-12 teachers of mathematics or mathematics leaders, the course focuses on discussions related to the teaching of data analysis and probability through problem sets, written assignments, classroom-based projects and research. Topics will also include incorporating activities to address teaching probability and statistics to diverse populations. Also, participants will become familiar with current research and recent trends related to the teaching of a topic on data analysis and probability. Attention will be given to practices utilizing manipulatives, writing, problem solving, technology, and simulations.", "prerequisite": "permission of program"}, {"course_name": "EDMTH 444: Numbers and Operations Across the Curriculum", "department": "Education Mathematics - CA (EDMTH)", "credits": "3 Credits", "description": "The course focuses on investigating reports, research, and recent trends related to teaching number and operation concepts K-12. A student who has passed MATH 200 may not take EDMTH 444 for credit."}, {"course_name": "EDMTH 455: Current Issues in Mathematics Education", "department": "Education Mathematics - CA (EDMTH)", "credits": "3 Credits", "description": "An examination and analysis of contemporary trends and concerns in the teaching of mathematics.", "prerequisite": "EDUC 417"}]