[{"course_name": "EDSGN 11: Explorations in Design First-Year Seminar", "department": "Engineering Design (EDSGN)", "credits": "1 Credits", "description": "Students explore topical issues in engineering design.", "other": ["First-Year Seminar"]}, {"course_name": "EDSGN 12: Solar Racers First-Year Seminar", "department": "Engineering Design (EDSGN)", "credits": "1 Credits", "description": "Students explore solar energy engineering by designing, building, testing, and racing a model car powered by a photoboltaic panel.  EDSGN 012S Solar Racers First-Year Seminar (1) This engineering First-Year Seminar, Solar Racers, is intended as a topical introduction to the field of solar engineering with a focus on solar electricity. Through hands-on activities, readings, and research, students explore the application of solar energy to power a model car (and by extension, solar electricity generation in general). Working in small teams, students design, build, and test a model solar-powered car. This seminar emphasizes active learning via project-oriented teamwork. Solar principles to be demonstrated include solar angles, solar resource, and conservation of energy. Students also use spreadsheets and computer models to perform parametric studies as an aid in the design process.Classes typically begin with a review and overview of the topics for that day. Class time is spend discussing new material, recent assignments, and working in the lab. Students also serve as mentors and advisors for local middle school students who will also be building and racing similar model solar cars.", "other": ["First-Year Seminar"]}, {"course_name": "EDSGN 13: Ethics of Star Trek First-Year Seminar", "department": "Engineering Design (EDSGN)", "credits": "1 Credits", "description": "The Star Trek television series is used as an introduction to ethics, with application to student life and engineering practice.  EDSGN 013S Ethics of Star Trek First-Year Seminar (1) In this first-year seminar,The Ethics of Star Trek , students explore ethical issues that arise in various episodes ofStar Trek,fromThe Original Serieswith Captain James T. Kirk and company, throughThe Next Generation,with Captain Jean Luc Picard. Students learn how to methodically approach tough ethical decisions in their lives, especially those in professional life. This course helps them to identify, understand, and examine their moral values, and especially to plan actions that are consistent with these values. The class explores the current thinking on the responsibilities of engineers to society, community, family, and themselves. This is a discussion and application oriented course with emphasis placed on applying key concepts to realistic problems and on developing skills such as team work, argumentation, and communication skills.Underpinning the viewing of Star Trek episodes, the course starts with a foundation on moral and ethical theory. After discussing the ethical issues faced by the Star Trek crews, the class investigates similar situations faced by students and by engineers. Teams analyze and solve progressively more complex ethical cases in engineering and in general. The goal of the course is for students to develop their moral imagination and to understand how to make the best choices in difficult circumstances.", "other": ["First-Year Seminar"]}, {"course_name": "EDSGN 15: Transformations by Design: First-Year Seminar", "department": "Engineering Design (EDSGN)", "credits": "1 Credits", "description": "Examination of the social and environmental transformations that follow engineering design, and of the transformations of students by higher education.  EDSGN 015S Transformations by Design: First-Year Seminar (1) Engineering design is a diverse field of study with many emerging topics and applications. The goal of this first-year seminar course is to introduce first-year students to engineering design. In turn, design is set within the essential dynamic context of technology: the transformation of the environment and society. Hence, doing design well means creating a better world and a sustainable environment. Students examine the global networks of product life cycles from extraction to disposal that is triggered by engineering design and how it affects people's lives and the environment.Since much engineering design is integrated design that brings together the disciplines and people necessary to achieve a design solution to a given problem, this FYS provides students with a vivid glimpse of engineering careers. This is developed further by student presentations that focus on their life goals and how their expected career in a given field of engineering will help them to achieve their goals.This course will combine lectures, discussions, teamwork, projects, and hands-on activities, with an emphasis on active learning and an examination of the transformations of technology from transducers to product life cycles.In addition to introducing first-year students to design topics and careers in engineering, this seminar course will help incoming students develop success skills and become acclimated to University life. But higher education is also presented to the students as a transformative process that reshapes their social relationships and determines much of their future.The course will be offered once a year in the fall semester.", "other": ["First-Year Seminar"]}, {"course_name": "EDSGN 97: Special Topic", "department": "Engineering Design (EDSGN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript."}, {"course_name": "EDSGN 100: Cornerstone Engineering Design", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "EDSGN 100 Cornerstone Engineering Design provides students with a foundation for engineering design through hands-on team projects that address specified design opportunities. Through this course, students will recognize the role that engineering and design have in improving the health, safety, and welfare of the global community, as well as identifying when a solution is technically feasible, economically viable, and desirable. Students will use a range of design tools and techniques to carry out and communicate their design processes as applied to their projects. Additionally, students will develop and practice professional skills, such as communication, teamwork, and ethical decision making. Course delivery will be via faculty-led lessons, hands-on activities, and discussions."}, {"course_name": "EDSGN 100H: Introduction to Engineering Design", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "Introduction to engineering design processes, methods, and decision making using team design projects; design communication methods including graphical, verbal, and written.", "other": ["Honors"]}, {"course_name": "EDSGN 100S: Introduction to Engineering Design", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "Introduction to engineering design processes, methods, and decision making using team design projects; design communication methods including graphical, verbal, and written.", "other": ["First-Year Seminar"]}, {"course_name": "EDSGN 110: Spatial Analysis in Engineering Design", "department": "Engineering Design (EDSGN)", "credits": "2 Credits", "description": "Spatial analysis techniques using advanced computer-aided drafting and design systems, with an emphasis on engineering concepts, analysis and design.  ESDSGN 110 Spatial Analysis in Engineering Design (2) EDSGN 110 is a continuation of EDSGN 100, moving toward an introduction to computer-aided engineering. Emphasis is on the design of mechanical systems using two-dimensional (2D) drawings and three-dimensional (3D) solid modeling techniques commonly used in the mechanical design and structural systems.This course covers spatial relationships using the advanced functionality of computer-aided drafting and design systems. Students will be able to: (1) create and interpret advanced 2D engineering models and drawings; (2) create and manipulate 3D solid models; and (3) use these techniques in practical engineering design problems.Students will become proficient in the use of computers for the simulation of mechanical systems, design documentation, network storage and retrieval, and presentation technologies. The student will create and interpret advanced 2D engineering drawings which may include auxiliary views and working drawings. Using the engineering design process and solid modeling software, the student will create and manipulate 3D solid models and assemblies to aid in the design and documentation of simple mechanical systems.", "prerequisite": "EDSGN 100"}, {"course_name": "EDSGN 130: Architectural Graphics and CAD", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "Principles of architectural drawing; spatial relations with architectural applications; introduction to computer graphics (CAD) with project."}, {"course_name": "EDSGN 196: Independent Studies", "department": "Engineering Design (EDSGN)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses. A specific title may be used in each instance and will be entered on the student's transcript."}, {"course_name": "EDSGN 197: Special Topics", "department": "Engineering Design (EDSGN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript."}, {"course_name": "EDSGN 199: Foreign Studies", "department": "Engineering Design (EDSGN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDSGN 210: Tolerancing and Spatial Models", "department": "Engineering Design (EDSGN)", "credits": "2 Credits", "description": "Tolerances; form and size; unilateral, bilateral, and symmetric; form control, critical fits, tolerances specifications precedence; applications in spatial models.  EDSGN 210 Tolerancing and Spatial Models (2) Professional parametric solid modeling software will be applied to produce complete, industry-typical and standard working drawings, including part detail drawings and various types of assembly drawings; to implement the appropriate tolerance design of interfacing components and to explore advanced productivity-enhancing add-in modules. Students will be introduced to the variety and relative precedence of specifications for feature tolerances, and to the basic differences between form and size tolerance. Topics covered include: unilateral, bilateral and symmetric size tolerances, form control and tolerances, calculations for critical fits, specification precedence for tolerances, e.g., stock size vs. size directly specified in the drawing field vs. title block tolerances vs. drawing notes, etc.Laboratory assignments will include: part drawing with standard three orthographic views, complete dimensions, and a section view; part drawing with complete dimensions and a broken view; part drawing with complete dimensions and a primary auxiliary view; part drawing with complete dimensions and a secondary auxiliary view; part drawing with complete dimensions and removed detail view(s); detail drawing with correct limit tolerances on features which are critical for fit and function, assembly file with separate sub-assemblies, assembly drawing (with part identification balloons and a bill-of-material) which uses sectional views to expose fine internal detail and part interrelationships, assembly drawing (with part identification balloons and a bill-of-material) which is based upon an exploded view, assembly drawing of a tooling fixture (with part identification balloons and a bill-of-material) which shows the subject work piece transparently with phantom lines, Configured part file with tabulated drawing, welding of an assembly using advanced software capabilities and production of a welding drawing with correct symbols, production of an injection mold cavity from the subject part file, exploration of the functionality of sheet metal modules, applications of top down design and layout sketches, application of motion-simulating modules and functionality. The differences between coordinate tolerancing and geometric tolerancing are included in the course.The American Society of Mechanical Engineers Y14.5M will be referenced. The following topics will be covered: Eight key GD&T terms, GD&T modifiers and symbols, Rule #1 and #2, concepts of GD&T, introduction to the flatness control, straightness control, circularity control, perpendicularity control, angularity control, parallelism control, concentricity control, symmetry control, the datum system (planar datum, introduction to datum targets, FOS datum specifications (RFS), FOS datum specifications (MMC).", "prerequisite": "EDSGN 110"}, {"course_name": "EDSGN 270: Summers by Design: An International Engineering Design Experience", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "The School of Engineering Design, Technology, and Professional Programs (SEDTAPP) offers this Penn State faculty-led study abroad program. Students will practice design with international collaborators in international environments and conduct design for global markets. In addition, students will learn to function in cross-cultural engineering design teams, partnering with students from both the U.S. and other global institutions. Specific locations of study are varied, and have included San Sebastian, Spain, and Nantes, France. This study abroad program takes place at a partnering university over a two-week period at the end of May. While enrolled in the course, participants will also experience many cultural activities relevant to the part of the world in which they find themselves, including partaking in local cuisine, visiting historical landmarks, and interacting with local engineering companies. This is an ideal program for Penn State engineering students as it allows students the opportunity to participate in a study abroad program while still having time to return home to complete a summer engineering internship. The objectives of the course include identifying global engineering design problems, developing effective engineering solutions within a cultural context, evaluating engineering designs with global parameters, working with a team consisting of designers from different global backgrounds, and effectively communicating engineering designs to a cross-cultural audience. Students will be evaluated through completion of pre-departure activities, participating in a design project while abroad, and completing a final project report upon their return. The course will be offered once a year through SEDTAPP and Penn State Global Programs.", "prerequisite": "EDSGN 100", "other": ["International Cultures (IL)"]}, {"course_name": "EDSGN 294: Research Project", "department": "Engineering Design (EDSGN)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "EDSGN 296: Independent Studies", "department": "Engineering Design (EDSGN)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "EDSGN 297: Special Topics", "department": "Engineering Design (EDSGN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EDSGN 299: Foreign Studies", "department": "Engineering Design (EDSGN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDSGN 367: Design Thinking and Making", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "Creating innovative products and services that matter for society and users, i.e. designing for impactful results, involves a complex process of thinking and making-both thinking and making strengthen each other-that uses a plethora of design methods, some of which are elaborated in conversation with the context in which they operate. Successful design practitioners channel their ability to read cultural contexts, empathize with users, and design and communicate compelling solutions to complex problems. They seek to offer solutions that are human-centered; foster deep and positive cultural change; and strive to achieve sustainable goals that consider society, culture, the economy, and the environment. Students enrolled in this class will be tasked with finding, in a team, a solution to a complex problem. They will develop a thorough understanding of the design process through collaboratively thinking (user-researching, framing, analyzing, formulating) and making (preparing fieldwork, prototyping, role-playing, user-testing). Students who take the course will be prepared to conduct qualitative research, design creatively for a variety of contexts and users, and demonstrate the pertinence of their solution to a wide audience.", "prerequisite": "3rd Semester standing"}, {"course_name": "EDSGN 395: Internship", "department": "Engineering Design (EDSGN)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique or activity required."}, {"course_name": "EDSGN 397: Special Topics", "department": "Engineering Design (EDSGN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EDSGN 399: Foreign Studies", "department": "Engineering Design (EDSGN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDSGN 401: Engineering Systems Design", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "Design requirements for complex systems; trade-offs between market opportunities and technology; translation of priorities and needs into an operational concept.  EDSGN 401 Engineering Systems Design (3) This course provides the knowledge and skills necessary to translate needs and priorities into system requirements, and develop derived requirements, which together form the starting point for engineering of complex systems. Students will develop an understanding of the larger context in which requirements for a system are developed, and learn about trade-offs between developing mission needs or market opportunities first versus assessing available technology first. Techniques for translating needs and priorities into an operational concept and then into specific functional and performance requirements will be presented. Students will assess and improve the usefulness of requirements, including such aspects as correctness, completeness, consistency, measurability, testability, and clarity of documentation. The course explores the role of techniques such as decision analysis, cost-benefit analysis, and risk assessment. Students will understand the limitations of the way that current systems engineering is practiced in terms of dealing with complexity, lifecycle uncertainty and other factors.", "prerequisite": "EDSGN 100"}, {"course_name": "EDSGN 402: Materials and Manufacturing", "department": "Engineering Design (EDSGN)", "credits": "4 Credits", "description": "Students will study principles and properties of engineering materials and manufacturing processes with a focus on their appropriate selection in design. Based on these principles and properties, as well as hands-on laboratory experiences, students will develop systematic methods for matching material and process choices to the mechanical, thermal, electro-magnetic, and environmental constraints set by the technical requirements of a design problem or project. Knowledge of current manufacturing processes is required to align appropriate processes and materials with the requirements of designed products. Students will develop basic, practical knowledge and skills in operating manual and CNC machine tools. Both subtractive and additive manufacturing processes will be explored, and students will learn best practices for making informed choices between them based on design needs. Computer aided manufacturing will be introduced to provide background for future courses (e.g., senior capstone projects).", "prerequisite": "CHEM 110"}, {"course_name": "EDSGN 403: Product Realization", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "This course provides students with practical experience in the product design and development process. Computer aided design and a variety of related analytical tools are employed in team-oriented design activities, as well as defined in-class team interactions. Team progress will be monitored through weekly team check-ins, during which two project status communication tools will be reviewed an updated Gantt Chart and a Weekly Project Activity Plan document. The hands-on design activities will culminate in the presentation and demonstration of a functioning engineering system. In working toward this goal, students will employ several industry-standard product design tools and techniques. In addition to Gantt charts for project management, they will employ formal ideation techniques, such as '6-3-5 Brainwriting' and Mind Maps. Conceptual designs will be communicated through morphological charts, preceding the process of reconciling conflicting Customer Needs via deterministic engineering design techniques. They will utilize the House of Quality to implement Quality Function Deployment. The hands-on aspect of the course will utilize programmable manufacturing equipment, both one additive manufacturing technique (3D printing) and three subtractive manufacturing techniques (CNC milling, water-jet, and laser cutting). Design Verification Testing will be conducted in the context of design-build-test iterations of their functional engineering prototype.", "prerequisite": "EDSGN 402"}, {"course_name": "EDSGN 410: Robotics Design and Applications", "department": "Engineering Design (EDSGN)", "credits": "4 Credits", "description": "Introduction to robotics, with emphasis on the design of robotics systems through multidisciplinary integration of electrical, mechanical, and software components.  EDSGN 410 Robotics Design and Applications (4) The objective of this course is to apply the basic concepts of electrical, mechanical, and software technologies to analyze, design and test a robotics system. This course will draw from skills in prior coursework in electricity and electronics, statics and dynamics, and software design. The course includes a discussion of present applications and future directions of robotics in such areas as manufacturing, science, transportation, military, healthcare, and entertainment. Students will be introduced to mechanical systems analysis, sensors, software development, electrical systems, control algorithms, testing, prototyping, design, modeling, and simulation of robot systems. Students will work in teams to design and prototype a robot to perform a task and to satisfy a set of design requirements. Professional communication and documentation will be included in the course experience. This course is a multi-disciplinary, project-based course and will have a substantial laboratory component supporting team-based design, integration and testing of a robot system.", "prerequisite": "EE 316"}, {"course_name": "EDSGN 420: Advanced Robotics Design and Applications", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "The objective of this course is to apply advanced topics in robotics. It serves as the second course of a possible two-course sequence in robotics design and applications. This second course will enable students to explore advanced topics not covered in the first course, or to continue a complex robot system design that would incorporate advanced topics and span two semesters in duration. One or more advanced topics, such as computer vision, artificial intelligence, biologically-inspired robots, multi-robotics, collaborative robots, human-robot interface, advanced navigation, or others, will be introduced based on background of the instructor. Students will work in teams to design and prototype a robot that integrates the advanced algorithms and technology and satisfies a set of design requirements. Laboratory exercises will provide experience in key areas to support the design and implementation process. Professional communication and documentation will be included in the course experience. This course is a multi-disciplinary, project-based course and will have a substantial laboratory component supporting team-based design, integration, and testing of an advanced robot system.", "prerequisite": "EDSGN 410"}, {"course_name": "EDSGN 452: Projects in Humanitarian Engineering", "department": "Engineering Design (EDSGN)", "credits": "2 Credits", "description": "Multidisciplinary student teams engage in integrated design of real-world humanitarian ventures.  EDSGN 452 Projects in Humanitarian Engineering (2)EDSGN 452 is intended to promote civic responsibility and enhance the student's abilities to engage in research and design, project management, communications, professional conduct and the understanding of user needs. This is accomplished by students undertaking team-based engineering projects in community service with partner community organizations. The projects offer real-world engineering design experience, from problem formulation through performance assessment. The project offerings will include a mix of local and international offerings. Students work on multidisciplinary teams with a project supervisor (i.e., faculty or practicing engineer) and a representative from the partner community organization. Projects are selected based on academic content, potential significance to the partner community, commitment of the partner community organization, and student safety. Students also examine the politics of technology, the relationship between engineering and communities (either domestic or international), and ethics in engineering practice. This includes the ways that engineering can be used positively and negatively in development. In the course of their work, the students will examine the ways that economic, social, cultural, political, and other contextual considerations are implicated in engineering design. Students are challenged to think critically about how engineering can be done most effectively to support community goals, and how engineering can weaken community efforts if done insensitively. These issues are explored through discussions of the relevant scholarly theory and through their manifestation in the course projects.", "prerequisite": "EDSGN 453"}, {"course_name": "EDSGN 453: Design for Developing Communities", "department": "Engineering Design (EDSGN)", "credits": "1 Credits", "description": "A seminar series related to the context and integrated design of Humanitarian Engineering and Social Entrepreneurship ventures in developing communities.  EDSGN 453 Design for Developing Communities (1) The Design for Developing Communities seminar course grounds students in EDSGN 452, BIOE 401, and other related courses in the basics of user-centered / context-driven design, extreme affordability, systems thinking, research ethics, privilege systems, travel and fieldwork, and related issues for technology-based social ventures in developing communities. These seminars directly help students across various classes and professional programs with their Humanitarian Engineering and Social Entrepreneurship (HESE)-related ventures. Typically, three sections of this course are offered: one focusing on international ventures, one on local ventures and an honors section focusing on international ventures. Designing appropriate products for customers inherently requires a thorough understanding of their needs. However, what happens when your target customers live in a developing country and have radically different needs than what you are accustomed to? Similarly, what happens when your audience lives in the United States, but in an unfamiliar environment? How do you know your product will be used by your intended customers? What pre-existing systems must your product work in harmony with? Open to students of all majors, the seminar class prepares students working on HESE ventures to create sustainable enterprises in resource-constrained environments. Students are introduced to the contextual factors that must be taken into consideration throughout their design process. Relevant philosophies and methodologies that relate to the integrated design, business and implementation strategy development of social enterprises are introduced to the students in the seminar class. The objective is to light a fire and not fill a pail. The relevant methodologies and philosophies are then reinforced in an experiential manner in the concurrent design classes (like EDSGN 452, BIOE 401, etc.) where students work on their ventures. Through the use of open discussion, videos, pictures, stories, and lectures, the course covers concepts such as systems-thinking, user-centered design, value creation, and effective communication. The seminar is highly interactive; students are encouraged to ask questions and provide examples of real-world situations that relate to the topics of conversation.", "prerequisite": "5th semester standing"}, {"course_name": "EDSGN 454: Humanitarian Engineering and Social Entrepreneurship Field Experience", "department": "Engineering Design (EDSGN)", "credits": "0.5 Credits", "description": "A hands-on integrated learning research and entrepreneurial engagement experience for students working on various humanitarian projects.  EDSGN 454 Humanitarian Engineering and Social Entrepreneurship Field Experience (0.5) The Humanitarian Engineering and Social Entrepreneurship (HESE) Field Experience is a hands-on integrated learning, research and entrepreneurial engagement experience for students engaged in HESE ventures in the EDSGN 452 and allied courses (e.g. BIOE 401, ME 440W). Students travel to project site(s) for three weeks to advance their ventures by conducting field-testing of their technologies, testing their preliminary business models, and gathering data for research projects. They work closely with community members and various partnering agencies during the course. The partnering agencies range from community members to non-profits, community-based organizations, and governmental and United Nations agencies. Students work in cross- national cross-functional teams and make several presentations to community members, potential partners and investors. In the past, HESE students have worked in Kenya, Tanzania, Rwanda, India, El Salvador, Jamaica, Ecuador and other countries. There is no set schedule for the three weeks in the partnering community. A (two-hour long) debriefing meeting is held every evening to discuss progress made by all the teams on that day and decide the action plan for the next day. Administrative issues, technological challenges, ethical or diplomatic issues are also discussed in this meeting and solutions are developed by consensus. The field experience is also a rich environment for students to explore the ethical intricacies of engaging in projects in international contexts. Students engage in debates on ethical issues related to science, technology and society in an applied setting -the people are real, the ethical dilemma is real and most importantly, a consensus is required to address the ethical issue and decide on the further course of action. A collaborative and integrated approach of system design, business strategy, and implementation strategy development is employed. The process of operationalizing the design and the business / implementation strategies is as important as the product itself. This integrated design and implementation process encompasses conceptualization, validation, design, field-testing, implementation, and evaluation, all done in an iterative fashion. Several tools, from literature, industry (like the IDEO Human-Centered Design toolkit) and those developed by our teams (like the E-Spot Canvas) are employed during fieldwork. Student evaluation is by a reflective essay written 3-4 weeks after the completion of the trip.", "prerequisite": "EDSGN 453"}, {"course_name": "EDSGN 460W: Multidisciplinary Capstone Design Project", "department": "Engineering Design (EDSGN)", "credits": "3 Credits/Maximum of 6", "description": "Course provides multidisciplinary industry-sponsored and service-based senior design projects in conjunction with the Learning Factory.", "prerequisite": "BIO E, CH E, CMPEN, E E, I E, or M E; BME  440 or E E  300W or I E  302 , I E  305 , I E  323 , I E  327 , I E  330 , I E  405 or M E  340", "other": ["Writing Across the Curriculum"]}, {"course_name": "EDSGN 462: Introduction to Design for Additive Manufacturing", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "Additive manufacturing (AM, colloquially 3D printing) is rapidly changing the face of modern manufacturing. This layer-by-layer manufacturing approach allows for parts to be created with significant levels of complexity and in cost-effective small batches, with reduced raw material waste when compared with traditional manufacturing processes. This technology has given rise to the need for Design for Additive Manufacturing (DfAM) techniques capable of accounting for both the possibilities and restrictions offered by AM in product design. In this class, students will be introduced to the core design advantages behind DfAM at the desktop printer scale, including lattice structures, topology optimization, and mass customization. Students will learn how to balance these opportunities with the limitations inherent to AM process types, including minimum feature sizes and support material removal. Throughout the course, students will be tasked with applying specific DfAM concepts to improve end-use product design. The objectives of the course include demonstrating the workflow for creating objects with desktop AM, identifying proper use of AM in the design process, describing the role of the digital thread, utilizing the concepts of geometric complexity and mass customization, and identifying the limits and challenges imposed by desktop-scale AM on design.", "prerequisite": "EDSGN 100"}, {"course_name": "EDSGN 467: Prototyping to Launch", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "This course will focus on strengthening the fundamentals of human-centered design taught in the Design Thinking and Making course (EDSGN 367), which serves as a prerequisite to this course. The course will be a team- and project-based course, encouraging hands -on learning through action; students will be given a problem prompt at the start of the semester, but the project and solution are to be of their choosing. Students will develop a prototype each week that advances their understanding of design methodologies and project -specific design knowledge. The goal of the course will be to \"launch\" a solution in some meaningful way. This could include getting market validation via online platforms, for example, having users sign-up for a beta release. The course will focus on teaching hands-on design-thinking skills via intentional prototyping practice, leveraging a series of design methods and toolsets. Students will also be exposed to a variety of \"maker\" technologies, and become proficient in not only using this technology to manufacture prototypes, but selecting appropriate maker tools dependent upon design need and context.", "prerequisite": "EDSGN 100"}, {"course_name": "EDSGN 468: Engineering Design and Analysis with CAD", "department": "Engineering Design (EDSGN)", "credits": "3 Credits/Maximum of 6", "description": "This course delivers methods and techniques necessary to become proficient in applying CAD as a design tool for engineering design and analysis. Students will gain a deep understanding in principles, best practices, and strategies for solid-model representation of engineering designs. The use of CAD as a design tool will prepare students to effectively develop, analyze, and communicate engineering designs. Learning is reinforced through lectures, tutorials, quizzes, laboratory assignments, design projects, and online design portfolios. Students will learn how to recognize and capture design intent by using symmetry and parametric associativity; virtually test fit, form, and function of assembled components; analyze and improve models using analysis tools (e.g., finite element analysis); obtain, edit, and integrate existing non-native file formats; prepare models for stereolithography apparatus and other CNC machinery for prototyping; produce and manage part family models, and prepare technical drawings and illustrations. Through all these, students will be able to master special techniques for engineering design and analysis with CAD. The exercises, laboratory assignments, quizzes, midterm design projects, final design projects, and online design portfolios will enhance students' understanding of how engineering design and analysis efforts are supported through the use of CAD as a design tool and will prepare students to effectively develop, analyze, and communicate engineering designs with the use of CAD. The course will be taught in each semester with different sections utilizing different CAD packages, such as AutoCAD, CATIA, and SolidWorks. The course may be repeated if taken to learn a second software package. Credit toward the major will not be granted a second time for taking the course with the same CAD package.", "prerequisite": "EMCH 210"}, {"course_name": "EDSGN 479: Human Centered Product Design and Innovation", "department": "Engineering Design (EDSGN)", "credits": "3 Credits", "description": "Consumer product design for a global market, incorporating human factors principles and user desires in a multicultural perspective.  EDSGN (I E) 479 Human Centered Product Design and Innovation (3)This course will focus on consumer product design for a global market, incorporating human factors and ergonomics principles as well as user needs and emotional desires. The students will be led through product design process, various product design strategies, product planning, managing the development process, product evaluation, decision making tools, and market entry. Special emphasis will placed on user centered design, incorporating user characteristics, user needs and emotional desires (including Kansei engineering approaches), survey methodology, and usability testing. To emphasize the multicultural perspectives in today's global product design, interdisciplinary teams from two universities on opposites of the globe will apply these principles on actual industrial product designs for leading consumer product manufacturers.", "prerequisite": "IE 408"}, {"course_name": "EDSGN 485: Engineering Design Portfolio", "department": "Engineering Design (EDSGN)", "credits": "1 Credits", "description": "Positions in engineering design typically require a portfolio representing an applicant's best work. In preparation for this requirement, students in this course will develop the skills needed to design a portfolio that represents the depth and breadth of their engineering design training, by collecting, sorting, and sequencing visual information from relevant previous design experiences. The material will be presented through a series of Web-based modules. The objectives of this course include organizing a collection of graphics and text to effectively communicate engineering design experiences and development, summarizing both the depth and breadth of design experiences, analyzing and interpreting information for presentation to third party readers, and using modern engineering graphics and text communication methods to present information. Students will be evaluated on their ability to visually, textually, and sequentially present their design work in a design portfolio. The course will be taught once a semester as an online-course. The course is required for students pursuing the Engineering Design Certificate.", "prerequisite": "EDSGN 100"}, {"course_name": "EDSGN 494: Research Project", "department": "Engineering Design (EDSGN)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "EDSGN 494H: Research Project", "department": "Engineering Design (EDSGN)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "EDSGN 495: Internship", "department": "Engineering Design (EDSGN)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, pracrica, or internships.  Written and oral critique of activity required."}, {"course_name": "EDSGN 496: Independent Studies", "department": "Engineering Design (EDSGN)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "EDSGN 497: Special Topics", "department": "Engineering Design (EDSGN)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EDSGN 499: Foreign Studies", "department": "Engineering Design (EDSGN)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]