[{"course_name": "EDTHP 99: Foreign Studies", "department": "Educational Theory and Policy (EDTHP)", "credits": "1-12 Credits", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDTHP 115: Education in American Society", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "This course introduces students to the historical, political, philosophical, and sociological forces that have shaped the course of schooling in the United States. Through a semester-long analysis of a range of educational policies, practices, reforms, and developments, students will develop a stronger knowledge of American schooling and strengthen their skills in finding, interpreting, and presenting evidence in such a way so as to inform and guide both teaching and policy making.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EDTHP 115A: Competing Rights: Issues in American Education", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "An examination of educational issues relevant to democratic citizenship; emphasis is on understanding the relationship among politics, schools, and society.  EDTHP 115A Competing Rights: Issues in American Education (3) (GS;US)(BA) This course meets the Bachelor of Arts degree requirements.This course offers students a chance to practice solving skills necessary for active and responsible citizenship. Because the course requires students to engage in detailed analysis of contested issues, students will: acquire information about the history and governance of public schools; develop an understanding of ideologies underlying existing schools and proposed reforms; and, as a result, be better equipped to make informed choices as voters. Major topics include curriculum design; school accountability; education of minority populations; the conflict between students' rights and the need of a school to maintain order; and the teaching of values. The course will require extensive reading, discussion (in-class and/or on-line), writing, and field research, to include such activities as interviewing teachers and politicians, or attending a school board meeting. Readings may include editorials, proposed legislation, court decisions, chapters from texts, essays and scholarly articles, and material from web sites of interested organizations (such as the National Education Association, the Christian Coalition, or the American Civil Liberties Union). After readings, analysis and discussion, students will prepare and defend a position on each issue, either individually or in groups, formally or informally, in speech or in writing. Students will be graded on their ability to support a particular stance with credible evidence, and on their ability to articulate the ideology underpinning a stance. Therefore, the ability to identify credibility of sources is inherent to success in the course. In general, this course draws upon concepts and information from history, political science, economics and philosophy as well as from education. As a General Education course, it seeks to help students broaden their perspective on social issues; to offer them practice in informed decision-making; and to understand and accept the responsibilities of active citizenship. The course might be particularly useful to social science majors because it will reveal interdisciplinary connections, while it will also be useful to the wider student body as a form of civic education.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EDTHP 115S: Competing Rights: Issues in American Education", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "An examination of educational issues relevant to democratic citizenship; emphasis is on understanding the relationship among politics, schools, and society.  EDTHP 115S Competing Rights: Issues in American Education (3) (GS;US)(BA) FYS This course meets the Bachelor of Arts degree requirements. This course offers students a chance to practice solving skills necessary for active and responsible citizenship. Because the course requires students to engage in detailed analysis of contested issues, students will: acquire information about the history and governance of public schools; develop an understanding of ideologies underlying existing schools and proposed reforms; and, as a result, be better equipped to make informed choices as voters. Major topics include curriculum design; school accountability; education of minority populations; the conflict between students' rights and the need of a school to maintain order; and the teaching of values. The course will require extensive reading, discussion (in-class and/or on-line), writing, and field research, to include such activities as interviewing teachers and politicians, or attending a school board meeting. Readings may include editorials, proposed legislation, court decisions, chapters from texts, essays and scholarly articles, and material from web sites of interested organizations (such as the National Education Association, the Christian Coalition, or the American Civil Liberties Union). After readings, analysis and discussion, students will prepare and defend a position on each issue, either individually or in groups, formally or informally, in speech or in writing. Students will be graded on their ability to support a particular stance with credible evidence, and on their ability to articulate the ideology underpinning a stance. Therefore, the ability to identify credibility of sources is inherent to success in the course. In general, this course draws upon concepts and information from history, political science, economics and philosophy as well as from education. As a General Education course, it seeks to help students broaden their perspective on social issues; to offer them practice in informed decision-making; and to understand and accept the responsibilities of active citizenship. The course might be particularly useful to social science majors because it will reveal interdisciplinary connections, while it will also be useful to the wider student body as a form of civic education.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EDTHP 199: Foreign Studies", "department": "Educational Theory and Policy (EDTHP)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDTHP 200: Educational Reform and Public Policy", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "This course uses an interdisciplinary approach to explore the policies and reforms that shape the nation's largest social institution: public schools. This course is designed for students interested in understanding broad issues in public policy and in exploring fundamental questions about the United States through the lens of public educational institutions. Drawing from multiple social science disciplines, the course analyzes how ideologies, institutions, and social groups have interacted to shape formal schooling. Both past and present school reforms are used to interpret the relations of schools to historic changes in legal norms, the distribution of power and resources in public institutions, and the access of different social groups to leadership and leverage in the political process of American society. The course has no prerequisites. The lectures, discussions, readings, and projects are designed for students interested in studying public policy and are intended to lead to informed interpretation of educational policy dilemmas.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EDTHP 234: Honors Leadership Jumpstart", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "Intensive survey of contemporary leadership theory joined with practice, team-building skills, policy formation and influence, and service leadership.  EDTHP 234H Honors Leadership Jumpstart (3) This is an intensive honors course for incoming First-Year students in the Schreyer Honors College with an interest in leadership. It provides introductory skills, perspective and background to prepare for and participate in a variety of leadership roles at Penn State and in the university community. Contemporary leadership theory joined with increasingly complex practice situations will be introduced. Content matter will include personal assessments, team building skills, organizational leadership, collaborative leadership, civics and diversity, policy formation and influence, and lessons about service learning and public scholarship. Considerable reading, writing, and discussion, as well as a first-year orientation project and a semester-long team service project will be required.", "prerequisite": "first-semester Penn State student in the Schreyer Honors College", "other": ["Honors"]}, {"course_name": "EDTHP 297: Special Topics", "department": "Educational Theory and Policy (EDTHP)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given on a topical or special interest subject which may be offered infrequently."}, {"course_name": "EDTHP 299: Foreign Studies", "department": "Educational Theory and Policy (EDTHP)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDTHP 394: Professional Development in Education and Public Policy", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "This course develops professional skills and opportunities to prepare students for field placement and future employment or study.  EDTHP 394 Professional Development in Education and Public Policy (3)This course focuses on the development of personal understanding of educational policy in a wide range of governmental, private, and civic organization with interest in educational policy, broadly defined. Students are provided opportunities to discover their policy interests, develop their professional communication and research skills, and design an on-site research project to be implemented during a summer field experience. The culminating project, the Field Experience Proposal, synthesizes readings, research, professional presentation, and details of the field placement. This becomes the blueprint for the students' summer field experience in EDTHP 395."}, {"course_name": "EDTHP 395: Field Experience in Education and Public Policy", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "This course structures a summer field experience, research project, and service in an off-site educational policy organization.  EDTHP 395 Field Experience in Education and Public Policy (3)This course structures a summer semester field placement for EPP majors in a non-profit, governmental, or civic organization with an educational policy component. Students gain hands-on, real-world experience implementing their Field Experience Plan (created in EDTHP 394) while serving internships in regional and national settings. Student-directed Field Placement Plans include identification of a policy issue relevant to the placement, implementation, evaluation, and analysis and can apply to broad topics such as diversity, multiculturalism, social justice, and educational equity in rural, suburban, and urban settings. Communication, assignment submission, and instructor assessment will take place on the ANGEL Course Management System.", "prerequisite": "EDTHP394"}, {"course_name": "EDTHP 399: Foreign Studies", "department": "Educational Theory and Policy (EDTHP)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "EDTHP 401: Introduction to Comparative Education", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "Origins, nature, scope, basic literature, and methodology of comparative education.  Study of sample topics.  CI ED 401 CI ED (EDTHP) 401 Introduction to Comparative and International Education (3) (IL) The course introduces undergraduate students to global issues in education and provides a survey of schooling practices used in various educational systems around the world. Students will have the chance to create an individual research project that will allow them to explore one country and one global educational issues in depth. Students are required to attend all classes, participate in the discussion sections, and take notes on the films shown. These films play an integral part in the course and provide students with views into classrooms and schools around the world. Students will also have access to international databases and be expected to make use of these databases in developing their projects. Finally, in-class discussions will focus on how comparative educational studies have been used by politicians to influence educational reform around the world.In this course, we will survey the state of public education in the world today. Each student will focus on one nation and provide a synopsis of educational practice in that nation. We will then move on to focus on global or cross-national issues such as how competition between \"core\" nations like Singapore and the U.S. drives reform (GOALS 2000 or No Child Left Behind). Other issues will include power differences between north and south, education for democracy, barriers to girls and women's education in developing nations, as well as education and national identity.", "prerequisite": "5th semester standing or higher", "other": ["Cross-listed with: CIED 401", "International Cultures (IL)"]}, {"course_name": "EDTHP 412: Education and the Status of Women", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "An examination of the relationship of education to the status of women in American society.", "other": ["Cross-listed with: WMNST 412"]}, {"course_name": "EDTHP 416: Sociology of Education", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "The theoretical, conceptual, and descriptive contributions of sociology to education.", "other": ["Cross-listed with: SOC 416", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"course_name": "EDTHP 420: Education and Public Policy", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "Focus on the development and analysis of education policy, and policy's influence on schools. EDTHP 420 Education and Public Policy (3) This course examines the inherently political process in which educational policies are developed and implemented. It also considers how these formal policies interact with the practice of teaching and learning in U.S. schools. In this course, students will be expected to actively participate in classroom discusses and activities as we examine the development of policies and their implementation, with a focus on understanding pressing policy dilemmas in education today. Course evaluation includes quizzes, a midterm paper analyzing a policy issue, and a series of final exam essays.", "prerequisite": "5th Semester standing"}, {"course_name": "EDTHP 426: Economic Foundations of Education Policy", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "This course is designed for undergraduate students interested in understanding the economic dimensions of education. Students will be shown how to apply  economic models to fundamental questions of education policy. Concepts and principles such as returns to education, education production function, market  failure in education, signaling model of education, and externalities of education will be introduced with a specific eye towards the application of those  concepts to real world education policy issues. The concepts and methods of analysis addressed in this class would enable you to assess the validity of the  arguments put forth by economists and education policy makers in various situations and hopefully make you a more discerning consumer of news and  education policy topics. The main goals of the course are to (1) introduce students to the theoretical frameworks and empirical methods used by economists  to understand and analyze core questions and problems in education; and (2) To teach students how to apply economic concepts, modes of analysis, and  methods to analyze real-world education policy issues affecting the United States.", "prerequisite": "ECON 102", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EDTHP 427: Intelligence and Educational Policy", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "This course explores the concept of intelligence and its assessment from historical, psychological, educational and policy perspectives. EDTHP 427 Intelligence and Education Policy (3) In this course, we will focus on two main content areas. First, we'll explore the concept of intelligence and its assessment from historical, psychological, educational, and policy perspectives: What does intelligence look like in different cultures and at different points in history? What forces help to shape conceptions of intelligence? Second, we will consider the ways in which conceptions of intelligence influence students' opportunities to learn. For example, how are students assigned to higher-level or remedial classes and on what bases should admission to elite educational programs be allocated? What policies govern such decisions? The study of intelligence has been a controversial one. This course will touch on several controversies associated with the topic, including the \"nature/nurture\" debate and the \"merit/affirmative action\" debate. Readings and discussion will draw on opposing sides of these issues.", "prerequisite": "5th Semester standing"}, {"course_name": "EDTHP 430: History of Education in the United States", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "American educational ideas and practice critically examined in terms of their historical development and contemporary significance."}, {"course_name": "EDTHP 434: Honors Teaching Experience in Leadership Jumpstart", "department": "Educational Theory and Policy (EDTHP)", "credits": "1 Credits/Maximum of 3", "description": "Guided instruction and practical experience for teaching assistants to the Honors Leadership Jumpstart course (EDTHP 234H).  EDTHP 434H Honors Teaching Experience in Leadership Jumpstart (1) This course trains and supports the teaching assistants (TAs) who work with the first-year students in the Leadership Jumpstart course (EDTHP 234H). The TAs help guide the first-year students through their course by assisting in the design, implementation, and evaluation of the course and the student projects, providing feedback for what worked and what did not work, and providing important perspective from when they were first-year students. The TAs are expected to be a role model, assist in the instruction of the course, assist in the functional elements of the course, be a confidant/mentor to new students, and occasionally serve as an evaluator of students' work. The TAs' grades will be based on attendance at all class sessions and interactive assistance and leadership during the EDTHP 234H course and on the TA's reflections on the course, its effectiveness to achieve the objectives, and possible improvements.", "prerequisite": "EDTHP234H and permission of program", "other": ["Honors"]}, {"course_name": "EDTHP 435: Child Labor and Education in the Global Economy", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "The legal instruments and social science theories useful for understanding and combating child labor through education policy and practice."}, {"course_name": "EDTHP 440: Introduction to Philosophy of Education", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "Introduction to the examination of educational theory and practice from philosophical perspectives, classical and contemporary.  CI ED 440 CI ED (EDTHP) 440 Introduction to Philosophy of Education (3) The major objective of EDTHP (CI ED) 440, Introduction to Philosophy of Education, is to broaden and deepen the students' understanding of the nature of education. Such a study involves exploring the ends as well as the means of education. It includes both an examination of some of the distinctive or defining characteristics of \"educated persons\" as well as the different elements of the learning experience (including curricula, pedagogies, and evaluative processes) that encourage the development of such persons. As part of developing an understanding of the educational enterprise, this course will introduce students to some of the important ideas and theories that comprise the rich tradition of educational philosophy. In the design of a course of this nature with constraints established by space, time, and the background of the student, it is necessary to confront the task of making judicious selections from the vast literary wealth accumulated over the centuries. In doing so, the decision made has been to focus primarily on the literary contributions of western philosophers of education. In the interest of making the sample varied and interesting, however, an effort has been made to include writings of some philosophers of education from different cultural contexts. The educational thoughts of A.S. Neill, John Dewey, Eliot Wigginton, Maxine Greene, Paolo Freire, Mohandas Karamchand Ganddhi, David Orr, Ivan Illich, and Wendell Berry, among others, will be explored in this class. The exposure to diverse, rich, and provocative ideas of the educators included for study here will, it is hoped, stimulate students to re-examine and further develop their own philosophy of education into a more comprehensive, coherent, and consistent one.", "prerequisite": "ENGL 015", "other": ["Cross-listed with: CIED 440"]}, {"course_name": "EDTHP 441: Education, Schooling, and Values", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "Studies in education and schooling as problems in value; axiological problems and positions; examination of practical applications, including moral education."}, {"course_name": "EDTHP 447: Ethnic Minorities and Schools in the United States", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "Analysis of the social and cultural factors which affect educational outcomes among minority pupils, especially Blacks, Hispanics, and Indians.", "other": ["Cross-listed with: SOC 447", "United States Cultures (US)"]}, {"course_name": "EDTHP 492: Identities, Power and Perceptual Pedagogies in Teaching and Learning", "department": "Educational Theory and Policy (EDTHP)", "credits": "3 Credits", "description": "Students will perform inquires into the intersections of identities, power, and pedagogical formations in relation to urban teaching/learning contexts. AFAM 492 / CI 492 / EDTHP 492 Identities, Power and Perceptual Pedagogies in Teaching and Learning (3) In this course, students will take part in inquiries into the intersections of identities, power, and perceptual pedagogies, particularly as these phenomena pertain to methods of teaching and learning in urban contexts. To develop new knowledge and analytic skills, students will be introduced to perceptual and conceptual frameworks that assist deep engagements with youth- and teacher-centered case studies. These cases will depict actual lived experiences among racially and economically diverse students and teachers in urban contexts.", "prerequisite": "5th semester standing", "other": ["Cross-listed with: AFAM 492, CI 492"]}, {"course_name": "EDTHP 496: Individual Studies", "department": "Educational Theory and Policy (EDTHP)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "EDTHP 497: Special Topics", "department": "Educational Theory and Policy (EDTHP)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given on a topical or special interest subject which may be offered infrequently."}]