[{"course_name": "EMSC 100S: Earth and Mineral Sciences First-Year Seminar", "department": "Earth and Mineral Sciences (EMSC)", "credits": "3 Credits", "description": "Writing, speaking, and critical thinking skills applied to topics of general interest in Environmental and Materials Science.  EM SC 100S Earth and Mineral Sciences First-Year Seminar (3) (GWS;FYS) The EMS First-Year Seminar is designed to encourage students to begin the important process of 'thinking for a living.' The primary focus of the seminar is to promote critical reading and thinking skills, and to help students develop effective written and oral arguments. Students learn the importance of reading, sharing ideas and collaborating, through independent and group research, discussion and debate. We want our students to think about some of the major issues facing the world today, the role that science and technology have played in defining and addressing these issues, the way in which present-day thinking has been shaped by the past, and the development of scientific thought. The Seminar's content focuses on communication skills, but these are addressed within the context of issues relevant to the disciplines represented in EMS. As such, the discussions range across topics such as the Earth and its resources; scientific and technical aspects of global habitability; development of the advanced materials necessary for sustaining and advancing civilization in the 21st century; and the social, economic, and political factors that shape and constrain society's view of the Earth system. Students undertake three to five major writing projects throughout the semester, as well as several smaller one to two paragraph written assignments. Grades are determined from their performance on the written papers, oral presentations, and in-class participation. The Seminar is a required course for all EMS first-year students at the University Park campus and, together with English 015 and either English 202 or Speech Communications 100, will satisfy the Writing and Speaking requirements of General Education.", "other": ["First-Year Seminar", "General Education: Writing/Speaking (GWS)"]}, {"course_name": "EMSC 101: Resource Wars", "department": "Earth and Mineral Sciences (EMSC)", "credits": "3 Credits", "description": "\"Resource Wars\" presents an analysis of natural resources and how competition for them shapes national and international cultures and geopolitics.  EM SC 101 Resource Wars (3) (US;IL) The faculty of the College of Earth and Mineral Sciences are uniquely qualified to teach \"Resource Wars\", a course that presents an analysis of natural resources and how competition for them shapes contemporary and historical culture and geopolitics. \"Resource wars\" will examine the extent to which the Gulf War of 1991, the explosive conflict between the United States and Islamic extremists, and present engagement in Iraq are manifestations of a foreign policy that comes from a desire for resource security. While the current Iraq war is the most recent manifestation of the clash between US and IL cultures, there are many examples of past resource wars in world history. Although the present conflict in the Middle East is about petroleum, past conflicts involve the entire spectrum of natural resources from gold and diamonds to rubber and tea to water, clean air, and living space. Class discussion will meld the technical aspects of discovery and extraction with its impact on society from a cultural and geopolitical points of view (US & IL).Technical analysis starts with the geology of the natural resource. The extraction, harnessing, or mining of that natural resource and resource transportation come next. The use of that natural resource as a material follows. Of course, short term and long climatic instability may play roles. The human elements (US & IL) involved in the trading and development of the resource lead to both armed interstate conflicts and intrastate disputes. Cultural questions might include how the digital age impact resource control and trade, how global resource distribution impacts energy security and utilization, and how international resource competition impacts the climate. Ultimately, the class is led to an understanding about how scarcity has impacted cultures throughout human history (US & IL).The tentative plan is that each lecture period consists of two parts starting with a moderator (the lead faculty member throughout the entire semester) who summarizes the resource under discussion in a 10-15 minute introduction. Then, appropriate EMS faculty will offer detailed accounts of their particular expertise. This format requires two 75-minute classes per week (30 per semester).The moderator shall be responsible for grading the class including the discussion and written responses in a large classroom format (50+ students) taught in one lecture hall. Active learning shall include discussion sessions with a wireless response pad technology for in-class interaction between student and instructor.", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "EMSC 121: Minerals and Modern Society", "department": "Earth and Mineral Sciences (EMSC)", "credits": "3 Credits", "description": "Production and use of mineral resources in modern society with an emphasis on the interrelationships and their effect on the Earth system.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"course_name": "EMSC 150: Out of the Fiery Furnace", "department": "Earth and Mineral Sciences (EMSC)", "credits": "3 Credits", "description": "A history of materials, energy and man, with emphasis on their interrelationships.  For nontechnical students.", "other": ["Cross-listed with: STS 150", "Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)"]}, {"course_name": "EMSC 240N: Energy and Sustainability in Contemporary Culture", "department": "Earth and Mineral Sciences (EMSC)", "credits": "3 Credits/Maximum of 3", "description": "In this course students are guided through an engaging exploration and the critical evaluation of selected media (e.g., books, film) in contemporary culture on topics related to energy and sustainability. Three selections are used each term, typically two books and one film. Students consider the subject matter in light of humanistic values, where the science, ideas and history presented in the selected media are critically evaluated relative to the viability of our planet's ability to support life. Opening lessons cover the foundational science of energy and sustainability, with a global perspective and consideration of the human dimension. The science is presented without technical jargon or advanced mathematics, to promote a genuine and sound understanding of these essential concepts for college-level students of all academic backgrounds. Learning units are devoted to each media selection, with all content, activities and assessments within the unit contributing to this concentrated focus. After completing this course, students will possess the foundational science knowledge necessary to evaluate contemporary topics related to energy and sustainability, from the perspective of universal humanity on a planet of finite resources. This knowledge prepares students to develop observations, questions and opinions on topics related to energy and sustainability and to self-express them, in both written and oral presentations, to others with different backgrounds and points of view. Students will have the foundational knowledge necessary to be skilled critical readers of energy and sustainability subject matter, knowing how to raise (and answer) questions related to scientific clarity and soundness and how to test assumptions and scope of arguments, especially as related to inclusion of humanistic values and planetary limits. This knowledge prepares students to be willing and able to avoid entrenched ideology-based positions on issues related to energy and sustainability and to develop, instead, a personal position based in science and data with a humanistic perspective. Students will gain the knowledge of credible resources and organizations for ongoing research related to energy and sustainability and be prepared to participate in public dialogue on some of the most challenging and complicated issues of our time, including activities such as letters to the editor, online commenting, political engagement, and public advocacy.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "EMSC 296: Independent Studies", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "EMSC 297: Special Topics", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "EMSC 299: Foreign Studies", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction."}, {"course_name": "EMSC 302: Orientation to Energy and Sustainability Policy", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1 Credits", "description": "Orientation to goals of the Energy and Sustainability Policy program and resources available to help students succeed.  EM SC 302 Orientation to Energy and Sustainability Policy (1) EM SC 302 provides an orientation to the goals of the Energy and Sustainability Policy (ESP) degree program, helping students to successfully prepare for the five program learning outcomes. The course is conducted as a group seminar, with topics that are designed to provide an initial understanding of program outcomes: energy industry knowledge, global perspective, analytical skills, communication skills, and sustainability ethics. Students are expected to actively participate in discussions and work hands-on with online tools in activities that will allow them to gain an understanding of what it means to successfully participate as an ESP student in different educational and course contexts. Students are evaluated based on active class participation, written assignments, and class presentations. This course is intended to be taken during the first semester after being admitted to the ESP program."}, {"course_name": "EMSC 420: Energy and Modern Society", "department": "Earth and Mineral Sciences (EMSC)", "credits": "3 Credits", "description": "Technology and economics of energy resources, production, and consumption; environmental factors, exhaustion, new technology.", "prerequisite": "3 credits of SOC", "other": ["Cross-listed with: SOC 420, STS 420", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "EMSC 440: Science Diving", "department": "Earth and Mineral Sciences (EMSC)", "credits": "4 Credits", "description": "Advanced scuba diving skills applied to underwater research.  EM SC 440 Science Diving (4) EM SC 440 is a four credit intermediate science diving course for students already holding a basic open water scuba diving certification from an internationally recognized certification agency (e.g. PADI, NAUI, CMAS, YMCA, SSI etc.). Scientific diving is concerned with the observation of underwater phenomena and the acquisition of scientific data. This course introduces students to advanced scuba diving skills following the standards established by the American Academy of Underwater Sciences (AAUS) -- with a significant emphasis on diver safety. The course covers theoretical aspects of the physics of diving, dive physiology, and underwater environments. There is a strong emphasis on diver safety with theoretical and practical training in cardiopulmonary resuscitation, diving-related first aid, accident management and dive rescue. The course will cover advanced recreational diving techniques, including deep diving and enriched air (nitrox) diving. A significant component of the course will involve scuba diving accident analysis, the focus of the course textbook. The course will also include an introduction of advanced underwater sign language. The course will include classroom sessions, pool sessions, and open water dives focusing on underwater skills development for eventual application in research settings. Each government or university underwater research program certifies its own divers based on standards that, at a minimum, conform to those of the AAUS. Successful completion of the course will allow the student diver in training to enroll in EM SC 441, Advanced Science Diving. Successful completion of EM SC 441 will allow the student diver in training to apply for science diver certification from the Penn State Science Diving Program. Certification is also dependant on a medical examination and is at the discretion of the University Dive Safety Officer; it is not automatically offered on completion of the course. The course is usually offered once a year in the spring semester and will involve several day trips (usually at weekends) to various river, lake, and quarry locations within the state. There will be an additional fee charged to cover the costs of the open water dives and administrative charges for recreational dive certifications.", "prerequisite": "basic open water SCUBA certification and approval of program"}, {"course_name": "EMSC 441: Advanced Science Diving", "department": "Earth and Mineral Sciences (EMSC)", "credits": "4 Credits", "description": "Advanced scuba diving skills applied to underwater data collection and research.  EM SC 441 Advanced Science Diving (4) EM SC 441 is a four credit advanced science diving course for students who have completed EM SC 440 (Science Diving), an equivalent course at a recognized AAUS member institution, or have been approved by the University Dive Safety Officer based on acceptable demonstration of practical and academic dive experience. Students must have a minimum of 20 logged dives beyond their basic open water certification dives by the start of the course. Scientific diving is concerned with the observation of underwater phenomena and the acquisition of scientific data. This course introduces students to some of the basic skills and techniques used in scientific diving, following the standards established by the American Academy of Underwater Sciences (AAUS) -- with a significant emphasis on diver safety. The course covers theoretical aspects of science diving techniques. The course will focus on advanced techniques in underwater ecology, geology, paleontology and archaeology, leveraging expertise from PSU faculty in these disciplines. The course will include classroom sessions, pool sessions, and open water dives. The classroom and pool sessions and the open water dives will involve skills development and their application in research settings. Research will involve a variety of projects (e.g. fish surveys, lake sediment sampling for climate reconstruction, underwater mapping) &ndash; the exact nature of which will vary depending on the areas of expertise of the faculty and students involved. Each government or university underwater research program certifies its own divers based on standards that, at a minimum, conform to those of the AAUS. Successful completion of the course will allow the student diver in training to apply for science diver certification from the Penn State Science Diving Program. Certification is also dependant on a medical examination and is at the discretion of the University Dive Safety Officer; it is not automatically offered on completion of the course. The course is usually offered once a year in the fall semester and will involve several day trips (usually at weekends) to various river, lake, and quarry locations within the northeastern United States. There will be an additional fee charged to cover the costs of the open water dives and administrative charges for recreational dive certifications.", "prerequisite": "successful completion of EM SC440 or waiver by University Dive Safety Officer based on   acceptable demonstration of practical and academic dive   experience"}, {"course_name": "EMSC 470W: Undergraduate Collaborative Research in Earth and Materials Sciences", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-6 Credits/Maximum of 6", "description": "Interdisciplinary research seminar involving students in the process of discovery, writing, and debate on issues of broad interest to Earth and Materials Sciences.", "other": ["Writing Across the Curriculum"]}, {"course_name": "EMSC 494: Research Project Courses", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "EMSC 494H: Research Project Courses", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "EMSC 496: Independent Studies", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "EMSC 497: Special Topics", "department": "Earth and Mineral Sciences (EMSC)", "credits": "1-9 Credits/Maximum of 18", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript."}]