[{"course_name": "ENVST 100N: Visions of Nature", "department": "Environmental Studies (ENVST)", "credits": "3 Credits", "description": "An interdisciplinary introduction to environmental studies, including perspectives from environmental ethics, economics, public policy, art, literature, history, geology, biology, and ecology. This course may be team-taught and include field and laboratory work. Students will be introduced to interdisciplinary study of the environment with an overview of nature's role as subject matter in a variety of academic disciplines. Students will examine the formative value of nature in our cultural history, consider the role of nature in our current value systems and social and economic structure, and be introduced to the theory and practice of ecological science. Students should achieve a broad understanding of the value (not just economic) of living things and their habitats. The course will demonstrate how information from different fields can interconnect. It also serves as the \"gateway\" course for students intending to major or minor in an interdisciplinary environmental studies program, introducing the program's concerns, aims, and goals and the varied academic perspectives to be built upon in later coursework.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ENVST 200: Research Methods in Environmental Studies", "department": "Environmental Studies (ENVST)", "credits": "3 Credits", "description": "Focus on interdisciplinary research methodologies from biology, social sciences, and humanities for the study of environmental issues and problems.  ENVST 200", "prerequisite": "BIOL 110"}, {"course_name": "ENVST 294: Research Project", "department": "Environmental Studies (ENVST)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or group-basis."}, {"course_name": "ENVST 296: Independent Studies", "department": "Environmental Studies (ENVST)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "ENVST 297: Special Topics", "department": "Environmental Studies (ENVST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "ENVST 299: Foreign Studies in Environmental Studies", "department": "Environmental Studies (ENVST)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "approval of the program", "other": ["International Cultures (IL)"]}, {"course_name": "ENVST 395: Internship", "department": "Environmental Studies (ENVST)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "other": ["Prerequisites INTSP 370"]}, {"course_name": "ENVST 400W: Senior Seminar in Environmental Studies", "department": "Environmental Studies (ENVST)", "credits": "3 Credits", "description": "Writing-intensive study of a specified topic in environmental studies integrating approaches and research from a variety of disciplines.  ENVST 400W", "prerequisite": "ENVST200", "other": ["Writing Across the Curriculum"]}, {"course_name": "ENVST 424: Creative Writing and the Natural World", "department": "Environmental Studies (ENVST)", "credits": "3 Credits", "description": "Creative writing workshop focused on the environment and related issues.  ENGL (ENVST) 424 Creative Writing and the Natural World (3) American literature includes a long and rich tradition of writing that focuses on the natural world. From the oral stories of indigenous people to the journals of the first European settlers, many have looked for a way to understand their own place in the world based upon their relationship to the earth and its creatures. While Puritans often discerned the pleasure or wrath of God in the environmental changes they experienced, Transcendentalists like Henry David Thoreau and Ralph Waldo Emerson sought out moments of spiritual enlightenment by immersing themselves in the natural order. More recently, such poets as Galway Kinnell, James Wright, and Robert Bly have attempted to connect with the depths of collective unconsciousness by exploring the natural world, while others, like Mary Oliver, Dan Gerber, Jim Harrison, Gary Snyder and Wendell Berry, have used transcendental thought and melded it with Christian and Buddhist insights. Still others, like Gary Paul Nabhan, Rachel Carson, and Alison Hawthorne Deming have brought science to bear upon the riches that nature, art, and scientific exploration may offer when joined in the pursuit of a deeper understanding of, and relationship with, the natural world. This course will acquaint students with the tradition of American nature writing, as well as contemporary nature writing, in the genres of nonfiction, poetry and fiction. Students will be introduced to issues of style, philosophy, and content, as they produce their own essays, poems, and stories. The course culminates in the production of a portfolio of nature writing. Much of this work will begin in class with specific assignments, which will include field work, and feedback from other students in the class. As a workshop course in creative writing, the emphasis will be upon the production of literary texts that interact with the natural world and upon the revision of those texts.", "prerequisite": "ENGL 50", "other": ["Cross-listed with: ENGL 424"]}, {"course_name": "ENVST 424H: Creative Writing and the Natural World", "department": "Environmental Studies (ENVST)", "credits": "3 Credits/Maximum of 3", "description": "Creative writing workshop focused on the environment and related issues.  ENVST (ENGL) 424 Creative Writing and the Natural World (3) American literature includes a long and rich tradition of writing that focuses on the natural world. From the oral stories of indigenous people to the journals of the first European settlers, many have looked for a way to understand their own place in the world based upon their relationship to the earth and its creatures. While Puritans often discerned the pleasure or wrath of God in the environmental changes they experienced, Transcendentalists like Henry David Thoreau and Ralph Waldo Emerson sought out moments of spiritual enlightenment by immersing themselves in the natural order. More recently, such poets as Galway Kinnell, James Wright, and Robert Bly have attempted to connect with the depths of collective unconsciousness by exploring the natural world, while others, like Mary Oliver, Dan Gerber, Jim Harrison, Gary Snyder and Wendell Berry, have used transcendental thought and melded it with Christian and Buddhist insights. Still others, like Gary Paul Nabhan, Rachel Carson, and Alison Hawthorne Deming have brought science to bear upon the riches that nature, art, and scientific exploration may offer when joined in the pursuit of a deeper understanding of, and relationship with, the natural world. This course will acquaint students with the tradition of American nature writing, as well as contemporary nature writing, in the genres of nonfiction, poetry and fiction. Students will be introduced to issues of style, philosophy, and content, as they produce their own essays, poems, and stories. The course culminates in the production of a portfolio of nature writing. Much of this work will begin in class with specific assignments, which will include field work, and feedback from other students in the class. As a workshop course in creative writing, the emphasis will be upon the production of literary texts that interact with the natural world and upon the revision of those texts.", "other": ["Honors"]}, {"course_name": "ENVST 425: Environmental Communication", "department": "Environmental Studies (ENVST)", "credits": "3 Credits", "description": "ENVST 425W Environmental Communication (3). Environmental communication is an increasingly important specialty within the discipline of communication, and a critical topic for students interested in participating in environment-related discourse as policy advocates, subject-matter experts, journalists, strategic communication professionals, or citizen-stakeholders. In this course, students will learn (1) how the environment is constructed and contested as an idea in public discourse, via news, current events, and popular culture; (2) how individuals, organizations, and authorities engage in environmental discourse, and to what ends; and (3) how environmental policy advocates and entrepreneurs attempt to enlist and mobilize publics via communication campaigns. Students will learn to design and critique environmental messages. Methods of assessment center on the production of informative, persuasive, and reflective environmental messages in a variety of textual forms and genres to develop practical communication skills. Class size is limited to 10 students. This course may be substituted for ENVST 400W with program approval.", "prerequisite": "CAS 100", "other": ["Writing Across the Curriculum"]}, {"course_name": "ENVST 428: Environmental Economics and Policy", "department": "Environmental Studies (ENVST)", "credits": "3 Credits", "description": "Our free market system has brought us tremendous increases in productivity and innovation over the last century. However, at times the production or consumption of goods or services generates side effects that can lower the welfare of society, or even threaten society's very existence. What should be done? Environmental economics provides one tool to examine this question. There are four broad areas in the field of environmental economics: benefit-cost analysis including the valuation of the environment and the cost of environmental regulation; institutional design in the regulation of the environment; and exhaustible and renewable resource management. This course will provide an overview of these four areas and will examine several applications of the techniques found in the environmental economics literature.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Natural Sciences"]}, {"course_name": "ENVST 494: Research Project", "department": "Environmental Studies (ENVST)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or group basis."}, {"course_name": "ENVST 496: Independent Studies", "department": "Environmental Studies (ENVST)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "ENVST 497: Special Topics in Environmental Studies", "department": "Environmental Studies (ENVST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "prerequisite": "6th semester standing and 6 credits in ENVST or related   disciplines"}, {"course_name": "ENVST 499: Foreign Studies in Environmental Studies", "department": "Environmental Studies (ENVST)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "6th semester standing, approval of program, and 6 credits in   ENVST or related disciplines", "other": ["International Cultures (IL)"]}]