[{"course_name": "ESL 4: ESL Composition for American Academic Communication I", "department": "English as a Second Language (ESL)", "credits": "3 Credits", "description": "For undergraduate students who are beginning-intermediate level non-native speakers of English to improve their grammar and writing skills in preparation for future American academic writing assignments.  This course may not be used to satisfy the basic minimum requirements for graduation in any baccalaureate degree program.  ESL 004 ESL/Composition for American Academic Communication I (3) This course is for undergraduate students who are beginning-intermediate level non-native speakers of English. The course is designed to improve their grammar and writing skills in preparation for future American academic writing assignments. Topics to be covered include the following: (a) subject-verb agreement; (b) verb tenses; (c) adjectives and adverbs; (d) independent and dependent clauses; (e) essay and paragraph organization; (f) paragraph development; editing and proof-reading. This course may not be used to satisfy the basic minimum requirements for graduation in any baccalaureate degree program."}, {"course_name": "ESL 5: Writing Tutorial", "department": "English as a Second Language (ESL)", "credits": "1 Credits/Maximum of 1", "description": "This course supplements ESL 015, providing focused instruction for non-native English speaking students in English composition and academic writing. This course may not be used to satisfy the basic minimum requirements for graduation in any baccalaureate degree program"}, {"course_name": "ESL 15: ESL Composition for American Academic Communication II", "department": "English as a Second Language (ESL)", "credits": "3 Credits", "description": "ESL 15 ESL/Composition for American Academic Communication II (3) This course is for undergraduate students who are intermediate-advanced level non-native speakers of English. Students will become familiar with the various stages in the process of writing and develop strategies for reading and writing various models of American academic discourse. Students will be able to use what they have learned in this course to participate successfully in academic reading and writing tasks throughout their university experiences in the United States. Students will participate in a variety of reading and writing tasks that will enable them to: (a) define the subject, purpose, audience, and appropriate organizational structure for written compositions; (b) revise and reshape their writing to improve ideas, organization, language use, vocabulary and mechanics; (c) identify and correct structural and grammatical errors within their written texts; (d) select sources, take notes, and acknowledge sources to support ideas, using the library to conduct library research; and, (e) become better writers in preparation for their college careers.", "prerequisite": "a grade of C or higher required in ESL  004", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "ESL 114G: American Oral English for Academic Purposes", "department": "English as a Second Language (ESL)", "credits": "3 Credits", "description": "Instruction in ESL for graduate students, focusing on the use of oral language skills in an academic setting.  ESL 114G American Oral English for Academic Purposes (3) This course is designed for graduate students who are non-native speakers of English in order to develop and improve their oral communication skills for effective interaction in social, as well as academic settings in English-speaking environments. Activities will include: (a) a pre- and post-testing of oral proficiency for diagnostic and achievement purposes; (b) a series of in-class oral presentations which will be audio-taped and videotaped for self, peer, and instructor evaluation; (c) participation in group discussions, role plays, and impromptu speeches; and, (d) various oral language assignments, including listening and pronunciation activities, transcriptions of recorded speech, and the creation of an audio-taped oral dialogue journal."}, {"course_name": "ESL 115G: American Oral English for ITAs I", "department": "English as a Second Language (ESL)", "credits": "3-9 Credits/Maximum of 9", "description": "Initial course in American Oral English for preparation of international teaching assistants.  ESL 115G American Oral English for ITAs I (3 per semester/maximum of 9) This course is designed for non-native speakers of English who wish to improve their overall speaking and listening skills in English. Through various oral and aural language activities, students will increase the intelligibility of their speech by improving their pronunciation of American English. They will also develop academic speaking skills in order to engage critically and constructively in the exchange of ideas during discussions of academic content. They will improve their overall listening comprehension, as well as their discrimination of particular sounds in English. By the end of this course, students will have improved their overall speaking and listening skills, in particular their fluency, to participate successfully in academic settings.", "prerequisite": "score below 150 on the American English Oral Communicative   Proficiency Test (AEOCPT)"}, {"course_name": "ESL 116G: ESL Composition for Academic Disciplines", "department": "English as a Second Language (ESL)", "credits": "3 Credits", "description": "For international students at the graduate level to engage in scholarly activity in their academic disciplines.  ESL 116G ESL Composition for Academic Disciplines (3) This course is designed for international students at the graduate level who are preparing to engage in scholarly activity in their academic disciplines. Through reading and writing selected rhetorical models of academic disclosure, students will be able to analyze and use the organizational structure of various models of academic texts. They will engage in contextualized language activities, which will enable them to match appropriate English linguistic forms to specific rhetorical purposes. Students will be expected to gather appropriate sources, organize information, and compose various models of academic essays and research papers. By the end of the course, students will be able to translate their research activities into written reports that conform to the expectations of the English-speaking academic community."}, {"course_name": "ESL 117G: American Oral English for ITAs II", "department": "English as a Second Language (ESL)", "credits": "3-9 Credits/Maximum of 9", "description": "Intermediate course in American Oral English for preparation of international teaching assistants.  ESL 117G American Oral English for ITAs II (3 per semester/maximum of 9) This course is designed for intermediate level non-native speakers of English who need to improve their communication effectiveness in order to become teaching assistants (TAs). Through various language related activities, students will increase the intelligibility of their speech by improving their pronunciation of American English. Students will also develop oral presentation skills necessary for different types of classroom interaction. In addition, they will learn about American cultural traits as they pertain to communication in the university-level classroom. By the end of this course, students will have improved their overall communication effectiveness to participate successfully in a variety of future teaching assistant responsibilities.", "prerequisite": "score of 150-199 on the American English Oral Communicative   Proficiency Test (AEOCPT) or a grade of A- required in ESL  115G"}, {"course_name": "ESL 118G: American Oral English for ITAs III", "department": "English as a Second Language (ESL)", "credits": "3 Credits", "description": "Advanced course in American Oral English for preparation of international teaching assistants.  ESL 118G American Oral English for ITAs III (3) This course is designed to provide English language instructional support for advanced non-native speakers of English who need to improve their communication effectiveness in order to become teaching assistants. Through various language related activities, students will increase the intelligibility of their speech by improving their pronunciation of American English. To do this, they will develop an acute awareness of their own strengths and weaknesses as a communicator in real and simulated instructional contexts. They will also develop effective oral communication strategies necessary for interaction with individual students, small groups, and large classes. Students will learn about American cultural traits and underlying assumptions as they pertain to communication in the university-level classroom. By the end of this course, students will have improved their overall communication effectiveness to carry out their future teaching assistants responsibilities successfully.", "prerequisite": "score of 200-249 on the American English Oral Communicative   Proficiency Test (AEOCPT) or a grade of A- required in ESL  117G"}, {"course_name": "ESL 297: Special Topics", "department": "English as a Second Language (ESL)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]