[{"course_name": "FINSV 420: Estate Planning for the Financial Services Professional", "department": "Financial Services (FINSV)", "credits": "3 Credits", "description": "Studies the processes relating to the use, conservation, and transfer of an individual's wealth; emphasizing investments, insurance and taxation.  FINSV 420 Estate Planning for the Financial Services Professional (3) This course examines the why and how people plan for their retirement. The course examines the various aspects of estate planning: wills and trusts, estate and gift tax planning, estate administration and taxation. The course guides the student in a step-by-step process through the entire estate planning process. Critical to the process is gathering the necessary financial facts, setting realistic objectives, and planning the requisite income tax and investment strategies. Students will utilize a range of personal financial statements and planning forms to assist in the gathering, organization, and use of pertinent data.This course has four objectives: (1) To understand the motives for why people plan for their retirement. Related to retirement planning is the disposition of the residual value of their estate in a financial and tax prudent manner. (2) To understand the process by which individuals explore the various decision options. The most frequently cited motivation for estate planning is to minimize the tax burden on beneficiaries and to maintain the integrity of the planning process. (3) Students are motivated to understand how estate planners manage their client's wealth portfolios. The increasing wealth of the baby--boomer generation and those that follow make this process more important than for earlier generations. (4) To help students prepare for the Certified Financial Planner certification exams.FINSV 420 is an additional course in the Financial Services Option of the Bachelor of Science in Business (BSB) program. It is a relatively sophisticated course and students who select FINSV 420 will complete it only after completing courses in investments, insurance, and taxes.Evaluation will normally take the form of examinations, a research project, and class participation. At most campuses, the course will be offered once per year.", "prerequisite": "FINSV400 , FINSV411"}]