[{"course_name": "HDFS 97: Special Topics", "department": "Human Development and Family Studies (HDFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HDFS 101N: Helping People: Introduction to Understanding Social Problems & How to Help", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This inquiry-based course introduces students to the dynamic world of helping through the exploration of \"hot topics\"/pressing social issues. Exploration will highlight core themes of lifespan human development, lives in context, and the ethics of care as well as integrate how to use concept maps to understand complex social issues and identify policies and interventions to help. While discussion and exploration of hot topics may extend to address international contexts and applications, exploration will primarily grounded in exploring issues within the U.S. By the end of the semester, students should develop the skills and knowledge needed to independently learn about and find ways to help address the pressing social issues that interest them.", "other": ["United States Cultures (US)", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HDFS 101S: \"Helping People:\" Introduction to Understanding Social Problems & How to Help", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This inquiry-based course introduces students to the dynamic world of helping through the exploration of \"hot topics\"/pressing social issues. Exploration will highlight core themes of lifespan human development, lives in context, and the ethics of care as well as integrate how to use concept maps to understand complex social issues and identify policies and interventions to help. By the end of the semester, students should develop the skills and knowledge needed to independently learn about and find ways to help address the pressing social issues that interest them. Additionally, students are guided to engage and develop their own next steps for how to help address the issues they feel most passionate about - whether that's as an engaged citizen, volunteer, or helping professional. Students will be guided to think about and explore their interests and opportunities for engagement and how these connect to undergraduate educational and engaged learning opportunities. Throughout, students will be introduced to and guided to explore of to leverage learning and helping opportunities, tools, and resources available at Penn State to get the most out of the their undergraduate experience.", "other": ["First-Year Seminar", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HDFS 108N: Art and Science of Human Flourishing", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This course offers students the opportunity to explore human flourishing - defined as a life of deep meaning, fulfillment and service to others. Students will be taught about flourishing through the lens of science, philosophy, and their own experience. Through exposure to diverse scientific theories and research on the skills associated with flourishing, to philosophical and religious writings on human happiness and wellbeing, and to various reflective exercises and contemplative practices (e.g., mindfulness and compassion meditation), students will develop conceptual knowledge, experiential insight, and practical skills related to flourishing. The course begins by introducing a conceptual framework that defines flourishing in terms of foundations, domains and dimensions. First, students will learn about the foundations of flourishing in terms of the unique human capacities for reflection, resilience and transformation. Second, students will learn about four major domains and related dimensions that characterize flourishing, including the domains of awareness (e.g., focus, emotion, mindfulness), connection to others (e.g., interdependence, compassion, diversity), wisdom (identity, aesthetics, values) and integration of one's values and intentions in everyday living (e.g., courage, performance).Together, in a supportive and highly experiential learning environment, students will be encouraged to envision, articulate and pursue their own unique path to flourishing during their time in college and beyond based on their intellectual and experiential learning in the course. By the end of this course, students are able to: (I) Demonstrate foundational knowledge, including the ability to analyze and describe the relevant concepts and theories in multiple intellectual fields on the nature and cultivation of human flourishing, and the ability to recognize the possibilities, value, and relevance of cultivating personal flourishing in their own lives in relation to flourishing in social relationships, communities, and institutions; (II) Experience deep engagement in terms of being familiar with the basic personal experiences relating to individual qualities of human flourishing in order to make personal sense of them, and master individual practices for assessing and developing them; and (III) Understand real-world applications in terms of acquiring skills, sensibilities, and perspectives relating to individual qualities of human flourishing, which they are able to apply in the diverse contexts of their lives", "other": ["General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HDFS 129: Introduction to Human Development and Family Studies", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Introduction to psychosocial and family development at all stages of the individual and family life cycle. Students may take only one course for General Education credit from SOC 30 or HDFS 129. HDFS 129 Introduction to Human Development and Family Studies (3) (GS)(BA) This course meets the Bachelor of Arts degree requirements. This course provides a basic introduction to the concepts, theories, and research on human development as it occurs over the life span and in context. Students will be introduced to developmental tasks and challenges unique to each stage of human development from the womb through infancy, early and middle childhood, adolescence, emerging adulthood, middle age and old age. Beginning with the prenatal state and infancy, students will be introduced to the biological, emotional, cognitive, psychosocial, as well as the social, cultural and historical factors that influence growth and development across infancy, childhood, adolescence, adulthood, and advanced adulthood. Students will be introduced to basic concepts, theoretical orientations, and key empirical studies that inform human growth and development. Furthermore, attention is given to the central role of families and family life as a context for development. The formation of intimate relationships, marriage, marital processes, motherhood and fatherhood will be reviewed, as well as problems and challenges that families face such as financial stress, separation and divorce, abuse, and caregiving. Finally how families and family behavior are influenced by their communities, the larger culture, and other social and economic forces will be discussed.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "HDFS 129S: Introduction to Human Development and Family Studies", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Introduction to psychosocial and family development at all stages of the individual and family life cycle.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "HDFS 175N: Introduction to Youth Development and Arts-based Social Justice", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Youth Development and Arts-based Social Justice is an inter-domain course (GA/GS) intended to help students develop a critical understanding of the ways that sociopolitical factors influence youth development. The course will examine youth development as an indicator of broader community development and explore the inter-dependencies between the two by drawing both from the interdisciplinary fields of youth development and arts-based social justice. This course will assess the proposition that goals of social equity at the community, metropolitan, or regional scale cannot be achieved unless disparities in youth development are also addressed. Students will learn to read, interpret, discuss, and integrate information from the arts and social sciences. We will primarily, but not exclusively, focus on youth-led organizing and social justice movements as sites of youth development wherein young people have utilized the arts to mobilize and transform public policy, determine the destiny of their communities and challenge injustice (e.g., mass incarceration, educational inequality, and forced relocation). We will explore key concepts, theories, models, and examples of youth development and youth organizing from the perspectives of youth and adults who are actively engaged in building progressive movements for social justice through the arts. Throughout this exploration, we will pay close attention to issues of identity, culture, community, and politics. Students in this course will be introduced to key ideas and dispositions for working with diverse youth populations through a social justice lens. Students will engage in critical thinking based on their own identities, values, experiences and perspectives while also practicing deliberate and strategic open-mindedness rooted in the awareness of the personal and political limitations. Students will reflect upon their own developmental experiences and the contexts in which these played out in their weekly sketchbook entries and the two papers. The course will consider the mutual impact that arts and social movements have on each other. This will be assessed through classroom dialogue, students' sketchbooks and the integrative creative action project. The historical and theoretical materials will be contextualized by guest lectures, discussions, and performances involving visiting scholars, artists and activists.", "prerequisite": "ENGL 15", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HDFS 197: Special Topics", "department": "Human Development and Family Studies (HDFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HDFS 200: Quantitative Skills for Human Services", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This course introduces students to the quantitative methods used in human service careers emphasizing the implementation and interpretation of quantitative procedures in human service program settings. Students will obtain an understanding of programming basic Microsoft Excel calculations used to manage and analyze data; budgeting required in human service settings; interpreting descriptive and foundational inferential statistics; using quantitative statistics for program evaluations, producing charts and graphs for presenting information to community shareholders and funding agencies, and using output from statistical software to guide conclusions about human service program effectiveness.", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "HDFS 210Z: Ethnicity, Health and Aging", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "The study of health and aging among persons from diverse race populations is not only the study of how people of different racial groups age, but also the contexts in which these populations function physically, psychologically, and socially. This course will allow students to develop a better understanding of the aging process across racial/ethnic populations and how differences in adult and aging development can be affected by social structures. Furthermore, the course is designed to encourage students to transfer learned material into modifying existing or developing new practical solutions to reduce aging and health disparities. This course will cover multiple areas, such as: (1) Overview of the concepts regarding race, ethnicity, and culture; (2) Aging demographics; (3) Research methods in aging and racially diverse populations; (4) Health Disparities (e.g., physical and mental health); (5) Family, work, and retirement; (6) Aging in neighborhoods; (7) Policy. In-class lectures will be provided to cover the material. Students will be asked to complete assignments, exams, and a final project. HDFS 210Z is a linked course, students may choose to link to either SOC 210Z or SOC 211Z", "other": ["General Education: Health and Wellness (GHW)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "HDFS 216: Personal and Interpersonal Skills", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Conceptions of lifespan personal and interpersonal skill enhancement."}, {"course_name": "HDFS 229: Infant and Child Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Theory, research, and methods of social/behavioral/biological sciences related to developmental processes and intervention during infancy and childhood. HD FS 229 Infant and Child Development (3) (GS)(BA) This course meets the Bachelor of Arts degree requirements. This course introduces students to the study of children from the prenatal period to (not including) adolescence. Students will become familiar with the most prominent theoretical ideas about child development. The latest research on prenatal development, infancy, early and middle childhood will inform the discussions, and students will become familiar with key studies. The major domains of children's functioning covered include social interactions and emotional development, cognitive changes and acquisition of language, physiological growth in infancy and biological changes that underlie the transition out of childhood into adolescence. A key feature of this course is how processes in these different domains interact to influence children's overall adaptation. Finally, informed by a life course developmental framework, this course will place these developmental processes in context. Students will become familiar with the theoretical and empirical literature that locates children's growth and development in the context of families and family change, peer groups, neighborhoods and communities, and the larger cultural context within which they are embedded.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "HDFS 229H: Infant and Child Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Theory, research, and methods of social/behavioral/biological sciences related to developmental processes and intervention during infancy and childhood.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "Honors"]}, {"course_name": "HDFS 230: Overview of Curricular Practices in Early Childhood Care and Education", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Curricular practices in programs for infants, toddlers and preschoolers. Focus on developmentally appropriate practice, emergent curriculum and home/child care links.  HD FS 230 Overview of Curricular Practices in Early Childhood Care and Education (3) This course, intended for current or future providers of early childhood care and education, examines curricular practices in programs for young children. It is required for the proposed Early Childhood Care and Education option to the associate degree in Human Development and Family Studies.The course addresses current practices in early childhood care and education programs for infants, toddlers, and preschoolers. After a brief examination of the history of early childhood care and education, this course focuses on the use of developmentally appropriate activities and strategies to maximize children's positive growth and development. Each of the traditional early childhood curricular areas (involving physical, social, emotional, cognitive development) is considered, as is the importance of the connection between families and early care and education settings. Reading and discussion in each curricular area stresses diversity issues and inclusion of children with special needs in groups with normally developing children. There is an emphasis on applications of the project approach and emergent curriculum as appropriate for use with infants, toddlers and preschoolers.Students show mastery of the course material through tests over each topic of discussion, reports on outside reading related to current issues in early childhood care and education, individual and small group presentations about a specific curricular issues, and use of a reflective journal.The course will be offered once each academic year, with an enrollment of 15-25 students.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 231: Guidance in Early Childhood Care and Education", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Positive guidance methods for infants, toddlers and preschoolers, leading to self-control and social capability.  Includes focus on home/childcare links.  HD FS 231 Guidance in Early Childhood Care and Education (3) This course, intended for current or future providers of early childhood care and education, examines guidance methods for use with young children. It is required for the proposed Early Childhood Care and Education option to the associate degree in Human Development and Family Studies.The course emphasizes the use of guidance techniques that help children grow in independence, responsibility, self-control, and ability to function as group members. It addresses organization and guidance methods that foster the child's responsibility, independence, positive social interactions and emotional self-control. While the course covers various types of guidance, it emphasizes responding to children with respect and acceptance, using positive discipline. Since guidance is an area in which families and teachers frequently must confer, this course also deals with the use of effective parent-teacher communication skills. It requires weekly experience with young children.Each student will produce a portfolio demonstrating understanding of guidance techniques and their theoretical backgrounds. In addition, portfolios will demonstrate evidence of competence in analyzing the early childhood care and education environment in terms of its effect on young children's behavior, as well as competence in solving environmental problems that contribute to guidance issues. Portfolios will also demonstrate evidence of competence in communicating with parents and families about guidance issues. Students will reflect, in writing, on their own use of developmentally appropriate guidance techniques in their work with young children.The course will be offered once each academic year, with an enrollment of 15-25 students.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 232: Creativity and Play in Early Childhood Care and Education", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Planning for play, creativity and exploration in programs for infants, toddlers and preschoolers.  Includes focus on home/childcare links.  HD FS 232 Creativity and Play in Early Childhood Care and Education (3) This course, intended for current or future providers of early childhood care and education, examines the development of play and creativity in young children. It is required for the proposed Early Childhood Care and Education option to the associate degree in Human Development and Family Studies.The course addresses the potential of play, creativity, and exploration in the optimal development of a child. Content includes the development of play, creativity, and aesthetics. The course emphasizes adult-child interaction styles and activities that encourage, enhance and expand play, exploration and creativity in infants, toddlers, and preschoolers throughout the daily care and education routine. There is an emphasis on effective communication with families regarding the benefits of play and open-ended activities. It requires weekly experience with young children.Each student will develop a portfolio that demonstrates understanding of the development of play, exploration and creativity in the early years, as well as competence in planning for and enhancing that development. The portfolio will also show evidence of competence in communicating with parents and families.In addition to the portfolio, the student will develop an activity card file containing ideas for developmentally appropriate play and creative activities for infants, toddlers, and preschoolers. Each student will participate in individual and group presentations related to course topics, and will take tests covering reading and other class material.The course will be offered once each academic year, with an enrollment of 15-25 students.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 233: Emergent Language and Literacy: Development and Practice in Early          Childhood Care and Educat", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Fostering development of language and literacy in infants, toddlers and preschoolers.  Includes children's literature and focus on home/childcare links.  HD FS 233 Emergent Language and Literacy: Development and Practice in Early Childhood Care and Education (3) This course, intended for current or future providers of early childhood care and education, examines the emergence of language and literacy. It is required for the proposed Early Childhood Care and Education option to the associate degree in Human Development and Family Studies.The course emphasizes why and how to foster continuous development from first sound through recognizable speech; from initial symbol recognition through reading; from making the first mark through writing. Content also includes choosing literature appropriate for use with infants and young children and methods of integrating literature throughout the daily child care and education routine. There is a focus on developing activities centered on language and literature, and an emphasis on effective communication with parents and families. This course requires weekly experience with young children.Students will produce a portfolio demonstrating understanding of language and literacy development, competence in planning developmentally appropriate language and literacy activities for infants and young children, and competence in evaluating child care settings in terms of support for emergent language and literacy. Portfolios will also demonstrate evidence of competence in choosing and using good literature with young children, and in communicating to parents and families the importance of facilitating early language and literacy.In addition to the portfolio, students will develop files of language and literacy activities appropriate for use with infants and young children. They will also take tests related to reading and material covered in class.The course will be offered once each academic year, with an enrollment of 15-25 students.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 234: Mathematics and Science Reasoning: Development and Practice in Early       Childhood Care and Educat", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Fostering development of mathematical reasoning and scientific inquiry in infants, toddlers and preschoolers.  Includes project approach and focus on home/childcare links.  HD FS 234 Mathematics and Science Reasoning: Development and Practice in Early Childhood care and Education (3) This course, intended for current and future providers of early childhood care and education, examines the emergence of mathematics and science reasoning. It is required for the proposed Early Childhood Care and Education option to the associate degree in Human Development and Family Studies.The course addresses processes involved in mathematical reasoning and scientific inquiry. It emphasizes the development of activities, questioning skills, and observation and documentation techniques that extend infants' and young children's exploration, discovery, and thinking patterns. Content also includes methods of integrating mathematics, science and reasoning activities throughout the daily child care and education routine. Participation in the project approach provides students with an experiential understanding of constructing knowledge. There is also an emphasis on effective communication with parents and families. This course requires weekly experience with young children.Students will produce a portfolio demonstrating understanding of the development of mathematics and science reasoning in the very early years and competence in planning developmentally appropriate mathematics, science, and logical thinking activities for infants and young children. Portfolios will also demonstrate evidence of competence in communicating to parents and families the importance of exploration and discovery in facilitating young children's mathematics and science knowledge. Students will reflect, in writing, on their own growth in knowledge and competence in facilitating young children's thinking.In addition to the portfolio, students will develop files of mathematics and science reasoning activities appropriate for use with infants and young children. They will also take tests related to reading and materials covered in class.The course will be offered once early academic year, with an enrollment of 15-25 students.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 239: Adolescent Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This course provides a basic introduction to concepts, theoretical perspectives, and key empirical studies on adolescent development. Students will become familiar with key developmental trends and challenges that must be addressed to achieve healthy growth and development from the beginning of adolescence (puberty) up to the transition to adulthood. The course addresses biological changes (hormones, brain development), cognitive changes (abstract thinking, information processing) and social changes (families, peers, school, work); and the implications of these changes for issues such as identity development, autonomy, intimacy, sexuality and achievement. For each topic, students will become familiar with major theoretical frameworks, approaches to empirical research, and findings from empirical studies. Key features of this course are its attention to: how biological, cognitive and social changes combine to influence adolescents' overall adaptation; the ways in which adolescent development occurs in the context of families, peer groups, neighborhoods and communities, and the larger cultural context; and how theories and empirical findings can be applied to promote healthy adolescent development. Students pursuing the HDFS major must complete HDFS 129N plus two of the three 200-level developmental courses (HDFS 229, HDFS 239, HDFS 249N). This course may count toward the minor in HDFS. Students who are not pursuing a major in Human Development and Family Studies can apply credits from this course towards the General Education Social and Behavioral Sciences (GS) knowledge domain.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "HDFS 249N: Adult Development and Aging", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This course provides a basic introduction to concepts, theoretical perspectives, and key empirical studies on adult development and aging. Students will become familiar with key developmental trends and challenges that must be addressed to achieve healthy growth and development throughout adulthood and late life. The course addresses changes in physical health, cognition, and psychosocial functioning (including mental health, social roles and relationships, and transitions in work and retirement); and the implications of these changes for issues such as risk of disability, dementia, caregiving, and end-of-life decisions. For each topic, students will become familiar with major theoretical frameworks, approaches to empirical research, and findings from empirical studies. Key features of this course are its attention to: how biological, cognitive and social changes combine to influence overall adaptation and throughout the aging process; the ways in which adult development and aging occurs in the context of families, social relationships, neighborhoods and communities, and the larger cultural context; and how theories and empirical findings can be applied to promote healthy adult development and aging. Students pursuing the HDFS major option must complete HDFS 129 plus two of the three 200-level developmental courses (HDFS 229, HDFS 239, HDFS 249N). This course may count toward the minor in HDFS. Students who are not pursuing a major in Human Development and Family Studies can apply credits from this course towards the General Education Integrative Studies requirement: as an Inter-domain Course, the course puts approximately equal emphasis on learning objectives for Social and Behavioral Sciences (GS) and for Health & Wellness (GHW) knowledge domains.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "HDFS 250: Sexual Identity over the Life Span", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Concepts of affectional and sexual orientation over life span, with emphasis on lesbian and gay male personal, family, and community adaptation.  HD FS (WMNST) 250 Sexual Identity over the Life Span (3) (US) This course reviews concepts of sexual identity as informed by a human development perspective. Concepts of sexual orientation are discussed in the context of a review of lesbian, gay male, and bisexual lives. Developmental processes of lesbian and gay life are detailed: personal change from the teenage years through adulthood, changes in family and relationship patterns, and impact of communities, laws, and culture. These processes are contrasted to the developmental processes of women and men who identify themselves as heterosexual. The complex effect of gender, race, ethnicity, class status, and historical time on sexual orientation and its expression has generated ongoing controversies in scholarship as well as in public discourse. The course will be an introduction to these controversies as informed by human development research.", "prerequisite": "3 credits in ANTH or BBH or CAS or COMM or CRIM or CRIMJ or GEOG or HDFS or HIST or PSYCH or SOC or WMNST", "other": ["Cross-listed with: WMNST 250", "United States Cultures (US)"]}, {"course_name": "HDFS 250H: Sexual Identity Over The Lifespan", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "CONCEPTS OF AFFECTIONAL AND SEXUAL ORIENTATION OVER LIFESPAN, WITH EMPHASIS ON LESBIAN AND GAY MALE PERSONAL, FAMILY, AND COMMUNITY ADAPTATION.", "other": ["Cross-Listed", "Honors"]}, {"course_name": "HDFS 254N: Reading Our Lives: Understanding Diversity and Human Development through Memoirs", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Students will explore the way people and their environments interact to influence human development through the integration of memoirs and other personal narratives, humanist themes and methods of inquiry, and social science theory and research. The personal narratives will expose students to the diversity of human experience including differences in gender, race, socioeconomic status, cultural and historical contexts. To frame and inform discussions of each memoir, students will examine relevant social science theories and research. The social science material will include key developmental frameworks such as lifespan development and ecological systems theory, and micro- and maco-level contextual factors influencing development, such as interpersonal relationships, cultural norms, and structural constraints. Students will also examine core humanist themes relevant to each memoir, such as values, cultural relativism vs. universalism, narratives and objective facts, structure and agency. Students will learn to read, interpret, and integrate information from the humanities and social sciences. They will learn to critically reflect on their own experiences, perceptions, and values, while developing an understanding of other people's experiences, perceptions, and values. Students will also learn to engage in compassionate, informed, and knowledge-generating discussions to understand the complexity of human experiences.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "HDFS 258N: Introduction to Child Maltreatment and Advocacy Studies", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Introduction to the multidisciplinary field of child maltreatment.  CMAS (HD FS) 258 Introduction to Child Maltreatment and Advocacy Studies (3) This course will focus on the identification, investigation, service, advocacy, prosecution, and prevention of child maltreatment as well as the treatment of adverse health outcomes for children who have been maltreated. Specific topics include the causes, correlates, and consequences of child maltreatment, best practices for reporting and investigating an allegation of child maltreatment, evidence-based prevention and intervention programs, the Child Welfare System, and relevant legal issues (e.g., termination of parental rights, children's testimony in court, etc.). By definition, this course will detail issues related to the abuse and neglect of children. This material can be difficult to hear, view, and discuss. This course is a required course, and a prerequisite for all advanced courses, for a Minor in Child Maltreatment and Advocacy Studies.", "other": ["Cross-listed with: CMAS 258N, SOC 258N", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HDFS 287W: Intercultural Community-Building", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "An experiential introduction to negotiating differences in small groups, families, institutions, and communities.  HD FS 287W Intercultural Community -Building (3) (GS;US) This course provides students an experiential introduction to how individuals and families both affect and are affected by the various cultural/community contexts in which they develop, including schools, places of work, and youth and community programs. Students will identify and explore their own unique and shared assumptions, and the relationships between those assumptions and life histories and experiences. They will become aware of the dynamics of how communities are formed and function by forming a community themselves, and through involvement in a local community group or agency. Group discussions and written reflections will link their personal experiences to theory and research presented in class and readings on such topics as developing systems theories, cultural communication theories, and decision-making. The goals of the course are to increase students' understanding of the relations between values, power relations, and the various processes of social change, and encourage the development of communication skills and citizenship. Special emphasis will be placed on developing relationships within culturally and ethnically diverse groups. Because it is designated as a writing intensive course, particular attention will be given to the development of written communication skills. Students will be evaluated on the basis on their performance in several areas, which may include examinations and quizzes, several writing assignments, and participation in class discussions and simulations. The course may be delivered at certain Commonwealth College campuses and Altoona College. Depending on location, the course may be offered during the fall, spring and/or summer sessions, with anticipated class enrollments of 12-20 students.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "Writing Across the Curriculum"]}, {"course_name": "HDFS 287Y: Intercultural Community-Building", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "An experiential introduction to negotiating differences in small groups, families, institutions, and communities.  HD FS 287Y Intercultural Community -Building (3) (GS;US) This course provides students an experiential introduction to how individuals and families both affect and are affected by the various cultural/community contexts in which they develop, including schools, places of work, and youth and community programs. Students will identify and explore their own unique and shared assumptions, and the relationships between those assumptions and life histories and experiences. They will become aware of the dynamics of how communities are formed and function by forming a community themselves, and through involvement in a local community group or agency. Group discussions and written reflections will link their personal experiences to theory and research presented in class and readings on such topics as developing systems theories, cultural communication theories, and decision-making. The goals of the course are to increase students' understanding of the relations between values, power relations, and the various processes of social change, and encourage the development of communication skills and citizenship. Special emphasis will be placed on developing relationships within culturally and ethnically diverse groups. Because it is designated as a writing intensive course, particular attention will be given to the development of written communication skills. Students will be evaluated on the basis on their performance in several areas, which may include examinations and quizzes, several writing assignments, and participation in class discussions and simulations. The course may be delivered at certain Commonwealth College campuses and Altoona College. Depending on location, the course may be offered during the fall, spring and/or summer sessions, with anticipated class enrollments of 12-20 students.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "Writing Across the Curriculum"]}, {"course_name": "HDFS 296: Independent Studies", "department": "Human Development and Family Studies (HDFS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "HDFS 297: Special Topics", "department": "Human Development and Family Studies (HDFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HDFS 298: Special Topics", "department": "Human Development and Family Studies (HDFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HDFS 300: Honors Seminar:  Concepts and Issues in Human Development and Family       Studies", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Introduces core concepts and issues in the study of Human Development and Family Studies.", "prerequisite": "HDFS 129", "other": ["Honors"]}, {"course_name": "HDFS 301: Values and Ethics in Health and Human Development Professions", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Examines bases for choices among values in personal and professional relations in human development processes and supporting services."}, {"course_name": "HDFS 302A: Leadership and Technology Skills for Human Services Professionals A", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Development of skills essential for contemporary human services professionals, including critical thinking, problem solving, electronic communications, and information handling.", "prerequisite": "HDFS 129"}, {"course_name": "HDFS 310M: Seminar in Honors--Research Methods", "department": "Human Development and Family Studies (HDFS)", "credits": "4 Credits", "description": "Overview of research and methods issues tailored around development of honors thesis proposals. HDFS 310 Seminar in Honors--Research Methods is designed to cover all of the elements in designing a research project. Through a series of written projects, students study the scientific method, research question development, and tools and techniques for data gathering and analysis. The course covers how to take a theory about human development and family studies and develop testable hypotheses/research questions. Students learn the basic skills needed for managing and understanding data; analyzing data; and presenting data. Then, students use real data to practice data management, data analysis, and reporting on data in both oral and written forms.", "prerequisite": "Permission of Human Development and Family Studies honors adviser", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "HDFS 311: Human Development and Family Studies Interventions", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Survey of individual and family formal and informal intervention efforts; historical and current perspectives and approaches.", "prerequisite": "HDFS 129"}, {"course_name": "HDFS 312W: Empirical Inquiry in Human Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Introduction to the skills involved in critical thinking in general and the methods of empirical inquiry in particular. Open to HD FS majors only.", "prerequisite": "EDPSY 101", "other": ["Writing Across the Curriculum"]}, {"course_name": "HDFS 313: Empirical Inquiry in Human Development for Non-Majors", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Introduction to the skills involved in critical thinking in general and the methods of empirical inquiry in particular.  HD FS 313 Empirical Inquiry in Human Development for Non-Majors (3) The main purpose of this course is to help students become informed and critical consumers of scientific research. Throughout the course, they will develop the critical thinking skills necessary to understand scientific inquiry in the field of Human Development. This course will serve as an introduction on how the tools of the scientific method can be used to understand human behavior, developmental processes, and modification of those processes. Students are encouraged to develop their critical capacities through a process that involves learning basic components of empirical inquiry, such as study design, measurement approaches, and sampling strategies, and applying their understanding of those components to evaluate the conclusions of research studies. Students will be exposed to quantitative and qualitative approaches as well as information on intervention and applied research. The course will consist of lectures and class exercises.", "prerequisite": "EDPSY 101"}, {"course_name": "HDFS 314: Understanding Human Development and Family Research", "department": "Human Development and Family Studies (HDFS)", "credits": "1 Credits", "description": "Students who complete HDFS 314 will have a broad understanding of the methodological principles and the techniques used to measure human and family behavior. Students will also acquire an understanding of how statistics, reading, and writing research are integrated together for a complete learning experience. By the end of the semester, students will have gained a supplementary understanding of the research process. Students who successfully complete HDFS 314 will have become proficient (1) in the use of standard methodological terminology related to HDFS research. (2) in the use reference managing software (such as Zotero or Mandalay). (3) using software for family data collection (such as Qualtrics, SPSS, or Excel). (4) recording and reporting family data collected from \"participants.\" (5) analyzing family data sets through the use of standard statistical analysis."}, {"course_name": "HDFS 315: Family Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Family functions over the life course; family from a multidisciplinary perspective, emphasizing adaptation and change. HDFS 315 Family Development (3) (US) This course offers an overview of families focusing primarily on contemporary American families. The primary thrust of this course is to step beyond our personal experiences with families and place them within a broader social, historical, cultural and economic context. This class will be multi-disciplinary in its approach to the study of American families. However, we will begin with the historical, demographic and social changes that American families have undergone and try to understand some of the causes and consequences of these changes for the developmental life course of adults and children in families today. Throughout this course we will be particularly concerned with the diversity of American families stressing differences based on gender, race and ethnicity, and socioeconomic status.", "prerequisite": "HDFS 129", "other": ["United States Cultures (US)"]}, {"course_name": "HDFS 315Y: Family Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Family functions over the life course; family from a multidisciplinary perspective, emphasizing adaptation and change. HDFS 315Y Family Development (3) (US) This course offers an overview of families focusing primarily on contemporary American families. The primary thrust of this course is to step beyond our personal experiences with families and place them within a broader social, historical, cultural and economic context. This class will be multi-disciplinary in its approach to the study of American families. However, we will begin with the historical, demographic and social changes that American families have undergone and try to understand some of the causes and consequences of these changes for the developmental life courses of adults and children in families today. Throughout this course we will be particularly concerned with the diversity of American families stressing differences based on gender, race and ethnicity, and socioeconomic status.", "prerequisite": "HDFS 129", "other": ["United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "HDFS 330: Observation or Experience with Children, Youth, and Families", "department": "Human Development and Family Studies (HDFS)", "credits": "1-6 Credits", "description": "Directed observations of, or supervised experience with children, youth, and families in group or home settings.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 345: CONTEMPORARY URBAN ISSUES AND SOCIAL JUSTICE FRAMEWORKS", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits/Maximum of 3", "description": "The discipline of Human Development and Family Studies has a tradition of culturally sensitive engagement within communities, helping to improve quality of life by applying and disseminating knowledge about development across the lifespan, all in their larger social contexts. Issues of social justice and equity play an integral role in defining the questions that Human Development and Family Studies students ask and the solutions that they pursue, as students must account for diverse needs and values based on age, gender, ethnicity and cultural background. Students preparing to work in the field of Human Development and Family Studies must possess the content, pedagogical and professional knowledge, skills, and dispositions necessary to work in diverse communities. HDFS 345 is an opportunity for students to explore the relationship between contemporary urban issues and family development. Participants will evaluate urban development from a Human Development perspective and with a critical eye to how urban development has accounted for the distinctive needs of different segments of the public. Therefore, HDFS 345 incorporates the knowledge of different Human Development and Family Studies theories and social justice paradigms to help students examine urban themes and build their understanding of social justice and family development as related to these themes. Students will learn how urban planning accounts for differences in society, identify different segments of the urban population differentiated by a few diversity constructs (culture, race, SES, gender, etc) and gain awareness of the varying and distinctive needs and concerns of these groups with respect to living in the urban environment. Students will also explore contemporary issues, like modern policing practices, and find resources to develop solutions to social issues or problems. Discussions of policy and moral philosophy will contribute to students' aptitude to plan an appropriate solution with tangible results. Ultimately, students are expected to leave the course with geographically-informed conceptualizations of social justice and insight into how individuals, families and organizations can work within urban communities as collaborators and partners.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "HDFS 395: Internship", "department": "Human Development and Family Studies (HDFS)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "HDFS 397: Special Topics", "department": "Human Development and Family Studies (HDFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HDFS 400: Youth Development and Social Justice Capstone Seminar", "department": "Human Development and Family Studies (HDFS)", "credits": "4 Credits", "description": "This course will immerse students in theories, historical contexts, and practices of structural oppressions that influence youth development, and responses to them through youth empowerment, democratic action, and popular education in communities through study, reflection and, most importantly, on-site partnership field placement with an urban youth worker or agency, such as in a school or community organization. Specifically, you will work with various community-based organizations in partnerships set up by the Penn State Faculty that are local exemplars of democratic action with and for youth development, working closely with professionals affiliated with those programs to support their work and learn from them. HDFS 400 is a community engaged and culture of support course. Community engagement, also called service learning, is a form of reciprocal experiential education wherein students learn through the collaborative process of meeting authentic community needs. High quality community engagement also attempts to affect real, material social conditions; to authentically integrate the work done to meet community needs with the curriculum/course through continuous, critical reflexive and reflective inquiry; and to be a system of praxis (theory - practice) where the inquiry then informs the work participants do, participants' self-concepts, and the practices of the community. The field, reading, in class and written work will reflect these principles", "prerequisite": "HDFS 175N"}, {"course_name": "HDFS 401: Project Planning, Implementation, and Evaluation in the Human Services", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Exercises and activities related to the design, planning, implementation and management, and evaluation of projects and programs in the human services.  HD FS 401 Project Planning, Implementation, and Evaluation in the Human Services (3) HD FS 401 is part of a sequence of courses that develop skills and competencies of the human services student. The course emphasizes the further development of communication skills, diversity skills, team-building skills, critical thinking skills, and technology and leadership skills. Intended to be completed prior to the internship experience, the course will initially focus students' efforts on the identification of a field-based human services project or program, and a setting within which it could be carried out. Subsequently, students will design and plan the project or program, examine and propose effective implementation and management procedures, and incorporate state-of-the art evaluation procedures into the design.", "prerequisite": "HDFS 312W"}, {"course_name": "HDFS 402: Human Services Seminar", "department": "Human Development and Family Studies (HDFS)", "credits": "4 Credits", "description": "Presentations and discussion of contemporary human issues by students and visiting professionals.", "prerequisite": "HDFS 401"}, {"course_name": "HDFS 405: Gender and Social Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "A REVIEW OF GENDER-RELATED PATTERNS OF SOCIAL DEVELOPMENT OVER THE LIFESPAN, AS INFLUENCED BY BIOLOGICAL, SOCIOLOGICAL, AND PSYCHOLOGICAL FACTORS.", "prerequisite": "HDFS 129", "other": ["United States Cultures (US)"]}, {"course_name": "HDFS 410: Communities and Families", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Family and community interaction, emphasizing strategies for intervention to solve family-community problems.", "prerequisite": "HDFS 312W"}, {"course_name": "HDFS 411: The Helping Relationship", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Theory and research related to interpersonal conditions which facilitate personal growth; intensive interpersonal competency training.", "prerequisite": "HDFS 311"}, {"course_name": "HDFS 412: Adult-Child Relationships", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Theories, research, and application of adult behavior for maximizing adult- child relationships and optimizing child socialization and self-development.", "prerequisite": "PSYCH 212"}, {"course_name": "HDFS 413: Developmental Problems in Adulthood", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Analysis of individual developmental problems from young adulthood through old age and their prevention and modification.", "prerequisite": "HDFS 129"}, {"course_name": "HDFS 414: Resolving Human Development and Family Problems", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Strategies for, and roles of professional specialists in, the solution of problems in human development and family functioning.", "prerequisite": "HDFS 312W"}, {"course_name": "HDFS 415: Program Development in Family Relationships", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Methods for planning, developing, and evaluating human service programs for families across the life span.", "prerequisite": "HDFS 311"}, {"course_name": "HDFS 416: Racial and Ethnic Diversity and the American Family", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This course will explore the nature and determinants of racial and ethnic variation in family processes in the United States.  HD FS 416 (SOC 411) Racial and Ethnic Diversity and the American Family (3) During the last several decades, the racial and ethnic composition of the U.S. population has changed dramatically. At end of the 20th century, non-Hispanic whites accounted for less than 75 percent of the U.S. population. While blacks remained the largest minority group, there were nearly as many Hispanics as blacks, and the number of Asians was increasing. Population projections indicate that by the middle of the 21st century, Hispanics will make up nearly one-fourth of the U.S. population. Blacks, Asians, and American Indians together will comprise an additional fourth of the population. The last several decades have also brought significant changes in family life in the United States, including declining rates of marriage, a rising age-at-marriage, an increase in cohabitation, and a dramatic rise in the proportion of births outside of marriage. While these trends in family life have been experienced by all racial and ethnic groups, there is substantial variation in family patterns by race and ethnicity. The course will build on other courses in social inequality and the family. The course does not overlap with any existing courses in the Department of Sociology or with courses offered in other relevant departments.This course will explore the nature and determinants of racial and ethnic variation in family processes in the United States. The student will read articles from major sociological journals and learn to extract major points and issues. He/she will learn to synthesize and critique various arguments on major issues in the field. The student will acquire skills in summarizing and evaluating arguments in essay form. He/she will also develop oral presentation skills. Final grades for the course will be based on class participation, a brief (approximately 5 pages) paper, a group presentation, a midterm examination (essay format) and a final examination (essay format). The course is not required for the Sociology minor or major. However, the course can count as one of the 400-level elective courses in Sociology for the Sociology minor, B.A. or B.S.", "prerequisite": "3 credits in SOC", "other": ["Cross-listed with: SOC 411", "United States Cultures (US)"]}, {"course_name": "HDFS 417: Biocultural Studies of Family Organization", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Study of variability in family organization with an emphasis on cultural and economic factors influencing household organization and family roles.", "prerequisite": "HDFS 129", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "HDFS 418: Family Relationships", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Dynamics of family interaction; effects of parenthood, sibling and intergeneration relationships on family solidarity.", "prerequisite": "HDFS 312W"}, {"course_name": "HDFS 420: Laboratory in Individual and Family Enhancement", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Supervised practice in methods of assessment, intervention, and evaluation to enhance individual and family development.", "prerequisite": "HDFS 312W"}, {"course_name": "HDFS 424: Family Development in an Economic Context", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Economic conditions influencing family functioning; familial effects on the economy; strategies to enhance work-family relations.", "prerequisite": "HDFS 312W", "other": ["United States Cultures (US)"]}, {"course_name": "HDFS 427: Developmental Sport & Exercise Psychology", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Developmental changes in the antecedents and consequences of physical activity across the lifespan.  HD FS (KINES) 427 Developmental Sport & Exercise Psychology (3)Change is constant with physical activity - our reasons for being active change across the lifespan an dour experiences with physical activity change how we view ourselves and those around us. Developmental Sport & Exercise Psychology focuses on developmental changes in the psychosocial antecedents and consequences of physical activity across the lifespan. Specific course objectives include (1) describing theoretical frameworks and methods used to study physical activity-related psychosocial development across the lifespan, (2) describing how self-perceptions develop and influence behavior in movement contexts at different points in life, (3) explaining how contextual factors influence developmental processes associated with physical activity, (4) identifying age-related differences in activity-related antecedents and consequences of physical activity, and (5) developing, reviewing, and critiquing theoretically-grounded interventions to address issues related to developmental processes associated with physical activity across the lifespan. Evaluation will be based on written examinations, submission of a series of reflection papers on reading assignments, a group presentation, and the students' engagement in the class. It extends but does not duplicate existing courses in the Department of Innersole, Human Development & Family Studies, and Psychology.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: KINES 427"]}, {"course_name": "HDFS 428: Infant Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Conceptual analysis, assessment, and empirical investigation of normal and deviant development, prenatal through first two years of life.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 429: Advanced Child Development", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Processes of development during childhood from birth to adolescence. Emphasis upon theory, method, and empirical research.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 430: Experience in Preschool Groups", "department": "Human Development and Family Studies (HDFS)", "credits": "1-6 Credits/Maximum of 6", "description": "Guided practicum experience in planning and facilitating developmentally appropriate activities for young children.  HD FS 430 Experience in Preschool Groups (1-6 per semester/maximum of 6) This course is intended to provide students with guided experience in interacting with young children and in designing and conducting developmentally appropriate activities for children in preschool groups. In addition to working with preschool children in preschool classrooms, students will meet weekly to discuss curriculum and activity planning, guidance techniques and issues relevant to providing quality preschool settings. Time will be set aside in each class period for open discussion of classroom experiences. Visits to campus preschool locations are planned to enhance the selection of appropriate teacher resources for curriculum development.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 431: Family Disorganization: Stress Points in the Contemporary Family", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Focuses on divorce, remarriage, incest, family violence as well as problems associated with family formation and parent-child relations.", "prerequisite": "6 credits in HDFS or 6 credits in PSYCH or 6 credits in SOC or (3 credits in HDFS and 3 credits in PSYCH) or (3 credits in HDFS and 3 credits in SOC) or (3 credits in PSYCH and 3 credits in SOC)", "other": ["Cross-listed with: SOC 431", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "HDFS 432: Developmental Problems in Childhood and Adolescence", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Analysis of problems in individual development from infancy through adolescence; prevention and modification of developmental difficulties.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 433: Developmental Transition to Adulthood", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Conceptual analysis and empirical investigation of interrelationships between developmental processes during the period of pubertal growth.", "prerequisite": "HDFS 239"}, {"course_name": "HDFS 433H: Developmental Transition to Adulthood", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Conceptual analysis and empirical investigation of interrelationships between developmental processes during the period of pubertal growth.", "other": ["Honors"]}, {"course_name": "HDFS 434: Perspectives on Aging", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "An analysis of the demographic, social, and cultural factors affecting the aged population in American society.", "prerequisite": "3 credits of sociology", "other": ["Cross-listed with: SOC 435", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "HDFS 440: Family Policy", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "An in-depth examination of family policy.  HD FS (SOC) 440 Family Policy (3)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed to provide an in-depth examination of family policy. Students will identify and critically analyze major issues, controversies, and policies that affect families. Attention will be devoted to recognizing both intended and unintended consequences of family policies and understanding policy challenges and trade-offs. Students will gain an understanding of how policies are shaped by both facts and myths, as well as our values. Students will examine historical and current trends in family patterns (e.g., divorce, women's labor force participation, nonmarital births) to understand the implications they hold for individuals, families and society. Students will gain an awareness of the social, economic, historical, legal, and political contexts within which family policies exist and are proposed. Although the main focus is on U.S. family policy, some time will be devoted to learning about family policies in other countries. We will learn about several specific family policies in-depth (e.g., welfare), but a final goal is to help students develop a general way of looking at family policy that they can then use to understand any issue of family policy that unfolds throughout their lifetime. This course will foster thoughtful reflection and critical thinking, writing skills, research skills, and skills of synthesis, logic, and argument. Course goals will be accomplished through course readings, writing assignments, lectures, class discussions, debates and group projects. Mastery of course material and student evaluation are assessed in several ways. Students will take a midterm and final exam that cover lectures, class discussions, and assigned readings. Two papers are also required. The first paper is based on an analysis of newspaper articles dealing with family policy issues that students will collect and relate to course materials. The second paper is a literature-based analysis of a family policy in a society outside the United States. Class participation is also essential and its evaluation will be based on a combination of class attendance, contributions to class discussions, participation in group debates and projects, and an oral presentation of the final paper on a non-U.S. family policy.", "prerequisite": "3 credits of SOC or HDFS", "other": ["Cross-listed with: SOC 440", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "HDFS 445: Development Throughout Adulthood", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Processes of development and change of behavior from early adulthood through old age, emphasizing theory, method, and empirical research.", "prerequisite": "HDFS 312W", "other": ["Cross-listed with: PSYCH 416", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "HDFS 446: Programs and Services in Gerontology", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Theoretical and historical views of the conceptualization and delivery of programs and services to older persons within a multidisciplinary developmental framework.", "prerequisite": "HDFS 445"}, {"course_name": "HDFS 447: Issues in Gerontology", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Analysis of major issues in adulthood and aging, with an emphasis on integration of theory and research.", "prerequisite": "HDFS 445"}, {"course_name": "HDFS 448: Death and Bereavement", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "The course takes a social and developmental perspective to illuminate an often hidden, but significant dimension of human development in the context of death-related encounters, attitudes, historical patterns, cultural variations, as well as the complexities of the American death system. In considering death-related patterns in society, it explores notable examples like 'human-induced death' (e.g., suicides, accidents and homicides), 'socially sanctioned death' (e.g., violence from war, genocide, and terrorism), and the characterization of death in daily discourse, the media, and present day death rituals. Key issues and questions from the field are discussed at both individual and societal levels, which include the meaning of death, facing death across the life-course, the sociocultural context of death, bereavement and grief, the death industry, and ethical and legal issues surrounding death. Examining the variegated meanings in different social institutional spheres, such as ethics, politics, mass media, and family from a social-scientific perspective, the course helps students recognize and appreciate that death and bereavement are deeply embedded into social and cultural structures of society, including how we learn about death, the typical ways in which our attitudes and beliefs are shaped, and how death and bereavement affect children, adolescents, adults, and older adults. It also addresses issues specific to death/dying in careers Human Development and Family Studies prepares for in terms of death education and bereavement counseling.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 452: Child Maltreatment Prevention, Intervention, and Legal Issues", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Examines causes, correlates, and consequences of child maltreatment, empirically supported prevention/intervention programs, the Child Welfare System and relevant legal issues.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 453: Family Participation and Involvement in Child Services", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Current and historical perspectives of roles and functions of family members in designing, delivering, and evaluating of child service programs.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 454: Development and Administration of Child Service Programs", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Planning, administering, and evaluating child service programs at several administrative levels using methods from relevant disciplines.", "prerequisite": "HDFS 312W", "other": ["Cross-listed with: ECE 454"]}, {"course_name": "HDFS 455: Development and Administration of Human Services Programs", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Fundamentals of program development and administration of human service programs in community settings; emphasis given to program content, strategies, and the overall planning process.", "prerequisite": "HDFS 311"}, {"course_name": "HDFS 465: Child Maltreatment: Prevention and Treatment", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Advanced examination in approaches for preventing child maltreatment and treating its consequences.  HD FS (CMAS) 465 Child Maltreatment: Prevention and Treatment (3) Child maltreatment, including physical abuse, sexual abuse, emotional abuse, and neglect, is a highly prevalent condition affecting nearly one million children each year in the United States alone. This course will delineate the long-term health consequences affecting those who have experienced child maltreatment with an emphasis on those outcomes exerting the greatest impact on overall public health throughout the lifespan. Importantly, a focus on the etiology of such health consequences in the child maltreatment population will be made in order to understand the causal pathways leading to these health consequences. This focus on etiology will serve as a segue into the remaining sections of this course, specifically the prevention and treatment of child maltreatment and its consequences. Universal and targeted prevention programs, where the focus is to prevent an initial instance of child maltreatment from occurring, will be detailed, as will tertiary prevention programs, where the focus is on preventing a re-occurrence of child maltreatment. Similarly, prevention of adverse health outcomes for those affected by child maltreatment will also be covered. Finally, evidenced-based interventions applied with children who have been maltreated and are currently experiencing clinical levels of impairment (e.g. post-traumatic stress disorder) will be detailed. Identification and rehearsal of treatment components commonly used in prevention and clinical intervention programs will be emphasized. Students successfully completing this course will have direct knowledge of the consequences of child maltreatment and the established methods used in prevention and intervention programs applied with this population.", "prerequisite": "CMAS 258N", "other": ["Cross-listed with: CMAS 465"]}, {"course_name": "HDFS 467: Autism: Providing Professional Support for Individuals and Families", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "This course emphasizes the professional development for students planning to pursue careers in the field of autism. Topics include the stresses and needs of families and siblings of children with Autism Spectrum Disorders (ASD), vocational and social challenges faced as individuals with ASD age into adolescence and adulthood, and techniques to aid parents in becoming effective advocates for their child's academic, social, and behavioral needs. Although the core symptomatology of ASD and empirically validated interventions are covered as foundational knowledge, these topics are not be the focus of this course. Rather, this course identifies the challenges and strengths likely to be encountered in the lives of families and individuals with ASD and provides current best practices to help clients navigate life with ASD.", "prerequisite": "HDFS 229"}, {"course_name": "HDFS 469U: Family Change in the Global Economy", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Exploration of how family life, quality, and structures in each region of the world are affected by the new global economy.  HD FS 469U Family Change in the Global Economy (3) (IL) We know that family life, structure, and practices undergo dramatic change when there are economic and political changes in the society. Economic globalization is unprecedented as a force for social and political change. How is it affecting family life and structures around the world? While we have considerable research on globalization and on family change, there has been little work that connects the two.This is an exploratory seminar that involves locating those linkages and discovering families in each world region are changing as they meet up with global economic forces. As we explore each world region, we will learn about diverse cultures and how they are affected by global forces. In the Americas, Africa, Asia, the Middle East and Europe this course uncovers new forms of inequality that are emerging from the global economy and having direct effects on women and families. Through it all, we explore how human action, in the family, the community and the society, struggles for quality of life in a global economic context.", "other": ["International Cultures (IL)", "Honors"]}, {"course_name": "HDFS 477: Analysis of Family Problems", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "Analysis of families' behavioral, managerial, interpersonal, and financial problems and their interrelationships.", "prerequisite": "HDFS 312W"}, {"course_name": "HDFS 485: Supporting Healthy Development: Understanding Systems, Successes, and Challenges", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "In this advanced, project-based course, each student will select a topic to study for an individual, semester-long project. Through interviews with people in their communities and reading academic literature, students will examine their topic in detail and explore the way individuals and contexts interact to influence development. Throughout the semester, students will be instructed on topics such as ecological systems theory, policy analysis, concept mapping, and network theory, as well as be guided to develop skills in interviewing, networking, and project management. Students will learn about each other¿s topics, share resources, and provide each other with support. Assignments will be professional-style products ranging from concise interview and reading summaries to project proposals, weekly logs, and presentations.", "prerequisite": "HDFS 301"}, {"course_name": "HDFS 490: Introduction to Internship Experience", "department": "Human Development and Family Studies (HDFS)", "credits": "2 Credits", "description": "Planning and preparation for field experience in human service setting. Analysis of human service system and arrangement of site.", "prerequisite": "HDFS 312W"}, {"course_name": "HDFS 494: Research Project", "department": "Human Development and Family Studies (HDFS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "HDFS 494H: Senior Honors Thesis", "department": "Human Development and Family Studies (HDFS)", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study under the direction of the thesis advisor of topics related to the interests of the student, culminating in presentation of a thesis.", "prerequisite": "approval of honors thesis advisor", "other": ["Honors"]}, {"course_name": "HDFS 495A: Internship:  Advanced Experience", "department": "Human Development and Family Studies (HDFS)", "credits": "3-9 Credits/Maximum of 9", "description": "HD FS 495A Internship: Advanced Experience (8) HD FS 495A represents a full-time, one-semester internship experience. Its focus is experiential learning accompanied by intensive supervision, provided by one-site personnel, as well as University-based mentoring. Taken within a year of the pre-internship course (HD FS 490), which helps the student with the details of making arrangements for their internship, HD FS 495A, taken during the same semester as HD FS 495B, is considered the capstone of the HD FS undergraduate program. The internship can be taken during the fall, spring, or summer semester. It is one full semester spent working as a human service professional in a setting of your choice. Generally interns will work as a full-time professional (35-40 hours a week) for the semester.", "prerequisite": "HDFS 490"}, {"course_name": "HDFS 495B: Internship:  Advanced Project", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits", "description": "HD FS 495B Internship: Advanced Project (4) HD FS 495B is taken at the same time as HD FS 495A, and within a year of the pre-internship course (HD FS 490), which helps you with the details of making arrangements for the HD FS internship, HD FS 495B focuses on the academic aspects of the internship experience. This course can be taken during the fall, spring, or summer semester. Currently, HD FS 495B consists of writing three papers; The Organizational Analysis, The Policy Analysis, and The Personal Development Paper. The purpose of the organizational analysis paper is to give the intern an opportunity to learn about his or her internship setting or organization in greater depth than might be possible otherwise. This will necessitate the intern taking an active approach to systematically securing information about the internship organization through the review of relevant documents, conducting formal or informal interviews, and observation. This paper will then be saved at the internship office, without identifying information or grade, to be viewed as a source of information about potential internship sites by future students who are seeking internships.", "prerequisite": "HDFS 495A"}, {"course_name": "HDFS 495C: Professional Practicum in Human Services", "department": "Human Development and Family Studies (HDFS)", "credits": "3-8 Credits/Maximum of 8", "description": "Guided professional practicum in human services, usually in the form of a project related to a human services issue.", "prerequisite": "HDFS 401"}, {"course_name": "HDFS 496: Independent Studies", "department": "Human Development and Family Studies (HDFS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "HDFS 497: Special Topics", "department": "Human Development and Family Studies (HDFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HDFS 498: Special Topics", "department": "Human Development and Family Studies (HDFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "HDFS 499: Foreign Studies", "department": "Human Development and Family Studies (HDFS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual of group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "HDFS 499A: **SPECIAL TOPICS**", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits/Maximum of 12", "other": ["International Cultures (IL)"]}, {"course_name": "HDFS 499B: **SPECIAL TOPICS**", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits/Maximum of 12", "other": ["International Cultures (IL)"]}, {"course_name": "HDFS 499C: **SPECIAL TOPICS**", "department": "Human Development and Family Studies (HDFS)", "credits": "3 Credits/Maximum of 12", "other": ["International Cultures (IL)"]}]