[{"course_name": "IB 199: Foreign Studies", "department": "International Business (IB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "IB 290: International Business Goes to the Movies", "department": "International Business (IB)", "credits": "1 Credits/Maximum of 3", "description": "A business elective to expose students to international and global issues through the eyes of film makers around the world.  I B 290 International Business Goes to the Movies (1 per semester/maximum of 3) I B 290 is an international business elective class which exposes students to international and global issues through the eyes of film makers around the world. Using film as the medium, students can evaluate differing perspectives and arguments on issues affecting business and economics in the global environment. This course is intended for students who are likely to study abroad during their PSU careers. Thus, the course attempts to prepare students for immersion in a variety of cultures, often different from the US. The course objective is to begin a broadening process of students' world views by examining a wide range of issues captured in film around the world.Typical topics include the rise of globalization and its impact on various countries and societies, a range of cross-cultural issues and controversies inherent in competing cultural differences between peoples of various nations, the impact of American culture on social, political, economic, and legal institutions throughout the world, and the differential role played by economics in various societies and at different stages of economic development across many nation states.This course employs film as a powerful medium to enable historical and modern understandings of global issues and international perspectives. As students enter the business world and learned professions, it is imperative that their world view include images and understandings found in a host of competing cultures including Eastern and Central Europe, East Asia, The Middle East, Latin America as well as Western Europe, Australia, and North America.Upon completion of the course, students will be introduced to a wide range of international issues as well as a foundation for approaching cross-cultural disputes inherent in international and global business. In addition, they will obtain an appreciation of international cinema and its wide scope as an art form, as an informational source for business, and as a powerful medium for argument and debate."}, {"course_name": "IB 296: Independent Studies", "department": "International Business (IB)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "IB 297: Special Topics", "department": "International Business (IB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore in depth, a comparatively narrow subject interest."}, {"course_name": "IB 299: Foreign Studies", "department": "International Business (IB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "IB 303: International Business Operations", "department": "International Business (IB)", "credits": "3 Credits", "description": "A survey of the major aspects of international business environment and operations with an emphasis on the cultural dimension.  I B 303 International Business Operations (3) (IL) International business is important and necessary because economic isolationism has become impossible. Failure to become a part of the global market assures a nation of declining economic influence and deteriorating standards of living for its citizens. International business therefore presents more opportunities for expansion, growth, and income than does domestic business alone. This course will cover the major aspects of international business environment and operations with emphasis on its impact on the local businesses in your state. In other words, in this course you will learn why international business differs from domestic business, economic theories on international trade, and how managers deal with the uncontrollable forces such as cultural differences of international environment. In this course you will develop a global perspective through studying the impact of other countries and their peoples on society and develop skills that will enable you to interact effectively in an interdependent global community.", "prerequisite": "fifth-semester standing", "other": ["International Cultures (IL)"]}, {"course_name": "IB 350: International Business Law", "department": "International Business (IB)", "credits": "3 Credits", "description": "International Business Law examines the framework and systems of international law, including: world legal systems, international commercial disputes, contracts, banking and trade regulation, European Union law, the World Trade Organization, import/export law, marketing regulations, intellectual property, foreign direct investment, labor & employment, and environmental laws.", "prerequisite": "IB 303"}, {"course_name": "IB 397: Special Topics", "department": "International Business (IB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparativey narrow subject which may be topical or of special interest."}, {"course_name": "IB 399: Foreign Studies", "department": "International Business (IB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "IB 403: International Business and National Policies", "department": "International Business (IB)", "credits": "3 Credits", "description": "Evaluation of national economic policies in the light of international economic theory; their impacts on operations of the international business firm.  IB 403 International Business and National Policies (3) IB 403 integrates macro and micro analyses of the dynamics between international businesses/ multinational enterprises (MNES) and national Governments. Students who successfully complete IB 403 will acquire knowledge of and tools to understand, analyze and evaluate actions, theories and philosophies that influence home and host Government policies, the roles businesses play in shaping, these policies, and how policies and other factors shape competitive strategies of international business firms in the areas of trade, investment and other international economic activities. * Theories, Models and Policies - Country-based advantages Imperfect Competition, Barriers to Entry and Strategic Trade Policy  * Competitive Analysis: Product Life Cycle and Porter Models * Integrating Market and Non-Market Strategy * Manipulating and Managing External Stakeholders Across Borders * Transitional Economies: Opportunities, Risks and Strategies * Strategies for Successful Foreign Direct Investment in China * Evaluating Opportunities and Risks in Global Industries * Privatization of Telecommunications * Economic Integration: the Case of Europe * Industrial Policy, Foreign Direct Investment and Economic Growth * Foreign Market Entry Strategies for Regulated Industries * Industrial Policy and International Competition * International Competition in Services Industries * Update on U.S. and EU policies in the Airline Industry and Impacts on Industry Structure and Firm Strategy.", "prerequisite": "BA 301"}, {"course_name": "IB 404: Contemporary Issues in International Business", "department": "International Business (IB)", "credits": "3 Credits", "description": "Investigation of issues in international business practice interpreted from the foundations of the social sciences.  Topics will be chosen from contemporary issues in global business and economics.  I B 404 Contemporary Issues in International Business (3) I B 404 enables students to study the most current topics in international and global business from the framework of the social science issues that form the framework for understanding, business decisions. The course provides structured experiences in library research and data gathering, techniques, and builds the habit of reading the international business press daily and analyzing it weekly. The class is typically organized around 3 integrative business topics that represent a spectrum of questions important to business. These include questions about finance and economics in international business, questions about people and organizations in an international environment, and questions about products (development, production, distribution of goods and services) in international business contexts. This is not an introductory course, and as such, the topics chosen should be substantive and nuanced. For example, one topic might be how the structure of franchises must be modified to reflect the property rights in a particular country, and how those property rights laws impact the value of the franchise. The second topic might be how the internationalization of the structure and role of Boards of Directors in multinational firms contribute to globalization, and challenge the cultural norms in those organizations The third topic might be how North American firms have been forced to adjust their product packaging, in response to environmental impact laws in Germany, and how this shifts the locus of the product message from point-of-purchase to alternative media.", "prerequisite": "BA 301"}, {"course_name": "IB 440: Globalization and Its Implications", "department": "International Business (IB)", "credits": "3 Credits", "description": "This course explores the socioeconomic implications of globalization.", "prerequisite": "AFAM 100N", "other": ["Cross-listed with: AFR 440, PLSC 440", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "IB 450: The Business Enviornment of Europe", "department": "International Business (IB)", "credits": "3 Credits", "description": "This course provides an overview of the economic, institutional, and regulatory environment in Europe at the EU and national levels. IB 450 The Business Environment of Europe (3) This course provides an overview of the business, economic, and regulatory environment in Europe at the European Union (EU) and national levels. The course examines how regional integration, through the EU, has shaped industrial, competition, monetary, and related economic policies, and how Europe's international trade and finance capabilities affect the global economy.  As a result, a significant part of the course focuses on the evolution of the EU, its institutional structure, and its impact on business (both European and foreign).  The course also compares business-government relations, models of capitalism, and corporate governance in individual European countries, using the United States as a basis of comparison.  Particular attention is given to France, Germany, Ireland, and the United Kingdom, and how their business environments differ from each other.While the primary focus of this seminar will be on these themes, we will use articles from the Financial Times and similar publications as the basis of discussion in each class for a range of topics related to Europe. The approach taken in this course is a multidisciplinary one, with the assumption that business executives must understand the political, cultural, institutional, historical, and geographic aspects of Europe if they are to be successful in the business environment of Europe.Students are expected to be active participants in class discussion.  Readings usually will include a textbook, readings packet, and a subscription to the Financial Times .  Evaluation will be based on a combination of participation and attendance, exams, quizzes, a group project, and essay assignments.", "prerequisite": "BA 301"}, {"course_name": "IB 460: International Business in Emerging Nations", "department": "International Business (IB)", "credits": "3 Credits", "description": "An overview of international business strategies and economic environments of emerging nations with a specific focus on markets in China, India, and Southeast Asia.", "prerequisite": "ACCTG 211"}, {"course_name": "IB 464: International Logistics", "department": "International Business (IB)", "credits": "3 Credits", "description": "This course will examine the logistics function and the unique requirements of the movement of products internationally. To effectively maneuver in today¿s global marketplace, a mastery of the international logistics function has become a critical success factor. The course will explore the key elements of international logistics (including INCO terms, container shipments, and packaging for rail, water, and land shipments). The requirements of moving material through the supply chain from raw materials to finished goods, including sourcing, manufacturing, packaging, and documentation through its delivery to the final customer.", "prerequisite": "IB 303"}, {"course_name": "IB 470: International Development in an African Context", "department": "International Business (IB)", "credits": "3 Credits", "description": "This course looks at international development from an African perspective and discusses the prospects for African economic growth in the 21st Century. With an understanding of historical events that have shaped the political and social landscape of modern day Africa, the economic potential of African nations will be discussed in detail. Utilizing success stories, the course introduces economic, business, social, and political issues that confront developing countries in Africa, along with solutions that have been proposed or are in use to address various development challenges. This course will provide students with the opportunity to learn first-hand about international development issues. It will introduce students to definitions of international development terms, data on international development, measures of development and development indices, as well as leading issues in International development. Using an interdisciplinary approach, the course explores some of the key development issues in sub-Saharan Africa, examines empirical findings to better understand Africa and its nations, and reviews the prospects for successful international business in this emerging growth market. Cases studies focus on successful economic growth that have emerged out of Africa and what how these successes are laying the groundwork for future international business opportunities. As such, the various components of the course are designed to promote the student's abilities to: -Describe and analyze social, economic, political elements that influence development in African countries. Students will learn that development problems, while often measured in economic terms, are multi-faceted and interrelated, thereby learn to appreciate that meaningful analysis and problem solving in international development must include different components. -Identify and analyze specific global issues, illustrating the social, economic and political context that may affect their resolution. Students will have the opportunity to experience the different facets of international development and participate, in a limited way, in efforts to address the issues.", "prerequisite": "Fifth semester standing or higher required"}, {"course_name": "IB 480: International Real Estate Markets", "department": "International Business (IB)", "credits": "3 Credits", "description": "Internatinal perspectives on real estate as property, evaluation of land use regulations, and differences in real estate markets across countries.", "prerequisite": "R M  303 or R M  330W", "other": ["Cross-listed with: RM 480"]}, {"course_name": "IB 494: Research Project", "department": "International Business (IB)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "prerequisite": "permission of the program"}, {"course_name": "IB 494H: Honors Research Project", "department": "International Business (IB)", "credits": "1-3 Credits/Maximum of 6", "description": "Supervised honors student research projects identified on an individual or small-group basis.", "prerequisite": "permission of the program", "other": ["Honors"]}, {"course_name": "IB 496: Independent Studies", "department": "International Business (IB)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "IB 497: Special Topics", "department": "International Business (IB)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore in depth, a comparatively narrow subject interest."}, {"course_name": "IB 499: Foreign Studies", "department": "International Business (IB)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]