[{"course_name": "JAZZ 100: Jazz Performance Studies", "department": "Music-Jazz (JAZZ)", "credits": "1 Credits/Maximum of 8", "description": "Jazz Performance provides individual instruction for vocal and instrumental musicians to develop theoretical, technical, and aural skills required by selected jazz performance styles. The style(s) to be studied are agreed upon between the student and instructor; these are drawn from Blues, Dixieland, Swing, Bebop, Cool Jazz, Modal Jazz, Jazz-Rock Fusion. The initial third of the semester is devoted to studying the technical norms of a given style: melodic materials (scales, modes), harmonic structure (vocabulary, norms of harmonic motion), characteristic rhythmic practices (with particular attention to syncopation), special aural requirements (the ability to connect musical hearing and musical thought) and typical frameworks of contrapuntal organization in the appropriate types of ensemble. The final two thirds of the course then deal with applications of these materials in improvisational contexts, with a short section during the last two weeks devoted to developing keyboard skills, an important area of musical competence for any jazz performer. This course is appropriate for any music major or minor with an interest in jazz. Instruction will be delivered in one half-hour lesson per week. Occasional performance in a combo will be a regular part of the course. Applied music fees are required for individualized instruction: $175 for 1-credit course; $250 for a 2-credit course"}, {"course_name": "JAZZ 110: Jazz Performance Studies", "department": "Music-Jazz (JAZZ)", "credits": "2 Credits/Maximum of 16", "description": "Jazz Performance provides individual instruction for vocal and instrumental musicians to develop theoretical, technical, and aural skills required by selected jazz performance styles. The style(s) to be studied are agreed upon between the student and instructor; these are drawn from Blues, Dixieland, Swing, Bebop, Cool Jazz, Modal Jazz, Jazz-Rock Fusion. The initial third of the semester is devoted to studying the technical norms of a given style: melodic materials (scales, modes), harmonic structure (vocabulary, norms of harmonic motion), characteristic rhythmic practices (with particular attention to syncopation), special aural requirements (the ability to connect musical hearing and musical thought) and typical frameworks of contrapuntal organization in the appropriate types of ensemble. The final two thirds of the course then deal with applications of these materials in improvisational contexts, with a short section during the last two weeks devoted to developing keyboard skills, an important area of musical competence for any jazz performer. This course is appropriate for any music major or minor with an interest in jazz. Instruction will be delivered in one hour-long lesson per week. Occasional performance in a combo will be a regular part of the course. Applied music fees are required for individualized instruction: $175 for a 1-credit course; $250 for a 2-credit course"}]