[{"course_name": "KOR 1: Level One Korean A", "department": "Korean (KOR)", "credits": "4 Credits", "description": "Listening, speaking, reading, writing Korean: an introduction for beginners; basic structures and vocabulary; cultural elements.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "KOR 2: Level One Korean B", "department": "Korean (KOR)", "credits": "4 Credits", "description": "Listening, speaking, reading, writing Korean: structures and vocabulary; cultural elements.", "prerequisite": "KOR  001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "KOR 3: Level Two Korean A", "department": "Korean (KOR)", "credits": "4 Credits", "description": "Further development of listening, speaking, reading, writing skills in Korean; cultural elements.", "prerequisite": "KOR  002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "KOR 97: Special Topics", "department": "Korean (KOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "KOR 99: Foreign Studies", "department": "Korean (KOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "KOR 110: Level Two Korean B", "department": "Korean (KOR)", "credits": "4 Credits", "description": "This is the fourth semester course of sequenced Korean study at Penn State. It is the Advanced-Intermediate course.  KOR 110 Level Two Korean B (4) This is the second part of intermediate Korean and a continuation of Korean 3 offered at Penn State. Classroom activities will be built around the textbook lessons and all activities will be designed such that students will have multiple opportunities to practice listening, speaking, reading, and writing. Pedagogical materials also include the use of multi-media based authentic language samples from a variety of modalities (spoken, written, and computer mediated) produced for Korean nationals (e.g., tv dramas, movies, magazines, internet sites and blogs, essays, short stories, magazine articles, advertisements). These will supplement the textbook and will provide insights into daily life in Korea, sociocultural values of the Korean people, as well as a broader representation of Korean language, history, literature, and culture. Students will also work within various genres of Korean discourse and literature and learn to recognize and accurately use the particular language styles that are associated with those genres.", "prerequisite": "KOR  001 , KOR  002 ,and KOR  003 (or equivalent cumulative knowledge of Korean)"}, {"course_name": "KOR 120: Introduction to Korean Culture", "department": "Korean (KOR)", "credits": "3 Credits", "description": "Survey of Korean culture and society in historical contexts; exploration from antiquity to the contemporary period through diverse media. This course is designed as a multi-disciplinary introduction to Korean society. In surveying Korean culture from antiquity to the present, we will examine a wide range of primary sources from the past, including archaeological relics, written records, and works of art; as well as contemporary materials by Korean authors, directors, and other cultural producers, together with scholarly commentaries about these materials. Instruction and all materials will be in English. No preliminary knowledge of Korean history or language is required for taking this course. In the first part of the course that covers the origins of Korean 'tradition,' we will observe the formation and development of social relations, popular beliefs, and systems of thought that have shaped the Korean way of life. Our historical analysis of these texts will also locate their resonances and ramifications in modern Korea, particularly in cultural representations. In the second part of the course, we will discuss Korea's transformation through its encounter with the West, its modern experiences and national struggle under colonial rule, social upheavals after liberation, and the Korean War. Finally, by tracing the enduring impacts of the unresolved past on contemporary society, we will look at Korea today in terms of economic development and crisis, the democracy movement and its limitations, relations with North Korea and with the US, and sociocultural diversification in the age of globalization. By situating these topics within the broader contexts of East Asia and the world, we will seek to gain a richer and more nuanced view of Korea on the global map. The overall goal of this course is to develop students' abilities to engage in cross-cultural understanding. Through a comprehensive study of Korean materials from a variety of genres and media, students will not only learn about and from Korean history and culture, but also enhance their skills in reading closely, thinking critically, and writing effectively. In exploring Korean culture as a space of complex formations and dynamic interactions, students will be trained to question, analyze, and appreciate different modes of cultural production in their specific political and social contexts.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "KOR 121: Korean Popular Culture", "department": "Korean (KOR)", "credits": "3 Credits", "description": "Survey of contemporary Korean popular culture in various forms, including pop music, film, TV drama, advertising, comics, and literature. What do we mark as 'Korean-style'? Are the images of Korea(ns) changing with the worldwide spread of Korean popular culture known as the Korean Wave (Hallyu)? This course provides critical approaches to cultural flows from South Korea. We will employ theoretical concepts and critical vocabularies from cultural studies to deepen and sharpen our analysis of the cultural representation of Korea in relation to questions such as class, gender, ethnicity, and body politics. Using diverse texts from literature, film, TV dramas, comics, and pop music, we will examine the social codes, cultural values, and economic realities that influence Korean society, including the Korean diasporic population around the world. In directing our attention to various ways in which Korean culture is transmitted and presented in different media, we will also inquire into historical and social issues rooted in the division of Korea, as well as the international dispersion of Koreans since the colonial period. Through intellectual exercises in boundary crossing, we will ultimately develop our ability to explore the cross-cultural production of trans/national identities in the age of globalization. Instruction and all materials will be in English. No preliminary knowledge of Korean history or language is required for taking this course.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "KOR 197: Special Topics", "department": "Korean (KOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "KOR 199: Foreign Studies", "department": "Korean (KOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "KOR 295: Internship", "department": "Korean (KOR)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "KOR 296: Independent Studies", "department": "Korean (KOR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "KOR 297: Special Topics", "department": "Korean (KOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "KOR 299: Foreign Studies", "department": "Korean (KOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "KOR 397: Special Topics", "department": "Korean (KOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "KOR 399: Foreign Studies", "department": "Korean (KOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "KOR 401: Level 3 Korean A", "department": "Korean (KOR)", "credits": "4 Credits", "description": "KOR 401 is the first semester of third-year Korean, which is equivalent to Advanced-Intermediate Korean I.  KOR 401 Level 3 Korean A (4) (IL) Korean 401 is the first half of the 3rd year Korean (or Advanced-Intermediate Korean I). KOR 401 is designed for the learners who have background in KOR 110 or equivalent. The medium of instruction will be Korean. The students in this course will explore various topics and styles in Korean and further improve their skills of listening, reading, speaking, and writing in Korean to be able to better comprehend Korean culture and society. The objectives in this course are 1) to review, reinforce, and expand the basic grammar, 2) to expand knowledge of vocabulary and idioms, 3) to be able to speak not only in single sentences, but in dialogues to perform basic communicative functions, 4) to be able to read and understand simple essays and stories, and 5) to be able to write short compositions in Korean. As an advanced-intermediate Korean language course, it does not only strive to enable the students to interact successfully in Korean, but it also encourages them to deepen their understanding of Korean culture and society. In addition, it aims to cultivate students' knowledge and awareness of the similarities and differences between Korean and American culture, by introducing cultural values, tradition, beliefs, and customs of Korea during the course and also promoting discussion on the topics. It is expected that through enhanced Korean language proficiency and cultural knowledge of Korea, students can increase their ability to locate and evaluate information about Korea for their further academic and/or professional needs. The course is designed to be suitable for the students who have successfully completed Korean 110 (or its equivalent, through such means as study abroad). This course is designed to meet the Korean minor requirement and also count as an IL (\"International Cultures\").", "prerequisite": "KOR  110 or equivalent", "other": ["International Cultures (IL)"]}, {"course_name": "KOR 402: Level 3 Korean B", "department": "Korean (KOR)", "credits": "4 Credits", "description": "KOR 402 is the second semester of third-year Korean, which is equivalent to Advanced-Intermediate Korean II.  KOR 402 Level 3 Korean B (4) (IL) Korean 402 is the second half of the 3rd year Korean (or Advanced-Intermediate Korean II). KOR 402 is designed for the learners who have background in KOR 401 or equivalent. The medium of instruction will be Korean. The students in this course will explore various topics and styles in Korean and further improve their skills of listening, reading, speaking, and writing in Korean to be able to better comprehend Korean culture and society. The objectives in this course are 1) to review, reinforce, and expand the basic grammar, 2) to expand knowledge of vocabulary and idioms, 3) to be able to speak not only in single sentences, but in dialogues to perform basic communicative functions, 4) to be able to read and understand simple essays and stories, and 5) to be able to write short compositions in Korean. As an advanced-intermediate Korean language course, it does not only strive to enable the students to interact successfully in Korean, but it also encourages them to deepen their understanding of Korean culture and society. In addition, it aims to cultivate students' knowledge and awareness of the similarities and differences between Korean and American culture, by introducing cultural values, tradition, beliefs, and customs of Korea during the course and also promoting discussion on the topics. It is expected that through enhanced Korean language proficiency and cultural knowledge of Korea, students can increase their ability to locate and evaluate information about Korea for their further academic and/or professional needs. The course is designed to be suitable for the students who have successfully completed Korean 401 (or its equivalent, through such means as study abroad). This course is designed to meet the Korean minor requirement and also count as an IL (\"International\").", "prerequisite": "KOR  401 or equivalent", "other": ["International Cultures (IL)"]}, {"course_name": "KOR 403Y: Level 4 Korean A", "department": "Korean (KOR)", "credits": "4 Credits", "description": "This is a four-credit writing intensive course designed for students who have completed Level Three Korean B (KOR 402) or the equivalent. The course aims to further improve students' proficiency in all four language skills, with a special emphasis on writing. By exploring a wide range of topics on Korean popular culture and issues in modern Korea through selected various authentic materials, students will engage in a substantial amount of writing, editing, and revising in Korean. As a writing-focused course, this course will involve in-class and out-of-class writings entirely in Korean that aim to show students how to use writing as a form of both thinking and developing Korean proficiency, as a way to invent and/or build up new ideas, and as ways of organizing their thought in ways that allow them to communicate those ideas effectively to others entirely in Korean. Students will be assigned bi-weekly writing assignments of different genres on the topics that are covered by each lesson. The final project of the course will be a writing-based research project in Korean; the leadup to that project will involve significant discussion of academic writing style as well as the use of writing to help develop the research abilities and critical thinking. The course will cover various topics on Korean culture and issues in modern Korea that are selected from authentic materials such as newspaper articles, essays, TV programs, movies, and short stories. Thus, students will be exposed to various genres and different writing styles in Korean. This will allow students not only to develop writing proficiency in Korean in that what kinds of speech styles should be appropriately selected (among the many that have been learned) but also to gain greater knowledge of Korean culture and a deeper awareness of the role of culture and social behavior and to hone intercultural competence and critical thinking.", "prerequisite": "KOR 402", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "KOR 404: Level 4 Korean B", "department": "Korean (KOR)", "credits": "4 Credits", "description": "This is a four credit course designed for those who have completed KOR 403 (Level Four Korean A) or the equivalent. As a continuation of KOR 403, the course aims to further develop students' proficiency in all four language skills. Students will explore a wide range of topics on Korean popular culture and issues in Korean society for content-based language learning throughout the semester to improve all aspects of proficiency for an advanced/near-superior level. Students will learn and practice via structured and authentic materials such as newspaper articles, essays, TV programs, movies, etc. The majority of reading and writing assignments will be done outside class, helping students become more independent in studying Korean. Students will be introduced to appropriate resources such as dictionaries, reference books, online dictionaries and other online resources depending on their individual needs. Class time will be used mainly for discussions of content, feedback on writing and presentations by students. This course will help students further advance their writing and speaking skills by continuously building their vocabulary, understanding the target culture, and its social issues through various sources of structured and authentic materials.", "prerequisite": "KOR 403", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 422: Introduction to Korean Linguistics", "department": "Korean (KOR)", "credits": "3 Credits", "description": "This course aims to develop linguistic knowledge about the Korean language. The course will focus on understanding the Korean language in terms of history, the writing system, lexicon, phonology, morphology, syntax, dialects, sociolinguistics, and pragmatics. Students will be introduced to essential features of the Korean language, focusing on its general and salient aspects of the language in consideration of general linguistics. The primary objective of the course is to develop a deep understanding of the Korean language and to be able to analyze some of the linguistic phenomena that are unique to the Korean language. Students will be engaged in hands-on analysis of language data in major topic area in linguistics. This course will offer valuable insights into various linguistic aspects of the Korean language, by providing not only essential background knowledge but also an extensive survey and descriptions of the Korean language to the students learning Korean and the students who are interested in particularly East Asian linguistics. The course is thus suitable primarily for students who are learning (or who have learned) Korean and would like to know more about the language and connect with it on a more academic level. Secondly, it is suitable for students interested in East Asian linguistics who would like to pursue specialization in Korean or East Asian languages. Some linguistic background will be helpful, although it is not required.", "prerequisite": "KOR 121", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 423: Korean Media and Communication", "department": "Korean (KOR)", "credits": "3 Credits", "description": "This course explores historical, technological, and cultural aspects of Korean media and communication by examining both scholarly and primary sources such as film, radio, youtube, webtoons, online games, facebook, twitter, and TV dramas/variety shows. Students will study the role of media and communication in private, interpersonal, national, global, communal, and cultural settings in order to deepen their understanding of contemporary Korean society and culture. The objectives of the course are to enable students to improve their knowledge in Korean media and communication methods and technologies; become an autonomous learner of Korean culture through making use of the newly available tools and resources; become a global citizen, with better understanding of the usage of media in a different culture and enhanced cultural sensitivity; and develop critical thinking abilities through investigating Korea-related issues reported and discussed in new media. Class activities may include: written analysis of scholarly articles and media content, class and group discussions, debates and presentations. The course content may vary depending on instructors but it covers various topics that illustrate characteristics of Korean communication media such as technologies, grassroot journalism, effects of social media, communication trend, media policy, softpower, etc.", "prerequisite": "KOR 121", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 424: Transnational Korean Literature", "department": "Korean (KOR)", "credits": "3 Credits", "description": "Exploration of seminal Korean texts, including poetry, fiction, autobiography, and criticism, from the early twentieth century to the contemporary era. This course provides a comprehensive overview of modern Korean literature within a transnational context. As we learn how to critically analyze seminal Korean texts, we will locate them in the social, political, economic, and cultural conditions under which they were produced and received. In grappling with some of the fundamental issues they raise;including colonialism, migration, national division, war, gender relations, developmentalism, urbanization, democratization, and contemporary consumer culture;we will also seek to situate these writings in the Korean vernacular within the larger context of global modernity. Rather than take Korean literature and global modernity as given or apart from each other, we will attend to their intersections by raising such questions as: How did modern experiences, constructed through the interface with unfamiliar Others, change preexisting ways of writing and reading? How did foreign occupations affect the formation of a national literature? In what ways do Korean writers' representations of the inter/national events and phenomena on and beyond the Korean peninsula at once enrich and complicate empirical investigations into modern histories of Korea, East Asia, and the world? In an increasingly borderless world, can we draw a boundary around what is called \"Korean\" literature? In parallel with these questions, we will further discuss why and how to engage in literary practices in the current age of digital reproduction. Instruction and all materials will be in English. No preliminary knowledge of Korean history or language is required for taking this course.", "prerequisite": "KOR 120", "other": ["Cross-listed with: ASIA 424, CMLIT 424", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 425: Global Korean Cinema", "department": "Korean (KOR)", "credits": "3 Credits", "description": "Exploration of Korean cinema from the early twentieth century to the present, with an emphasis on its global/local dynamics. This course offers an introductory overview of Korean cinema. As we trace its history from the colonial period to the current \"Korean wave,\" we will also engage with film criticism, the trans/national contexts of film productions, the particular aesthetics of selected auteurs/genres, and local/global receptions of Korean cinema. Our discussion of formal elements and key issues featured in these films;modernity, colonialism, division, nation, class, gender, identity, tradition, ideology, desire, violence, and migration, among others;will be informed by readings of secondary sources and theoretical works, as well as literary materials produced during the same period. Throughout our analyses, we will seek to contextualize the cinematic texts within moments of major shifts not only in modern Korean history, but also in the transnational film industry and screen culture. In pursuing a broad and detailed perspective of Korean cinema, this course will ultimately enrich, and simultaneously complicate, our understanding of Korea, cinema, and the world. Instruction and all materials will be in English. No preliminary knowledge of Korean history or language is required for taking this course.", "prerequisite": "KOR 120", "other": ["Cross-listed with: ASIA 425, CMLIT 425", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 450: Korean Cultures in Global Contexts", "department": "Korean (KOR)", "credits": "3 Credits", "description": "As Korea has gained significant economic and political power in the past few decades, people in many different parts of the world desire to know about Korean culture as a way to communicate with them. Korea has a long history and traditions that distinguish it from other nations and societies; and that still influence the ways Koreans behave in different social and cultural settings. However, Korean culture is not a unifying or clearly defined entity since foreign political, economic, and cultural forces that shaped contemporary Korean culture. It is a malleable entity that continuously evolves through Korea's close engagement with the world. This course examines the multiplicity and fluidity of Korean culture in global contexts primarily in Korean language. It is designed for students who desire to obtain knowledge about the global connection between Korea and other societies in the world in the fields of business culture, entertainment culture, tourism, diplomacy, education, art, etc. It first situates Korean culture in its relationship to others to see how global politics, economy and culture influenced the ways Korean cultures transformed; how Koreans engage with the global community in industries, politics and economy; and how the engagement can further create constructive channels between the global community and Korea. Depending on instructors, the content will vary, but it covers topics that concern students whose interests lie in the cultural understanding of work culture, Korean business, entertainment, tourism, Korean diaspora, and art from a global perspective.", "prerequisite": "KOR 401", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 451: Food and Foodways in Korea", "department": "Korean (KOR)", "credits": "3 Credits", "description": "Food is an essential means to live but it is also an important element to tell us about who we are and how we live. Korean cuisine offers rich history and tradition. It is also a gateway to deeply understand and appreciate Korean culture and society in which key ideas of national and individual health and identities, social life, international relations, gender roles and relations, class, and food activism manifest in actual food and ways of preparing and consuming food. This course explores historical, social, cultural, and geographical aspects of Korean food almost entirely in Korean language. By learning Korean food and foodways, students will understand traditions of Korean food; the ways Korean food evolved; the relationship between food and national and individual identity; and ingredients and recipes for some of the representative Korean dishes. Various course materials will be used such as scholarly books and articles, cookbooks, TV cooking shows, films, youtube, culinary tour brochures, etc. Students will have an opportunity to master how to cook a few essential Korean dishes during the course and present their actual cooking process of at least one dish either in class presentation or in video-recording.", "prerequisite": "KOR 401", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 452: Korean Language and Culture", "department": "Korean (KOR)", "credits": "3 Credits", "description": "How do language, culture, and society affect one another? Through this course, students are introduced to the Korean language, culture, and society and how they are closely related to one another. We will examine essential and critical roles of the Korean language in Korean culture and society in order to gain a better understanding of the Korean society and an understanding of the Korean language in relation to its culture and society from diverse perspectives. We will examine the relationship by means of literature, history, philosophy, social structure, social/cultural values, interpersonal relationships, and social and regional varieties of Korean. We will explore a series of topics related to sociolinguistic perspective, cultural terms and figurative expressions, linguistic etiquette, language use in the media as a reflection of culture, which will allow students to develop a deeper understanding of fundamental socio-cultural nature of the Korean language (that are distinct from other languages such as English). With readings drawn from media articles, scholarly essays, popular books, and podcasts, a comparative perspective will also be taken to discuss similarities and differences between Korean and English in various aspects covered by the course. Thus, the course will provide richer insight into the Korean language, culture, and society as well as a broad awareness of different cultures and languages.", "prerequisite": "KOR 401", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"course_name": "KOR 494: Research Project", "department": "Korean (KOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "KOR 494H: Research Project", "department": "Korean (KOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "KOR 496: Independent Studies", "department": "Korean (KOR)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "KOR 497: Special Topics", "department": "Korean (KOR)", "credits": "3-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject related to Korea."}, {"course_name": "KOR 498: Special Topics", "department": "Korean (KOR)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "KOR 499: Foreign Studies", "department": "Korean (KOR)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]