[{"course_name": "MKTG 199: Foreign Studies", "department": "Marketing (MKTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MKTG 220: Introduction to Selling Techniques", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Principles underlying the sales process and practical application of these principles to selling situations.  Studies role of selling in total marketing process.", "prerequisite": "third-semester standing"}, {"course_name": "MKTG 221: Contemporary American Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Social and economic aspects, movement of goods and services from producers to consumers; analysis of marketing functions, systems, and institutions. May not be used to satisfy Penn State Business baccalaureate degree requirements.  Not available to students who have taken B A 303 or MKTG 301.", "prerequisite": "3 credits in ECON"}, {"course_name": "MKTG 221W: Contemporary American Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Social and economic aspects; movement of goods and services from producers to consumers; analysis of marketing functions, systems, and institutions. May not be used to satisfy Penn State Business baccalaureate degree requirements. Not available to students who have taken B A 303 or MKTG 301.", "prerequisite": "3 credits in ECON", "other": ["Writing Across the Curriculum"]}, {"course_name": "MKTG 296: Independent Studies", "department": "Marketing (MKTG)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "MKTG 297: Special Topics", "department": "Marketing (MKTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MKTG 299: Foreign Studies", "department": "Marketing (MKTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MKTG 301: Principles of Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Principles of Marketing covers terminology and important concepts related to marketing in the business environment. Domestic and international environments that impact marketing are included, with particular emphasis on the marketing environment, segmentation, positioning and targeting. MKTG 301 course objectives include providing an overview and introduction to marketing; demonstrating the relationship of marketing to other functions and processes in a business organization on an integrated basis; providing real world examples of challenges and issues related to marketing; and explaining and discussing important concepts and analytical tools in marketing. Major themes embedded in the foundation of MKTG 301 include domestic and global economic factors influencing current marketing environments; how consumer, business and organizational customers are segmented and targeted; how marketing research and information systems are used to create and guide marketing strategies; how products are developed to serve customers, businesses and organizations; how service products are developed and managed to meet customer needs; how customers are reached through various conventional and technological channels and how these sales management processes are managed; how people in the United States and other nations are influenced by marketing in the non-profit sector; how products and services are marketed to other businesses and organizational customers; how marketing communications programs, which include advertising, publicity, sales promotion and web sites, are designed to reach domestic and international customers; how pricing strategies support corporate objectives in various economic climates; and how marketing programs adapt to shifts towards global markets. Students may earn credit towards graduation for only one of the following; BA 303, MKTG 301, MKTG 301H, or MKTG 301W."}, {"course_name": "MKTG 301H: Principles of Marketing (Honors)", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Marketing begins and ends with the customer, from determining wants and needs to providing customer satisfaction. This course will emphasize fundamental marketing concepts, such as segmentation, targeting, and positioning, and the 4 P's (product, price, place, and promotion). In addition, the course will emphasize the use of marketing research to inform managerial decision-making. The overarching goal of this course is to introduce you to a) the role of marketing within business organizations and society, and b) the concepts and activities in marketing that create and deliver value to customers. At the conclusion of this course, students will be able to: 1) explain the fundamental concepts of marketing and the role of marketing in business; 2) apply marketing concepts and analysis tools to managerial decision-making; and, 3) provide real-world examples of challenges and issues in marketing. Major themes embedded in MKTG 301H include: domestic and global socioeconomic factors that influence marketing environments; the use of marketing research and information systems to create and guide marketing strategies; how consumers, businesses and organizational customers are segmented and targeted; how products are developed to serve customers, businesses and organizations; unique issues in the marketing of services versus goods; how customers are reached through conventional and technological channels; the sales function, including how sales processes are managed; how marketing communications programs (including advertising, publicity, sales promotion and new media) influence customers; how pricing strategies support corporate objectives, and how consumers respond to pricing; the roles of non-profit and social marketing; corporate social responsibility and sustainability in marketing; and the impact of marketing on society. Students may earn credit towards graduation for only one of the following; BA 303, MKTG 301, MKTG 301H, or MKTG 301W.", "other": ["Honors"]}, {"course_name": "MKTG 301W: Principles of Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Principles of Marketing is a three credit course offered each semester across Penn State and covers terminology and important concepts related to marketing in the business environment. Domestic and international environments that impact marketing are included, with particular emphasis on the marketing environment, segmentation, positioning and targeting. MKTG 301W course objectives include providing an overview and introduction to marketing; demonstrating the relationship of marketing to other functions and processes in a business organization on an integrated basis; providing real world examples of challenges and issues related to marketing; and explaining and discussing important concepts and analytical tools in marketing. Major themes embedded in the foundation of MKTG 301W include domestic and global economic factors influencing current marketing environments; how consumer, business and organizational customers are segmented and targeted; how marketing research and information systems are used to create and guide marketing strategies; how products are developed to serve customers, businesses and organizations; how service products are developed and managed to meet customer needs; how customers are reached through various conventional and technological channels and how these sales management processes are managed; how people in the United States and other nations are influenced by marketing in the non-profit sector; how products and services are marketed to other businesses and organizational customers; how marketing communications programs, which include advertising, publicity, sales promotion and web sites, are designed to reach domestic and international customers; how pricing strategies support corporate objectives in various economic climates; and how marketing programs adapt to shifts towards global markets. Students may earn credit towards graduation for only one of the following; BA 303, MKTG 301, MKTG 301H, or MKTG 301W.", "other": ["Writing Across the Curriculum"]}, {"course_name": "MKTG 302: Marketing Techniques for Electronic Commerce", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Explores methods to implement/adapt marketing methods to the Internet; builds upon introductory marketing classes to examine what does/doesn't work.  MKTG 302 Marketing Techniques for Electronic Commerce (3) This course examines the role of commerce and marketing with special focus on Internet commerce topics including: the commerce value chain, business strategies and business strategies for the global marketplace. Several Internet business models are examined. These include: business-to-business (B2B); business-to-consumer (B2C); consumer-to-consumer (C2C); and government-to-consumer (G2C); and other permutations of these models. Marketing fundamentals include market segmentation and product life cycle, and similar topics are reviewed with the emphasis on Internet implementation. Specific methods for conducting market research using the Internet as well as methods to determine who is the 'average' Internet user are examined. Advertising methods for the Internet vs. the traditional advertising mediums of TV, radio, and print, and methods to measure advertising success on the Internet are discussed. The Internet removes existing roadblocks and adds new roadblocks for businesses, thus requiring different pricing strategies. Distribution channels and methods of supply--chain management are studied. How marketers utilize e-mail, site commissions, cookies, filters, and databases is examined. Security, privacy, and ethical issues, e.g., consumers' rights to privacy and sale of consumer information, are reviewed. Finally, a market plan to migrate business functions to the Internet is developed.", "prerequisite": "BA 303"}, {"course_name": "MKTG 310: Public Relations and Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Examination of the role of public relations in a company's efforts to manufacture and market its products and services.", "prerequisite": "BA 303"}, {"course_name": "MKTG 327: Retailing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Management of marketing institutions in distribution channels from producers to consumers. Emphasis on retail institutions: location, personnel, merchandising, control, promotion.", "prerequisite": "BA 303"}, {"course_name": "MKTG 330: Consumer Behavior", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Application of behavioral science concepts to the understanding of buyer behavior as a basis for marketing management decision making.", "prerequisite": "BA 303"}, {"course_name": "MKTG 342: Marketing Research", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Research approaches, methods, and applications studied as a formal approach to problem solving for marketing decisions.", "prerequisite": "BA 303"}, {"course_name": "MKTG 343: Introduction to Marketing Analytics", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Marketing Analytics helps students enhance skills and knowledge required for data-driven marketing decision process. The course introduces students to analytics for pricing, forecasting, different estimation techniques, calculating lifetime values, market segmentation, the impact of social network marketing and measuring the effectiveness of advertising. Through this course, data visualization and communicating data insights will be discussed as well strategic marketing decision making processes", "prerequisite": "MKTG 342"}, {"course_name": "MKTG 395: Sales Internship", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "A sales internship is a structured work experience conducted by an organization in cooperation with a Penn State college or campus. It is a learning experience that encompasses a set of specified tasks related to sales and requires the student to apply knowledge learned in an academic environment to the sales profession. A student may earn three academic credits for the successful completion of the internship. Internships may be completed within Fall, Spring, or Summer academic terms. All Internships require both organizational and faculty sponsors who oversee the student's internship experience. Companies are carefully screened to ensure that sales internships are a positive and beneficial experience. The organizational sponsor oversees the intern's work experience and is responsible for evaluating the student work performance. The faculty sponsor evaluates the intern's academic performance and authorizes the granting of academic credit upon completion of the internship. A sales internship provides students an important learning experience as they begin their journey into the work force.", "prerequisite": "Prior approval of proposed internship by instructor"}, {"course_name": "MKTG 397: Special Topics", "department": "Marketing (MKTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MKTG 399: Foreign Studies", "department": "Marketing (MKTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "MKTG 410: Personal Selling", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Principles underlying the selling process and practical application of these principles to selling situations.", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 422: Advertising and Sales Promotion Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Perspectives and models of the key decisions involved in managing advertising and sales promotion campaigns.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 422H: Advertising and Sales Promotion Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Perspectives and models of the key decisions involved in managing advertising and sales promotion campaigns.", "other": ["Honors"]}, {"course_name": "MKTG 426: Business Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Developing marketing strategies and programs. The course emphasizes the special nature of the business and organizational markets.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 428: Advanced Sales Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Approaches to planning, organizing, staffing, training, directing, and controlling the sales force in support of marketing objectives.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 437: Advanced Retailing and Merchandise Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Analyzing planning and controlling the retail merchandising effort, including procurement, resource selection, vendor relations, product presentation, inventory control.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 440: Services Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Marketing theory and methods applied to profit and nonprofit service industries such as health care, finance, transportation, tourism, arts and consulting.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 441: Sustainability in Marketing Strategy", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "This course examines sustainability in marketing strategy, including real- world applications, green solutions, and using marketing principles to solve social issues.  MKTG 441 Sustainability in Marketing Strategy (3) This course will examine the growing trend of sustainability and its implications for marketing in today's world and in the future. It will explore how businesses develop and implement marketing strategies to promote sustainability, and analyze how companies are performing. Businesses are increasingly applying the concepts of sustainability to their decision-making for marketing strategy. Some firms are leaders in the sustainability movement, and are motivated by ethical conviction to do well for society and the environment. Others find themselves forced by pressure from shareholders, customers, governmental regulation, and peers. Given this increased attention to the concepts of sustainability by stakeholders, businesses are also looking for future employees with an understanding of the phenomenon.", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 442: Sustainable Behavior of Consumers, Firms, and Societies", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Sustainability is a broad domain concerning the extent to which environmental, economic, and social practices are viable for current and future generations. Consumer awareness of sustainability issues has evolved from an emerging social movement to mainstream values, but increasing sustainable behavior remains a challenge. This course is designed to provide students with the knowledge to enhance sustainable behaviors in firms, among consumers, and in society at large. In doing so, this course will include frameworks for understanding how to influence sustainable practices, consumer response to sustainability, and marketing communication issues as well as real-world examples of sustainable practices and issues, offering both a theoretical and applied approach. The course may also include a project which will entail student teams working on a real-world sustainable behavior problem in collaboration with a business or segment of the university campus when available or other course project addressing a relevant sustainability issue. Students should leave the course with an understanding of sustainability issues in the current marketplace and the knowledge and ability to influence sustainable behaviors. Students will enter their career with the knowledge and skills to be a sustainable business decision-maker and foster sustainable behavior.", "prerequisite": "BA 342", "other": ["Cross-listed with: BA 442"]}, {"course_name": "MKTG 443: Sports Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "This course will focus on how companies develop, execute and measure marketing strategies and tactics to use sports teams, familities, leagues and other organizations to market their products and services domestically and internationally to consumers and business partners.  The course will examine the marketing strategies employed by sports teams and leagues.  MKTG 443 Sports Marketing (3)\"Sports Marketing\" is designed to explore how various types of businesses and other organizations market products and/or service related to sports as well as how sports are used as marketing platforms for non-sports products. Unique aspects of the sports business will be explored including how strategies and tactics related to marketing in this sector differs from other industries. The purpose of this course is to provide an overview of various aspects of sports marketing. This will include the use of sports as a marketing tool for other products, the marketing of sports products and emerging considerations that are relevant for both marketing through and the marketing of sports. Since sports involves consumers, businesses and other organizations, this courses will cover B2C as well as B2B marketing.How product, distribution, pricing and promotional programs are developed particular to this industry will be one of the primary focuses. Relationship marketing, the role of technology, sponsorships, ambush marketing, partnership leveraging, endorsements, venue naming rights, licensing and emerging legal and ethical issues will also be important focuses. A guest speaker series will provide additional professional perspectives on a variety of unique aspects of marketing particular to sports. Reading Sports Business Journal, the most highly regarded source of news by sports industry employees, will further expand this knowledge base as will current news events related to the industry. Students will be provided an opportunity to network with guest speakers and those interested in considering sports among their job search, will also be able to receive internship and career counseling from the instructional team. Students enrolled in this class will also be able to submit resumes and requests to be interviewed for internships with various sports organizations being arranged in cooperation with the Smeal Collage Corporate and Career Services Office. Students will apply what is being learned in the class to the development of a project related to sports marketing, with the added benefit of having a deliverable which can be used to further the search for jobs and/or internships in the sports business.", "prerequisite": "BA 303"}, {"course_name": "MKTG 444: Buyer Behavior and Applied Research", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Buyer Behavior occupies the center of the customer-company interface. It informs the design of marketing strategy and planning by providing insights about the evolving consumer environment; consumer information processing and decision-making; consumer purchase and product usage patterns and influences; consumer attitude, consumer motivation. To address these diverse issues and concerns, consumer behavior analyses draws from related fields of economics, psychology, sociology, anthropology and other basic disciplines. Similarly, studying consumer behavior requires an extensive and diverse methodological tool kit of both qualitative and quantitative research techniques. Insights about consumers and consumption patterns help marketing professionals design products and marketing programs that resonate with consumers' thoughts, feelings, interests and motivations.", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 445: Global Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Role of international marketing in the global environment; political, economic, geographic, historical, cultural conditions; developing and implementing international marketing strategies.  MKTG (I B) 445 Global Marketing (3) (IL) MKTG/I B 445 focuses on the wide range of issues, which face enterprises as they develop and execute marketing strategies and tactics, designed to support business activities in markets outside their home country. This course deals directly with these issues as they apply to firms, which concentrate on a few markets closer to home, or on many markets throughout the world, including via the Internet. This course also deals with the important role played by governments in shaping the global marketing environment, including through trade policies, treaties and marketing supports. Students successfully completing this course also gain a greater understanding of the cultural, technological, economic, political and social environments which international businesses and global marketers face as they seek to expand their product and/or service offerings into other nations. Understanding this important part of the challenge facing international businesses and global marketers is achieved through the text, lectures, and student group projects and presentations including some focused on specific countries, including both major trading partners of the United States and select emerging new markets. This course is designed for students who have an interest in these topics and/or who plan to enter fields such as international business or global marketing and/or who expect to work for businesses, which are active internationally. Class discussions and projects are designed to help students explore these topics in greater depth. A series of small group assignments and presentations will further help students apply what is being learned via problem-based learning. This is an interactive class. Therefore, a portion of the grade each student achieves will be based on class attendance and participation. Students are also expected to pay attention to examples of the issues discussed in class that they encounter during the semester in prim broadcast, and online communications. Along with material from lectures and the text, issues discussed in class will be included in the exam.", "prerequisite": "BA 303", "other": ["International Cultures (IL)"]}, {"course_name": "MKTG 449: Sports Business Market Strategy", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "This course provides an overview of the business of sports, with an emphasis on marketing and market strategy. Particular topics include business strategy and competitive forces in sports, fan psychology, fan behavior, segmentation, targeting, positioning, sports brands, market research, fan satisfaction, licensing, facilities, technology, ethics, and careers in sports. It will provide practical case-study examples from the sports industry, and challenges students to explore solutions to a variety of business problems in sports. Students will apply concepts and frameworks from assigned readings and class discussions, to think critically about current and ongoing issues in business and marketing in the sports industry, and to present recommendations in a professional setting. Assignments and group presentations are intended to provide practical, hands-on experience, which students can leverage to enhance their value in the sports industry.", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 450W: Marketing Strategy", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Market-oriented problems of the firm; identification and selection of market opportunities; formulation of competitive strategies; marketing policies and programs.", "prerequisite": "MKTG 330", "other": ["Writing Across the Curriculum"]}, {"course_name": "MKTG 472: Strategic Brand Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Brands are a potentially valuable asset to firms in Business-to-Business (B2B) and Business-to-Consumer (B2C) markets. Strong brands influence purchase and consumption by communicating value and providing differentiation in the marketplace. Effective brand management is therefore critical to maintaining the long-term profitability of products and services. This course investigates how to create profitable brand strategies by building, measuring, and managing brand equity. Theories and practical tools will address the following questions: how does branding influence purchase and consumption? how can firms build brand equity? how should brand equity be measured and managed over time? how should firms manage brands in a brand portfolio? how can firms leverage brand equity? At the conclusion of this course, students will be able to: 1) explain the fundamental concepts of branding and the role of branding in business; 2) apply branding concepts and analysis tools to managerial decision-making; and, 3) provide real-world examples of challenges and issues in branding.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 473: Digital Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "In recent years, marketing has dramatically shifted from traditional (e.g., commercial, print advertising) to digital using technologies such as the Internet, social media, augmented reality, mobile, Internet of Things, and wearables. This course will introduce students to the changing landscape of marketing through a digital marketing perspective. Major topics covered are digital marketing themes, communication platforms, content marketing, digital advertising, real-time marketing, marketing automation, search engine optimization (SEO) and search engine marketing (SEM), social media, mobile, video, digital technologies, and measurement. This course helps students understand, and evaluate the digital marketing landscape to aid in effective marketing campaigns. Students will learn the fundamentals, frameworks and useful concepts developed specifically for digital platforms. How core marketing and business principles (i.e. segmentation, marketing mix, commerce) are used or have been altered will be discussed. Case studies and examples of successful and failed campaigns will be analyzed. The course utilizes group work assignments to create and present a digital marketing plan of a company, brand or specific product/service. Last, there is a large emphasis on including guest speakers from the industry.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 474: Marketing Analytics", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "In rapidly changing markets characterized by ever more demanding customers served by global competitors, intuitive decision making, even when honed by years of experience, is unlikely to generate superior results. Instead, successful marketers increasingly rely on Marketing Analytics, a systematic approach to applying analytical models to properly organized empirical data, with the goal of extracting true insights about the marketing environment. This course will introduce students to commonly used analytical tools in such areas as segmentation, targeting and positioning, satisfaction management, customer lifetime analysis, customer choice, product and price decisions using conjoint analysis, and text analysis and search analytics. This is a hands-on course based on the Marketing Engineering approach and Excel software, in which students will apply the tools studied to actual business situations and conduct a group project involving primary data collection and analysis. At the conclusion of this course, students will be familiar with some of the more common marketing analytics tools and be able to extract insights from marketing data using model-supported decision making.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 475: Innovation and Product Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "This course is an application-oriented interdisciplinary course on new product development concepts, and innovation management.  MKTG 475 Innovation and Product Management (3) This course is designed to provide students the opportunity to examine and understand the new product development process. It takes the process from the strategy and ideation stage to the after-market product launch. The course blends the perspectives of marketing, management, and engineering into a single approach to product development. It provides students with an appreciation for the realities of industrial new product development practice. Therefore, case studies and other in-class assignments are designed in a way that students can apply the theoretical/abstract concepts to the real life phenomenon. The new product development projects are assigned to teams in real life, students have the opportunity to complete the case analyses and assignments in teams. Course aims to integrate micro level new product development issues (e.g., firm-level product strategy) to macro level issues (e.g., anti-trust regulations and legislations).", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 476: Sales Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Application of modern management principles to field sales force planning, organization, and administration; selection, training, and compensation plans.", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 478: Services Marketing Management", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Conceptual understanding of services and the analytical tools that are used in solving strategic services marketing problems.", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 480: Intermediate Social Media Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Social Media Marketing tools, techniques, and strategies to build brands and customers.  MKTG 480 Intermediate Social Media Marketing (3) In today's business world, marketers must become more creative in the ways in which they present their company on an Internet based platform such as Twitter, Facebook, and Linked-In in order to present increasingly relevant products and services to a more receptive customer base. The course, Intermediate Social Media Marketing, is designed to provide hands-on experiences with the use of Social Media Marketing tools and techniques while adhering to socially acceptable and ethical standards and protocols. The technology tools and platforms include but not limited to: Facebook, LinkedIn, Twitter, YouTube, Google+, Pinterest, Foursquare, Friendster, Technorati, Blogs, Vlogs, Podcats, Hootsuite, Radian6, various search engines, and QR codes. These social media tools can be used to find, reach, connect, and automate marketing messages to efficiently and effectively build relationships, stronger brands and loyalty. These technologies may be utilized with or without a fully realized marketing automation structure, allowing ideas to be shared on a global platform. Students will learn and apply the major categories of Social Media tools, the how's and why's of their use, and decide what venues to use to reach the social media marketing objectives of firms, which may include improving the content to increase online presence, brand awareness, fan likings, customer inquiries, and sales. During this course, students will devise a social media marketing plan for a local firm (or firms) that addresses (1) platform, (2) content, and (3) interaction. This course will achieve academic excellence by having students research the latest techniques and practices of social media, mobile, and direct marketing to build a social media marketing plan for a local firm (or firms) to expand its markets. Students will be analyzing a firm's current traditional and social media marketing practices, and short-term and long-term goals for its target markets.", "prerequisite": "MKTG 330"}, {"course_name": "MKTG 485: Business-to-Business Marketing", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Application of marketing principles to commercial enterprises, industrial firms, government, and other non-profit institutions.", "prerequisite": "MKTG 301"}, {"course_name": "MKTG 494: Research Project", "department": "Marketing (MKTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "MKTG 494H: Research Project", "department": "Marketing (MKTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "MKTG 495: Internship", "department": "Marketing (MKTG)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor"}, {"course_name": "MKTG 495A: Penn State Prime Practicum: Brand Management and Campaign Strategy", "department": "Marketing (MKTG)", "credits": "3 Credits", "description": "Penn State Prime is designed to give students hands-on, practical experience between brand (\"client side\") and ad agency (\"agency side\") while taking on a real consumer marketing challenge. Teams live out the journey from client-agency initial engagement, consumer insights to campaign development. In doing so, students apply skills developed in departmental workshops, marketing-related coursework, and other relevant experiences.  Unlike traditional courses, students adopt specific roles on the client or agency side, and receive mentorship from a client or agency executive, teaching assistants, and the instructor. The goal of the practicum is to enhance and refine each student's ability to excel in the future by experiencing the real-world challenges and \"messiness\" of brand management and advertising in a semi-guided context. While a traditional course design would focus on specific aspects of client side and agency side topics such as brand, advertising, and promotion management, Penn State Prime's project team environment gives students the opportunity to utilize real-world exposure to pull content together.", "prerequisite": "Permission from the Instructor"}, {"course_name": "MKTG 496: Independent Studies", "department": "Marketing (MKTG)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "MKTG 496A: **SPECIAL TOPICS**", "department": "Marketing (MKTG)", "credits": "1-6 Credits"}, {"course_name": "MKTG 496B: **SPECIAL TOPICS**", "department": "Marketing (MKTG)", "credits": "1-6 Credits/Maximum of 6"}, {"course_name": "MKTG 497: Special Topics", "department": "Marketing (MKTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MKTG 498: Special Topics", "department": "Marketing (MKTG)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "MKTG 499: Foreign Studies", "department": "Marketing (MKTG)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]