[{"course_name": "OT 97: Special Topics", "department": "Occupational Therapy (OT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "OT 100: Structural Foundations of Occupational Therapy", "department": "Occupational Therapy (OT)", "credits": "1 Credits", "description": "An overview of the structural foundations of the occupational therapy profession.", "other": ["First-Year Seminar"]}, {"course_name": "OT 101: Conceptual Foundations of Occupational Therapy Practice", "department": "Occupational Therapy (OT)", "credits": "2 Credits", "description": "An overview of the conceptual foundations of occupational therapy practice. Observation of therapists in treatment settings.  O T 101 Conceptual Foundations of Occupational Therapy Practice (3) The focus of the course is to provide students with the conceptual foundations of occupational therapy. These foundations form the basis for subsequent occupational therapy courses and are expanded upon in those courses. Topics will include: clinical reasoning, diversity issues, ethics and conflict management, occupation, models of O T, the Practice Framework, principles of management, and occupational therapy literature. Upon successful completion of OT 101 the student will be able to:1. Describe occupation from the perspective of an occupational therapy practitioner.2. Identify the critical differences between the models of OT theory: cognitive, biomechanical, Person Environment Occupation, and sensory integration.3. Identify cultural, contextual, and diversity issues which impact the practice of occupational therapy in a variety of practice settings and describe their impact.4. Identify and define types of clinical reasoning utilized in occupational therapy.5.. Identify professional literature appropriate to the practice of occupational therapy; read and summarize selected articles.6. Demonstrate knowledge of liability issues related to OT and the AOTA Code of Ethics and apply the code to given situations which present ethical dilemmas.7 . Identify issues common to the management of occupational therapy departments and the role of the OTA in these issues.", "prerequisite": "OT 100S"}, {"course_name": "OT 103: Occupational Performance Across the Life Span", "department": "Occupational Therapy (OT)", "credits": "3 Credits", "description": "Analysis of occupations from birth to death including descriptions of occupational performance and factors which influence performance.  O T 103 Occupational Performance Across the Life Span (3)The focus of this course is an in-depth understanding of occupations across the life span. Students engage in an analysis of occupations including: activities of daily living, instrumental activities of daily living, education, work, play, leisure, and social participation. Specific descriptors are used to discuss occupational performance from the perspective of the Occupational Therapy Practice Framework. Areas which influence performance skills and patterns are studied and applied. Topics include: areas of occupations engaged in by individuals from birth to death; performance skills and patterns, context, activity demands, and client factors which impact occupational performance, definitions of grading, adapting, and analyzing occupational performance to support meaningful and socially relevant participation in day-to-day occupations. This course is required in the accredited 20T major and provides the foundation for understanding and applying the concepts related to occupations within the occupational therapy assistant intervention courses which follow. Evaluation methods include: written examination, and graded written/oral assignments. Enrollment is limited to students admitted to the 20T major.", "prerequisite": "OT 101", "other": ["United States Cultures (US)"]}, {"course_name": "OT 195E: Fieldwork Level I Experience in Occupational Therapy", "department": "Occupational Therapy (OT)", "credits": "1 Credits", "description": "This is the first fieldwork level I experience. It involves observation and engagement with individuals and/or groups to develop a better understanding of occupational performance, challenges and occupation-based interventions. The purpose is to process the information learned in didactic coursework as related practice. An emphasis is placed on peer collaboration, professionalism and interactions with clients, on-site providers, and/or family members."}, {"course_name": "OT 197: Special Topics", "department": "Occupational Therapy (OT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "OT 205: Group Process Across The Lifespan", "department": "Occupational Therapy (OT)", "credits": "3 Credits", "description": "The course addresses concepts & theories related to group processes and dynamics within the OT therapeutic context. Topics addressed in the course, include but are not limited to: types of groups, group roles, leadership styles, theory of group development & implementation, group norms, and the selection of appropriate activities based on age and occupational performance areas or components, safety, management of the environment, and time management.", "prerequisite": "OT 103"}, {"course_name": "OT 207: Assistive Technologies and Methods of Adaptation", "department": "Occupational Therapy (OT)", "credits": "3 Credits", "description": "Addresses a variety of assistive technology and assistive devices people use to assist them in completing daily and life occupations. Students engage several assistive technologies and learn to identify, create, and practice implementation of adaptations for clients that optimize occupational performance. Students will be expected to identify, describe, explain, and demonstrate knowledge and skills related to assistive technology and methods of adaptation along with client and caregiver safety.", "prerequisite": "OT 103"}, {"course_name": "OT 209: Management, Leadership and Ethics in Occupational Therapy", "department": "Occupational Therapy (OT)", "credits": "3 Credits", "description": "Focus on management, leadership and ethics in occupational therapy practice will be addressed. Importance of intraprofessional and interprofessional collaboration, as well as, reimbursement and policies related to the delivery of services will be emphasized. A keen understanding of the occupational therapy practitioner-client relationship driven by therapeutic use of self will be applied to all aspects the teaching-learning process. Interprofessional and intraprofessional collaborative practice will be addressed, as well as, the essentials of advocacy and professionalism.", "prerequisite": "OT 103"}, {"course_name": "OT 210W: Clinical Reasoning and Documentation in Occupational Therapy", "department": "Occupational Therapy (OT)", "credits": "3 Credits", "description": "This courses entails a broad scope experience in clinical reasoning strategies, proficient writing and documentation skills required by the occupational therapy assistant across a wide variety of practice settings. The objective of this course is to provide intensive & rigorous teaching-learning opportunities for students to utilize verbal and written clinical reasoning to facilitate occupation-based assessments, interventions and discharge planning. Additionally, student will be able to demonstrate knowledge of the use of technology in practice for electronic documentation, virtual environments, and telehealth platforms.", "prerequisite": "OT 205", "other": ["Writing Across the Curriculum"]}, {"course_name": "OT 212: Occupational Therapy for Child & Adolescent Health", "department": "Occupational Therapy (OT)", "credits": "4 Credits", "description": "Students will utilize clinical reasoning to facilitate occupation-based interventions that address client factors as related to conditions associated or the prevention of such with children and adolescents. Focused interventions will include areas of Course Justification occupation, performance skills, performance patterns, contexts and environments. Students learn about and gain skills related to occupational therapy evaluation, intervention, and documentation related to conditions associated with children & adolescents.", "prerequisite": "OT 205"}, {"course_name": "OT 214: Occupational Therapy for Psychosocial and Behavioral Health", "department": "Occupational Therapy (OT)", "credits": "4 Credits", "description": "Students will utilize clinical reasoning to facilitate occupation-based interventions that address client factors as related to psychosocial and behavioral health. Focused interventions will include areas of occupation, performance skills, performance patterns, contexts and environments. In-depth work will be engaged, as related to psychosocial and behavioral health interventions and programming in various clinical and community settings with individuals and groups. Overall, students will learn about and gain skills related to occupational therapy evaluation, intervention, doc", "prerequisite": "OT 205"}, {"course_name": "OT 216: Occupational Therapy for Physical Health and Rehabilitation", "department": "Occupational Therapy (OT)", "credits": "4 Credits", "description": "Students will utilize clinical reasoning to facilitate occupation-based interventions that address client factors as related to physical health and rehabilitation. Focused interventions will include areas of occupation, performance skills, performance patterns, contexts and environments. Students learn about and gain skills related to occupational therapy evaluation, intervention, and documentation related to physical health and rehabilitation. Students will be expected to identify, describe, explain, and demonstrate knowledge and skills related to physical health and rehabilitation along with client and caregiver safety.", "prerequisite": "OT 205"}, {"course_name": "OT 295: **SPECIAL TOPICS**", "department": "Occupational Therapy (OT)", "credits": "1-12 Credits/Maximum of 6"}, {"course_name": "OT 295B: Field Experience in Occupational Therapy II", "department": "Occupational Therapy (OT)", "credits": "1-6 Credits", "description": "Part II of supervised experience in select occupational therapy settings in the role of an occupational therapy assistant; seminars included.", "prerequisite": "successful completion of all didactic course work and successful completion of OT 295A"}, {"course_name": "OT 295E: Fieldwork Level I Experience in Occupational Therapy", "department": "Occupational Therapy (OT)", "credits": "2 Credits", "description": "This is the second fieldwork level I experience taken alongside of coursework during the 4th semester. It involves observation and engagement with individuals and/or groups to develop a better understanding of occupational performance, challenges and occupation-based interventions. The purpose is to apply knowledge and skills learned in didactic coursework to practice. An emphasis is placed on peer collaboration, professionalism and interactions with clients, on-site providers, and/or family members.", "prerequisite": "OT 195E"}, {"course_name": "OT 296: Independent Studies", "department": "Occupational Therapy (OT)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "OT 297: Special Topics", "department": "Occupational Therapy (OT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "OT 395A: Fieldwork Level II Experience in Occupational Therapy", "department": "Occupational Therapy (OT)", "credits": "1-6 Credits", "description": "This is the first 8-week supervised fieldwork experience in a community or clinical based setting. Level II fieldwork may be completed in acute care facilities, rehabilitation facilities, out-patient centers, behavioral/mental health facilities, school systems, home health agencies, outpatient centers, or skilled nursing facilities. Level II fieldwork includes hands-on experience with individuals and/or groups. Knowledge of the occupational therapy processes, professional conduct, and effective communication between supervisor and student is essential to accomplish fieldwork goals and objectives. The goal of Level II Fieldwork is to develop competent, entry-level, generalist occupational therapy assistants."}, {"course_name": "OT 395B: Fieldwork Level II Experience in Occupational Therapy", "department": "Occupational Therapy (OT)", "credits": "1-6 Credits", "description": "This is the second 8-week supervised fieldwork experience in a community or clinical based setting. Level II fieldwork may be completed in acute care facilities, rehabilitation facilities, out-patient centers, behavioral/mental health facilities, school systems, home health agencies, outpatient centers, or skilled nursing facilities. Level II fieldwork includes hands-on experience with individuals and/or groups. Knowledge of the occupational therapy processes, professional conduct, and effective communication between supervisor and student is essential to accomplish fieldwork goals and objectives. The goal of Level II Fieldwork is to develop competent, entry-level, generalist occupational therapy assistants.", "prerequisite": "OT 395A"}, {"course_name": "OT 412W: Introduction to Research", "department": "Occupational Therapy (OT)", "credits": "3 Credits", "description": "Introduction to quantitative and qualitative research process relative to occupational therapy.", "prerequisite": "STAT 200", "other": ["Writing Across the Curriculum"]}, {"course_name": "OT 495: **SPECIAL TOPICS**", "department": "Occupational Therapy (OT)", "credits": "1-6 Credits/Maximum of 6"}, {"course_name": "OT 496: Independent Studies", "department": "Occupational Therapy (OT)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "OT 497: Special Topics", "department": "Occupational Therapy (OT)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]