[{"course_name": "PHOTO 99: Foreign Studies--Photo", "department": "Photography (PHOTO)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "PHOTO 100: Introduction to Photography", "department": "Photography (PHOTO)", "credits": "3 Credits", "description": "An introduction to the aesthetics, history, and science of photography including practical and critical approaches to the art of photography.  PHOTO 100 Introduction to Photography (3) (GA) PHOTO 100 is an introduction to the aesthetics, history, and science of photography including practical and critical approaches to the art of photography for beginning students.The course will introduce students to photography as an art form and as an important medium in commercial applications, news and journalism, science, and industry. The course will look at photography in a social/historical context and showcase the work of important photographers. The course will examine the impact of technological, economic, and cultural forces on photography and, in turn, the role that it plays in our daily life, culture, and society.The course will also expose students to the various styles and techniques used in making photographs and give them the opportunity to gain experience and practical know-how in creating their own photographs. Through the process of assembling and critically examining 'galleries' of their own work and the work of others, they will be encouraged to develop a more informed critical point of view about photography as an art and important form of human expression.Grading will be based on three photographic assignments that will account for 50% of the semester grade. In addition, there will be four exams (on photographic history, aesthetics, technical aspects of photography, and image manipulation) that will account for 40% of the semester grade. The remaining 10% of the semester grade will be based on participation in class critiques. Students will be required to have access to a digital camera and the internet.PHOTO 100 will be offered in the fall and spring semesters each year.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"course_name": "PHOTO 101: Culture of Photography", "department": "Photography (PHOTO)", "credits": "3 Credits", "description": "This is a non-technical introductory photography course where students photographically and intellectually examine the role of photography in modern culture. PHOTO 101 expands students' depth of appreciation, knowledge, and understanding of the medium by providing them with a creative and intellectual background to realize its broad cultural scope. The course accomplishes this through photographic and written explorations of social, political and ethical issues relevant to photography. Photography wields unprecedented influence as a primary visual medium and students constantly use photography in their personal lives as both a communications tool and as a creative outlet. The ubiquitous smart phones with built in cameras are responsible for much of this explosive popularity with social media providing appealing venues for publicly displaying photography. Over the first decade of the new millennium, social media sites saw the volume of photo uploads increase dramatically, eventually exceeding 10 billion per month. In light of photography being a key medium students use to share and communicate information about themselves to the world at large, the course is designed to help them to think critically and ethically about the photographs they take, share, view and use. The major course teaching topics will address a broad range of contemporary issues relevant to how photography and culture affect one another. Students will become aware of photography as a constantly evolving medium, whose relatively short historical trajectory has culminated in the development of an easily accessible egalitarian art form that bridged the digital divide to interact intimately with personal computing, cell phone communications, the Internet, and social media. In the course, students will take photographs to fulfill photographic assignments, share them with peer audiences, and then engage in critical conversations regarding the aesthetic and communicative meaning and effectiveness of the photos. They will also engage in written assignments where the course presents them with case studies regarding current issues in photography such as, the impact of technological developments in the medium, ethical uses of photography, photography as free speech, and photography as social media. Students will conduct research on the topics and develop informed written position statements, which they will share with their classmates for peer evaluation and feedback. In addition, students will engage with selected readings regarding aspects of photography addressed in the major teaching topics.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PHOTO 199: Foreign Studies--Photo", "department": "Photography (PHOTO)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "PHOTO 200: Photo Studio I", "department": "Photography (PHOTO)", "credits": "3 Credits", "description": "A beginning level course that explores the fundamentals of photography.  PHOTO 200 Photo Studio I (3) PHOTO 200 is a beginning level course focused on the aesthetics and practical application of photography. Employing lectures, demonstrations and hands-on photographic assignments, it concentrates on teaching basic photographic techniques. Digital and film camera use, imaging software, basic digital scanning, digital printing methods, and basic darkroom practice are covered. A digital camera and access to a 35mm film camera is required.Grading is based on the quality of work in required creative projects (70%) and tests/quizzes (30%).PHOTO 200 will be offered fall and spring semesters.PHOTO 100 is the prerequisite for PHOTO 200.", "prerequisite": "PHOTO 100"}, {"course_name": "PHOTO 201: A Chronological Survey of Photography", "department": "Photography (PHOTO)", "credits": "3 Credits", "description": "A survey of photography's place and influence in a social, cultural, and historical context.  ART H 250 A Chronological Survey of Photography (3) This course explores the role played by photography over time in providing understanding and insight in a social, cultural, and historical context of the impact of the development of the photographic medium and its effect on social, political, cultural and technological events. Emphasis will be given to understanding the context that surrounds the scientific and aesthetic development of photography. This is a survey of the chronology of events in western culture that transpires from the inception of photography until the year 2000. It includes the influences and outcomes of photographers and those associated with the medium on our culture. Emphasis will be placed on the influence of photography on the world around it, and significant events and individuals in the development of the medium as a vital art form. The structure of the course will consist of research and discussion of events and individuals that characterized years selected for examination. Each week one or two decades of western culture will be highlighted. Although the thrust of research will relate to photographic subject matter, the events studied will span the culture. We will explore the development of art, literature, music, and photography, as well as, historic landmarks, and the events that have shaped present society. Each week a selection of visual material will be presented highlighting selected events, students will read literature from the period of discussion, significant pieces of music will be introduced, and accounts of periodic events will be surveyed.Each week, a group of students will be assigned to research at least one decade. Each student will gather information about a significant figure or event that occurred in the course of a given period. The student will be expected to prepare a short paper and give a five-minute oral presentation about his/her assigned year, historical figure or event. As each student presents, the chronology of events becomes clear and the multiple threads of history weaves a brilliant tapestry of our culture. For the final presentation the student will prepare a ten-page research paper about a historical figure or event.Students will be graded on the quality of the weekly oral presentations and the demonstrated level of commitment to research. Another significant part of their grade will be derided from the length of committed scholarship given to the ten-page term paper. Students must exhibit a level of originality, clarity, and insight. The student must demonstrate the capacity for the assimilation of facts and events relative to their subject and demonstrate how their subject relates to other events that occurred around the same time of their event. Toward this end students will be encouraged to work together to illustrate the interconection of the chronology.", "other": ["Cross-listed with: ARTH 250"]}, {"course_name": "PHOTO 202: Fundamentals of Professional Photography", "department": "Photography (PHOTO)", "credits": "3 Credits", "description": "This professionally oriented photography course gives students a foundation in the techniques and other competencies relevant to professional photography. PHOTO 202 Fundamentals of Professional Photography is a professionally oriented problem based learning class where students are introduced to the fundamental technical and creative aspects of client centered photography relevant to careers in photography and photography related or dependent fields. Students will be introduced to the photographic techniques; professional practices; creative sensibilities; and cultural knowledge significant to the work of a professional photographer and fields reliant on or related to professional photography.  The course content focuses student attention on mastering the technical fundamentals of professional photography in the context of the photographer/client relationship. The learning problems place emphasis on the communication, collaboration, and cooperation necessary to solve visual photographic problems in a professionally oriented setting. Under these conditions, students must collaborate with their clients to foster creatively productive relationships and meet their photographic needs.  This problem requires developing communication and interpersonal relation skills, which require clearly understanding the clients' needs and educating them about the creative possibilities and limitations. Under this teaching and learning model, students must learn to merge their own creative vision with the needs and desires of their professional clients. These skills are directly applicable to the real world problems students will encounter in professionally oriented circumstances after they graduate.  In the learning problems student peers, with the instructor's guidance, will play dual roles of clients and photographers with the goal of concentrating the photographers' attentions on communicating with their clients to create effective and creative purpose-driven images. Consequently, the course places a greater emphasis on communication, collaboration, and cooperation than it does on personally and individually motivated expression.  Since the advent of digital photography, the medium has undergone an unprecedented period of technological, creative, and cultural flux. Digital photography, computer technology, and social media have had dramatic impact on the medium, which we expect will continue into the future. Consequently, we have used a problem based learning approach to ensure we can continuously address the most relevant and current topics and information. We have also chosen major teaching and learning topics, which will continue to meet the fundamental needs of the students even as technology continues to shift.  At the beginning of each semester, students and the instructors will work collaboratively to develop five student learning-problems. These problems or projects will address the major teaching and learning topics under a variety of conditions designed to reinforce the subject matter, encourage flexibly creative thinking, and allow students to pursue the subject with greater critical depth and awareness.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking"]}, {"course_name": "PHOTO 210: Introduction to Architectural Photography", "department": "Photography (PHOTO)", "credits": "2 Credits", "description": "Exploration of approaches to photographing architectural interiors, exteriors, and architectural models.", "prerequisite": "Students in ARCBS_BS or BARCH majors or by permission of the program."}, {"course_name": "PHOTO 295: Internship", "department": "Photography (PHOTO)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "PHOTO 296: Independent Studies", "department": "Photography (PHOTO)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "PHOTO 297: Special Topics", "department": "Photography (PHOTO)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PHOTO 299: Foreign Studies--Photo", "department": "Photography (PHOTO)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "PHOTO 300: Photo Studio II", "department": "Photography (PHOTO)", "credits": "4 Credits", "description": "An intermediate course that explores advanced processes and applications in digital photography, digital image processing, and photographic inkjet printing.  PHOTO 300 Photo Studio II (4) PHOTO 300 is an intermediate course in the aesthetics, processes, and practical applications of digital photography, digital image processing, and photographic inkjet printing.A digital camera is required.Students will employ digital photographic applications and techniques to create images and expand their personal photographic vision. The course will help students to: 1. Gain a deeper understanding of the medium of digital photography artistically, critically, and as a technical process. 2. Explore the potential of the medium's ability to express ideas in new ways. 3. Understand advanced digital camera methods. 4. Learn advanced skills in the use and application of Adobe Photoshop. 5. Learn high quality film and object scanning procedures. 6. Learn to make photographic quality color archival inkjet prints and develop critical color awareness.Grading is based on the quality of work in required creative projects (80%) and presentations / participation in formal critique sessions / tests-quizzes (20%).The final course grade will be dropped one full grade for each absence or late submission beginning with the second late submission or absence.The prerequisite for PHOTO 300 is PHOTO 200.PHOTO 300 will be offered fall and spring semesters.", "prerequisite": "PHOTO 200"}, {"course_name": "PHOTO 301: Beyond Photoshop: Techniques in Digital Photographic Imaging", "department": "Photography (PHOTO)", "credits": "3 Credits/Maximum of 6", "description": "Students will learn aspects of photographic image making by capturing, processing, editing, retouching, digital printing, archiving, using digital images in the traditional darkroom, and manipulating of digital photographs with the emphasis on learning specialized software techniques beyond the usual Photoshop fare. Through a series of learning problems, students will focus on developing new skills and knowledge needed to accomplish techniques used in the creation of photo-based digital imagery. These skills include previsualization of images, camera techniques for images that require post-processing (such as stacking), shooting practices for enhanced digital workflow and choosing the image post-processing techniques most appropriate for the end-use of images, color management, digital printing and the use of digital images in the traditional darkroom. With awareness and knowledge of the total process, they will synthesize photographic shooting practices with computer-based image post-processing for creative, and professionally oriented image-making results. They will develop creative, critical and conceptual sensibilities needed to discuss and evaluate their work and the work of others using these methods. Students will identify, research, and analyze effective professional and creative practices in the field of photography with emphasis on developing skillful digital post-processing techniques. The shift to digital imaging has raised ethical challenges in photography-reliant fields such as the arts, sciences, advertising, and journalism. Students will analyze and assess factors necessary to recognize in making ethical image-making decisions. In the darkroom, students will learn to integrate their digital photography with traditional and historic photographic processes blending digital and analog techniques.", "prerequisite": "PHOTO 202"}, {"course_name": "PHOTO 303: Professional Photography: Studio Technique and Photocomposition", "department": "Photography (PHOTO)", "credits": "3 Credits/Maximum of 6", "description": "PHOTO 303 Professional Photography: Studio Technique and Photocomposition is an intermediate-level problem-based learning class where students acquire practical skills, and learn creative techniques relevant to professional photographic image making. The course focuses on building and synthesizing career oriented competencies in the areas of intermediate to advanced digital photography, photocomposition, studio lighting, and image processing related to professional photography. This is a technically oriented course, which emphasizes image making for professional purposes such as for clients or specific audiences. Using this approach, students will practice methods to tailor their own creative vision to the needs of collaborators such as art directors or other professionals. Students will focus on using lighting, cameras & lenses, and creative design techniques as tools to achieve professional quality photographs appropriate for creative artist portfolios used for photography and related careers. Students will develop the skills necessary to recognize and deconstruct lighting, camera, and design techniques in professional photography they may encounter in advertising, magazines, websites and other places where professional photography is used. After they graduate, students will be able to continue using these critical skills to learn and experiment with new techniques, which drive the constantly changing styles in photographic design and thus keep their work looking fresh and current. They will additionally develop and hone visual and verbal skills necessary to critically analyze their own photos and the photos of their peers. The course will culminate with students producing professional portfolios of their work suitable for career purposes.", "prerequisite": "PHOTO 200"}, {"course_name": "PHOTO 304: Fashion Photography", "department": "Photography (PHOTO)", "credits": "3 Credits/Maximum of 6", "description": "Students will learn the primary technical, aesthetic, and stylistic photographic techniques and knowledge required for the creation, presentation, and marketing of professional fashion photographs. The course will additionally address the relevant business practices associated with the field. Other essential material covered in the course will involve student research culminating in presentation projects relating to the history, aesthetics, and ethics of fashion photography. The course features a problem based learning approach where students and instructors work collaboratively to develop five student learning-problems. These problems or projects will address the major teaching and learning topics under a variety of conditions designed to reinforce the subject matter, encourage flexibly creative thinking, and allow students to pursue the subject with greater critical depth and awareness. Like fashion itself, fashion photography is subject to constant aesthetic, stylistic, and cultural change. To address these problems practitioners need to develop an awareness of style and trends in both the fashion industry and the fashion publishing industry, which are dependent on photography for marketing and advertising. Photography additionally adds historic value as a stylistic and creative archive for these industries. Fashion photographers must have the skills and mindset necessary to constantly learn and experiment with new techniques, which keep their work technically proficient and stylistically innovative and fresh. This problem based learning approach will allow the course to remain dynamic and address, in real-time, changing issues relevant to the industry and our students", "prerequisite": "PHOTO 200"}, {"course_name": "PHOTO 321N: Flow Visualization: The Art and Physics of Fluid Motion", "department": "Photography (PHOTO)", "credits": "3 Credits/Maximum of 3", "description": "In this course, student will explore techniques for the visualization of the physics of fluid flows including seeding with dyes and particles. Students will also gain technical expertise in a range of flow visualization and photographic techniques drawn from the course topics, such as photographing atmospheric clouds. Assignments are student-driven, to individuals and mixed teams of undergrad students from different majors. This course will reveal the techniques of making laboratory and everyday fluid flows visible for both scientific and aesthetic purposes. Students will create images using photographic techniques, and document their work in written reports. Questions such as \"what makes an image scientific?\" and \"what makes an image art?\" will be explored.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PHOTO 397: Special Topics", "department": "Photography (PHOTO)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PHOTO 399: Foreign Studies--Photo", "department": "Photography (PHOTO)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "PHOTO 400: Digital Photography in the Studio", "department": "Photography (PHOTO)", "credits": "4 Credits", "description": "Concepts and technology of the digital photography studio; large format digital cameras, electronic studio lighting and digital printing.  PHOTO 400 Digital Photography in the Studio (4) PHOTO 400 is a wholly digital, in-depth course in photography that explores the visual, technical, and creative application of digital photographic technologies in a studio setting.Students will employ digital photographic applications and techniques to create images and expand their personal photographic vision. The course will help students to:1. Gain a deeper understanding of the medium of digital photography artistically, critically, and as a technical process. 2. Explore the potential of the medium's ability to express ideas in new ways 3. Master the fundamental studio practices and technologies of digital photography o Professional large format digital view cameras o Professional electronic studio lighting o Adobe Photoshop o Digital printing o DVD-CD-Rom storage o Presentation and distribution utilizing the World Wide WebPHOTO 400 follows a workshop/critique format. A collaborative team approach is utilized to enhance students' abilities in working together to solve creative problems. Students will have to think critically, develop strategies to solve problems, and engage in class critiques as a normal expectation of the course.Grading is based on the quality of work in required creative projects (80%) and participation in formal critique sessions (20%). The final course grade will be dropped one full grade for each absence or late submission beginning with the second late submission or absence.PHOTO 400 will be offered spring semesters.", "prerequisite": "PHOTO 200", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "PHOTO 401: Fashion Photography", "department": "Photography (PHOTO)", "credits": "3 Credits/Maximum of 6", "description": "Students will learn the primary technical, aesthetic, and stylistic photographic techniques and knowledge required for the creation, presentation, and marketing of professional fashion photographs. The course will additionally address the relevant business practices associated with the field. Other essential material covered in the course will involve student research culminating in presentation projects relating to the history, aesthetics, and ethics of fashion photography. The course features a problem based learning approach where students and instructors work collaboratively to develop five student learning-problems. These problems or projects will address the major teaching and learning topics under a variety of conditions designed to reinforce the subject matter, encourage flexibly creative thinking, and allow students to pursue the subject with greater critical depth and awareness. Like fashion itself, fashion photography is subject to constant aesthetic, stylistic, and cultural change. To address these problems practitioners need to develop an awareness of style and trends in both the fashion industry and the fashion publishing industry, which are dependent on photography for marketing and advertising. Photography additionally adds historic value as a stylistic and creative archive for these industries. Fashion photographers must have the skills and mindset necessary to constantly learn and experiment with new techniques, which keep their work technically proficient and stylistically innovative and fresh. This problem based learning approach will allow the course to remain dynamic and address, in real-time, changing issues relevant to the industry and our students.", "prerequisite": "PHOTO 200"}, {"course_name": "PHOTO 402: Photographic Narratives", "department": "Photography (PHOTO)", "credits": "4 Credits/Maximum of 8", "description": "The development of a photographic project that leads to the creation of narrative visual stories. PHOTO 402 Photographic Narratives (4) PHOTO 402 is a project course in photography focused on the construction of visual narratives that feature a student's photographs as the central content. The course gives the student the opportunity to choose a subject and explore it through photographic means over an extended period of time, in this case, an entire semester. Emphasis is placed on the quality of photography and the organization of those photographs into print and digital forms of display. Students will be evaluated on their abilities to understand the medium through classroom instruction. Evaluation will also be determined by a student's imaginative capabilities through visualization and through the completion of a series of finished pieces.", "prerequisite": "PHOTO 200", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "PHOTO 402H: Photographic Narratives", "department": "Photography (PHOTO)", "credits": "4 Credits/Maximum of 8", "description": "The development of a photographic project that leads to the creation of a handmade book.  PHOTO 402 Photographic Narratives (4 per semester/maximum of 8) PHOTO 402 is a project course in photography focused on the construction of a handmade book that features a student's photographs as the central content of that book. The course gives the student the opportunity to choose a subject and explore it through photographic means over an extended period of time, in this case, an entire semester. Emphasis is placed on the quality of photography and the organization of those photographs in a book for their display.Students will be evaluated on their abilities to understand the medium through classroom instruction. Evaluation will also be determined by a student's imaginative capabilities through visualization and through the completion of a series of finished pieces.The prerequisite to PHOTO 402 is PHOTO 200.PHOTO 402 will be offered fall and spring semesters.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "PHOTO 404: Professional Photography Capstone Seminar: Self-Marketing and Professional Presence", "department": "Photography (PHOTO)", "credits": "4 Credits", "description": "PHOTO 404: Professional Photography Capstone: Self-Marketing and Professional Presence is a culminating problem based learning course where students analyze, synthesize, and organize their creative, academic, co-curricular, internship and photographic experiences to present to audiences of potential clients and employers in preparation for careers in professional photography or related fields. Trends in effective self-marketing and professional presence change over time with shifts in cultures, styles, and technologies. The Internet has given rise to global niche markets as well, which photographers often accommodate. As a result, there is no clear one-size-fits-all approach to this inconstant problem. We have chosen to apply a problem-based learning approach to this course with the intent that students will work with their instructors and peers to tailor the course learning problems to be relevant to each individual student and still meet the course learning objectives. To achieve that, in collaboration with their instructor and peers, every student will design five individualized capstone projects specifically pertinent to his or her situation. Each project will directly address at least two of the course major teaching topics. Much of the work of the capstone course will focus on reflection, refinement, and synthesis.", "prerequisite": "PHOTO 300"}, {"course_name": "PHOTO 405: Creative Projects in Photography", "department": "Photography (PHOTO)", "credits": "4 Credits/Maximum of 8", "description": "Special individual problems related to photographic vision.  PHOTO 405 Creative Projects in Photography (4 per semester/maximum of 8) PHOTO 405 is a project course in photography designed to challenge students and engage them in photographic assignments that expand their personal and individual vision.Projects may be developed using either digital or photochemical process (or a combination of the two) and may be organized as either group or individual assignments.PHOTO 405 will be offered fall and spring semesters.", "prerequisite": "PHOTO 202", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "PHOTO 406: Product Photography", "department": "Photography (PHOTO)", "credits": "2 Credits/Maximum of 4", "description": "This advanced level course will explore the practices of photographing products for print and product advertising.  PHOTO 406 Product Photography (2) This advanced level course will introduce the practice of photographing products with a focus on advertising. The development of the photographers' problem solving abilities, when lighting varied surfaces, will be considered. The importance of lighting for scale will be examined along with how or when to contribute to the context of a product by introducing appropriate set propping. Aesthetic and intellectual concepts of rendering of products for specific end uses will be explored. Theory will be applied and practiced by the student in a studio environment. As a practical course, lectures and studio demonstrations are major elements of the instruction. The lecture time will modify throughout the course to allow each student the flexibility to practice learned skills. Students will be responsible for scheduling individual studio time with the Integrative Arts Photo Services unit. A digital camera and a laptop computer with a copy of Adobe Photoshop installed are required.", "prerequisite": "PHOTO 200"}, {"course_name": "PHOTO 407: Portrait Photography", "department": "Photography (PHOTO)", "credits": "2 Credits/Maximum of 4", "description": "This advanced level course investigates contemporary portrait photography and traditional and modern styles of photographic lighting.  PHOTO 407 Portrait Photography (2) This advanced level course will investigate what portrait photography is and how portrait lighting evolved from the influences of early painting. Throughout the course there will be an ongoing investigation of the successes of historic, contemporary & influential photographers. Styles of photographic lighting will be explored as well as natural and artificial light sources. Why posing is important to portrait photography will be considered as well as how or when to suggest or direct a subject to acquire a pleasing pose will be examined and practiced. Theory will be applied and practiced by the student in environmental and studio locations. Through the study of character and expression, the student Portrait Photographer will introduce their style to portrait making. The course will enable the student to make intellectual and aesthetic choices when choosing appropriate equipment and technique, command the application of skillful lighting, develop sensitivities of interaction in prelude to the direction of the photo session and understand the incorporation of space or environment and it's relationship to the individual subject. A digital camera and a laptop computer with a copy of Adobe Photoshop installed are required.", "prerequisite": "PHOTO 200"}, {"course_name": "PHOTO 410: Photographing Motion and Athletic Events", "department": "Photography (PHOTO)", "credits": "2 Credits/Maximum of 4", "description": "A practicum course in photographing sports and athletic events.", "prerequisite": "PHOTO 200"}, {"course_name": "PHOTO 495: Internship", "department": "Photography (PHOTO)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "PHOTO 496: Independent Studies", "department": "Photography (PHOTO)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "PHOTO 497: Special Topics", "department": "Photography (PHOTO)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PHOTO 499: Foreign Studies--Photo", "department": "Photography (PHOTO)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]