[{"course_name": "PLET 50: Computer Applications for Plastics Engineering Technology", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "2 Credits", "description": "Programming, spreadsheets for the solution of technical problems, internet access for background and support information, formatting professional reports, creating presentations.  PL ET 050 Computer Applications for Plastics Engineering Technology (3) This course will acquaint first semester students with a variety of computer software programs that will be used in upper level classes. Extensive hands-on laboratory problems are designed to reinforce the lecture. After completing this course, the students should be able to access plastic related information on the Internet, prepare a formal report complete with footnotes or endnotes, create a computer generated technical presentation, import and export data between different software packages, and program technical spreadsheets for solving engineering problems. Student competency will be assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year with an enrollment of 40 to 50 students."}, {"course_name": "PLET 205: Introduction to Plastics", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Introduction to the plastics industry including fundamental aspects of plastic materials and processing; introduces the chemical influence on mechanical and flow properties of plastic materials.  PL ET 205 Introduction to Plastics (3) Introduction to the plastics industry including fundamental aspects of plastic materials and processing; introduces the chemical influence on mechanical and flow properties of plastic materials.", "prerequisite": "MATH 140"}, {"course_name": "PLET 206M: Plastic Materials and Properties", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Coverage of the most common commercial plastics including their additives, fillers, and fibers; includes common physical tests used to determine material characteristics.", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "PLET 206W: Plastic Materials and Properties", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Coverage of the most common commercial plastics including their additives, fillers, and fibers; includes common physical tests used to determine material characteristics; writing intensive.", "prerequisite": "PLET 205", "other": ["Writing Across the Curriculum"]}, {"course_name": "PLET 222: Introduction to Plastics Processing", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "4 Credits", "description": "Introduction to plastic processing methods, materials, tooling, design, and equipment.  Safe operation and practices are emphasized.  PL ET 222 Introduction to Plastics Processing (4) This course provides an introduction to plastics processing and is intended to provide broad foundational knowledge of the different types of plastics processing methods, equipment, and materials. The educational objectives are to develop competency in the determination of potential methods for manufacturing various component designs and the determination of cost effectiveness for the possible process alternatives selected. After completing this course, the student should have a basic understanding of a multitude of plastic processing methods and have knowledge of the interrelationship of part and tool design as it impacts manufacturing. The student should also understand materials and material flow phenomena as it affects processing and should understand the processing and troubleshooting techniques typically found in the industry."}, {"course_name": "PLET 227: Plastics Processing & Statistical Methods", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "4 Credits", "description": "Study of advanced issues in plastics processing, such as design of experiments and SPC/SQC will be covered.  PL ET 227 Plastics Processing & Statistical Methods (4) The course is intended to give the students the basic tools needed to identify and troubleshoot plastic processing problems. Injection molding will be the primary focus. The course objectives are: to introduce the student to the root cause of injection molding problems both at the start-up of a new mold and during production runs, to identify when a process has changed and to monitor the effects of attempts to improve the process using statistical process control and other statistical methods, to identify and minimize the sources of process variation; to ascertain the capability of measurement systems, and to gain understanding in the use of designed experiments techniques for developing cause and effect information. During the course, students will build upon knowledge gained in earlier courses in plastics materials and plastics processing.", "prerequisite": "PLET 50"}, {"course_name": "PLET 232: Introduction to Part and Tool Design", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "CAD techniques for designing plastic products and related tooling.  PL ET 232 Introduction to Part and Tool Design (3) This is the introductory course for designing plastic parts using CAD solids modeling techniques. This course builds upon fundamental CAD modeling skills developed during earlier courses and initially focuses on the fundamental techniques needed to construct solids models for thin walled plastic parts. Focus then shifts toward using similar solids and surface modeling techniques for designing molds for plastic parts. The course objective is to provide the basic knowledge to construct solid models of plastic parts and related tooling and to lay the foundation for more advanced plastic part and mold design courses.", "prerequisite": "PLET 222"}, {"course_name": "PLET 235: Tool Design & Machining", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "2 Credits", "description": "Study of the methods used to create the tooling used in plastics fabrication and the methods of maintaining tooling.  PL ET 235 Tool Design & Machining (2) This course will provide the students with an understanding of the construction methods and materials used in the creation of plastics tooling. Various methods of mold manufacture are introduced along with the fabrication practices needed to permit successful mold operation. The course concludes with a study of the materials used in mold construction and plastics tooling preventative maintenance practices. The course objective is to provide the knowledge needed to properly design parts for manufacturability. Students will also learn how to set up a system to maintain tooling to reduce catastrophic failures. Through the lab portion of this class, the students will obtain hands-on experience in the actual construction methods. This course uses knowledge gained in earlier plastics materials and processing courses to guide tooling design and fabrication decisions.", "prerequisite": "PLET 232"}, {"course_name": "PLET 296: Independent Studies", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "PLET 297: Special Topics", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "PLET 304: Plastic Material Properties and Applications", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Synthesis, polymerization, and characterization of thermoplastic and thermoset polymeric materials.  PL ET 304 Plastic Material Properties and Applications (3) This course studies the fabrication of polymers and macromolecules. Current commercial techniques are covered in detail and encompass the reactions and processes currently being used in the plastics industry today. Also covered is the technology for creating different grades of polymers by using various fillers, additives, and blends to create variations within the known polymers. This is supplemented by laboratory exercises that draw together theory and practice.Polymer synthesis is a key link between the atoms present before they become a part of a polymer molecule and the molded article, the end produce of the molding operation. The course objective is to establish a basic knowledge of these processes to enable a deeper understanding of the capabilities of molding, designing, and the performance of polymer articles. Students will be able to start with a handful of carbon atoms, a synthesis procedure, and an injection molding machine, and understand what affects the polymer at each stage, rather than being limited to understanding a given molding process. It will allow students to adapt to industrial needs and the push towards a scientific approach to problem solving, rather than acting as traditional molding machine processors. Students will also be able to correlate the polymerization process to the performance derived in plastics processes and molded articles. Student competency is assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year with an enrollment of 40 to 50 students.", "prerequisite": "PLET 206W"}, {"course_name": "PLET 323: Packaging Processes", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "In-depth studies and laboratory experiments will be conducted on processes such as blow molding, thermoforming, extrusion, and rotational molding, and other packaging processes. PLET 323 Packaging Processes (3) In this course the student will learn about plastic packaging processes of blow molding, thermoforming, extrusion. Other minor processes will be presented. The course objectives are to develop student proficiencies in identifying the polymer material requirements for each process, in identifying the mold design and construction techniques for each process, and knowing how plastic packaging processes differ from injection molding. The laboratory will include experiments that show the advantages of each process and to develop student competency in running equipment for each process explored. The students shall also develop competency in conducting elementary process troubleshooting for each process. Student competency is assessed by graded lab reports and projects.", "prerequisite": "PLET 227"}, {"course_name": "PLET 330: Advanced Tooling & Rheology", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "4 Credits", "description": "Tooling design strategies are developed considering a material's physical and rheological influences on processing and part formation.  PL ET 330 Advanced Tooling & Rheology (4) This course is intended to allow the student to develop an understanding of the critical relationship between the physical and rheological properties of plastic materials and their influence upon processing and part formation. The course objective is to establish this relationship since it is the basis of establishing tooling design strategies for optimizing part quality, moldability, and productivity. Upon completing the course, the student will have proficiency in the use of injection molding analysis software (Moldflow) and be able to develop strategies for its efficient and effective application. The software is used as a means to accelerate and enhance the students understanding of the injection molding process. Students will learn how software usage can be interwoven with knowledge of polymer melt rheology, shrinkage, warpage, residual stresses and their relationship to tooling to enable proper process and molded part design. Student competency is assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year with an enrollment of 40 to 50 students.", "prerequisite": "PLET 206W"}, {"course_name": "PLET 345: Heat Transfer", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Fundamentals of heat transfer including conduction, convection, and radiation.  PL ET 345 Heat Transfer (2) The course is intended to allow the student to develop the ability to conceptually evaluate heat transfer problems, and solve practical problems that might be encountered in the plastics industry including those that relate to energy management in plastic materials or processes. The course objectives are accomplished by establishing the concepts of the three principle mechanisms of heat transfer, solving plastics related problems illustrative of each mechanism, and reinforcing theoretical concepts learned through the use of simulation software and hands-on laboratory experiments. During this course students will build upon the knowledge gained in an earlier course in the thermal and fluid sciences. Student competency is assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year with an enrollment of 40 to 50 students.", "prerequisite": "PLET 366"}, {"course_name": "PLET 350: Design of Plastic Parts", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "4 Credits", "description": "Designing plastic parts utilizing CAD, FEA, and CAE technologies for the design and for structural, dimensional, and process evaluation and optimization.  PL ET 350 Design of Plastic Parts (4) The educational object of this course is to develop knowledge in the process of designing plastic parts and products. The course focuses on the critical relationship between the part design and the plastic material, tooling and the specific manufacturing methods used to produce the part. Use of CAE technologies are used for enhancing concurrent engineering strategies and evaluating manufacturability of a design. The course develops special design guidelines to accommodate plastic material characteristics and production requirements. The course also addresses issues of assembly and decoration of plastic parts. Upon completing the course students will demonstrate competency in relating how engineering properties of plastic materials and their unique characteristics relate to product design. This includes understanding visoelasticity and the effects of time, strain, rate, temperature and environment on plastic materials and the product. During this course students will build upon the knowledge gained in previous courses on strength of materials, plastic materials, part and tool design and finite element methods. Student competency is assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year with an enrollment of 40-50 students.", "prerequisite": "MET 213"}, {"course_name": "PLET 366: Fluid and Thermal Sciences", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Fundamentals of thermodynamic principles, fluid statics, and fluid dynamics.  PL ET 366 Fluid and Thermal Sciences (3) This course is intended to develop the student's ability to conceptually evaluate thermal or fluid problems, and solve practical problems that might be encountered in the plastics industry. The course objectives are: to introduce the fundamentals of thermodynamic behavior by defining pertinent material properties that define an equilibrium state based on temperature and pressure, to study internal energy, enthalpy, and the specific heats of liquids, solids, and gases, including ideal gas behavior and changes in energy level as a result of phase changes, and to introduce mechanical and electrical work leading to applications of the First Law of Thermodynamics. Other objectives are to study fluid static principles involving submerged body behavior by investigating topics of buoyancy and centers of pressure. Fluid dynamics studies explore the Bernoulli and Energy equations, head losses, and calculation of pump requirements from pressure drop and volumetric flow data. Criteria for determining laminar and turbulent flow are established. Viscosity of fluids and fluid rheology topics are also introduced. Students will apply the lessons learned in a subsequent course on heat transfer. Student competency is assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year with an enrollment of 40 to 50 students.", "prerequisite": "PHYS 250"}, {"course_name": "PLET 380: Introduction to Plastic Medical Devices", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1 Credits", "description": "Introduction to plastic medical devices and their manufacture.  Also covers the regulatory requirements of plastic medical devices.  PL ET 380 Introduction to Plastic Medical Devices (1) This course serves as the introductory course required for the new Certificate in Medical Plastics. It will provide students with an overview of the medical plastics industry. This will be accomplished by providing students with an understanding of the medical device regulatory environment and its impact on medical plastics design, manufacture and material selection.", "prerequisite": "PLET 205"}, {"course_name": "PLET 397: Special Topics", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "PLET 464: Plastics Failure Analysis", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Fundamentals of Plastics Materials Process and Design Failure Analysis.  PL ET 464 Plastics Failure Analysis (3) This course is intended to give the student an introduction to failure analysis for plastic articles. Course objectives are to: provide methods for the identification of common failure problems associated with modern molded plastic parts, perform a causal analysis for each failure type, provide an introduction, instruction, and allow operation of several analytical tools used to establish failure mechanisms, and review the relevant polymer physics and chemistry concepts involved in failure analysis. During the course students will be using concepts studied earlier in plastic material properties and applications. Student competency is assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year as a technical elective with an enrollment of 15 to 20 students.", "other": ["Enforced Prerequisite at Enrollment PLET 350 and MET 418"]}, {"course_name": "PLET 466: Thermoplastic Composites", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "This class will explore both well-established and emerging composite plastic systems, including the basic chemistries and driving forces to explain composite material properties from micro to nanoscale composite systems. Microcomposites are discussed in terms of both common commercial materials (Glass/nylon, polypropylene/talc, for examples) as well as for cutting-edge composite systems that are explained through the use of current technical literature. The common theme of chemistry to promote interfacial adhesion is developed for each system. Characterization techniques that are common to composite evaluation are taught. Nanocomposites are considered in light of the greatly enhanced surface area of the filler relative to the microcomposite analogue.", "prerequisite": "PLET 304"}, {"course_name": "PLET 468: Rapid Commercialization", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "Techniques to help get plastic products to market quicker and to build solids and surface modeling skills.  PL ET 468 Rapid Commercialization (3) The educational objective of this course is to develop the student's ability in using techniques to reduce the time to design a product and get it into production. The course objectives are to enable students to understand how to evaluate the differing points of view of each group during the concurrent engineering of plastic products and to analyze various rapid prototyping and tooling methods to determine their applicability to plastic products. Several simulations packages will be used to show their use in the preliminary design stages. During the course students will be using concepts studied earlier in plastic part design. Student competency is assessed by graded quizzes, examinations, homework, and special assignments. The course is offered once per year as a technical elective with an enrollment of 15 to 20 students.", "prerequisite": "PLET 350"}, {"course_name": "PLET 481: Plastic Product Development", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "This course provides students with an in-depth overview of the integrated new product development process.  PL ET 481 Plastic Product Development (3) Current product development trends have moved toward an integrated and interdisciplinary development process that includes team members from all aspects of the corporation. This course serves as an overview of that integrated product development process. Prior to this course, students will have studied methods and processes for the detailed and structural design requirements for plastic components. In this course, the students will be taught how their detailed design process fits into the remainder of the overall product development process. This will be accomplished by traditional lectures on the process and is underscored by a semester long project in which the students will form teams, invent a product idea, and develop that idea to a prototype state.Among the topics addressed are: -Concept development and selection -Working in a interdisciplinary team environment -Gathering and organizing customer needs -Translating customer needs into product specifications -Product development economics -Prototyping methods and purpose -Industrial design -Intellectual property", "prerequisite": "PLET 350"}, {"course_name": "PLET 482: Medical Product Development", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1 Credits", "description": "This course provides students with medical device development requirements and processes.  The course is to be taken in conjunction with PL ET 481 as both courses will utilize a semester project to invent and design a new product.  Over the course of the semester students will review the FDA classifications, filing requirements, and recommended practices for medical device development.  This knowledge will be applied and practiced through the semester projects.  Students will learn techniques for Failure Modes and Effects Analysis and how to properly document and manage product change through the development process.  PL ET 482 Medical Product Development (1) This course provides students with medical device development requirements and processes. The course is to be taken in conjunction with PL ET 481 as both courses will utilize a semester project to invent and design a new product. Over the course of the semester students will review the FDA classifications, filing requirements, and recommended practices for medical device development. This knowledge will be applied and practiced through the semester project.Students will learn techniques for Failure Modes and Effects Analysis and how to properly document and manage product change through the development process.", "prerequisite": "PLET 380"}, {"course_name": "PLET 483: Plastics in Medical Applications", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "This course focuses on plastics materials and properties and how they meet the unique medical application and device requirements.  PL ET 483 Plastics in Medical Applications (3) This course studies plastics materials in medical applications and devices. The course focuses on the properties that are important to medical devices such as chemical resistance, sterilization and biocompatibility. A broad range of polymers will be reviewed including commodity resins, such as polyolefins, engineering resins such as polycarbonates, acrylics, nylons and advanced polymers including polysulfones, polyetherether ketones and aramids.The synthesis, production and structure property relationships will be studied with particular emphasis on the effect on sterilization, biocompatibility and FDA regulatory requirements. The effect of additives, stabilizers, fillers and blends will also be reviewed.", "prerequisite": "PLET 304"}, {"course_name": "PLET 484: Medical Manufacturing Methods", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "3 Credits", "description": "This course provides instruction in the methods and practices used in the manufacturing of plastic devices in the medical industry.  PL ET 484 Medical Manufacturing Methods (3) This course provides instruction in the methods and practices used in the manufacturing of plastic devices in the medical industry. The course includes both manufacturing and regulatory requirements. A large portion of the class will involve a simulated process validation exercise. The concepts will be introduced in lecture, parts will be manufactured and measured in the processing lab, and data analysis will be completed in a computer lab. Injection molding will be emphasized as the major plastic part production method, but other processes will be used as needed. Clean room requirements, sterilization and material handling, and common assembly methods will also be covered.", "prerequisite": "PLET 380"}, {"course_name": "PLET 494: **SPECIAL TOPICS**", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-12 Credits/Maximum of 12"}, {"course_name": "PLET 494A: Plastics Projects", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research and/or design projects identified on an individual or small group basis. A specific title may be used in each instance and will be entered on the student's transcript.", "prerequisite": "MET 418"}, {"course_name": "PLET 495: Internship", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica or internships.  Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor", "other": ["Full-Time Equivalent Course"]}, {"course_name": "PLET 496: Independent Studies", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "PLET 497: Special Topics", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "PLET 499: Foreign Studies", "department": "Plastics Engineering Technology - BC (PLET)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]