[{"course_name": "PPEM 120: The Fungal Jungle: A Mycological Safari From Truffles to Slime Molds", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "This course is an introduction to the world of fungi and their impact on humans and the environment around us. Fungi represent one of five or one of sixteen Kingdoms of biological organisms depending on the system used. Either way the Fungi are an integral and essential component of the biological world worthy of study by scientists and non-scientists alike. However, despite their importance to the ecosystem and to human affairs Fungi are among the least studied groups of biological organisms. This is unfortunate since Fungi are often quite beautiful and impact everyone's life. The goal of the proposed course is to provide a framework and context for students to become familiar with the Fungi and their importance to other life forms including humans. For example, food production is both positively and negatively impacted by Fungi in quite profound ways from serving a source of highly sought-after products such as truffles to plant pathogens such as wheat rust destroying crops. This course explores questions such as: What are Fungi? Why are they important? How do they work in the ecosystem? How have humans harnessed the unique capabilities of Fungi? How are Fungi portrayed in the media, and are these accounts accurate? Students will also practice using their fungal knowledge to evaluate the potential efficacy of consumer products aimed at control of Fungi. Some course concepts will be explored through hands on activities and visits to relevant campus locations. At course conclusion students will have a deeper understanding of the fascinating Kingdom Fungi, and a greater appreciation for their importance, diversity, and beauty.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "PPEM 170N: Plant and Microbial Art", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "This inter-domain general education course provides a cross-disciplinary platform for plant- and microbe-facilitated creative production and art-mediated scientific learning. The course balances studio art activities with lecture- and discussion-based learning about integrated science and art topics. Students use the media of plant and microbial pigments, growth, and biology in a hybrid studio-lab environment. The biology, chemistry, and physics of these living and life-derived media are expected to form integral parts of student presentations. Lectures will provide information about broad scientific principles and in-depth learning about specific phenomena underlying the biologically-based media as well as relevant bio-art issues and contexts in which work is produced. Student projects will represent an integration of natural science understanding with artistic expression. Students will be encouraged to go in various directions with their creative efforts, including visual mechanics (light, color, composition), mark making (painting, drawing), meaning making (metaphors, allegories, cultural appropriations), storytelling, sensing (ways of seeing, phenomenology), and new media issues (e.g., post-humanism). Some example types of bio-media and their scientific connections include: plant pigments, which facilitate discussion of light, photosynthesis, basic chemistry and chromatography; bacterial cultures, which facilitate discussion of microbiology, cell biology, and cellular movements; and fluorescent proteins, which facilitate discussion of DNA, RNA, protein structure, mutations, species concepts, and genetic engineering. Student projects integrate the scientific basis of the bio-art media used such that the media become part of the message of the art.", "other": ["Cross-listed with: ART 170N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PPEM 225: Mushroom Cultivation", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "Students will learn about commercial production of edible mushrooms and how to cultivate them on both a small and commerical scale.  PPEM 225 Mushroom Cultivation (3) Pennsylvania's growers account for nearly 2/3 of the US total mushroom production. The production of the button mushroom, Agaricus bisporus, is a technically challenging process that requires a thorough understanding of substrate preparation and pasteurization (Phase I and Phase II composting) to be successful. The class will follow an Agaricus bisporus crop, at the Mushroom Research Center on campus, for the 11 week cropping cycle, participating in all aspects of button mushroom production. The course will also cover specialty mushroom production (including shiitake, oyster, maitake, enoki), which can be achieved on a small scale with some basic training and understanding of the different nutritional and substrate preparation techniques. Because cultivation of many specialty mushrooms is easier than button mushroom production, we will cultivate shiitake mushrooms both on sawdust logs as well as traditional oak logs. The class will have the opportunity to cultivate at least one other specialty mushroom, such as the oyster or lion's mane, in lab as well. We will schedule one Saturday field trip to visit several commercial mushroom farms in southeast Pennsylvania. Though this trip is not mandatory, it will be a good chance to view all aspects of commercial mushroom farming."}, {"course_name": "PPEM 296: Independent Studies", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "PPEM 297: Special Topics", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "PPEM 300: Horticultural Crop Diseases", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "The concepts of plant pathology are introduced to describe how plants, the environment, and biotic and abiotic plant pathogens interact over time to cause disease. Understanding these relationships can help to prevent disease problems or increase management and control options. Students learn how plant pathogens survive, reproduce, and spread. The role that plant pathogen distribution and regulation have played in shaping history and their influence on our economics, trade, and the environment is discussed. Common and significant plant diseases are illustrated to explain their causes, diagnosis, management, and national and international importance. All information is presented in online modules and all assessments are submitted online. Students should be able to recognize common garden plants in the NE United States such as maples, oaks, roses, crabapples, lilacs, peony, pachysandra, etc. Internet access and a digital camera are required (phone cameras are usually fine). Weekly assignments, quizzes, and labs are all submitted online. Several diagnosis exercises reinforce the practical aspects of identifying and controlling plant pathogens and the Plant Disease Assessment Report provides experience in plant disease site evaluation and management. Students customize many assignments to use their favorite plant materials and locations. The online modules supply course content but students apply the lessons in their own local area. Original student photographs are needed for diagnoses and the Plant Disease Assessment Report. Plant diseases have significant influences on plant aesthetics, economics, edibility, and viability. They have had profound influences on world history, and roles in modern national and international trade and bio-security. Students will gain an appreciation of the impact that horticultural crop diseases can have on society and the environment, including how the global trade of horticultural crops has resulted in the spread of pathogens important to agricultural crops and native plants.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PPEM 318: Diseases of Forest and Shade Trees", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "2 Credits", "description": "Introduction to diagnosis and management of forest and shade tree diseases.  PPEM 318 Diseases of Forest and Shade Trees (2) Diseases of Forest and Shade Trees, is a practical, hands-on, lab and lecture course designed primarily for forestry and landscape-contracting students. However, the course is also appropriate for any student interested in tree diseases, or for any student who simply wants to know \"What is wrong with my tree?\" The course content covers the important tree diseases of Pennsylvania, with emphasis on tree diseases that also have national and international implications. New and emerging tree diseases are discussed during the last two weeks of the semester."}, {"course_name": "PPEM 318H: Diseases of Forest and Shade Trees", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "2 Credits", "description": "Introduction to diagnosis and management of forest and shade tree diseases.  PPEM 318 Diseases of Forest and Shade Trees (2) Diseases of Forest and Shade Trees, is a practical, hands-on, lab and lecture course designed primarily for forestry and landscape-contracting students. However, the course is also appropriate for any student interested in tree diseases, or for any student who simply wants to know \"What is wrong with my tree?\" The course content covers the important tree diseases of Pennsylvania, with emphasis on tree diseases that also have national and international implications. New and emerging tree diseases are discussed during the last two weeks of the semester.", "other": ["Honors"]}, {"course_name": "PPEM 397: Special Topics", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PPEM 405: Microbe-Plant Interactions:  Plant Disease and Biological Control", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "Survey of microbe-plant interactions causing plant disease, mechanisms of pathogenesis, disease management, and microbial and molecular biological control strategies.  PPEM 405 Microbe-Plant Interactions: Plant Disease and Biological Control (3) Plant health in both natural and agricultural ecosystems is essential for sustaining human society and all other life forms on Earth. Plant disease epidemics are common and diverse and can have devastating effects on our population and economy by debilitating the ecosystems on which we depend. This course focuses on biological and environmental factors that influence microbe-plant interactions which in turn determine plant health and initiate plant disease epidemics. Developing strategies for maintaining healthy plants in both natural and agricultural ecosystems requires an understanding of pathogen and host biology, as well as the role of the environment in disease epidemiology. Students will learn about the survival and spread of important plant-infecting fungi, bacteria, phytoplasma, and viruses and how mechanisms for microbial pathogenicity are influenced by the environment. The final section of the course will focus on the use of beneficial microorganisms to maintain and improve plant health. Grades will be based on student performance on a wide variety of activities including labs, quizzes, seminar reports, and exams.", "prerequisite": "BIOL 110"}, {"course_name": "PPEM 412: Turfgrass Disease Management", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "PPEM 412 Turfgrass Disease Management (3) This course will provide an introduction to concepts of disease processes in plants and biology of plant pathogens, principles of turfgrass disease diagnosis based on symptom development, recognition of signs and microscopic structures of the pathogens, environmental and cultural management factors influencing disease development, significance of pathogen life cycle in disease epidemic development, and integrated turfgrass disease management practices for root and foliar disease. Disease of various turf types for golf courses, residential lawns, landscapes, and athletic fields will be discussed. Disease topics will include diseases that commonly occur in winter, disease that develop in spring and persist into summer, and disease that initiate in summer and remain active until late fall in most regions of North America. A number of non-infectious disorders of turf caused by extreme environmental conditions and improper cultural practices will also be discussed.", "prerequisite": "TURF 235"}, {"course_name": "PPEM 416: Plant Virology: Molecules to Populations", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "An exploration of the molecular biology and population dynamics of the virus-plant interaction.  PPEM 416 Plant Virology: Molecules to Populations (3) This will be the departmental foundation course for plant viruses, one of the four major pathogen groups. The course will entail an exploration of the history, nature, cause, socioeconomics, symptomatology, physiology, diagnosis, ecology, epidemiology, and control of viral diseases on plants. Special emphases will be placed on replication, and evolution of plant viruses, molecular biology of the virus-plant interaction, replication, virus-like agents (viroids & prions), natural and genetically engineered disease resistance, virus-vector relationship, and population dynamics.", "prerequisite": "BIOL 110"}, {"course_name": "PPEM 417W: Mechanisms of Bacterial Pathogenesis in Plants", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "This course covers the mechanisms that certain bacteria use to infect and cause disease in plants. We will consider the molecular, genetic, biochemical, and physiological systems that are used by plant-pathogenic bacteria to move about and infect plants, cause disease symptoms, evade plant immune responses, and derive nutrition from the plant. We will cover these topics through a combination of lectures and close readings of current and classic primary research articles. The course also has a major, hands-on laboratory component that includes experiments on bacterial genetics related to disease, bacterial physiology and behavior, and the stimulation of plant immune responses during bacterial infection. Students taking this class can expect to gain experience reading primary plant bacteriology research literature and designing and implementing experiments in plant-bacterial interaction.", "prerequisite": "BIOL 110", "other": ["Writing Across the Curriculum"]}, {"course_name": "PPEM 425: Biology of Fungi", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "4 Credits", "description": "BIOL 425 / PPEM 425 (4 cr.) is a lecture and laboratory survey of the diversity of Fungi, consisting of two 75-minute lecture and two 180-minute laboratory/field activity periods per week. The course moves from branch to branch in the Fungal tree of life, covering aspects of ecology, morphology, physiology and life history, as well as current and historical importance to human affairs in medicine, agriculture and industry. Topics covered as students move through the Fungal tree include: 1) Macrofungi seen in the field; 2) Fungal evolution; 3) Fungal reproduction and dispersal; 4) Fungal growth, development and structure; 5) Fungal genetics and genomics; 6) Fungi as mutualistic symbionts of plants, animals and other organisms; 7) Fungal diseases of plants, animals and humans; 8) Fungi as toxin producers; 9) Fungi as sources of food, pharmaceuticals and enzymes; and 10) Fungi as research organisms used to understand basic biological processes. Some laboratory sessions consist of field trips to local forests to observe and collect Fungi for observation in the laboratory.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: BIOL 425"]}, {"course_name": "PPEM 427: Mycotoxins: Effects of Fungal Toxins on Human and Animal Health", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "Description and history of mycotoxicoses. Mycotoxin formation, occurrence, control, economic and social impacts, and regulatory issues.  PPEM 427 Mycotoxins: Effects of Fungal Toxins on Human and Animal Health (3) This course will provide a comprehensive overview of the multi-disciplinary subject of mycotoxicology. Mycotoxins are chemicals produced by fungi that are toxic to humans and animals. Students will become familiar with the history and description of mycotoxins and mycotoxicoses, formation of mycotoxins, biology of mycotoxigenic fungi, methods of mycotoxin analysis, fate of mycotoxins in food processing, management and prevention of mycotoxins, regulations, and economic and social impacts. This course is appropriate for students who wish to learn more about fungi beyond the introductory level, as well as for those with interests in animal science and husbandry. The subject of mycotoxicology involves most aspects of the agriculture-food system so students of food science, crop and soil science, entomology and plant pathology will find relevant topics in mycotoxicology. Biology and microbiology students especially those with interests in plant-associated microbes and ecology will also benefit from this course. Course format will be two lectures per week and one period of discussion that will include laboratory activities, field trips, case study discussions, and student presentations.", "prerequisite": "BIOL 110"}, {"course_name": "PPEM 430: Air Pollution Impacts to Terrestrial Ecosystems", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "This course introduces student to air pollutant sources, transport, meteorology, and temporal and spatial trends of pollution dispersion and deposition. An overview is presented of the direct and indirect effects of air pollutants on terrestrial ecosystems with an emphasis on plant life. The effects of ozone, sulfur dioxide, nitrogen oxides, particulate matter, halogens, and combined pollutants leading to acidic atmospheric depositions are presented. Emphasis is placed on air pollutants as plant pathogens leading to symptoms and eventual long-term accumulative effects to entire ecosystems. Methods of diagnostics, factors affecting plant response, ecosystem decline and resiliency, pest interactions, assessment of loss and cost/benefit analysis leading to abatement follows. Final parts of the course include perspectives of public awareness, development of National Ambient Air Quality Standards, compliance prevention of significant deterioration, and the Clean Air Act reforms of 1990.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: ERM 430"]}, {"course_name": "PPEM 440: Introduction to Microbiome Analysis", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "The development of next-generation sequencing (NGS) technologies was initially spurred by the desire for a human genome sequence, but these tools are now essential to all areas of biology. The amount of data produced by NGS allows us to ask questions about processes that occur across genomes, communities, and even landscapes. In particular, NGS has revolutionized the study of environmental microbiology, allowing us to investigate the thousands of microbial \"species\" that co-occur in a given environment, even though most of these microorganisms have not been captured or observed in culture. The entire complement of microorganisms (and their genes) that occur in a particular environment is frequently referred to as the \"microbiome\" of that environment. The field of microbiome research is evolving rapidly, which means that there are many opportunities to contribute to exciting new discoveries. However, this fast pace of change has made it difficult to properly prepare students for microbiome-focused graduate work. In this course, students will learn about the development of NGS techniques, as well as recent applications of NGS to natural and agricultural soil systems, including how these tools can be used to understand both targeted and unintentional human-induced changes to microbiomes. Students will also develop the ability to interpret microbiome-related literature and to work with NGS data using freely available software. In the second assignment, students will explore additional software not used in class, in order to learn how to learn to use unfamiliar bioinformatics tools. This course is intended for students with very little background in programming or bioinformatics, but with a strong understanding of microbiology, molecular biology, and/or ecology. At the conclusion of this course, students will be able to: - Interpret microbiome terminology and figures. - Understand and present a summary of a microbiome-based journal article. - Analyze microbiome-based high-throughput sequencing data using freely available software. - Apply microbiome analysis tools to unknown data. - Express their interpretation of microbiome data in oral, written, and graphical contexts."}, {"course_name": "PPEM 454: Virus Ecology", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "Virus ecology describes how viruses interact with their hosts, and how those interactions modulate the hosts' interactions with their environment.  PPEM 454 Virus Ecology (3) In this course students will learn about the interplay among viruses, hosts and the environment. The diversity of viruses, which infect all known life forms, will be explored. The important role viruses play in the ecology of the planet, including carbon cycles, host adaptation to extreme environments, host health or disease, and host evolution will be discussed in depth using specific examples. Students also will learn to critically read the scientific literature. Learning will be assessed through a combination of written and oral assignments and exams.", "prerequisite": "BIOL 110"}, {"course_name": "PPEM 456: Applied Microbial Ecology", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "3 Credits", "description": "This is a lecture based course that will broaden students' understanding of the diverse biotic and abiotic interactions relevant to microbes in diverse environments. In particular, this course focuses on ecological interactions between microbes in a common environment or between microbes and their eukaryotic hosts (e.g. plants and animals). In addition to learning about ecological theory as it applies to microbes, students will learn about historical and contemporary approaches to studying microbes in different environments. This will include substantial focus on cutting edge '-omics', microscopic, and direct functional analytical approaches to understand both the distribution of microbial taxa (i.e. who's there) and what processes they carry out in their natural environments (i.e. what they're doing). In the latter portions of the class, students will apply the theory and techniques to understanding the ecology of specific environments, including environmental, agricultural, and food environments. The objectives of this course include: provide students with a firm understanding of contemporary microbial ecology and environmental microbiology; conceptually link processes that occur in disparate environments, such as plant roots, termite guts, and cheese rinds; provide students with the language to discuss these concepts and processes; make students familiar with and conversant in 'omic' and other cutting edge functional techniques used to study microbes in their natural environments; provide select examples of how humans take advantage of microbial ecology for our benefit (such as suppression of pathogens or promotion of waste decomposition). The course will conclude with a research and writing project where students will review the microbial ecology of a specific environment. This course expects students to have an understanding of basic microbiological concepts.", "prerequisite": "MICRB 201"}, {"course_name": "PPEM 494: RESEARCH PROJECT", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "PPEM 496: Independent Studies", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "PPEM 496H: Independent Studies", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "PPEM 497: Special Topics", "department": "Plant Pathology and Environmental Microbiology (PPEM)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]