[{"course_name": "PSYCH 83S: First-Year Seminar in Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Implications of contemporary psychological research and theory. PSYCH 83S First-Year Seminar in Psychology (3) (GS;FYS) (BA) This course meets the Bachelor of Arts degree requirements. Modern science provides perspectives on human beings that may conflict with our intuitive and conventional views of ourselves as individuals capable of free choice and responsibility. These perspectives raise important questions for how we understand ourselves and others. The goal of this course is to help students to understand the basis of these contemporary scientific views of human beings, and to think critically about the ways in which these views shape human experience. The specific research and theories discuss will vary by section. Students will read selections from the scholarly literature in psychology, as well as popular or media selections related to the topic. The class format will be open discussion, and students will be expected to come to class prepared to discuss the assigned readings. Evaluation will be based on short writing assignments, exams, in-class presentations, and class participation. Writing assignments will generally require that students apply concepts discussed in class to particular topics, or that they use library and Web resources to find relevant material. In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them including the opportunity to develop relationships with faculty and other students who share their academic interests. This course fulfills the first-year seminar requirement as well as a general education or Bachelor of Arts social/behavioral science requirement.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 97: Special Topics", "department": "Psychology (PSYCH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PSYCH 100: Introductory Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course is required and foundational for students who are majoring or minoring in psychology and it is a prerequisite for other psychology courses. Psychology is a scholarly discipline, a scientific field, and a professional activity. Its overall focus is the scientific study of behavior and experience, and of associated mental and physiological processes. As a scholarly discipline, psychology represents a major field of study in academic settings, with an emphasis on theories and principles of behavior and experience. As a science, psychology is a domain of research in which investigators analytically and systematically study behavior and experience to develop theories and principles and to understand their application to real-world situations. As a profession, psychology involves the practical application of knowledge, skills, and techniques for enhancing well-being and quality of life, as well as solving or preventing individual and social problems. This course provides an overview of the field of psychology, including research, theory, and application. Specific topics include the biological bases of behavior, sensation and perception, learning, cognition, motivation and emotion, development, social cognition and social influence, personality and individual differences, and mental disorders and therapy. Content is presented through a combination of lectures, readings, and demonstrations. Evaluation is primarily based on objective exams. A major goal of the course is to show how questions within these areas are addressed through empirical research. The course introduces students to theories, research, and procedures used in psychological research and practice and encourages them to apply this knowledge to enhance their lives. After taking this course, students should be able to make informed decisions about participation in future psychology courses and have a better understanding of psychology as a science and of human behavior.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PSYCH 100H: Honors Introductory Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Psychology is a scholarly discipline, a scientific field, and a professional activity. Its overall focus is the scientific study of behavior and experience, and of associated mental and physiological processes. As a scholarly discipline, psychology represents a major field of study in academic settings, with an emphasis on theories and principles of behavior and experience. As a science, psychology is a domain of research in which investigators analytically and systematically study behavior and experience to develop theories and principles and to understand their application to real-world situations. As a profession, psychology involves the practical application of knowledge, skills, and techniques for enhancing well-being and quality of life, as well as solving or preventing individual and social problems. This course, which serves as a prerequisite for most upper-level psychology courses, provides an overview of the field of psychology, including research, theory, and application, and promotes thinking about how students can apply psychology to enhance their lives. Specific topics include the biological bases of behavior, sensation and perception, learning, cognition, motivation and emotion, development, social cognition and social influence, personality and individual differences, and mental disorders and therapy. Evaluation is primarily through exams, papers, projects, or presentations and assesses psychological knowledge, skills, conceptual thinking, and critical analysis. After taking this course, students should be able to make more-informed decisions about participating in future psychology courses and have a better understanding of both psychology as a science and human behavior. Introductory Psychology is required for the Psychology major and minor. This honors version of the course is designed to provide the opportunity for students to engage with the material at greater depth and with greater emphasis on the scientific basis for the content.", "other": ["General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PSYCH 100S: Introductory Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Introduction to general psychology; principles of human behavior and their applications.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "PSYCH 105: Psychology as a Science and Profession", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Overview of history and methods of psychology as a science and profession; applications and ethical issues in psychology.  PSYCH 105 Psychology as a Science and Profession (3)(BA) This course meets the Bachelor of Arts degree requirements. The purpose of this course is to introduce Psychology majors and prospective majors to basic principles of research and practice in scientific psychology. The course provides a survey of the subfields of psychology, their history, and their current importance in both academic and applied settings. The focus is on common principles and issues important across these subfields. Students will learn how psychological research is conducted, survey applications of psychological research, consider ethical issues in psychological research and practice, and learn about careers in a variety of subfields in psychology. Students will be evaluated on the basis of multiple-choice exams (75%), in-class activities (10%), and short writing assignments (15%). The course will be required for the Psychology B.A. and Psychology B.S. (all options) majors, but will not be a prerequisite for any other course. The course will be offered each fall and spring semester in large sections of 300-350 students.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 109N: The Psychology of Artistic Creativity", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Creativity is an essential component of people's lives. It plays a critical part in advancing our society via art, design, and science. However, what is creativity? What contributes to it? Moreover, how can one become more creative? The goal of this introductory course is to answer these questions by integrating art and psychology. The course begins with a discussion of what is creativity. In the process, the class will discuss how context, culture, and narrative play a key role in answering this question. Next, the course will examine who is creative. Here, the class will discuss what, if anything, contributes toward a creative personality, what role developmental factors play in the creative process, and if there is a link between mental illness and creativity. Lastly, the course will discuss the creative process. Here, students will learn how the brain and body help people process, understand, and create information, how emotions influence thought and are conveyed to others, how motivational processes can both encourage and hinder creative endeavors, and how inter- and intra-personal processes can facilitate and destroy creative expression. Students will learn about these processes by examining creativity via two perspectives: the perspectives of various artists, art scholars, and art educators and from the perspectives of various disciplines within psychology, including personality, clinical, development, and social psychology. Students also will complete exercises that encourage critically evaluating these perspectives and actively applying their potential insights to their own artistic endeavors. Thus, a key element of this course is not only to understand more about creativity, but to be able to apply artistic and psychological practices and knowledge to better understand and improve one's own and other's creative potential.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 120N: Knowing Right from Wrong", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "\"Knowing Right from Wrong\" provides a comprehensive understanding of the nature of moral ideas, beliefs, and behaviors in contemporary contexts. What roles do nature and nurture play in the development of moral sensibilities? How do moral emotions and moral reasoning interact to produce moral behavior? What defines moral character and how does it influence what we do? Is it possible to derive what ought to be done from what is known about the world? How do we respond when moral demands compete with another? How do our moral convictions color our perceptions of world events? Can individuals and groups with differing moral commitments communicate with one another and live together peacefully? The course integrates perspectives from philosophy, psychology, and sociology, and prepares students to think about (and act in) a world in which morality (and its linked concepts, such as judgment of others) plays an increasingly important social and political role. The course treats morality as both an aspirational concept and as an actual social practice, and focuses on three major themes: (1) the origins and development of moral reasoning and ethical systems, (2) the influence of moral emotions and moral intuitions on moral reasoning and behavior, and (3) the influence of social and contextual factors on moral behavior and expression. Integrating the philosopher's interest in ethics, with the psychologist's interest in the mind and body, and the sociologist's interest in groups, the course provides a comprehensive introduction to morality in contemporary society, and the ways in which it shapes the lives of people in everyday situations.", "other": ["Cross-listed with: PHIL 120N, SOC 120N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PSYCH 144Z: Climate Change: Individual Behaviors and Group Attitudes", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "PSYCH 144Z: Climate Change - Individual Behaviors and Group Attitudes is intended to be an introduction to environmental attitudes and behavior research within the social sciences, especially the fields of social and environmental psychology. This course allows students to understand the varied psychological processes, including individual attitudes, societal values, and personality traits, that shape a person's interactions with and feelings toward the physical environment within the context of global climate change. Drawing on methodology and theory in the areas of attitude change, social cognition, environmental perception, pro-social behavior, and emotions, this course will provide students with insight into how individual and group actions and mental processes can impact beliefs and actions toward global climate change while also providing a foundation for ways to alter those behaviors in meaningful ways. By linking with other courses on climate change in the arts (GA) and natural sciences (GN), this course represents one piece of a larger discussion in which global problems such as climate change are studied and prevented from multiple perspectives and disciplines. PSYCH 144Z fulfills 3 credits of the GS Domain General Education requirements. PSYCH 144Z may also be used in combination with either ART 144Z or BIOL 144Z as linked courses to fulfill 6-credits of Integrative Studies.", "other": ["General Education: Social and Behavioral Scien (GS)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 150N: Human Nature: The Science of Extreme Altruism and Violence", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Why do humans so readily help strangers in some circumstances and not others? Why does our species have a tragic history of war, genocide, and violence? Just how flexible is our tendency for altruism and violence? Human Nature: The science of extreme altruism and violence surveys and synthesizes two of the most fascinating and unusual features of humans: our extremely high levels of altruism alongside our tragic propensity for violence. Treating humans as both biological and cultural creatures, we use the tools of anthropology, biology, and psychology to explore some of the most vexing questions in the social sciences and humanities. We will consider the role of the brain, hormones, genetics, social context, and evolution in producing the best and worst our species is capable of. While there are no prerequisites, you will gain a foundation in basic neurobiology and behavioral endocrinology alongside familiarity with leading theories of violence and altruism. We will use a combination of lectures, readings, and discussions to understand the science of altruism and violence. Throughout the course, we will use well-known current events and cross-culture case studies to anchor theory in real social contexts. By the end of this course, you will have the tools to evaluate behavior as the product of a complex interaction between biological, physiological, and social structures. You will never look at the world the same again!", "other": ["Cross-listed with: ANTH 150N", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 150Q: Human Nature: The Science of Extreme Altruism and Violence", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Why do humans so readily help strangers in some circumstances and not others? Why does our species have a tragic history of war, genocide, and violence? Just how flexible is our tendency for altruism and violence? Human Nature: The science of extreme altruism and violence surveys and synthesizes two of the most fascinating and unusual features of humans: our extremely high levels of altruism alongside our tragic propensity for violence. Treating humans as both biological and cultural creatures, we use the tools of anthropology, biology, and psychology to explore some of the most vexing questions in the social sciences and humanities. We will consider the role of the brain, hormones, genetics, social context, and evolution in producing the best and worst our species is capable of. While there are no prerequisites, you will gain a foundation in basic neurobiology and behavioral endocrinology alongside familiarity with leading theories of violence and altruism. We will use a combination of lectures, readings, and discussions to understand the science of altruism and violence. Throughout the course, we will use well-known current events and cross-culture case studies to anchor theory in real social contexts. By the end of this course, you will have the tools to evaluate behavior as the product of a complex interaction between biological, physiological, and social structures. You will never look at the world the same again!", "other": ["Cross-listed with: ANTH 150Q", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 169N: What it means to be human", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course will investigate the distinctiveness of Homo sapiens, using fossil and non-human animal comparisons to highlight how modern humans are both similar to and different from other species. Basic elements from the fields of biology, genetics, anatomy, physiology, ecology, cognition, neuroscience, social psychology, and anthropology will be integrated for a complete and robust picture of humans and their place in the animal world. Furthermore, students will expand upon this integration of fields to make inferences about how an individual's or society's perspective on human uniqueness, or the lack thereof, impacts decisions and behaviors relevant to research ethics, environmental policy, educational policy, religion, and/or social issues.", "other": ["Cross-listed with: BIOL 169N", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PSYCH 175N: Mental Illness and the Movies", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course serves as an introduction to the integration of psychology and film analysis, with a focus upon mental health. PSYCH 175N / COMM 175N seeks to help students understand the extent to which cinema can influence our perceptions of mental illness, and how the experience of mental illness can influence cinema. Students will be guided to critically analyze and discover how cinema can build or break the stigma and stereotypes regarding various types of mental illnesses and their treatments. The course is designed to familiarize students with various mental disorders (e.g., autism, schizophrenia, bipolar disorder, dissociative identity disorder, anxiety disorders, substance abuse, and dementia), aspects of their treatment (e.g., psychotherapy, medication, and ECT), and the creative ways in which filmmakers can choose to portray mental illness and its treatment (e.g., camera angles, lighting, music, costuming, casting, editing, method acting, and marketing) across cinema formats (e.g., in feature, independent, and documentary films). Students will be guided to consider how the cinema has shaped their own perceptions of mental illness, and how they could guide a filmmaker to generate a creative, compelling, and accurate portrayal of various types of mental illness and their treatments. PSYCH 175N / COMM 175N emphasizes integrative thinking, and seeks to help students develop critical reading, viewing, and thinking skills. The course incorporates lectures and assigned readings with the viewing of feature films during a weekly practicum period. Most lectures incorporate case examples and video clips to help students exercise their critical thinking skills. Introductory lectures provide a critical social and historical context for each week's film screening. Follow-up lectures and discussions offer critical and integrative analysis. Course assessment includes both objective measures and essay exams. PSYCH 175N / COMM 175N is an Interdomain General Education course that incorporates student learning criteria from both the arts (GA) and the social sciences (GS). It assumes to prior exposure to psychology or to film studies. As such, the course is designed to have broad accessibility, primarily for introductory level students.", "other": ["Cross-listed with: COMM 175N", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "PSYCH 197: Special Topics", "department": "Psychology (PSYCH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PSYCH 199: Foreign Studies", "department": "Psychology (PSYCH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "PSYCH 200: Elementary Statistics in Psychology", "department": "Psychology (PSYCH)", "credits": "4 Credits", "description": "This course provides an introduction to the descriptive and inferential statistics commonly used in psychology, and to hypothesis testing as a method of scientific investigation. It also explores the ways in which the assumptions of statistical tests place constraints on experimental design and, conversely, how the design of experiments can dictate the statistical test appropriate for data analysis. The ability to understand and perform statistical analyses, and to evaluate the match between statistical analysis and experimental procedures, is critical to reading and understanding the empirical research that psychology is based upon, and that will be covered in upper-level psychology courses such as PSYCH 301W, for which PSYCH 200 is a pre-requisite, most 400-level courses, and certain lower-level psychology courses. In addition to performing some statistical tests by hand, students may also conduct statistical tests via statistical software packages commonly used by psychologists, such as SPSS or R. Finally, this course will include material on the responsible and effective communication of statistical results to a scientific audience according to APA guidelines. Specific topics covered include probability theory, scales of measurement, measures of variability and central tendency, normal curves, graphical displays (e.g., histograms, bar charts), the relation between samples and populations, correlations, simple regression, basic mean differences tests (e.g., t-tests), effect sizes, and confidence intervals. Classes may also cover z-tests, simple and factorial ANOVA, non-parametric tests (e.g., Chi Square, Mann-Whitney U, Wilcoxon), statistical power, or other statistical techniques commonly used in psychology.", "prerequisite": "PSYCH 100", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 212: Introduction to Developmental Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Developmental psychology involves the scientific study of the social, emotional, and intellectual changes that enable progression from infancy to adulthood. As part of a scholarly discipline, scientific field, and professional activity, the overall focus of developmental psychology is the scientific study of age-related changes in emotions, cognitions, language, personality and social relations and the relationships of these changes to familial, peer, and cultural experiences, biological development, and personal efforts to make sense of the social and object worlds. As an important area of psychological science, developmental psychology is a domain of research in which investigators analytically and systematically study behavior and experience to develop theories and principles and to understand their application to real-world situations. As part of a profession, developmental psychology involves the practical application of knowledge, skills, and techniques for enhancing the well-being and quality of life of children, adolescents, and their families, as well as the development of age-relevant solutions to and strategies for the prevention of individual and social problems.This course provides an overview of the field of developmental psychology, including its history, research methodologies, theories, and applications. Specific topics include but are not limited to the biological bases of development, parent-infant attachment, the development of sensation and perception, cognition and linguistic development, emotional development, moral development, and identity development. Content is presented through a combination of lectures, readings, activities, and demonstrations. Evaluation is primarily on the basis of objective exams.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 217N: The Science of Human Resilience", "department": "Psychology (PSYCH)", "credits": "3 Credits/Maximum of 3", "description": "This course provides a comprehensive understanding of resilience from both a biological and psychological perspective. It provides students with an integrative approach to understand the dynamic interplay between nature and nurture in understanding children's at-risk behaviors as well as understanding children's resilient behaviors. The study of resilience will be examined with a systems approach using a strengths-based framework of positive youth development. Topics will include brain development, the biology of stress, environmental factors influencing resilience, children's mental health, growth mindset, and the science of resiliency. Specific attention will be directed towards understanding the neuroplasticity of resilience. Content will be presented using interactive lectures, in-class activities, readings, and small group discussions. After taking this course, students will increase their understanding of how specific environmental factors interact with biological underpinnings to affect children's levels of resilient and at-risk behaviors (e.g., depression). Strategies to optimize children's positive developmental outcomes will be emphasized throughout. This course includes a service learning component where students have the opportunity to apply newly acquired skills to mentor children in supervised school/community settings.", "prerequisite": "PSYCH 100", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 220: Community Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "The purpose of this course is to provide an overview of the history and development of Community Psychology as field. In addition, you will be exposed to key concepts and values associated with Community Psychology, as well as examples of Community Psychology in action. You will learn about multiple levels of intervention, including the individual, small group, community, and societal levels, as well as the interrelationship between these levels. You will also learn to examine psychological phenomena in context. Course Goals: In this course, you will: 1. understand what Community Psychology is, including being able to explain the seven core values of Community Psychology; 2. develop a deeper understanding of what working with communities entails; 3. analyze what kinds of issues Community Psychologists must be aware of when working with diverse populations; 4. analyze how human diversity impacts our everyday life; 5. evaluate problems that might arise around human diversity and pose possible solutions to problems.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 221: Introduction to Social Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Introduction to Social Psychology discusses how people's thoughts, feelings, and behaviors are influenced by other people (real or imagined). The course will provide an overview of the field, potentially covering such topics as: attitudes, persuasion, person perception, automatic vs. conscious thought, the self, prosocial behavior, aggression, interpersonal attribution, conformity, obedience, culture, groups, prejudice and discrimination from a psychological perspective.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 230: Introduction to Psychologies of Religion", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course will act as an overview of the many ways that religious and spiritual beliefs can and do influence our daily lives, including an individual's attitudes, motivations, cognitions, emotions, and behaviors (and vice versa). We will explore concepts of religion and various religious perspectives as they relate to psychology, and the social and cultural implications of religion. The focus of this course will not be on any religious affiliation in particular, but instead on how people view religion and spirituality and use those beliefs in both positive and negative ways. Do not expect that we will answer such questions as \"Does God exist\" or \"Which religion is right?\" This is not what the course is about. We will, however, explore the psychological factors related to believing, or not believing, in \"God\" and to following particular religious traditions. The course mostly involves mini-lectures, presentations, quizzes, readings, and seminar-based classroom discussions, and some videos. You will be strongly encouraged to think about and share your opinions, beliefs, and experiences. By the end of the course you will have an increased understanding of the complexity, richness and psychological basis for religious beliefs and behaviors, be better able to understand your own religious life, explore the importance of religious phenomena for the field of psychology, analyze the strengths and weaknesses of a psychological approach to studying and interpreting religion, and understand the interaction of personal and social dimensions of religion. Hopefully students will also think more critically about how religious and spiritual beliefs influence actions in their everyday lives.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 230H: Introduction to Psychologies of Religion", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Introduction to major Western psychologies of religion (James, Freud, Jung) and to subsequent extensions of and departures from them.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "Honors"]}, {"course_name": "PSYCH 231: Introduction to the Psychology of Gender", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "The focus of this course in general is on the psychological study of gender in historical and contemporary perspective. The historical roots of gender studies in women's studies, as a correction to a traditional focus on male and masculine perspectives, will be covered. Through both traditional and feminist research methods, psychologists have sought to clarify what is general among genders, and what may be individualized to specific persons or groups. Conceptions of gender and gender identity are examined in relation to other social identities in the United States, and beyond the US with cross-cultural comparisons. Historical changes in the US and outside the US are also discussed. Major topics include the role of gender in development, self-concept, social relations, and mental health. Relevant major theories of gender development and behavior are covered, such as gender schema theory. Emphasis of study is upon those experiences that are specifically related to gender, such as stereotypes and expectations of femininity and masculinity, violence against women, economic and work-related constraints, and pregnancy and childbirth.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PSYCH 232: Cross-Cultural Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "PSYCH 232 provides a comprehensive overview of cross-cultural research in a broad range of areas including human development, perception, emotion, motivation, social behavior, personality, cognition, and abnormal behavior. It investigates the similarities and differences in individual psychological functioning among various cultural groups and explores the interaction of psychological, socio-cultural, and biological influences on human thought and behavior. In addition, the course addresses important international applications to acculturation, ethnic and minority groups, work, and communication. By studying psychology from a cross-cultural perspective, you should become more aware of the diversity of the international community and develop an increased understanding and tolerance of attitudes and viewpoints different from your own.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "PSYCH 238: Introduction to Personality Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Personality psychology involves examining theories of human nature and evaluating them in an empirical fashion. Personality psychology begins with the observation that each person is (to paraphrase Harvard psychologists Kluckhohn and Murray) in certain respects (a) like all other persons, (b) like some other persons, and (c) like no other person. In other words, personality psychology concerns itself with the study of (a) universal aspects of human nature, (b) psychological traits and types, and (c) individual uniqueness. Principal goals of the discipline include constructing descriptive taxonomies of personality, inquiring into the evolutionary and developmental origins of human universals and individual differences, and assessing theimpact of personality on the life course. This course aims to cultivate in students a breadth of understanding through an analysis of some of the major intellectual statements concerning human nature. Psychoanalysis, humanism, existentialism, symbolic interactionism, biological, and neuropsychological are primary perspectives that may be examined. Questions considered within the course include: How can we determine what might be a part of fundamental human nature? What are the relative contributions of conscious rationality andunconscious irrationality to human behavior? Can human behavior be explained by a finite set of motives? Do explanations in psychology differ in kind from explanations in the natural sciences? Can personality be quantified? Short-answer examinations and class participation are used to evaluate the degree to which students have successfully comprehended course material. Students should understand why it is difficult for a theorist to create a view of human nature that transcends the theorist's own personality and cultural/historical context, and how empirical research can help overcome these obstacles. Students are to learn how to identify and evaluate the assumptions (either implicit or explicit) about human nature and individual differences that underlie any social or behavioral science. By the end of the course, students should be able to describe the basic tenets of the major theories, to be able to compare and contrast the theories, and to be able to evaluate the strengths and weaknesses of each theory.A good understanding of the course material will prepare students for advanced study in personality theory and measurement, as well providing a useful context for courses in abnormal, clinical, developmental, health, historical/philosophical, industrial/organizational, and social psychology, as well as for courses in other social sciences, certain humanities, and some applied fields such as business which at least tacitly presuppose some view of personality.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 243: Introduction to Well-being and Positive Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "The introduction to well-being and positive psychology involves the application of empirically derived principles of psychology to address everyday experiences and focuses on ways to enhance one's life. More specifically, students will be introduced to the field and learn that positive psychology encompasses much more than the study of happiness, a common misconception. Students will learn to embraces strengths, fosters personal growth, and enhance well-being based on scientific research. As part of a scholarly discipline, scientific field, and professional activity, the overall focus of the course is the study of the psychological processes that relate to enhancing one's life.As an important area of psychological science, positive psychology is an area of research in which investigators develop and systematically test theories about the \"good life.\" As part of a profession, it involves the application of this empirically gained knowledge to enable people to cultivate areas of their lives that will lead to greater contentment and fulfillment. This course provides an overview of the field of positive psychology. It introduces the field by exploring its history and considers its place in the field of psychology more generally. Topics discussed include but are not limited to positive emotions, positive thinking, character strengths, values, relationships (intimate and friendships), and the meaning of life. Cultural considerations within the field are also explored. Content is presented through a combination of lectures, readings, active learning activities, and demonstrations. Assessment is based on objective exams and writing assignments (which includes the use of scientific research to support personal experiences). Discussion and questions are encouraged in all sections to facilitate students¿ understanding of the material. After taking this course, students should have a better understanding of the field of positive psychology and what it encompasses and will acquire tools for applying the concepts learned to their own lives.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 244: Introduction to the Psychology of Human Factors Engineering", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Human Factors Psychology is an area of psychology where the overall focus is the scientific study of human behavior and how it can be applied to the use, design and development of products and systems, Students will learn basic principles of how people process information, perceive and interact with the world in various circumstances, They will learn how psychologists conduct research on human thought and behavior in an effort to measure peoples' perceptions, attitudes, and behaviors. These basic principles will be illustrated and explored with a series of hands-on activities that relate the material to everyday life. Topics to be covered include research design and methods, sensation and perception, memory and language, and social psychology. Psychological principles from these areas will be used to discuss ways to improve the safety of tools and systems, reduce human error and increase user satisfaction. Students will also gain a better understanding of the influence of stress and workload on human performance. A major topic will be ways to develop reliable and valid evaluation techniques for assessing performance, safety and ease of use of systems. In order to design effective systems, individual differences in age, gender and culture must be taken into account. People in different regions of the world have cultural differences that influence the way they perceive the world and process information. These individual differences will be addressed throughout the semester. Topics are presented through a combination of lectures, readings, demonstrations, and in-class activities. Active learning elements such as library/internet research, writing activities, and collaborate learning experiences will be applied. Evaluation is on the basis of content-based quizzes, objective exams, brief written reports of hands-on exercises, and collaborative assignments.", "prerequisite": "PSYCH100 or 3 credits of GS", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 246N: Human Factors in Design & Art", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Within human factors engineering, a critical component to the design of products is understanding the physical and cognitive elements of the human. Within artistic design are fundamental elements to all visual expression. Thus, every artist, designer and visual communicator needs an awareness of formal elements and principles, variations within forms, relationships among forms. We must be aware of the impact evoked within viewers and users by formal conditions. This course and topics within it are inherently interdisciplinary in nature and could not be accomplished as effectively on their own. Without art, we cannot understand the design process effectively. Without human factors psychology, we cannot understand the human behavior effectively. Human factors is a discipline within psychology that deals with how humans interact and understand their world. This is necessary in product design. Art focuses on the creative process of design and is essential as well.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 253: Introduction to Psychology of Perception", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "The goal of this course is to give students a detailed introduction to the basic questions in the study of how the energies and information in the external world become part of our immediate experience. This includes questions about how patterned energies (such as light, sound, etc.) are coded by our sensory systems and how those codes are used to support psychological experience. These are fundamental and fascinating questions and concern the most basic ways in which we interact with and experience the physical world. Students will consider these questions in detail with respect to the visual and auditory systems, and time permitting, with other sensory systems. Because these questions are such fundamental questions, they have long intellectual histories. Philosophers and scientists have been working on these questions for centuries, and the scientific study of them forms the basis for much of contemporary scientific psychology. We will be examining some of this intellectual history and be discussing the connection between the scientific study of sensation and perception and the other natural sciences, including biology, chemistry, physics, and mathematics (including computer science). The class will also focus on some of the tools and techniques that have been developed for the study of sensation and perception. The course will show that these tools and techniques are very general and have application to a broad range of issues in human psychology. Students will learn the basic procedures for data collection and analysis, and the procedures for evaluating inferences on the basis of that data. The study of perception requires the integration of techniques, methods, and tools from a variety of other sciences, including mathematics. Physics, algebra, and geometry are involved in understanding light as a source of information. Chemistry is involved in the absorption of light by photoreceptors as well as the mechanisms of neural communication in all sensory systems. Probability and electrical engineering contribute the tools used to conduct signal detection analyses of perceptual performance. It is not assumed that students are experts in any of these fields, nor do we expect that students will be when the course is complete, however, we do expect students to be willing to consider their importance to perceptual psychology.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 256: Introduction to Cognitive Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course is an introduction to cognition, an area of psychology that investigates the ways in which we acquire, store, create and use knowledge. Cognition includes a wide range of mental processes that are used every day in almost all human activities. These include neuroscience, attention, perception, memory, imagery, language, problem solving, creativity, and reasoning. Cognition refers to a theoretical approach in psychology that emphasizes the role of people's knowledge, reasoning, and expectations and this approach has had a broad influence on all areas of psychology. It also involves developing sophisticated methodologies to study processes that are not always observable. Cognitive research can be applied in order to improve mental functioning, e.g., developing programs for improving memory or cognitive rehabilitation for brain injury. It can also be used to address serious societal issues and problems such as understanding how people develop and use stereotypes, or why distraction by a cell phone is dangerous. Cognitive psychology has applications to many fields including medicine, the legal system, education, and understanding mental disorders. In addition, cognitive psychology is part of the active interdisciplinary field of cognitive science that also includes disciplines such as philosophy, neuroscience and artificial intelligence. This course provides an overview of the field of cognitive psychology, including its research, theory, and application. Content is presented through a combination of lectures, readings, activities, and demonstrations. A major goal of the course is to show how the major questions in cognition are addressed through empirical research. It also promotes critical thinking and encourages students to apply this knowledge to enhance their lives.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "PSYCH 260: Neurological Bases of Human Behavior", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "An introduction to biopsychology, emphasizing the structure and function of the human brain.  BB H (PSYCH 260) 203 Neurological Bases of Human Behavior (3) The nervous system provides the biological underpinning of behavior, and several scientific fields are concerned with the relationship between the nervous system and behavior. The goal of this course is to introduce the principle methods, findings, and theories of these scientific fields. Topics include (a) the anatomy and physiology of the nervous system, (b) how the nervous system gives rise to perception, action, language, memory, emotion and reproductive behavior, and (c) how drugs and mental illnesses affect the nervous system and alter normalperceptual, cognitive, and emotional behavior. The course prepares students for a number of more advanced courses in Psychology and Biobehavioral Health that address specialized topics in neuroscience, and may satisfy a requirement of these majors.", "other": ["Cross-listed with: BBH 203"]}, {"course_name": "PSYCH 260A: Neurological Bases of Human Behavior", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Biological Psychology is an area of psychology where the overall focus is the scientific study of behavior and experience, and underlying associated neurological and physiological processes. This course provides an overview of the biological bases of behavior and includes a presentation of the research, theory, and application of this knowledge. Specific topics include the basic anatomy and physiology of the central and peripheral nervous system, neural transmission and the function of various neurotransmitters. The majority of the course will focus on how these basic processes contribute to the processing of information from the senses, simple and complex learning, and cognitive processes such as memory, and language. Topics will include cover brain development, developmental and acquired neuropsychological disorders and therapeutic techniques. Content is presented through a combination of lectures, readings, demonstrations, and in-class activities. A major goal of the course is to show how questions relating brain and neural function to behavior are addressed through empirical research. The course introduces students to theories, research, and procedures used in psychological research and practice. It also promotes thinking about how students can apply this knowledge to enhance their lives. After taking this course students will be able to explain the relationship between brain and behavior. They will make more informed decisions about participating in future psychology courses and gain a better appreciation of the science and profession of psychology.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 261: Introduction to Psychology of Learning", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course provides a general survey of the study of learning and behavior. It will focus on investigating historical and current learning perspectives, their respective research methods, and how each contributes to our understanding of both human and animal behavior. The course also provides an investigation of human and animal experiments and how those studies inform our understanding of learning principles. Students should expect to learn about the processes of classical and operant conditioning and other related phenomena. The course provides a foundation for further understanding of learning principles and prepares students to analyze and distinguish between different types of learning they will witness in their everyday life. Questions discussed would include, How are behaviors and habits formed or changed? How are many of our social behaviors reinforced or weakened? What are the limits of learning, if any? How do learning principles help us with devising clinical interventions and treatments? Students will be able to encounter new situations, both social and otherwise, apply learning principles they have studied, and have an enriched experience because of the application of that knowledge.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "PSYCH 263N: Science of Learning", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course is an introduction to the field of cognitive and learning sciences. It provides an integrative approach to how we learn and remember with particular emphases on the scientific approach to the concepts and application of the theory to education. Learning science is an interdisciplinary field that examines learning from many perspectives and applies the knowledge gained from such studies to improving learning, instruction, and learning environments. This field draws upon contributions from areas of psychology (cognitive, developmental, educational and biological psychology), neuroscience, computer science, as well as sociology and anthropology. Learning scientists use a scientific approach to understand learning, those who do the learning, and the context in which learning occurs. Many learning scientists also seek to apply this information to improve the learning environment, educational practices, and inform educational policies. In this course, students will learn the foundations of learning theory, the important neurological bases of learning, and current information on relevant aspects of cognition, Material will demonstrate the application of this information to educational settings. Course content will be presented in lectures, readings, activities, and demonstrations. As a science-based laboratory course, students will study the scientific method and complete a series of laboratory exercises. This course is designed for primarily for education and psychology majors. It will fulfill the laboratory requirement for education majors. For psychology majors at at Penn State Erie it may fulfill category 3. cognitive/experimental or be applied to the Science Option in the BS Major, it may fulfill Category B. developmental, cognitive, learning at Berks Lehigh Valley college and the Commonwealth College. It may be used to fulfill the Social Behavior sciences requirements. Evaluation will be through examinations, laboratory reports, and additional activity assignments. This course will be offered once a year at Penn State Erie. As a laboratory course, sections will be capped at 25.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 268: Animal Minds", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course considers the cognitive and communicative abilities of animals, especially primates, as compared with humans.  PSYCH 268 Animal Minds (3) This course covers select topics in animal cognition and communication. This course will focus mostly on the behavioral level. It will focus on observations and controlled behavioral experiments rather than on neurophysiological experiments (though it will cover some mechanisms that are implicated through behavioral research). One of the main goals of this course is to discuss how we can scientifically approach the study of animal minds. One of the recurring themes of the course will be methodological: how can we pose a question to a being that does not have language? Another goal of the course is to teach critical thinking about experiments in this field. It will discuss how to run a well-controlled experiment and closely examine the claims that are made by each experimenter. Through a class project, students will gain some experience trying to observe behavior and designing experiments.This course addresses an active research area in psychology, of broad interest to students in Psychology and other disciplines. Because of this broad appeal, no background in psychology is assumed, and no prerequisite is required. The course will fulfill a 200-level requirement for students in the PSY majors and minors. Students typically will be evaluated by two midterm exams (25% each), a final exam (35%), and a research project (15%). The course will typically be offered once each academic year with an enrollment limit of 50."}, {"course_name": "PSYCH 269: Evolutionary Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Survey of evolutionary perspectives in current psychological research.  PSYCH 269 Evolutionary Psychology (3) (BA) This course meets the Bachelor of Arts degree requirements.This course demonstrates how knowledge and principles from evolutionary biology are used to conduct research on the design of the human mind. The course explains how evolutionary psychologists identify adaptive problems faced by our ancestors and test hypotheses about psychological mechanisms designed by natural selection to solve these adaptive problems. The psychological mechanisms discussed are involved in phenomena such as perception and the control of activity, learning and cognition, mate selection and courting, development and parenting, altruism, aggression, and social structure. Evolutionary psychology is thus not a topic area such as perception, learning, or motivation, but rather a way of thinking that can be applied to any topic within psychology. The course, therefore, shows how evolutionary psychology is (1) changing how scientists approach old topics, (2) opening up new areas of research, and (3) beginning to provide a unifying framework for integrating the various subdisciplines of psychology. Students will learn to understand and evaluate evolutionary hypotheses about a range of topics in psychology and related social sciences. Evaluation will be based on a combination of methods, including for example traditional exams, written homework, papers, and participation in class and group discussions. The course is offered as a perspective that can be used to think about the subject matter in any particular content course in psychology. Students may choose this course to fulfill a requirement in the major.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 270: Introduction to Abnormal Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Overview of assessment, causes, and treatments of psychological disorders.  PSYCH 270 Introduction to Abnormal Psychology (3)(BA) This course meets the Bachelor of Arts degree requirements. This course focuses on some of the topics and questions people most commonly ask about psychology: What are the different psychological disorders, and what are they like? How do clinicians diagnose someone with a disorder? What do therapists actuallydoin therapy? Course objectives include: (a) examine historical and current conceptions of normal and abnormal behavior; (b) survey the origins, symptoms, and characteristics of several adult psychological disorders; and (c) introduce the main treatment approaches for psychological disorders. The course is designed to be accessible to both Psychology majors and others. Psychology B.A. and Psychology B.S. majors may use the course toward the 200-level breadth requirement of the major. Students will be assessed primarily with objective exams.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 281: Introduction to Industrial-Organizational Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course introduces the concepts and methods used to study people within and as they relate to the world of work. This is a survey course that provides an introduction to many topics ranging from determining what individuals do in their jobs, to the design and operation of organizations. Topics include (but are not necessarily limited to): recruitment, selection, training, teamwork, employee motivation, leadership, and organizational culture.", "prerequisite": "PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "PSYCH 294: Research Project", "department": "Psychology (PSYCH)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 295: Internship", "department": "Psychology (PSYCH)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 296: Independent Studies", "department": "Psychology (PSYCH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "PSYCH 297: Special Topics", "department": "Psychology (PSYCH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 297C: Special Topics - InterDomain", "department": "Psychology (PSYCH)", "credits": "3 Credits/Maximum of 9", "description": "Formal course given on a topical or special interest subject offered infrequently; several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GA/GS GenEd course", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain"]}, {"course_name": "PSYCH 299: Foreign Studies", "department": "Psychology (PSYCH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "PSYCH 300: Honors Course in Psychology", "department": "Psychology (PSYCH)", "credits": "1-6 Credits/Maximum of 6", "description": "Individual study and seminar in selected phases of psychology.", "prerequisite": "invitation of Program Honors Committee", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"course_name": "PSYCH 301M: Honors Research Methods in Psychology", "department": "Psychology (PSYCH)", "credits": "4 Credits", "description": "This is an advanced undergraduate-level research methods course for honors students. The course will emphasize the basics of research (generating researchable ideas, hypothesis testing, scientific writing, reliability and validity) and major types of research. It is assumed that students have had an introductory class in statistical methods (or quantitative methods) and introductory psychology courses prior to their participation in this course. The primary goals of this course are for students to (1) learn how to critique and generate research, (2) develop critical thinking and communication skills, and (3) generate and develop independent research projects. Attempts to achieve these goals require knowledge of basic concepts, techniques, language and logic of research methods and data analyses in psychology. This course is structured around the belief that one of the best ways to obtain these objectives is through active participation in the research process. The course is designed incrementally, so that skills learned early in the course are critical for success at subsequent assignments..In the end, a successful student will be (a) able to communicate and think critically about research, (b) have experience designing research and analyzing data, and (c) will have confidence in one's ability to generate interesting and testable research ideas. As a result, the successful student will be well prepared for advanced psychology courses and prepared to complete one's honors thesis.", "prerequisite": "PSYCH 100", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "PSYCH 301W: Basic Research Methods in Psychology", "department": "Psychology (PSYCH)", "credits": "4 Credits", "description": "Introduction to methods of psychological research, with special attention to hypothesis formation and testing, threats to validity, and data presentation.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"course_name": "PSYCH 370: Psychology of the Differently-Abled", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course familiarizes students with the needs and abilities of people with varying physical challenges through academic and experimental exercises.  PSYCH 370 Psychology of Differently-Abled (3) (US) In 1991 President Bush signed the Americans with Disabilities Act (ADA) which recognized that the hundreds of thousands of Americans living with disabling conditions form a class which should receive protection under the law. Many people look at the ADA as civil rights legislation which is intended to offer disabled Americans the same legal rights to access as the Civil Rights legislation of the 60s offered to Americans of color.While discrimination in the workplace, in housing, and in other areas based on race is no longer openly practiced, people with different physical abilities are still fighting an uphill battle. Often the barriers they face are due to ignorance of their needs. The intent of this course is to increase awareness and sensitivity to the needs of people who are different in the physical dimension. Additionally, policy and economic implications will be studied.The content will include multiple modalities, such as mobility and visual differences. The focus will be positive, emphasizing how differences in one area are overshadowed by similarities in most areas. Language in the course will focus on the positive as well, hence Psychology of the 'Differently-Abled' rather than 'Disabled'. Accomplishments of people such as FDR and Mozart will be discussed in the context of significant contributions made by people who were physically different. Finally direct experience with people will be obtained through a community service component of the course.The objectives of this course are to first familiarize students with the causes and consequences of different physical challenges. The long term objective is to increase sensitivity to the needs of people who are different from most of us in some ways, but very similar to us in most ways. Research has shown that familiarity is a critical tool in raising comfort levels and decreasing discriminatory and hurtful acts.Evaluation Methods: Examinations 40%, mid-term and final Community Service 30%, this will be assigned through the same form Internship supervisors use to evaluate students for PSYCH 395 Research Paper 25% Oral Presentation 5%, 15 minute presentation to class regarding their community service experience. This course will draw on materials covered in General Psychology. No other course preparation will be needed. The course is an Intercultural and International Competence (GI) course, focusing on intercultural aspects only.", "prerequisite": "PSYCH100", "other": ["United States Cultures (US)"]}, {"course_name": "PSYCH 395: Internship", "department": "Psychology (PSYCH)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "PSYCH 397: Special Topics", "department": "Psychology (PSYCH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PSYCH 399: Foreign Studies", "department": "Psychology (PSYCH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"course_name": "PSYCH 404: Principles of Measurement", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This is an introductory course about properties of test scores such as reliability and validity. In addition, the course focuses on the construction and evaluation of measurement instruments used in educational and psychological settings and may include topics such as test development, score reporting, and interpretation. Basic statistics are introduced throughout the course to interpret the psychometric properties of scores.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: EDPSY 450", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 406W: Advanced Research Projects in Psychology", "department": "Psychology (PSYCH)", "credits": "4 Credits", "description": "Advanced methodology focusing on the logic and practice of research culminating in the completion of a student designed research project.", "prerequisite": "PSYCH301W", "other": ["Writing Across the Curriculum"]}, {"course_name": "PSYCH 407: Advanced Research Methods in Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Advanced methodology focusing on the logic and practice of research in a selected content area of psychology.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 408: Program Evaluation", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Examination of the theories and practice of program evaluation; emphasis on applied work utilizing a wide range of evaluation approaches.  PSYCH 408 Program Evaluation (3) This course will introduce the student to the basic procedures and design methodologies of program evaluation. The student will learn about the purposes of evaluation, types, applications, and ethical issues involved in evaluation. A history of programmatic theory design will be reviewed with the purpose of clarifying the linkages between goals, objectives, and the hypothesized relationships between specific programmatic elements and desired outcomes. The student will be challenged to identify and understand the normative assumptions specific to organizations about their basic program design, implementation, and assessment processes.Students will be evaluated by a combination of the following: evaluation proposal, short written assignments, exams, oral presentation, and attendance. The prerequisites for this course include satisfactory completion of PSYCH 100, SOC 001, PSYCH 200, STAT 200, and PSY 201. This course presupposes critical thinking skills and basic competencies in statistics and research methods.For the Psychology major (PSHBS or PSHBA) at Penn State Erie, this course is important for students who will be entering graduate school or going into practice in the areas including, but not limited to: community psychology, social psychology, industrial-organizational psychology, sports psychology, or the general social services field. This course can count towards: a) the advanced course requirement, b) the special interest course requirement, or c) elective credit. Psychology minors at Penn State Erie can apply this course toward the 15 credits in psychology beyond the PSYCH 100 requirement. Students in other majors should consult with their academic advisers to determine how this course fits into their program of study.This course will be offered once annually (fall semester).", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 410: Child Development", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Study of the psychology of the growing person from conception through adolescence, focusing more on periods up to middle childhood.  PSYCH 410 Child Development (3) PSYCH 410 Child Development is intended for undergraduate students majoring in psychology, education and related disciplines. The purpose of this course is to introduce students to the theories and the influences on child development from conception through adolescence. Students will be introduced to research concerns in developmental psychology, including descriptions of research designs and ethical considerations in research with children and adolescents. Course content will include an in depth review of prevailing theories and influences on development from conception through adolescence. Application of the principles and influences will be applied to the physical, cognitive, and social development of children.Requirements for the course will include objective examinations, as well as written assignments. Written assignments will involve comparisons and critiques of major developmental theories. Examples of such assignments include descriptions of the key points of a major developmental theory or process of child development, detailed description of an observation of a child and how the child's behavior relates to a major developmental theory, descriptions of how application of developmental theory apply to the student's chosen major or occupation, or comparisons and critiques of developmental theory.", "prerequisite": "PSYCH100 , 6 additional credits of PSYCH"}, {"course_name": "PSYCH 412: Adolescence", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Physical, cognitive, and personality development during adolescence.", "prerequisite": "PSYCH100"}, {"course_name": "PSYCH 413: Cognitive Development", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Development of reasoning and related cognitive skills, such as perception and language.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 414: Social and Personality Development", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Development of social and personality attributes.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 414H: Social and Personality Development", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Development of social and personality attributes.", "other": ["Honors"]}, {"course_name": "PSYCH 415: Topics in Developmental Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Special topics in developmental psychology.", "prerequisite": "PSYCH413 or PSYCH414", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 416: Development Throughout Adulthood", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Processes of development and change of behavior from early adulthood through old age, emphasizing theory, method, and empirical research.", "prerequisite": "HDFS 312W", "other": ["Cross-listed with: HDFS 445", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 419: Psychology and a Sustainable World", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Students study relationships between humans and the natural world and psychological factors contributing to environmental problems and sustainable solutions.  PSYCH 419 Psychology and a Sustainable World (3) This course examines psychological dimensions of humans' connection to the natural world, causes of human contributions to environmental problems, and psychological approaches for encouraging sustainable behavior. The course draws on the new field of conservation psychology and responds to the University's commitment to becoming a leader in sustainability education. This course is designed for upper-level undergraduate students to satisfy requirements for Psychology degree programs, the Psychology minor, and the Sustainability Leadership minor. Major topics covered include psychological foundations of environmental problems (psychological understanding of unsustainable behavior, psychological perspectives on ethical dimensions of environmental problems, people's place in nature, psychological approaches to promoting sustainable behavior), and the application of psychological principles to specific environmental topics (consumerism and sustainable lifestyles, population overshoot, climate change, land use, water use, energy use, food production and consumption, pollution and waste). Students will be able to apply concepts, theories, and findings to change cognition, motivation, and behavior, with the goal of reducing negative human impacts on the environment. They will be able to write and communicate about their work in the form of a final paper and a class presentation that conform to the standards of psychological research. Assessment methods include weekly journal assignments that document students' application of lecture and reading material to their experiences with nature, their observations about their own negative impacts on the environment, and their actions to reduce negative impacts on the environment. In addition, students will develop a conservation intervention program that targets a specific problem on campus or in a community, for which students review relevant literature, design an intervention program, give a presentation of the program, and submit a final paper on the program.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 420: Advanced Social Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "In depth study of selected research areas in human social behavior.", "prerequisite": "PSYCH 221"}, {"course_name": "PSYCH 421: Self and Social Judgment", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Individual's perceptions, evaluations, and decision-making strategies about themselves, others, and social situations or issues.", "prerequisite": "PSYCH 221", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 422: Human Sexuality", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Psychological influences on human sexual behavior such as love, sexual orientation, gender, intercourse, contraception, sexually transmitted diseases, dysfunctions, and paraphilias.  PSYCH 422 Human Sexuality (3) PSYCH 422, Human Sexuality, is intended to examine the influence of psychological factors on human sexual behavior. Information on male & female anatomy, on the roles/influences of hormones, and on conception/pregnancy will be covered as well as information on gender, sexual orientation, communication, love, sexual harassment, paraphilias, sexually explicit material, and sexual dysfunction.Evaluation will be by means of exams (60% of grade), papers (15% of grade), small group projects (10% of grade), and a poster presentation (15% of grade). The prerequisite for this course is satisfactory completion of PSYCH 100. As the course presupposes critical thinking skills and an awareness of research methods in psychology, it is an advanced undergraduate level course requiring junior/senior level standing.For the Psychology major (PSHBS or PSHBA) at Penn State Erie, this course can count either toward (a) the diversity basic course requirement, (b) the advanced course requirement, (c) the special interest course requirement, or (d) elective credit. Psychology minors at Penn State Erie can apply this course toward the 15 credits in psychology beyond PSYCH 100 requirement. Students in other majors should consult with their academic advisors to determine how this course fits into their program of study.No special facilities are required for this course, though students will need to prepare a poster for presentation.This course is expected to be offered at least once every four semesters.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 423: Social Psychology of Interpersonal/Intergroup Relationships", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "In-depth study of relationships among individuals (e.g., intimate relationships) or groups (e.g., prejudice, cooperation, competition, aggression, and negotiation).", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 424: Applied Social Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Application of social psychological theories and research methods to field settings and to the study of social issues.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 425: Psychology of Human Emotion", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Reviews, critiques, and applies major historical and contemporary psychological theories of emotion experience, understanding, and expression.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 426: Language and Thought", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Relations between language and cognition; cognitive implications of normal and impaired language development; cognition and bilingualism.  LING (PSYCH 426) 429 Language and Thought (3)(BA) This course meets the Bachelor of Arts degree requirements. Is language a special and uniquely human ability that develops and functions independently of other cognitive processes? Do individuals who speak different languages also have different concepts about the meaning of objects and ideas? Does language development depend on exposure to spoken language? In this course we will examine the relation between language and thought by considering evidence on language and cognition in both children and adults. Topics to be covered include the typical development and use of language as well as language and cognition in individuals whose language and/or cognition is impaired in some form. The latter include individuals with aphasia who have sustained brain damage following stroke or head injury, schizophrenics whose language reflects aspects of their disorder, children diagnosed with Williams Syndrome who appear to have good or even precocious language abilities in the face of severe cognitive impairment, and Alzheimer's patients in whom semantic memory has begun to deteriorate. The course will also discuss the acquisition of sign language among deaf individuals and the consequences of bilingualism for children raised with two languages and for adults with proficiency in more than a single language.The purpose of this course is to provide a survey of current scholarship on the relation of language and thought, including a review of recent developments in the primary literature. The necessary background is covered in introductory Psychology and Linguistics courses, which serve as alternative prerequisites. Students will learn about the consequences of typical and impaired development for relations between cognition and language ability. It is distinguished from PSYCH 457, Psychology of Language, by a focus on the implications of language, language development, and language impairment, for cognitive processes. It covers some topics also addressed by current courses in Linguistics and in Communications Sciences and Disorders, but is distinguished from those courses by its focus on perspectives and theories from cognitive psychology. This course may be used toward the 400-level PSY requirements of the PSYBA and PSYBS majors, and toward the PSY minor. Students typically will be assessed on the basis of class participation and discussion (20%), four papers (total 60%), and an in-class presentation based on reading original research literature (20%). The course typically will be offered once each year at the University Park campus with an enrollment limit of 50.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: LING 429", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 427: L1 Acquisition", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "How children learn their first language; psycholinguistic aspects of lexical, syntactic, semantic, and phonological development.  LING 446 (PSYCH 427) L1 Acquisition (3) (BA) This course meets the Bachelor of Arts degree requirements.This course focuses on how children learn their first language from the theoretical perspectives of imitation theories, social construction theories, and innateness theories. In addition, the course covers the various stages of language acquisition including phonological (sound system), morphological (word meaning), syntactical (grammar) and semantic (meaning) development from birth to adulthood. Other related subfields covered in the course include the acquisition of Pidgin and Creole languages, bilingual and multilingual acquisition, and language acquisition and linguistic change.", "prerequisite": "LING 100", "other": ["Cross-listed with: LING 446", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 432: Multicultural Psychology in America", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course focuses on the central role of culture, race, and ethnicity in the human condition.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"course_name": "PSYCH 434: Psychology of Gaming", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Upper level course examining the core psychological principles as they apply to the topic of games.  GAME 434 / PSYCH 434 Psychology of Gaming (3) This course looks at how the field of psychology can be applied to understand and improve the world of games. This requires the application of theories and research based in experimental, cognitive and several other disciplines within psychology, including but not limited to cognitive, social, motivation & emotion, and experimental psychology. By applying different theories within these disciplines we can start to understand how humans interact with games and in turn how games have evolved as a result. This course addresses an active research area in psychology, of broad interest to students in Psychology and other disciplines. The course will fulfill a 400-level requirement for students in the PSYCH majors and minors as well as those in the GAME minor. Students typically will be evaluated by exams, research project, in-class activities, homework, and article discussions.", "other": ["Cross-listed with: GAME 434"]}, {"course_name": "PSYCH 436: Humanistic, Existential, and Religious Approaches to Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Existential, humanistic, and religious approaches to the psychology of experience, consciousness and will.", "prerequisite": "PSYCH100 or RL ST001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 438: Personality Theory", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Personality theories and their application to social and personality development and personality dynamics.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 439: History and Systems of Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Historical antecedents to scientific psychology; development of contemporary psychological theories and research areas from the formal establishment of psychology.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 441: Health Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Overview of the field with an emphasis on how psychological research contributes to an understanding of health and behavior.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 442: Trauma and Resiliency", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course will provide an overview of the current state of knowledge and research on traumatic stress, resiliency, and treatment.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 443: Treatment and Education in Developmental Disabilities", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Covers etiology, classification, intervention (treatment and education), ethical and legal issues related to individuals with developmental disabilities.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 444: Engineering Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Methods and results of experimental psychology pertinent to problems which involve man-machine relationships.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 445: Forensic Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Relations between psychological theory and research and the law, legal processes, and social policy.  PSYCH 445 Forensic Psychology (3)(BA) This course meets the Bachelor of Arts degree requirements. This course focuses on the interplay between psychological theory and research and the law, legal processes, and social policy. Students will be exposed to the dilemmas faced in the law and how overlap with the knowledge base and expertise of psychologists. Students will learn about the roles psychologists might play in the court system and the history of their involvement. This will include roles of consultant, policy evaluator, expert witness, assessor, and advocate. Legal issues that emerge in psychological practice will also be covered (e.g., limits to confidentiality, duty to warn, consent issues). Students will gain an understanding of the basic theories of the law and how psychological theories may intersect with these. The emphasis of discussion will be on those affecting children, youth and families. These will include topics such as divorce, child maltreatment, juvenile delinquency, domestic violence, and social welfare. Other topics of the law will also be highlighted (insanity plea, civil commitment). Particular attention will be paid to issues dealing with race, ethnicity, and social class and law and social policy.This course expands the PSY curriculum at the 400-level to include a popular and socially significant topic, and will fulfill a 400-level PSY requirement for Psychology majors and minors. It addresses in detail legal and social policy implications of topics covered in other psychology courses. Significant background in psychology is assumed; thus PSYCH 270 (Introduction to Abnormal Psychology) is a prerequisite. Students typically will be assessed on the basis of three exams (20% each), a paper (30%), and class participation (10%).", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 449: Basic Counseling Skills", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course provides an introduction to specific counseling and helping skills used by various counseling/psychotherapy models across the major theoretical orientations. During the course, an emphasis will be placed on the skills and techniques that a counselor uses to establish and maintain an effective counseling relationship. In both content and process, the focus is on integration of theory with practice through experiential learning. Students will learn and apply skills that range from basic attending and listening skills to interviewing skills. In order to facilitate learning, a variety of instructional strategies are to be used including: 1) Lectures and demonstration by the instructor, 2) video-taping of students as they are practicing their skills and providing feedback, 3) small group work for the purpose of practicing skills, analyzing other students' performances, and sharing reactions to the counseling process, and 4) completion of exercises/worksheets handed out in class. Upon successfully completing this course, the learner is expected to be able to engage in basic counseling and interviewing, demonstrate ethical counseling principles relevant to the content of the course, describe a model that represents the counseling process, including the stages of counseling, assess the role of nonverbal communication in counseling, identify and demonstrate basic listening skills, probing, interpretation skills, challenging skills, summarizing skills, and informing skills, assess the use of each basic skill in a multicultural environment, evaluate personal and peer mastery of basic skills, and conduct a brief one-session counseling intervention that facilitates client development and change.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 451: Psychology of Action", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Basic and applied science of action, from psychological, computational, and physiological perspectives.  PSYCH 451 Psychology of Action (3) In all walks of life, people must adaptively control their physical movements. Whether in industrial settings, on the highway, in the kitchen, in the studio, in the concert hall, or on the football field, skillful physical action is essential. This course will focus on the means by which skilled physical behaviors are learned, planned, and controlled. The course will focus on a broad range of basic behaviors (e.g., reaching, walking, looking, speaking, and typewriting) as analyzed from several perspectives (physiologically, psycho-logically, and computationally). Basic science as well as practical applications will be emphasized, as will links between movement control and other, related topics such as perception, cognitive development, and robotics.This course addresses topics in an active research area in cognitive psychology. It assumes some prior knowledge of cognitive psychology, requiring PSYCH 100 and PSYCH 256 as a prerequisite. The course will cover some topics addressed in several Kinesiology courses, but does so from the perspective of cognitive psychology. It will fulfill a 400-level PSY requirement for Psychology majors and minors. Students typically will be assessed on the basis of midterm (25%) and final (35%) exams, brief writing assignments and in-class activities (15%) and research papers or projects (25%). The course will normally be offered once each academic year.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 452: Learning and Memory", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "General survey of learning and memory processes as revealed in experimental work with animals and humans.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 455: Cognitive Neuroscience", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Cognitive Neuroscience strives to understand the brain bases of cognition. This course is intended to provide an overview of the cognitive and neural processes that support major components of cognition such as attention, vision, language, motor control, navigation, and memory. The course will introduce students to basic neuroanatomy, functional imaging techniques including electrophysiology and functional Magnetic Resonance Imaging (fMRI), as well as behavioral measures of cognition. We will discuss the experimental techniques and the ways in which inferences about the brain bases of cognition are made. We will consider evidence from healthy adults, as well as from patients with neurological diseases such as Alzheimer's disease, Parkinson's disease, Huntington's disease, amnesia, and stroke.", "prerequisite": "PSYCH 256"}, {"course_name": "PSYCH 456: Advanced Cognitive Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "In depth study of complex mental processes:  thinking, problem-solving, imagery, symbolic behavior, information-processing, attention, artificial intelligence, and language.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 457: Psychology of Language", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Overview of psychological research and theory on language processes, including speech perception, word recognition, meaning representation, comprehension, and language acquisition.  LING (PSYCH) 457 Psychology of Language (3)(BA) This course meets the Bachelor of Arts degree requirements. How do we process language? Why do we easily adjust to a speaker with a foreign accent? How do young children come to speak the language to which they are exposed? Why is it difficult to learn a second language as an adult? This course focuses on the cognitive processes engaged by language use. Topics to be covered include speech perception, word recognition, representation of word meaning, comprehension of sentences, spoken production of words and sentences, and first and second language acquisition. In addition, the role of language in the study of thought and the role of biological mechanisms in theories of language learning will be discussed, as well as ways in which research on the language of special populations (e.g., deaf signers, dyslexics, aphasics) can inform theories of language processing and representation.", "prerequisite": "LING 100", "other": ["Cross-listed with: LING 457", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 458: Visual Cognition", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Overview of concepts and methods in cognitive visual-spatial processing.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 460: Comparative Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Behavior from standpoint of phylogenetic growth and development; biological implications; comparison of different types of animals, including man.", "prerequisite": "PSYCH100 ; PSYCH260", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 461: Advanced Conditioning and Learning", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "An examination of basic learning processes that have been determined within the context of classical, instrumental, and operant learning situations.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 462: Physiological Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Study of the biological bases of behavior and experience, including the anatomy and physiology of the brain and nervous system.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 464: Behavior Genetics", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Survey of gene mechanisms and gene-environment interactions in the determination of behavior; emphasis on deviant human behavior.", "prerequisite": "BIOL 133", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 466: The Psychology of Evil", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This seminar will provide a critical study of evil from a psychological science perspective: how to define evil; popular perceptions about evil; the motivations people have to commit evil acts; the situational and personal factors that remove restraints to commit evil acts; and, the process of healing (forgiveness/reconciliation) after evil. By reading primary and secondary literature, we will critically think about these important, empirical questions about human nature. This course will wrestle with provocative questions about human nature. Are humans basically motivated to be good, evil, or both? Who should we trust more in recounting evil actions: victims or perpetrators (or neither)? Does \"pure evil\" exist? Can we ever completely stop evil from happening? How do we heal after experiencing evil?", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 467: Psychology of Serial and Mass Murderers", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "It is essential in understanding human behavior for students to include the darker side, murder -  without conscience. This course will enable students to understand the definition of murder, within various classifications of it used in the United States, in particular the phenomenon of serial and mass murder. Students will be able to examine and understand within a historical context the cultural development of monsters, demons and evil and this relationship to serial and mass murder. Importantly, students will explore the biological and genetic foundations of human behavior, develop an understanding of the Diagnostic and Statistical manual (DSM-V) spectrum of personality disorders and how these disorders relate to violent behavior. Hare's PCL-R (Psychopathy Check List- Revised) factors will be examined alongside the examination of serial murder committed by legally insane offenders. Some, but not all serial killers have documented cases of mental illness (e.g. schizophrenia), personality disorders (e.g. borderline and antisocial), and psychopathy, albeit most mass murderers suffer from various psychoses. In addition, students will be able to understand sociological theories as they pertain to violent behavior and include factors such as, the role of the family, sexual and physical abuse, and maladaptive childhood behaviors. Often serial murders are preceded by perpetrators' (i.e., males) use of various types of criminal paraphilia (violent or non-violent). These are examined by students to understand the roles these play in the sexual fantasy development of (i.e., males) perpetrators and specific types of sex crimes. The healthcare industry, a hidden, but important environment for serial murderers, is examined by students in order to understand how occupations are important to serial murderers, as by way of their employment, many have easy access to victims. There are numerous differences between male and female serial killers, and team killers. These differences are explored by students by reviewing case studies of each, which include their profiles, mobility and techniques. Finally, global mass and serial murder is to be explored by students, which compare methods, motives and demographics. Numerous case studies of serial and mass murderers will be reviewed to link the psychological, biological and sociological factors to enable students to construct their own profile of a serial or mass murder by researching particular murderers and their psychological, biological and sociological factors.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 470: Abnormal Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Causes, dynamics, symptoms, and treatment of neuroses, psychoses, personality disorders, and other psychological disorders of adulthood.", "prerequisite": "PSYCH100 ; PSYCH238 , PSYCH243 , or PSYCH270"}, {"course_name": "PSYCH 471: Psychology of Adjustment and Social Relationships", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Theory and application of psychological principles to problems in personal and social adjustment.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 472: Human Development, Health, & Education From A Global Perspective", "department": "Psychology (PSYCH)", "credits": "3 Credits/Maximum of 3", "description": "Intended to address the University's global community objectives and provide scholarly background on human development in other cultures.", "prerequisite": "PSYCH 110", "other": ["Cross-listed with: SPSY 472", "International Cultures (IL)"]}, {"course_name": "PSYCH 473: Behavior Modification", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Principles of advanced behavior modification techniques.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 474: Psychological Intervention in Childhood", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Psychology of personal relationships in school situations.", "prerequisite": "PSYCH100 ; PSYCH212 , PSYCH238 , PSYCH243 , or PSYCH270", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 475: Psychology of Fear and Stress", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Description and evaluation of major trends in research on stress and fear in humans and other animals.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 476: Child Psychopathology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Etiology, diagnosis, and facilitation of adjustment of the intellectually disabled, gifted, physically handicapped, and emotionally disturbed child.", "prerequisite": "PSYCH100 ; PSYCH212 , PSYCH238 , PSYCH243 , or PSYCH270", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 477: Mental Health Practicum with Children", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Overview of interventions for children at risk for mental health disorders; emphasis on intervention strategies, program evaluation, and applied skills.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 478: Clinical Neuropsychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Overview of functional human neuroanatomy and clinical neuropsychology, with emphasis on origin, assessment, and treatment of human brain damage.", "prerequisite": "PSYCH100 , PSYCH260", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 479: The Psychology of Gender", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Theories and research on gender differences and gender roles.  Emphasis on women's and men's current positions in society.", "prerequisite": "PSYCH100 , PSYCH221", "other": ["Cross-listed with: WMNST 471", "United States Cultures (US)"]}, {"course_name": "PSYCH 480: Advanced Mental Health Practicum with Children", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "This course involves a continuation and extension of the training and practicum work initiated in PSYCH 477 Mental Health Practicum with Children. The advanced training provided in this course extends understanding of intervention and prevention program logic models and implementation strategies, and includes a focus on tailoring interventions to account for individual, contextual, and cultural factors. Students began their practicum working with children in PSYCH 477 and continue to receive training and supervision for ongoing, linked practicum work in this course. The key goals of this course are to help students: 1) build up a \"toolbox\" of therapeutic skills, techniques, and intervention approaches to use in the accompanying practicum and to use in future work with high-risk children, 2) understand how therapeutic group interventions with high-risk children are organized and conducted, and identify the key mechanisms of action that inform intervention design and drive positive child benefits, and 3) become familiar with the resource-base of evidence-based prevention programs and implementation supports to foster dissemination in communities. Lectures, class discussions, and presentations are included, along with practicum work review and supervision; accompanying practicum work with children is required. The class requires a commitment of 9 hours per week, which includes class sessions, practicum work, and assignments.", "prerequisite": "PSYCH 477"}, {"course_name": "PSYCH 481: Introduction to Clinical Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Diagnostic precedures, treatment approaches, occupational settings, and ethical considerations relevant to the profession of the clinical psychologist.", "prerequisite": "PSYCH100 ; PSYCH238 , PSYCH243 , or PSYCH270"}, {"course_name": "PSYCH 482: Selection and Assessment in Organizations", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Background in personnel testing, performance measurement, selection strategies, with emphasis on validity and measurement reliability.", "prerequisite": "STAT 200", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 484: Work Attitudes and Motivation", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Survey of theory and research with respect to attitudes, morale, and motivation of employees and management.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 485: Leadership in Work Settings", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Review of research and application of behavior principles in the areas of management and supervision.", "prerequisite": "PSYCH 100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 489: Professional Development in Psychology", "department": "Psychology (PSYCH)", "credits": "1 Credits", "description": "Develop post-graduation plan for use of psychology major; develop professional presentation style.", "prerequisite": "PSYCH301W;  Concurrent:  PSYCH406Wor PSYCH490"}, {"course_name": "PSYCH 490: Senior Seminar in Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Capstone experience for senior psychology majors; review of current research literature; topics vary.", "prerequisite": "PSYCH 301W", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 491: Honors Thesis", "department": "Psychology (PSYCH)", "credits": "3 Credits/Maximum of 3", "description": "An opportunity to pursue an advanced research thesis or project to integrate studies within psychology.", "prerequisite": "PSYCH 300", "other": ["Honors"]}, {"course_name": "PSYCH 492: Current Topics in Psychology", "department": "Psychology (PSYCH)", "credits": "3 Credits", "description": "Current topics addressing significant contemporary developments in psychology.", "prerequisite": "PSYCH100"}, {"course_name": "PSYCH 493: Senior Thesis", "department": "Psychology (PSYCH)", "credits": "3-6 Credits/Maximum of 6", "description": "Supervised senior thesis research in psychology.", "prerequisite": "PSYCH 300", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 494: Research Projects", "department": "Psychology (PSYCH)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "PSYCH 494H: Research Projects", "department": "Psychology (PSYCH)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"course_name": "PSYCH 495: Internship", "department": "Psychology (PSYCH)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "PSYCH 100"}, {"course_name": "PSYCH 496: Independent Studies", "department": "Psychology (PSYCH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "PSYCH 496A: **SPECIAL TOPICS**", "department": "Psychology (PSYCH)", "credits": "1-6 Credits"}, {"course_name": "PSYCH 496B: **SPECIAL TOPICS**", "department": "Psychology (PSYCH)", "credits": "3 Credits"}, {"course_name": "PSYCH 496F: **SPECIAL TOPICS**", "department": "Psychology (PSYCH)", "credits": "1-6 Credits"}, {"course_name": "PSYCH 496H: Independent Studies", "department": "Psychology (PSYCH)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "PSYCH 497: Special Topics", "department": "Psychology (PSYCH)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "PSYCH 499: Foreign Studies", "department": "Psychology (PSYCH)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}]