[{"course_name": "RADSC 101: Radiographic Introduction and Procedures/Lab I", "department": "Radiological Sciences (RADSC)", "credits": "4 Credits", "description": "Radiology history, basic radiation protection principles, medical terminology, introduction to radiography and radiographic procedures/lab. As is consistent with the core courses in the Radiography program, a passing grade for enrolled radiography students is 75%."}, {"course_name": "RADSC 102: Radiographic Procedures/Lab II", "department": "Radiological Sciences (RADSC)", "credits": "4 Credits", "description": "Continuation of Radiographic Procedures/Lab I to include finish appendicular skeleton, axial skeleton and introduction to skull anatomy and positioning.", "prerequisite": "RADSC 101"}, {"course_name": "RADSC 103: Radiographic Procedures/Lab III", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "Continuation of Radiographic Procedures/Lab II to include digestive, urinary, and biliary systems and facial bone work.", "prerequisite": "RADSC 102"}, {"course_name": "RADSC 110: Patient Care in Radiologic Sciences", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "This course includes the basic concepts of patient care, including consideration for the physical and psychological needs of the patient and the family. Routine and emergency patient care procedures are addressed from the radiographer's perspective. Students will learn proper infection control techniques and will prove competency in CPR for healthcare workers. Students will learn drug nomenclature, legend drugs and different types of contrast used for procedures. As is consistent with the core courses in Radiological Sciences, students must achieve a grade of \"C\" or better"}, {"course_name": "RADSC 204: Radiographic Exposure I", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "This course establishes a knowledge base in factors that govern and influence the production and recording of radiographic images. Topics include the importance of imaging standards, discussion of technique problem-solving for image evaluation and the factors that affect image quality. As is consistent with the core courses in Radiological Sciences students must achieve a grade of \"C\" (minimum of 75% average) or better for successful completion of the course.", "prerequisite": "RADSC 103"}, {"course_name": "RADSC 205: Radiographic Exposure II", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "This course is a continuation of Radiographic Exposure I, with emphasis on electronic imaging, image formation, quality assurance, & related areas. As is consistent with the core courses in Radiological Sciences, students must achieve a grade of \"C\" or better.", "prerequisite": "RADSC 204"}, {"course_name": "RADSC 206: Advanced Radiographic Procedures", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "Emphasis on specialized positioning and advanced radiographic procedures; includes introduction to cross-sectional anatomy. As is consistent with the core courses in the Radiography program, a passing grade for enrolled radiography students is 75%.", "prerequisite": "BIOL 161"}, {"course_name": "RADSC 207: Registry Review", "department": "Radiological Sciences (RADSC)", "credits": "2-4 Credits/Maximum of 4", "description": "Registry Review includes material from all radiological science courses, with emphasis on National Certification Examination, and career planning."}, {"course_name": "RADSC 210W: Radiographic Pathology", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "RADSC 210W Radiographic Pathology (3) A writing-intensive study of the basic fundamentals of pathology (disease process) with emphasis placed on radiographic presentation. Material covered includes the basic concepts of disease and terms related to pathology, systemic classifications of disease including etiology, examples, complications and prognosis, radiographic procedures and presentation, and the health process. Writing requirements include shorter and longer sequenced papers. All papers will receive instructor feedback and subsequent submission of a final revised paper. An informal writing assignment with peer review is also required. The writing process evolves throughout the course as the student applies knowledge learned to current assignments. This course is a requirement of the radiography (radiological sciences) curriculum and could be utilized as an option for students interested in a visual study of disease process such as health science and biology majors or for students in need of a writing-intensive course. As is consistent with the core courses in the Radiography program, a passing grade of a C or higher is required for all RADSC majors.", "prerequisite": "BIOL 161", "other": ["Writing Across the Curriculum"]}, {"course_name": "RADSC 220: Radiation Biology and Protection", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "Study the principles of interaction of radiation with living systems, effects on cells and tissues, biological response, and radiation protection. The content of this course includes the basic fundamentals of radiation interactions, basic biology with emphasis placed on effects of radiation exposure on cells and on radiation protection mandates and techniques. This course is a requirement of the radiography (radiologic technology) curriculum and could be utilized as an option for other students interested in radiation effects such as health science, biomedical engineering, health physics or physics and biology majors. As is consistent with the core courses in the Radiography program, a passing grade for enrolled radiography students is 75%.", "prerequisite": "RADSC 101"}, {"course_name": "RADSC 230: Radiographic Physics", "department": "Radiological Sciences (RADSC)", "credits": "3 Credits", "description": "Basic knowledge of atomic structure, characteristics of radiation, x-ray production, photon interactions, circuitry, imaging equipment and quality control. This course is a requirement of the radiography curriculum and could be utilized as an option for other students interested in radiation interactions and imaging equipment such as health science, biomedical engineering, health physics or physics majors. As is consistent with the core courses in the radiography program, a passing grade for enrolled radiography students is 75%."}, {"course_name": "RADSC 295: **SPECIAL TOPICS**", "department": "Radiological Sciences (RADSC)", "credits": "1-2 Credits/Maximum of 2"}, {"course_name": "RADSC 295A: Radiologic Science Clinical Internship I", "department": "Radiological Sciences (RADSC)", "credits": "1.5 Credits/Maximum of 1.5", "description": "Supervised off-campus, non-group instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "RADSC 101"}, {"course_name": "RADSC 295B: Radiological Sciences Clinical Internship II", "department": "Radiological Sciences (RADSC)", "credits": "1 Credits/Maximum of 1", "description": "Supervised off-campus, non-group instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "RADSC 295A"}, {"course_name": "RADSC 295C: Radiological Sciences Clinical Internship III", "department": "Radiological Sciences (RADSC)", "credits": "1.5 Credits", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "RADSC 102"}, {"course_name": "RADSC 295D: Radiologic Science Clinical Internship IV", "department": "Radiological Sciences (RADSC)", "credits": "1 Credits/Maximum of 1", "description": "Supervised off-campus group instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "RADSC 103"}, {"course_name": "RADSC 295E: Radiologic Science Clinical Internship V", "department": "Radiological Sciences (RADSC)", "credits": "1.5 Credits", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "RADSC 295D"}, {"course_name": "RADSC 295F: Radiologic Science Clinical Internship VI", "department": "Radiological Sciences (RADSC)", "credits": "1.5 Credits", "description": "Supervised off-campus, non-group instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "RADSC 295E"}, {"course_name": "RADSC 295G: Radiologic Science Clinical Internship VI-A", "department": "Radiological Sciences (RADSC)", "credits": "1 Credits", "description": "Supervised clinical education activities under the direction of registered radiologic technologists.", "prerequisite": "RADSC 295E"}, {"course_name": "RADSC 295I: Radiologic Science Clinical Internship VII", "department": "Radiological Sciences (RADSC)", "credits": "2 Credits/Maximum of 2", "description": "Supervised clinical education activities under the direction of registered radiologic technologists.", "prerequisite": "RADSC 295G"}]