[{"course_name": "RM 214: Applications of Probability Theory to Actuarial Science", "department": "Risk Management (RM)", "credits": "1.5 Credits", "description": "This course introduces students to actuarial science topics and the actuarial profession. To become an actuary, individuals must pass a series of professional examinations that accredit them as professionals in the field. This course provides an introduction to the material on the earlier exams such as applications of probability theory to insurance, financial mathematics (compound interest and annuities), and provides instruction on spreadsheets, so that students can perform their homework using them. Topics covered include applications of the following to insurance and actuarial science: conditional probability, independence, combinatorial principles, Bayes Theorem, and random variables. Specific probability distributions used include the binomial, uniform, Poisson, geometric, negative binomial, hyper-geometric, and multinomial discrete distributions, as well as the exponential, normal, uniform, and gamma continuous distributions. Expectations, distribution parameters, means, medians, modes, variances, skewness, and moment generating functions are also covered. The more advanced topics of joint, marginal, and conditional distributions are used, along with functions and transformations of random variables. The application of probability theory to risk management is addressed. Throughout the course, sample problems will be reviewed to help prepare students for the actuarial professional exams.", "prerequisite": "MATH 141"}, {"course_name": "RM 296: Independent Studies", "department": "Risk Management (RM)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "RM 297: Special Topics", "department": "Risk Management (RM)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "RM 299: Foreign Studies", "department": "Risk Management (RM)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "RM 301: Risk and Decisions", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Introduction to decision-making under uncertainty.  Mathematical probability and statistics, decision theory and game theory will be studied.  R M 301 Risk and Decisions (3) Most tough business decisions involve risk. Smark risk-taking requires special analytical problem solving skills and careful consideration of the relevant data. In this course, you will learn how to conceptualize decisions involving risk, how to analyze your choices, how to estimate the risk, and how to communicate and defend your analysis to others. The skills and tools you will learn come from economics, probability, statistics, and game theory. The focus will be on how the tools from these fields are applied to real world business decisions in risky environments. The concept of risk diversification will be discussed under both independent and correlated risks. Decision rules such as expected value maximization and expected utility maximization will be covered. The role of risk aversion of the decision-making process will be discussed along with how it can be measured. The study of decision analysis will include the use of decision tress. The basic concepts in game theory will be introduced. Students will learn what a Nash equilibrium is and how to derive such an equilibrium. More complicated games with incomplete information will be introduced which are important in decision-making where parties often are missing key pieces of information but must still choose a business strategy. Problems of asymmetric information will be studied; these situations arise when one party to a transaction or contract has more information relevant to the decision than the other party. For these types of problems, such as adverse selection and moral hazard, optimal solutions will be discussed.", "prerequisite": "BA 301"}, {"course_name": "RM 302: Risk and Insurance", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Introduction to the principles and methods of handling business and personal risks; emphasis on insurance techniques.", "prerequisite": "4th semester standing"}, {"course_name": "RM 303: Real Estate Fundamentals", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Introduction to urban real estate; economic forces affecting property rights; real estate markets and finance; land-use analysis; government policies.", "prerequisite": "4th semester standing"}, {"course_name": "RM 320W: Risk Management and Insurance", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Goals and methods of risk management.  Commercial insurance and alternative risk transfer (ART) methods in addition to the characteristics of insurance markets and intermediaries used by risk managers. This course covers the risk management process used by organizations to deal with the risks that they face with an  emphasis on the types of risk commonly handled through the commercial insurance market. It addresses the costs and  benefits of risk management, the goals of the process and the methods available to handle risks. The methods covered  include both traditional and nontraditional ones including retention, commercial insurance, captive insurers, loss  sensitive contracts, finite risk plans and securitization. The characteristics of the insurance markets and intermediaries  used by risk managers are studied. These include insurance company organizational forms, operational structures,  measures of performance, regulation and the role of brokers. The risks to organizations that are addressed include  risks to employees, risks to customers, risks to shareholders and risks to third parties. The types of insurance covered  include workers compensation, employment practices liability, products liability, general liability, directors and officers  liability and environmental impairment liability. In addition, the failure of risk management during the recent financial  crisis is analyzed. The course ends with a case study of risk management at Penn State University to give students a  detailed perspective of the risk management program of a complex organization and to provide insight into how changes  in the market environment can significantly affect such a program.", "prerequisite": "FIN 301", "other": ["Writing Across the Curriculum"]}, {"course_name": "RM 330W: Real Estate Risk Analysis", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Risk and value associated with real estate decision making, which includes purchasing, leasing renovation, financing, and investing. The purpose of this course is to demonstrate how value and risk is central to virtually all real estate decision making, including whether and how to lease, buy or mortgage a property acquisition; whether to renovate, refinance, demolish or expand a property; and when and how to divest a property. The goal is to finish the course with a value oriented framework based on a set of valuation and decision making tools that can be applied in a variety of real world situations and to understand industry indicators (external factors) that determine the level of risk associated with real estate ventures.", "prerequisite": "5th - 11th Semester standing", "other": ["Writing Across the Curriculum"]}, {"course_name": "RM 395: Internship", "department": "Risk Management (RM)", "credits": "1-3 Credits/Maximum of 3", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "RM 399: Foreign Studies", "department": "Risk Management (RM)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "RM 401: Fundamentals of Private Pensions", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Analysis of pension regulation, funding, vesting, retirement annuities under insured and self-insured plans, actuarial cost analysis, plan termination insurance.", "prerequisite": "RM 302"}, {"course_name": "RM 405: Corporate Risk Management", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Risk management for firms and organizations; loss control, risk transfer, and loss financing alternatives; Corporate employee benefit program design and financing.", "prerequisite": "RM 302"}, {"course_name": "RM 410: Financial Mathematics for Actuaries", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "This course focuses on Interest Theory, including compound interest, annuities with non-contingent payments; equations of value; loans and their valuation; the pricing of bonds, determining their yields to maturity and outstanding balances; determination of yield rates; duration of an asset or liability, and immunization of interest rate risk. The course helps prepare actuarial students for the international actuarial exam in Financial Mathematics (FM).", "prerequisite": "MATH 141"}, {"course_name": "RM 411: Long Term Actuarial Mathematics - Fundamentals", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "A study of the mathematical theory of life contingencies, single-life functions, and their applications. The course provides a solid understanding of the mathematics of life insurance and annuities, and helps actuarial students prepare for the long-term part of the Fundamentals of Actuarial Mathematics (FAM) actuarial exam. Students will gain an understanding of key concepts for selling insurance to various constituents, which includes among other things pricing based on a person's age and gender. Additional topics covered in the course include: 1) Key features of long-term insurance coverages, 2) Key concepts concerning survival models for individual lives, 3) Calculations on the present value random variables associated with long-term insurance benefits and expenses, 4) The premium and policy value calculation process, and 5) Pricing simple financial options under the binomial and Black-Scholes models.", "prerequisite": "RM 410"}, {"course_name": "RM 412: Long Term Actuarial Mathematics - Advanced Topics", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "A study of joint-life and survivor-life functions, population life tables, and multiple decrement theory, with applications to disability and retirement problems. The course provides a solid understanding of the advanced topics in long-term actuarial mathematics, and helps actuarial students prepare for the Advanced Long-Term Actuarial Mathematics (ALTAM) actuarial exam. Topics covered include: 1) Key concepts of multiple state survival models, including calculations of premium and policy values, 2) Analysis of emerging surplus and apply profit testing principles, 3) Basic pension/retirement benefits, including accrual, valuation and funding calculations, and 4) Various equity-linked life insurance guarantees and options, including relevant pricing, reserving and hedging principles. Building on these topics, students will be able to apply theoretical concepts to real-world insurance problems using a project-based approach focused on one or more advanced topics covered in the course.", "prerequisite": "RM 411"}, {"course_name": "RM 415: Modeling for Actuarial Science", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Modeling for Actuarial Science provides detailed actuary principles dealing with models of interest rates used to price liabilities, and models of stock prices and options used to price employee options and cash balance accounts. The first section of the course focuses on discrete models, such as binomial option pricing, which can be used for pricing employee stock options. The second section covers put-call parity, the effects of style, maturity, and strike price on option prices, generalized parity, and exchange options. The third section looks at continuous models such as: 1) the Black-Scholes formula and it's applications to options on stocks, currencies, futures, and market-making, 2) Delta-Hedging and the understanding of and pricing of exotic options (Asian, Barrier, Compound, Gap, and Exchange Options), 3) understanding lognormal distributions, Monte Carlo testing, Brownian motion, Ito's Lemma, historic and implied volatility, Sharpe ratios, interest rate models, and the application of these to liabilities. The course assists in preparing students for the international actuarial exam MFE (Models in Life Contingencies).", "prerequisite": "RM 410"}, {"course_name": "RM 420: Property, Casualty, and Health Insurance", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Actuarial methods and concepts used to model property, casualty and health insurance losses along with credibility theory. RM 420 Property, Casualty, and Health Insurance (3) This course provides a solid understanding of actuarial methods and concepts used to develop loss models for property and casualty insurance and health insurance. The course makes use of real world numerical examples in order to demonstrate how actuaries use historical claims and pricing data, both company specific and industry, to determine rates and increases. The class also gives students a foundation in Credibility Theory and simulation to prepare for the actuarial examination on loss models.", "prerequisite": "RM 412"}, {"course_name": "RM 421: Short Term Actuarial Mathematics - Fundamentals", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "RM 421 provides a solid understanding of actuarial methods and concepts used to develop loss models for property and casualty insurance and health insurance. The course makes use of real world numerical examples in order to demonstrate how actuaries use historical claims and pricing data, both company specific and industry, to determine rates and increases. Topics covered include: 1) Understand the key features of insurance and reinsurance coverages, 2) Understand the characteristics of severity, frequency and aggregate models, 3) Understand the concepts and applications of credibility theory, 4) Apply basic methods for calculation of premiums and reserves for short term insurance coverages. The course helps actuarial students to prepare for the international Fundamentals of Actuarial Mathematics (FAM) exam.", "prerequisite": "RM 410"}, {"course_name": "RM 422: Short Term Actuarial Mathematics - Advanced Topics", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "This course covers advanced topics of actuarial methods and concepts used to develop loss models for property and casualty insurance and health insurance. The course makes use of real world numerical examples in order to demonstrate how actuaries use historical claims and pricing data, both company specific and industry, to determine rates and increases. Topics covered include: 1) Interpretation and calculations with severity, frequency and aggregate models, 2) Construction and selection of parametric models, 3) Estimation of losses using credibility procedures, and 4) Pricing and reserving for short-term insurance coverages. The course helps to prepare actuarial students for the international Advanced Short-Term Actuarial Mathematics (ASTAM) actuarial exam.", "prerequisite": "RM 421"}, {"course_name": "RM 424: Real Estate Law", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Analyze contemporary law applicable to various types of ownership interests and rights, methods of transferring ownership, and use of real property.  B LAW 424 B LAW (R M) 424 Real Estate Law (3) Analysis of contemporary law applicable to various types of ownership interests and rights, methods of transferring ownership, and use of real property. The objectives for this course are: (1) to provide students with an understanding of essential U.S. real estate property law, including the rights private property owners may obtain, how ownership and transfer are handled in view of present and future interests, constitutional issues that impact real estate ownership, and the legal aspects of modern real estate contractual transactions; (2) to teach students the ability to spot the legal issues arising from the above as future business leaders and (3) to introduce students to the legal reasoning process necessary to address and avoid the legal dilemmas presented by such issues. Instructional methods for the course will include detailed lectures and classroom discussion of readings and other materials. Student progress and mastery of the material will be evaluated through periodic examinations.", "prerequisite": "BLAW 341", "other": ["Cross-listed with: BLAW 424"]}, {"course_name": "RM 425: Business and Environmental Regulation", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Examines the interplay between environmental regulation and commercial activities, including property interests.  B LAW (R M) 425 Business and Environmental Regulation (3) R M/B LAW 425 is an advanced business law course based on foundation knowledge in legal regulation, property rights, and enterprise. The course explores the interplay between environmental laws and property rights and includes topics such as; common law regulation of the environment, government power and private rights, zoning, protecting endangered species, regulating the transportation and storage of hazardous materials, and Federal regulation of water quality.Students will develop their comprehension and analysis of the legal reasoning processes along with the ability to identify legal issues from the perspectives of the government, property owners, and environmental interest groups. The instructional methods will include class discussions of readings and video presentations. To facilitate thorough analysis of the competing interests affecting environmental law, this course will employ the Socratic teaching method and place a special emphasis upon class discussion and interaction.", "prerequisite": "BLAW 341", "other": ["Cross-listed with: BLAW 425"]}, {"course_name": "RM 430: Life and Health Insurance", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Industrial organization of the US life-health insurance industry; economic issues related to organizational structure, operational functions, and the supply and demand for life-health products.", "prerequisite": "RM 302"}, {"course_name": "RM 440: Risk, Strategy, and Decision Making", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "One of the key ways that a business attempts to manage risk it anticipates and confronts in markets is through organizational-level elements such as its business strategy, structure, and culture. These elements emerge from a series of decisions guided by the insights and biases of individuals. As such, the management of enterprise risk must also include an understanding of how individuals (e.g. managers) approach risk through their decisions and decision making processes. In this course, we look at some of these critical elements separately and then together as they integrate to guide and define enterprise risk management. The basic course objectives are to come away with an understanding of the following: Forms of strategic risk - From market to internally-driven risk; from emotional to economic-driven, how does strategic risk present itself? How do executives recognize/assess and respond to the \"portfolio of risk\" that they must address to make the business successful? Business strategy and structure - One way risk is addressed and articulated is through a business strategy. What is strategy? What are the key decisions that comprise a business strategy? How are organizations structured to implement these strategies and move information across the firm? Where and how is risk assessed in these processes and structures, and incorporated into a strategic risk plan? Decision making - Decision making around strategy and risk management plays out in various forms and across different levels (i.e., individuals and groups). What goes right and wrong? How are these processes systematically linked to perceptions and actions associated with risk management. Organizational culture - Perhaps one of the most critical elements in enterprise risk management is the role played by organizational culture (or simply \"How we do things around here and my role as an organizational member doing it.\") We examine the roots of organizational culture and how it is aligned to perspectives of risk and its management. Descriptive vs. prescriptive perspectives - Once we \"described\" what does/could go on, we need to engage in looking at ways that organizations can prevent pitfalls and correct suboptimal practices.", "prerequisite": "RM 302"}, {"course_name": "RM 450: Contemporary Issues in Real Estate Markets", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Historical performance, land use issues, market valuation, real estate development, public policy issues.", "prerequisite": "RM 303"}, {"course_name": "RM 460: Real Estate Financial Analysis", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Debt and equity financing, capital structure, \"creative financing,\" risk analysis, corporate asset management.  FIN (R M) 460 Real Estate Financial Analysis (3) The objective of this course is to provide in-depth coverage of real estate investment and financing decisions. The focus is on the private market, including corporate asset management. Investment analysis moves from the basics of forecasting cash flows, through advanced topics including the impact of real option value on investment and development decisions. Risk measurement is given particular attention with a focus on sensitivity and simulation analysis. There is some coverage of asset pricing models like the Capital Asset Pricing Model, which is critically analyzed with respect to its applicability in real estate markets. The impact of illiquidity, management costs, and the suspicion of non-normally distributed returns are explored, as are the implications of relative market inefficiency. The financing module begins with the basics of mortgage debt mathematics, which is then extended to include comparisons of various repayment programs. Included are interest-only, balloon, shared appreciation, growing equity, graduated payment and reverse annuity loans, as well as various creative financing of commercial properties.The latter include participating mortgages, convertible mortgages, and mezzanine debt. Featured in the corporate asset management section is the lease/buy decision. Other topics may be addresses based on current events. It is anticipated that guest speakers will be invited where appropriate.", "prerequisite": "FIN 305W", "other": ["Cross-listed with: FIN 460"]}, {"course_name": "RM 470: Real Estate and Capital Markets", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Analysis of publicly-traded real estate of both the equity, (REITs) and debt (MBSs) sides.  The course also provides international perspectives. FIN 470 / RM 470 Real Estate and Capital Markets (3) The objectives of this course are to expose the student and explore the issues associated with the analysis of \"public\" (\"Wall Street\") real estate, including both equities (such as Real Estate Investment Trusts or REITs) and debt vehicles (such as Mortgage-Backed Securities or MBSs). In addition, the course will focus on the increasingly globalization of real estate capital markets as the real estate sector becomes integrated into the global financial system. The differences between private and public real estate analysis will also be explored, including the suitability of traditional asset pricing models for real estate analysis. Topics include the growing impact of institutional real estate forces on the real estate sector, the use of modern financial economics methods to real estate including the concept of market efficiency, modern portfolio theory applications, market measures of risk and return, the use of option-based models, and other advances. The rise of Wall Street's interest in real estate securities is an important institutional development and serves as the underlying background for the analysis of MBSs using fixed-income security techniques. As globalization has spread, the real estate sector has moved with these changes and prospects for a global real estate market are examined and evaluated. This course serves as a compliment to FIN 460, which emphasizes traditional financial analyses of individual real estate projects. In FIN 470, real estate securities are viewed as a natural extension towards the complete integration of real estate and capital markets. In this sense, these courses will enable traditional and modern analyses of the real estate sector for years to come.", "prerequisite": "FIN 305W", "other": ["Cross-listed with: FIN 470"]}, {"course_name": "RM 475: Quantitative Analysis for Business", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "This course provides students with working knowledge of some widely used quantitative methods, such as Monte Carlo simulations, t-tests, linear regressions, nonlinear regressions, regressions with dummy variables, and regressions with interacting explanatory variables, as well their applications in business. The course will focus on understanding and applying each method, but not on statistical theory or their proof. Monte Carlo simulations will be used to substitute for mathematical proofs. By the end of the course, students should understand the purposes of the above methods and how to use them to solve real estate, financial, marketing, and risk management problems. Students should also be able to interpret results in ways that are correct, insightful, and useful, should be aware of potential problems of each method, such as the omitted variable bias, multicollinearity, heteroskedasticity of regressions, and should know how to make corrections if these problems are present. Students should also have developed working knowledge of R, which is a programming language and software environment widely used by quantitative analysts. Students should know how to use R to conduct basic data manipulation, do simple Monte Carlo simulations, do t-tests, and run linear and non-linear regressions.", "prerequisite": "SCM 200"}, {"course_name": "RM 480: International Real Estate Markets", "department": "Risk Management (RM)", "credits": "3 Credits", "description": "Internatinal perspectives on real estate as property, evaluation of land use regulations, and differences in real estate markets across countries.", "prerequisite": "R M  303 or R M  330W", "other": ["Cross-listed with: IB 480"]}, {"course_name": "RM 494: Research Project", "department": "Risk Management (RM)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "RM 494H: Honors Research Project", "department": "Risk Management (RM)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised honor student research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "RM 496: Independent Studies", "department": "Risk Management (RM)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative Projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "RM 497: Special Topics", "department": "Risk Management (RM)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "RM 499: Foreign Studies", "department": "Risk Management (RM)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]