[{"course_name": "RUS 1: Elementary Russian I", "department": "Russian (RUS)", "credits": "4 Credits", "description": "Audio-lingual approach to basic Russian; writing. Students who have received high school credit for two or more years of Russian may not schedule this course for credit, without the permission of the department.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "RUS 2: Elementary Russian II", "department": "Russian (RUS)", "credits": "4 Credits", "description": "Audio-lingual approach to basic Russian continued; writing. Students who have received high school credit for four years of Russian may not schedule this course for credit, without the permission of the department.", "prerequisite": "RUS  001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"course_name": "RUS 3: Intermediate Russian", "department": "Russian (RUS)", "credits": "4 Credits", "description": "Emphasis on reading unsimplified texts; composition; grammatical analysis.", "prerequisite": "RUS  002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"course_name": "RUS 51: Elementary Intensive Russian for Graduate Students I", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Intensive introduction to Russian: first half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  RUS 051 Elementary Intensive Russian for Graduate Students I (3)This is the first in a series of three courses designed to give students an intensive introduction to Russian. This is the first half of elementary sequence in reading, writing, speaking, listening, and cultural contexts. Students will learn the Russian vocabulary and will learn to create simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"course_name": "RUS 52: Elementary Intensive Russian for Graduate Students II", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Intensive introduction to Russian: second half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  RUS 052 Elementary Intensive Russian for Graduate Students II (3)This is the second in a series of three courses designed to give students an intensive introduction to Russian. This is the second half of graduate intensive sequence in elementary reading, writing, speaking, listening, and cultural contexts. Students will learn the Russian vocabulary. Lessons are taught in an authentic cultural context.", "prerequisite": "RUS  051 and graduate standing"}, {"course_name": "RUS 53: Intermediate Intensive Russian for Graduate Students", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Continued intensive study of Russian at the intermediate level: reading, writing, speaking, listening, cultural contexts.  RUS 053 Intermediate Intensive Russian for Graduate Students (3)This is the third in a series of three courses designed to give students an intermediate intensive knowledge of Russian. Continued intensive study of Russian at the intermediate level: reading, writing, speaking, listening, and cultural contexts. Lessons are taught in an authentic cultural context.", "prerequisite": "RUS  052 or equivalent, and graduate standing"}, {"course_name": "RUS 83: First-Year Seminar in Russian", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Russia's cultural past and present. RUS 083 First-Year Seminar in Russian (3) (GH; FYS; IL) (BA) Russia, the world's largest country stretching over eleven time zones in Europe and Asia, is currently undergoing a dramatic transformation. For the past hundred years, Russia has served as a laboratory of gigantic dimensions as various social ideals were implemented with unprecedented radicalism. At the same time, Russia's intellectuals raised 'ultimate questions' about social justice, the existence of God, and the meaning of human life with an unparalleled acuity and intensity. This course surveys Russia's cultural past and present and introduces students to the various attitudes of Russian thinkers and authors toward the questions of national identity and national destiny. It could be offered either as a broad overview of general trends and key ideas or as a theme-specific survey. With that said, while the thematic focus may vary from year to year, students will discuss examples of Russian high culture (philosophy, literature, art, music) alongside critical inquiries into daily life in imperial, communist, and post-communist Russia in each iteration of the course. Special emphasis will be placed on the in-depth study of a few seminal works of Russian literature and cinema. In addition to introducing students to the key topics in Russian history and culture, this course will help to prepare them for a variety of additional courses in the fields of literature and Russian/East European area studies. In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and to have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them, including the opportunity to develop relationships with faculty and other students who share their academic interests. The course will be taught in English, and no prior knowledge of Russian culture and history is required. Each section of this course will be limited to twenty students who will be instructed by an experienced professor. The classwork will consist of a fusion of lectures, seminar-style discussions, group work, short writing assignments, collaborative group projects, student presentations, and a research project. This course can be used to fulfill the General Education or Bachelor of Arts Humanities requirement, the International Cultures requirement, and the first-year seminar requirement.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RUS 99: Foreign Studies", "department": "Russian (RUS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 100: Russian Culture and Civilization", "department": "Russian (RUS)", "credits": "3 Credits", "description": "RUS 100 Russian Culture and Civilization (3) (GH; IL) (BA). This course meets the Bachelor of Arts degree requirements and is a prescribed course for the Russian major and minor. The course acquaints students with the general contours of Russian culture and civilization from the origins to the recent past. Students will read the story of the Russian people, which includes their ongoing quest for national identity between east and west, their triumphs and tragedies, and their important contributions to world culture. The course surveys history, politics, language, literature, folklore, religion, music, and art. Students will be acquainted with various attitudes of Russian thinkers and authors towards the question of national identity and national destiny. Examples of Russian high culture (philosophy, literature, art, music) and the Russian religious faith (Orthodoxy) are discussed alongside views of daily life. Although the course's focus is on Russian culture and civilization rather than on history, some historical background is necessary to properly understand and interpret the culture. That is why a historical frame is systematically provided. As a General Education course, Russian 100 incorporates the following four elements of active learning: international competence (which is inherent to the subject matter), information gathering and analysis, active use of writing, and dialogue pertaining to social behavior, community, and scholarly conduct, which will be provoked by the reading material. A knowledge of Russian is not required, as class lectures and discussions, as well as all additional readings, are in English. The course materials include weekly lectures designed as multimedia presentations, readings assigned through the Penn State Libraries electronic reserve system, and some films.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "RUS 101N: Russian Cinema", "department": "Russian (RUS)", "credits": "3 Credits", "description": "RUS 101N Russian Cinema (3) (GH; GA; IL). From the beginning, cinema has been an intersection of technology, art, entertainment, industry, commerce, politics, and more. The course acquaints students with major filmmakers who shaped Russian cinema over the 20th century and beyond. The course surveys Russian cinema from its beginnings to the present, with emphasis on historical, political, and cultural contexts. Russian cinema is defined as feature films and documentaries produced in pre-revolutionary Russia, as well as in the Soviet Union and post-Soviet Russia. The course will chronologically overview the developments in Russian film mapping these onto major historical events and artistic and cultural trends. It will also introduce students to fundamental concepts and terminology for film analysis. The course is taught exclusively in English; neither prior knowledge of Russian history and culture nor of film history and terminology is required. To preserve as much authenticity as possible, all movies will be viewed in Russian with English subtitles. Films will cover different genres, such as melodrama, historical film, screen adaptation of literary comedy, propaganda film, and documentary. Readings will provide a historical perspective and acquaint students with classical writings by filmmakers and theorists. Short papers and/or presentations will provide students with opportunities for personal research and active use of writing. The course is designed to satisfy General Education Inter-Domain course requirements as a GH (General Humanities), as a GA (General Arts), and as an IL (International Cultures) course.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RUS 110: Russian Folklore", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Study of byliny, lyrical and historical songs, folktales, drama, ceremonial poetry, chants, charms, proverbs, and mythology of Russia. In English.  RUS 110 Russian Folklore (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. Russian 110 is a general survey of Russian folklore for English-speaking students. It concerns itself not with the aristocratic and intelligentsia culture of Russia, but with the rites of passage, agricultural ceremonies, beliefs, legends, folktales, and epics of the Russian peasants, most of whom were illiterate. Students are evaluated on the basis of three examinations (half short-answer and half essay), a legend collecting project, and a final. The legend project requires students to collect a legend or tale (usually from the American tradition), evaluate it against folklore indices, present it to the other students, and write it up. Russian 110 may be counted toward the major in Russian Translation (BS). It may also be used to fulfill General Education Humanities and International/Intercultural Competency requirements. This course will be offered once a year with 50 seats per offering.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"course_name": "RUS 141Y: Russian Literature in English Translation: 1800-1870", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Pushkin, Lermontov, Gogol, the critics, Turgenev, Dostoevsky, Tolstoy. Writing assignments will serve as a major way of exploring subject matter.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "RUS 142Y: Russian Literature in English Translation: 1870 to Present", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Dostoevsky, Tolstoy, Chekhov, Gorky, symbolists, selected Soviet authors. Writing assignments will serve as a major way of exploring subject matter.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "RUS 143: The Culture of Stalinism and Nazism", "department": "Russian (RUS)", "credits": "3 Credits", "description": "This course, which is cross-listed between Russian and German, aims to acquaint students with an important and troubling chapter of 20th-century culture. The regimes of Stalin and Hitler have had a decisive impact not only on life in Russia and Germany, but in much of Europe and the world at large. There is no consensus among scholars about how to classify these systems, whether the term \"totalitarian\" is appropriate to describe them, and whether Stalinist Russia and Nazi Germany are essentially similar or essentially different historical phenomena. Espousing a comparative perspective, this course explores the culture produced by Stalinist Russia and Nazi Germany, taking into account both the culture of daily life and selected works of \"high culture,\" including literature, the visual arts, architecture, music, and film. The ideological underpinnings of both systems will be discussed and compared. The classics of Stalinist Socialist Realism and Nazi propaganda will be analyzed both as political statements and works of art. The course will also include a reading of authors who attempted to create critical representations of life in Stalinist and Nazi societies, such as Lydia Chukovskaya, Varlam Shalamov, Primo Levi, and George Orwell. The course is designed to be suitable for all students generally interested in Russian and/or German culture, or interested in various fields of humanistic study, whether or not they have previously studied the culture of Russia or Germany. A knowledge of Russian or German is not required, as class lectures and discussions as well as all reading assignments will be in English. This course is designed to count as General Education, as a GH \"Humanities,\" and as an IL \"International Cultures\" course. It meets the BA requirements in the humanities by asking students to demonstrate competence in 20th-century German and Russian history, political philosophy, literature, art and film.", "other": ["Cross-listed with: GER 143", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "RUS 144: Multicultural Russia: Narratives of Race and Ethnicity in Russian Literature and Culture", "department": "Russian (RUS)", "credits": "3 Credits", "description": "RUS 144 Multicultural Russia: Narratives of Race and Ethnicity in Russian Literature and Culture (3) (GH, IL). Despite media's renewed attention to Russia's domestic and foreign affairs, the fact that Russia-a gigantic land mass stretching all the way from Finland to the Sea of Japan-is, even today, not really a \"nation\" but an \"empire,\" encompassing peoples of many different ethnic, racial, linguistic, and religious backgrounds, remains a little known fact for the American audience. According to a 2005 report by the Council of Europe Commissioner for Human Rights, more than 170 distinct ethnic groups live within the borders of the Russian Federation. For most of the past two centuries, this empire was even larger and more diverse. While, inside the Soviet Union, this diversity was often celebrated as proof of the \"friendship of peoples\" underlying the Communist state. In the 1920s and the early 1930s, the Soviet authorities promoted the voices, literatures, and cultures of the empire's ethnic and national minorities, as long as they were \"national in form\" but \"socialist in content.\" Once the survival of the new state was secured, the so-called Soviet \"nationalization\" campaign was brought to a stop and even reversed in some cases, resulting in silencing of numerous treasures of world literature that offer invaluable glimpses into the lives of an ethnically, geographically, and culturally diverse range of peoples, who identify today as Russian citizens. This course explores the major works by authors representing many ethnic minorities in the territory of modern Russia, as well as works by writers from former Russian and Soviet colonies, such as Ukraine, Georgia, Armenia, Uzbekistan, and Kyrgyzstan. Special attention is also paid to Jewish experience and Russia's encounters with Africa and Africans. Focusing on five major regions-Ukraine, the Caucasus, Central Asia, the Far East, and Africa-the course analyzes primary texts for their rhetorical and poetic effects, the historical and political contexts in which literary discourses surrounding questions of ethnicity, culture, and race develop, and the conditions under which they are marketed to, or suppressed from, different groups of readers. Where applicable, the primary readings are supplemented with short selections from the scholarly literature on theories of race and ethnicity, human rights, colonialism, Russian/Soviet nationality policies, and the politics of censorship and literacy under Communism. The course is taught in English and requires no prior knowledge of Russian culture and history. It offers a variety of class activities - lectures, screenings, guided discussions, group work, and student presentations - and incorporates several elements of active learning - information gathering and analysis, active use of writing, and oral presentations and modeling demonstrations - to help students develop and apply actively their critical thinking and close reading skills. This course fulfills the General Humanities requirement and is designated as an International Cultures course.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RUS 145: Putin¿s Russia and Its Protest Culture", "department": "Russian (RUS)", "credits": "3 Credits", "description": "RUS 145 Putin¿s Russia and Its Protest Culture (3) (GH, IL). The collapse of the Soviet Union in 1991 caught most observers by surprise and has led Russia on a path of political, economic, and cultural liberalization of an unprecedented scope. But despite the initial excitement, post-Soviet Russia has emerged as a state characterized by authoritarianism and crony capitalism. How so? Why did Russia's political and economic transition fail to produce the intended results? What are the factors that gave rise to and sustained Vladimir Putin's regime? What are its key pillars and contradictions? What is the Russian people's response to Putinism, its punitive domestic politics, and its aggressive posture toward Russia's neighbors and the West? This course seeks to answer these questions by examining the relationship between individuals and the state in present-day Russia. Designed as a comprehensive overview of major events and most prominent voices in Putin's Russia that have influenced and continue to influence contemporary Russian culture and politics, this course aims at providing students with an opportunity to evaluate critically a set of creative and analytical works produced in Putin's Russia by representative writers, filmmakers, visual artists, journalists, political observers, human rights activists, and cultural critics from both aesthetic and ethical points of view. Particular attention is paid to Putin's solidification of power, the Second Russo-Chechen War, Putin's prosecution of the oligarchs and political dissent, Russia's state-sponsored disinformation offensive and its global ramifications, as well as their deliberations in arts and public discourse. The course is taught in English and requires no prior knowledge of Russian culture and history. Its classwork consists of lectures, screenings, guided discussions, group work, short quizzes, student presentations and incorporates the following elements of active learning: information gathering and analysis, oral presentations, and active use of writing. The course fulfills the General Humanities requirement and is designated as an International Cultures course.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "RUS 196: Independent Studies", "department": "Russian (RUS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 197: Special Topics", "department": "Russian (RUS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 199: Foreign Studies", "department": "Russian (RUS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 200: Intermediate Russian II", "department": "Russian (RUS)", "credits": "4 Credits", "description": "A continuation of intermediate Russian with a comprehensive grammar review and focus on reading, writing and speaking Russian.", "prerequisite": "RUS  003 or permission of program", "other": ["International Cultures (IL)"]}, {"course_name": "RUS 214: Intermediate Russian III", "department": "Russian (RUS)", "credits": "4 Credits", "description": "Intensive practice of Russian reading, writing, listening and speaking; review of Russian grammar.  RUS 214 Intermediate Russian III (4) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will provide intensive Russian language training at the intermediate level, stressing the four skills of reading, writing, listening, and speaking. Together with its companion course, Russian 204, the course will provide a complete review of Russian grammar. It will include a discussion of participles and verbal adverbs, verbs of motion, and problems of Russian syntax in conjunction with conversation practice and writing assignments.Russian 214 will be a required course for Russian majors. It can be taken before or after Russian 204 (which will also be required).Grading will be based on regular written tests and a final exam that will include an oral component.Students will be encouraged to use the new language training equipment available at Sparks Building.", "prerequisite": "RUS  003", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 296: Independent Studies", "department": "Russian (RUS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 297: Special Topics", "department": "Russian (RUS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 299: Foreign Studies", "department": "Russian (RUS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 304: Readings in Russian III", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Extensive reading of contemporary Russian texts, including articles from Soviet press and short fiction.", "prerequisite": "6 credits of Russian at the 200 level", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 305: Advanced Russian Conversation", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Discussion and role-playing based on real-life situations and current events; supervised by a native speaker.  RUS 305 Advanced Russian Conversation (3) (IL) RUS 305 is the basic conversation course for the B.A. in Russian. It centers around discussion and role-playing on such topics as ordering plane tickets, traveling on Russian trains, Russian restaurants, cooking at home, traveling to and from work, summer jobs and career plans, sports and other forms of leisure, movies and television, and interviews with famous people. Some current events are also discussed, e.g. Russian attitudes towards the Romanovs, the AIDS crisis, the economic situation in Russia.Evaluation is based on individual and group oral presentations, regular quizzes, and short compositions.No special facilities are required, but students are encouraged to use the new language training equipment available in Sparks Building.", "prerequisite": "RUS  204 , RUS  214", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"course_name": "RUS 395: Internship", "department": "Russian (RUS)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 399: Foreign Studies", "department": "Russian (RUS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 401: Advanced Russian I", "department": "Russian (RUS)", "credits": "4 Credits", "description": "Advanced practicum in conversation, reading, and composition. This course is designed as a transition from Intermediate to Advanced level of speaking proficiency. It is taught in Russian and covers topics in grammar in the context of the spoken and written language. Emphasis is placed on verbal morphology, simple and complex sentence structures. Short readings will include original or adapted texts covering a variety of genres and topics. Quizzes, tests, class discussions, individual and small group presentations, short descriptive and expository essays, and internet-based assignments that address current events and illustrate different linguistic usage will be essential means to explore the subject matter and assess students¿ progress. The course also aims to increase the students' understanding of Russian culture and the Russian way of life. This course meets the BA and IL requirements. Students must take RUS 200 prior to RUS 401 or receive permission of the program.", "prerequisite": "RUS  200", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 402: Advanced Russian B", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Advanced Russian grammar, conversation, and composition.  RUS 402 Advanced Russian B (3) RUS 402 is an advanced Russian language course that covers topics in grammar in the context of the spoken and written language. It is taught in Russian and functions as a complement to RUS 401. Emphasis will be placed on prefixed verbs of motion, use of the imperative, comparative and superlative forms,and complex and conditional sentences in Russian. Classes will include group and individual oral presentations, analyses of written texts, and assignments using the internet to access recent oral and written materials that treat current events and illustrate particular linguistic usage. Students will also watch one feature film during class time.", "prerequisite": "RUS  200"}, {"course_name": "RUS 403: Advanced Russian Conversation and Composition", "department": "Russian (RUS)", "credits": "3 Credits", "description": "A conversation and composition course that includes situational topics as well as complex academic discourse.  RUS 403 Advanced Russian Conversation and Composition (3) (IL) The Russian 403 course is intended primarily to develop students' oral and composition skills in Russian. The main focus of the course will be on speaking and understanding spoken Russian and writing on a variety of themes. The students will engage in different oral activities on a number of topics from the everyday life of an average Russian person to more complex discussions of current events, culture, history, the arts, and politics. The students will be expected to do a good deal of talking in Russian both with classmates and with the instructor in class, and prepare oral and written assignments at home. The written exercises will enhance the students' ability to perform well on the class assignments. The course will include a practical review and practice of some of the most complex and troublesome aspects of Russian grammar. There will be a considerable emphasis on vocabulary, word-formation for vocabulary building, and communicative strategies in the course. One of the goals of the course is also to increase the students' understanding of Russian culture and the Russian way of life based on Russia's history and current reality.", "prerequisite": "RUS  200 or permission of program;  Concurrent:  RUS  400, RUS  401 , RUS  402 , RUS  405 , RUS  412"}, {"course_name": "RUS 404: Advanced Reading and Composition", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Advanced Russian Reading and Composition.  RUS 404 Advanced Reading and Composition (3) RUS 404 focuses on reading and writing in Russian. Some time is spent on reading strategies, methods of building a working Russian vocabulary, sentence structure, and word order. Reading materials are at the advanced level and for the most part treat the history of the Russian Revolution and Civil War, the Stalinist era and the Thaw. Literary selections complement the historical readings and include works of Blok, Akhmatova, Zoshchenko, Bulgakov and Solzhenitsyn.", "prerequisite": "RUS  401 , RUS  402 , or RUS  403"}, {"course_name": "RUS 405: Seminar in Russian Literature", "department": "Russian (RUS)", "credits": "3-6 Credits/Maximum of 6", "description": "Readings in classical Russian literature; Topics vary.  RUS 405 Seminar in Russian Literature (3 per semester/maximum of 6) (IL) In no other culture has literature attained the centrality it enjoyed in nineteenth- and twentieth-century Russia. Political, social and historical constraints propelled Russian writers into figures of witness, prophecy and moral instruction. Yet far from being limited to the vast, dark novels of legend, Russian literature offers a great deal of variety, including much humor, lyricism and fantasy. Russian 405 is a senior-level seminar devoted to the in-depth study of selected texts of classical nineteenth- and twentieth-century Russian literature. It presupposes a solid reading knowledge of Russian. The choice of authors and texts will vary from one year to the next. Writers discussed on a regular basis will include such major figures as Alexander Pushkin, Mikhail Lermontov, Nikolai Gogol, Ivan Turgenev, Fyodor Dostoevsky, Lev Tolstoy, Anton Chekhov, as well as selected writers from the Soviet and post-Soviet period.The thematic emphasis will vary from one year to the next. The focus may be on the oeuvre of a single writer, on the development of a particular genre (e.g., lyric poetry or the short story), on a particular time period (e.g., the so-called \"Silver Age\" at the beginning of the twentieth century), or a particular theme (e.g., the conflict between liberalism vs. radicalism, the \"woman question,\" the role of religion, Russia vs. the West, Russian \"Orientalism,\" the Communist Revolution and its discontents, etc.).The literary texts will be read in Russian. They will be analyzed both in their socio-historical context and as aesthetically compelling manifestations of verbal art. Explorative analytical writing and class discussion will be essential means to explore the subject matter.", "prerequisite": "RUS 401", "other": ["International Cultures (IL)"]}, {"course_name": "RUS 406: Russian Film", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Conversation and Composition based on classical Russian films.  RUS 406 Russian Film (3) (IL) Taught in Russian, this course offers an overview of the development of the film industry in the USSR/Russia within its historical context: from the silent classics of the Soviet Golden Age, to the mass entertainment movies of Socialist Realism, the new-wave productions of the cultural thaw of the 60s, the popular genres of the 'stagnating' 70s, the liberated films of the glasnost period, and the most recent movies reflecting Russia's difficult economic transition. Russian cinema will be discussed as an index of sociopolitical trends over the years, as well as a medium in its own right. Therefore, attention will be devoted to historical turning points that affected the cultural policies of the Soviet Union, and consequently the styles, themes, and quality of filmmaking. At the same time, the course will consider the film as text, and analyze the feelings it stirs, the moods it evokes, and the ideological message it conveys. To this end, the course will cover the basic elements and techniques of film language (shots, montage, mise en scene, etc.) and the process of visual perception that affects the audience.", "prerequisite": "RUS  401 , RUS  402 , or RUS  403", "other": ["International Cultures (IL)"]}, {"course_name": "RUS 410: Heritage Russian 1", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Introductory course for heritage speakers of limited linguistic proficiency aiming at teaching basic reading, writing, and grammar skills in Russian.  RUS 410 Heritage Russian 1 (3) (IL) The course is aimed at \"heritage speakers\" of Russian, i.e., those who grew up speaking Russian in the family without a full Russian educational and cultural background. It is designed for students who have speaking and comprehension ability in Russian, but have minimum or no exposure to writing and reading. This course teaches basic skills of writing, reading, and grammar. It includes simple original reading material (fairy tales, poems, songs), as well as visual and multimedia material, such as cartoons, advertising, etc.) The course will enhance the students' knowledge and understanding of Russian culture as well as increase their awareness of their own complex cultural identity (Students with reading and limited writing proficiency should consider Heritage Russian II (RUS 411).", "prerequisite": "basic speaking proficiency in Russian; placement test and   consent of instructor", "other": ["International Cultures (IL)"]}, {"course_name": "RUS 412: Russian Translation", "department": "Russian (RUS)", "credits": "3 Credits/Maximum of 6", "description": "Translation from Russian into English of complex texts from the humanities, social sciences, and technical fields.", "prerequisite": "9 credits of Russian at the 200 level or higher", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 414: Advanced Grammar and Linguistic Analysis of Contemporary Russian", "department": "Russian (RUS)", "credits": "3 Credits", "description": "In-depth study of selected grammar topics pertaining to the phonology, morphology, and syntax of Modern Standard Russian with glimpses into the history of the Russian language. The course aims to both enhance students' understanding of linguistic structures in general and at improving their proficiency in Russian.", "prerequisite": "RUS 401", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 420: Senior Seminar in Russian Culture", "department": "Russian (RUS)", "credits": "3 Credits", "description": "Senior seminar devoted to topics in Russian culture and conducted in Russian. Building on linguistic and cultural material covered in the second and third levels of study toward the Russian major, this course is designed to add depth and sophistication to the students' understanding of basic concepts in Russian culture and improve their ability to discuss and write about them in Russian. The course materials cover, selectively, the \"big themes\" and concepts of Russian culture, such as the legacy of Kievan Rus, the cultural/historical preconditions for the 'Third Rome' theory, the rift between the people and the upper classes following Peter the Great, Westernizers versus Slavophiles, the Bolshevik Revolution, the Stalinist terror, WWII, the Thaw, Stagnation, Perestroika, and Putinism. Study materials include texts from a wide variety of genres and reflect a diversity of linguistic styles. They may incorporate passages from the ancient chronicles, folk legends, memoirs and autobiographies, as well as selections from historical and literary texts and films. Major artistic movements are considered in their connection to the respective historic period and their reception today. Students will also engage in brief weekly current events presentations. Frequent quizzes, participation in discussions, presentations, and research projects will be essential means to explore the subject matter and assess the students¿ progress. Students must complete RUS 100, RUS 401, and RUS 402 or RUS 403 prior to RUS 420 or receive permission of the program.", "prerequisite": "RUS 100", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"course_name": "RUS 494: Research Project", "department": "Russian (RUS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 494H: Research Project", "department": "Russian (RUS)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"course_name": "RUS 496: Independent Studies", "department": "Russian (RUS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 497: Special Topics", "department": "Russian (RUS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"course_name": "RUS 499: Foreign Studies", "department": "Russian (RUS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]