[{"course_name": "SCIED 110: Introduction to Engineering for Educators", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "This course focuses on physics content, engineering design principles, and elementary science education pedagogy.", "other": ["Cross-listed with: ENGR 110"]}, {"course_name": "SCIED 112: Climate Science for Educators", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "Concepts of climate sciences highlighted by evidence-based explanations and scientific discourse in preparation for K-6 science teaching. This introductory, multidisciplinary course will focus on the interactions among physical science concepts, earth science concepts, and scientific practices to develop understandings about Earth's climate system. The course is primarily intended for prospective elementary school teachers (Childhood and Early Adolescent Education, PK-4 and 4-8 majors), although it is available to other non-science majors. The development of models is an integral part of the course as a means to facilitate climate systems thinking by serving as a means to explain phenomena and predict outcomes. In addition, students in the course consider how what they are learning applies to teaching by offering opportunities to think about how they might extend their knowledge to teaching contexts. This course consists of integrated lectures and laboratory investigations in class meetings each week, with work on collaborative projects outside of class.", "other": ["Cross-listed with: EARTH 112"]}, {"course_name": "SCIED 114: Sound and Light for Educators", "department": "Science Education (SCIED)", "credits": "4 Credits/Maximum of 4", "description": "Waves, sound, and light concepts highlighted by evidence-based explanations and scientific discourse in preparation for K-6 science teaching. This course has two main focus areas: physics content typically addressed in elementary science curriculum and effective pedagogy for supporting children's meaningful science learning. An introduction to waves is used to construct an initial model, which is applied to sound phenomena and elaborated. The more robust model is then applied to understanding light phenomena and again elaborated. As the model develops across units of instruction, students are engaged in constructing explanations from evidence, model-based reasoning, and scientific discourse. Instructional approaches that are grounded in research on children's learning are used to engage education majors in their own learning, while teaching applications provide opportunities for them to unpack their experiences and apply them to school science teaching.", "other": ["Cross-listed with: PHYS 114"]}, {"course_name": "SCIED 116: Introduction to Astronomy for Educators", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "This course is designed to engage students with the big ideas of astronomy in ways that will help them understand both the content of astronomy, as well as the practices of science as carried out by astronomers. The course is designed for prospective elementary and middle school teachers (PK-4 and 4-8 majors), although it is available to other non-science majors. Throughout the course, students engage in a series of investigations that lead towards the development of evidence-based explanations for patterns observed in the current Solar System. Investigations will include computer-based simulations, night-sky observations, and use of simple laboratory equipment. These investigations lead students towards an understanding of how observations of the current Solar System can be explained by the model of its formation. The course is designed to build from students' own personal observations of the day and night sky towards developing increasingly sophisticated explanations for those phenomena and beyond. Conducting these astronomy investigations will help students understand fundamental aspects of physics, thus broadly preparing them for future science teaching in these domains. The course models evidence-based pedagogy, thus helping to prepare students for future teaching careers as they learn effective strategies for teaching science.", "other": ["Cross-listed with: ASTRO 116"]}, {"course_name": "SCIED 118: Field Natural History for Teachers", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "The purpose of this course is to equip students with knowledge of central Pennsylvania flora and fauna, familiarize students with different techniques for teaching about natural history, and to engage students with citizen science efforts. This class uses lectures sparingly and is instead designed to be an experiential and hands-on class that will engage students with the natural world on campus and other local sites. Analyzing natural history-based educational programs and the pedagogical methods for teaching in both outdoor and indoor settings is a core component of this class, alongside participation with citizen science data collection efforts and dissemination of findings. The overall goal of this course is to familiarize students with the natural history and biodiversity of Pennsylvania and techniques for educating in, for, and about the outdoors. At the end of the course, students will be able to: (1) Analyze the importance of interrelationships between all living organisms and how this contributes to a healthy planet. (2) Identify common Pennsylvania flora and fauna. (3) Regard living things as teaching tools for science classrooms. (3) Evaluate methods for teaching about different natural history topics in both indoor and outdoor settings. (4) Demonstrate their natural history observations and understandings by contributing to a citizen science project."}, {"course_name": "SCIED 140: Outdoor School Field Experience", "department": "Science Education (SCIED)", "credits": "2 Credits/Maximum of 6", "description": "To provide students with educational leadership skills and teaching opportunities working with children in an outdoor residential camp setting. RPTM 140 Outdoor School Field Experience (2 per semester/maximum of 4) is cross listed as SCIED 140. The Outdoor School Field Experience course allows students to observe, learn, and apply leadership techniques and teaching methodologies in an experiential, residential education program that occurs off campus. This field-based experience provides students with numerous opportunities to practice and refine their leadership and teaching skills through active participation in one week of Outdoor School Field Experience. Students are provided with the opportunity to explore personal values related to the natural environment, sustainable practices, health and wellness and technology, and to practice behavioral changes as they role model those values to the residential campers.", "prerequisite": "Students must apply for and be accepted into the Outdoor School Field Experience.", "other": ["Cross-listed with: RPTM 140", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "SCIED 297: Special Topics", "department": "Science Education (SCIED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "SCIED 298: Special Topics", "department": "Science Education (SCIED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "SCIED 410: Using Technology to Enhance Science Teaching", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "This course explores contemporary practice and research associated with applications of technology to enhance science learning and teaching.", "prerequisite": "admission to one of the science teaching options in SECED"}, {"course_name": "SCIED 411W: Teaching Secondary Science I", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "Introduction to teaching secondary school science, including curriculum, learning theory, media, evaluation as they relate to student progress.  SCIED 411W Teaching Secondary Science I (3) Science Education 411W is an introduction to secondary science education. The course is a project based course for individuals planning to teach science in grades 7-12 and has a significant emphasis on professional writing. The course is also appropriate for those interested in teaching or in program development of out-of-school science learning environments (e.g., science centers, nature centers, museums). Students will participate in activities that are designed to help forge a 'philosophy of science teaching' that is supported by research based findings on 1) learning and assessing learning, 2) best practices for teaching, 3) images of science and scientific inquiry, and 4) the effective design of lessons and activities. There are several peer-teaching assignments where students teach each other and two student teaching assignments with middle school children from area schools. Students are expected to complete written reports and reflections on-type assignments for lesson plan reviews, curriculum assessments, science research reports, and clinical interviews. One of the major goals of SCIED 411 is to promote 'reflection in action' and 'reflection on action' among the students. These are two constructs put forth by Donald Schon that argues an important meta cognitive dynamic for teachers is to think about what they are doing while teaching (in action), and to also think about what they will do differently in future episodes of teaching (on action). On each occasion in 411 when students compete a peer teaching or clinic teaching experience they are requested to compete a 'reflection writing assignment'. Criteria for success on the writing assignments is 1) to provide an accurate description (which may include a lesson plan or references to the lesson plan) of the teaching; 2) to diagnose and identify the successes and the shortcomings of the lesson in terms of student learning; 3) to make connections to course readings that offer suggestions for adapting the lesson to promote learning. The reflection assignments are typically 2 to 3 single-spaced pages accompanied by the lesson plan. Across the semester, from the first 'reflection' assignment to the last 'reflection' assignment there is an expectation that the 411 students will demonstrate a increasing depth and sophistication of reflection, analysis and attention with respect to the construction of learning goals and instruction strategies that promote working with students prior knowledge, employing formative assessment tasks to make students' thinking visible, and using questions and strategies that frame a student-centered discourse learning environment. The course professor will grade the written assignments and provide written and oral feedback. Each assignment will be revised and posted to an on-line student portfolio. Written communication is important in the field of education and science. In this course, the importance of written communication as a means to learn and reflect on the subject matter of the science disciplines and on teaching is emphasized. The value of scientific reports, analysis of curricular materials, development and reflection on lesson plans, and statements regarding the student's philosophy of science teaching will be evident through written assignments, feedback, and revision. Through the experience of reading, discussion, development of lessons, and practice teaching, students will develop the ability to do the following: (a) Use appropriate techniques to probe students' prior knowledge and understandings of scientific concepts. Knowledge about students' alternative conceptions and intuitions is then used to design effective lesson plans and assessments. (b) Plan and teach science lessons employing sound research-based techniques for inquiry teaching. Students will complete both peer and student teaching assignments that are videotaped. (c) Prepare written reflections and evaluations that incorporate analytical perspectives that are based on personal experiences and on course readings and research-based frameworks and practices. Students will be offering written reflective comment on their own teaching and that of classmates. The course goals include the ability to develop a 'reflection in action' and 'reflection on action' decision-making orientation that is informed by evidence-based practices linked to student learning.", "prerequisite": "5th Semester standing or Graduate Status or Non Degree Graduate Status", "other": ["Writing Across the Curriculum"]}, {"course_name": "SCIED 412: Teaching Secondary Science II", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "SCIED 412 is the second of two sequenced methods courses for preservice science teachers who are pursuing certification to teach in grades 7-12. In SCIED 412, prospective science teachers learn to effectively plan, deliver, and assess science instruction. The course emphasizes contemporary theory and practice associated with science education in public school classroom settings. As in SCIED 411W, emphasis is placed on developing professional science teachers; this includes promoting development of the knowledge, skills, and dispositions that lead to reflective practice, collaborative action, and lifelong inquiry into teaching and learning. Students will develop an understanding of science learning theories and the approaches that diverse learners take to construct knowledge; develop competence in the use of science content and inquiry processes and materials for planning instruction relevant to learners' needs; develop skills in instructional, communicative, managerial, and evaluative strategies; and will demonstrate facility in selecting and integrating appropriate technological tools into instruction. Throughout the course, special attention is given to identifying and addressing the needs of diverse learners, including English Language Learners and students with special needs. Students also develop familiarity with state and national curriculum standards that guide science, technology, and engineering education; they also demonstrate the ability to plan and deliver lessons that address those standards. SCIED 412 is scheduled concurrently with a supervised field experience in a middle or secondary school, where students have the opportunity to apply and evaluate their developing instructional skills.", "prerequisite": "SCIED 411W"}, {"course_name": "SCIED 457: Environmental Science Education", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "Philosophy, techniques, and skills for teaching environmental science, including curriculum development, fieldwork, and the use of appropriate technologies. SCIED 457 Environmental Science Education (3)This course provides an introduction to teaching environmental science to children. Although our emphasis is school-based instruction in the middle and secondary sciences, the course is also appropriate for grade K-6 teachers and teachers of other environmentally related subjects (e.g., social studies, agriculture), as well as educators who plan to work in nonformal educational settings such as nature centers and museums. The course builds students' knowledge in the philosophy, methods, and skills of environmental education; engages students in environmental curriculum analysis and development; and provides hands-on training in classroom-based and field-based environmental investigations. Training and practice with appropriate environmental technologies is included.", "prerequisite": "6th Semester standing or Graduate Status or Non Degree Graduate Status"}, {"course_name": "SCIED 458: Teaching Science in the Elementary School", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "SCIED 458 is designed to support teacher candidates in developing their own reflective practice in science teaching for young learners. Candidates in this course engage in a series of experiences that move them from their own understanding of engagement in science, to understanding children's engagement in science, and finally towards methods of designing science instruction for young learners. Central to this work is a focus on reflective practice; expert teachers reflect on their own teaching practices. During this course, candidates learn to be critical of their own learning, instructional design, and teaching. Candidates use this to revise their practice as they grow as science teachers. The course activities, assignments, readings, and placement experiences offer multiple opportunities for candidates to learn essential knowledge and practices to support children,s curiosity about the world. Course assignments and in-class experiences are designed to help teacher candidates understand the importance of engaging their future students in a strongly integrated focus on science content and practice. This encompasses both how scientists work (the practice of doing science and building our knowledge of the world) and how children learn the skills and practices of doing science. Helping children understand the practices of science is of equal importance as helping them learn the content of science. To start understanding ways of supporting children in learning to do science in age-appropriate ways, teacher candidates in this course contrast their understanding and experiences with those of children. Assignments are designed to help facilitate exploration of the links between understanding children's prior knowledge and beliefs, using knowledge of how people learn, and making pedagogical choices to move children towards specific content and practice goals. Candidates consider the role of differentiated instruction and methods of assessment in science teaching. Finally, the course examines methods of adapting science curriculum using knowledge of children and specified learning goals. Teacher candidates bring together what they have learned about the practices of science, social constructivist instructional methods, and assessment to think critically about how to support elementary students learning science across time. SCIED 458 is a part of a block of courses in a PSU teacher education program that is unified by a basic set of principles and a field experience component.", "prerequisite": "4th Semester standing Recommended Preparations: One course each in life, earth, and physical sciences (one having a lab component)"}, {"course_name": "SCIED 458H: Teaching Science in the Elementary School", "department": "Science Education (SCIED)", "credits": "3 Credits", "description": "Interpreting children's science experiences and guiding development of their scientific concepts; a briefing of science content material and its use.", "other": ["Honors"]}, {"course_name": "SCIED 460: Trends and Issues in Science, Technology, Engineering, and Mathematics (STEM) Education", "department": "Science Education (SCIED)", "credits": "3 Credits/Maximum of 3", "description": "Develops understandings of Science, Technology, Engineering, and Mathematics (STEM) education research and practices for PreK-12 teaching and learning", "prerequisite": "7th Semester Standing", "other": ["Cross-listed with: MTHED 460"]}, {"course_name": "SCIED 496: Independent Studies", "department": "Science Education (SCIED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "SCIED 496A: **SPECIAL TOPICS**", "department": "Science Education (SCIED)", "credits": "1.5 Credits/Maximum of 18"}, {"course_name": "SCIED 496H: Honors in Science Education", "department": "Science Education (SCIED)", "credits": "1-12 Credits/Maximum of 12", "description": "Independent studies course.", "other": ["Honors"]}, {"course_name": "SCIED 497: Special Topics", "department": "Science Education (SCIED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "SCIED 498: Special Topics", "department": "Science Education (SCIED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]