[{"course_name": "SPLED 99: Foreign Studies", "department": "Special Education (SPLED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "SPLED 199: Foreign Studies", "department": "Special Education (SPLED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "SPLED 297: Special Topics", "department": "Special Education (SPLED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "SPLED 299: Foreign Studies", "department": "Special Education (SPLED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "SPLED 395W: Observing Special Education Settings Spanning Across School Transitions", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Observation of Special Education Settings and Transitions through the Systems provides students with an opportunity to (a) observe exceptional individuals in a supervised setting, (b) become familiar with methods of observation, (c) use methods of writing for other professionals using descriptive summaries and graphic displays of data, (d) discuss transitions and what they look like in various settings, and (e) learn about the high-leverage practices used in effective teaching. This course provides a broad exploration of the various settings and elements that encompass special education. It allows for direct observation into today's schools to investigate trends in education. It considers how cultural perspectives can impact teaching. Building on these insights, students will work on professional writing across multiple contexts. Students will have opportunities to collaborate with each other to develop professional relationships.", "prerequisite": "SPLED 401", "other": ["Writing Across the Curriculum"]}, {"course_name": "SPLED 397: Special Topics", "department": "Special Education (SPLED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "SPLED 399: Foreign Studies", "department": "Special Education (SPLED)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "SPLED 400: Inclusive Special Ed Foundations: Legal, Characteristics, Collaboration, Assessment, and Management", "department": "Special Education (SPLED)", "credits": "4 Credits", "description": "Legal issues, learner characteristics, collaboration skills, assessment, and behavior management related to educating students with disability in inclusive settings.  SPLED 400 Teaching Exceptional Students in General Education Settings (4)This course is delivered via a model of blended instruction and addresses foundational skills (assessment and management) and knowledge (laws, etiologies, collaboration) for those working with students with special education needs in general education classrooms. Almost 30% of the content includes student understanding of the history and current relevance of special education law; roles and responsibilities of general education teachers in providing services to students with special education needs; characteristics and etiologies relevant to providing effective instruction to students with mild and severe disabilities; and developing and maintaining effective education teams. Roughly 35% of content is relevant to assessment in inclusive settings and is centered on sound instructional decision making as well as linking instruction to standards based curricula. Coverage includes understanding formative and summative assessment; creating and administering curriculum-based assessments in reading, mathematics, and writing; designing systems to collect behavioral data; interpreting a variety of norm-referenced test scores; using brief experimental analyses is adequate for a given purpose. Roughly 35% of content is relevant to applying principles of Applied Behavior Analysis (ABA) to managing and motivating learners with special needs placed in inclusive settings. Broad objectives include student acquisition of knowledge and skills related to ABA principles and interventions such as: identifying the nature (positive and negative) of consequences maintaining or decreasing specific behaviors; operationally defining behavior; establishing a classroom and school environment conducive to learning for all students; creating class-wide, school-wide; and individual motivation systems; intervening to decrease specific behavior; and using functional behavioral assessments (FBAs) and positive behavior supports.", "prerequisite": "HDFS 229"}, {"course_name": "SPLED 400H: Inclusive Special Ed Foundations: Legal, Characteristics, Collaboration, Assessment, and Management", "department": "Special Education (SPLED)", "credits": "4 Credits/Maximum of 4", "description": "Legal issues, learner characteristics, collaboration skills, assessment, and behavior management related to educating students with disability in inclusive settings. SPLED 400 Teaching Exceptional Students in General Education Settings (4) This course is delivered via a model of blended instruction and addresses foundational skills (assessment and management) and knowledge (laws, etiologies, collaboration) for those working with students with special education needs in general education classrooms. Almost 30% of the content includes student understanding of the history and current relevance of special education law; roles and responsibilities of general education teachers in providing services to students with special education needs; characteristics and etiologies relevant to providing effective instruction to students with mild and severe disabilities; and developing and maintaining effective education teams. Roughly, 35% of the content is relevant to assessment in inclusive settings and is centered on sound instructional decision making as well as linking instruction to standards based curricula. Coverage includes understanding formative and summative assessment; creating and administering curriculum-based assessments in reading, mathematics, and writing; designing systems to collect behavioral data; interpreting a variety of norm-referenced test scores; using brief experimental analyses is adequate for a given purpose. Roughly 35% of content is relevant to applying principles of Applied Behavior Analysis (ABA) to managing and motivating learners with special needs placed in inclusive settings. Broad objectives include student acquisition of knowledge and skills related to ABA principles and interventions such as: identifying the nature (positive and negative) of consequences maintaining or decreasing specific behaviors; operationally defining behavior; establishing a classroom and school environment conducive to learning for all students; creating class-wide, school-wide; and individual motivation systems; intervening to decrease specific behavior; and using functional behavioral assessments (FBAs) and positive behavior supports.", "prerequisite": "EDPSY 14", "other": ["Honors"]}, {"course_name": "SPLED 401: Motivating Exceptional Learners", "department": "Special Education (SPLED)", "credits": "4 Credits", "description": "Group and individual techniques to promote student task engagement and prosocial behavior.", "prerequisite": "SPLED 395W"}, {"course_name": "SPLED 402: Human Rights:  Historical and Current Issues in Special Education", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Litigation, legislation, regulation, and advocacy issues impacting on educational and related services for individuals with academic and/or physical disabilities.", "prerequisite": "or concurrent: SPLED400 or SPLED425"}, {"course_name": "SPLED 403A: Evidence-Based Instruction for Elementary Students with Disabilities in    Reading, Math, and Writin", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Evidence-based methods for design, delivery, and adaption of instruction for elementary students with disabilities in reading, mathematics, and writing.  SPLED 403A Evidence-Based Instruction for Elementary Students with Disabilities in Reading, Math, and Writing (3)This course is delivered via a model of blended instruction and addresses aspects of designing, delivering, and adapting instruction for students across the range of disability (i.e., mild, moderate, and severe) in elementary, inclusive settings. Content on relevant learner characteristics of special needs students is found throughout the course. About half the course covers content on: designing direct and explicit instruction; self-regulated learning; assistive technology; adaptations and accommodation for learners with several disabilities; and the hierarchy of taxonomical units relative to instructional design. The remaining half of the course covers content relevant to a wide range of literacy concerns and includes: evidence based practices for instruction in early reading (e.g. decoding, phonemic awareness, phonic and structural analysis; and vocabulary); reading comprehension at primary and intermediate levels (e.g. test structure, content specific vocabulary, and narrative and expository reading in content domains); writing (e.g. handwriting, spelling grammar, and written expression); and mathematics (e.g. number sense and early numeracy, basic facts and operations, applied skills, problem solving, factions, decimals, and percents).", "prerequisite": "SPLED 400"}, {"course_name": "SPLED 403B: Evidence-Based Methods for Teaching Secondary Students with Disabilities   in Inclusive Settings", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Evidence-based methods for designing, delivering, and adapting instruction for students with disabilites in inclusive secondary education settings.  SPLED 403B Evidence-Based Methods for Teaching Secondary Students with Disabilities in Inclusive Settings (3)This course is delivered via a model of blended instruction and addresses aspects of designing, delivering, and adapting instruction for students across the range of disability (i.e., mild, moderate, and severe) in secondary inclusive settings. Content on relevant learner characteristics of special needs students is found throughout the course. About half the course covers content on: designing direct and explicit instruction; self-regulated learning; assistive technology; adaptations and accommodation for learners with several disabilities; and the hierarchy of taxonomical units relative to instructional design. The remaining half of the course covers content relevant to a variety of procedures and approaches to help students with special education needs gain meaningful access to secondary curriculum content without watering it down or ignoring the instructional needs of students without disabilities. Broadly this content includes ways of planning and delivering instruction to help all students, including those with learning problems, understand and retain critical course content. Topics include using graphic organizers, options for presenting content, mnemonics; task specific learning strategies; cooperative groups and peer focused interventions; study guides and guided notes; advance organizers; text structures for narrative and expository text; single and multiple-approaches for reading comprehension; writing mechanics, prompts, and rubrics; narrative, informative, and persuasive writing; problem solving (including Polya's model); analogies; elaborative interrogation; and practice for problem solving.", "prerequisite": "SPLED 400"}, {"course_name": "SPLED 403H: Evidence-Based Instruction for Elementary Students with Disabilities in    Reading, Math, and Writin", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Evidence-based methods for design, delivery, and adaption of instruction for elementary students with disabilities in reading, mathematics, and writing.", "other": ["Honors"]}, {"course_name": "SPLED 404: Working with Families and Professionals in Special Education", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Strategies for productive interactions between special educators and others such as colleagues, employers, parents, service providers, professionals, and students.", "prerequisite": "SPLED 418"}, {"course_name": "SPLED 408: Meeting Instructional Needs of English Language Learners with Special Needs", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "A major objective of this course is for students to be able to develop or modify instructional plans that reflect evidence based practices for adapting for the needs of English Language Learners (ELL) with special needs. The course has been developed to fulfill Pennsylvania Department of Education requirements and in recognition of the growing number of ELLs in the general population and thus, in special education settings. This course covers (1) theory and research on the instructional needs of ELLs and (2) the knowledge base on effective instruction for students with special needs and assists students in bringing these two areas of research together. Major topic areas include principles and issues in second language acquisition; ELLs characteristics including linguistic and cultural factors that affect second language acquisition; techniques and methods of research-based instruction for ELLs with special needs; lesson planning and instructional modifications for ELLs with special needs; and appropriate assessment practices for ELLs with special needs.", "prerequisite": "EDPSY 14", "other": ["Cross-listed with: EDPSY 408"]}, {"course_name": "SPLED 409A: Fundamental Literacy Skills for Students with Special Needs", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Effective reading curriculum and teaching methods to teach students with special needs. SPLED 409A Fundamental Literacy Skills for Students with Special Needs (3) Effective classroom-based assessment, curriculum development, and instructional strategies for teaching reading to educate students with special needs will be described in this course. Students will learn how to assess, develop curriculum, and provide scientifically based explicit instruction in reading to K-12 students with special needs. Students will learn how to select reading skills necessary to scaffold and enhance students' present reading skills. Methods for using science-based assessment strategies and developing foundational reading skills within a classroom context will be described. This course builds on prerequisite Special Education courses in curriculum and instructional methods. Students in SPLED 409A extend knowledge of explicit instructional strategies in the context of reading. The content offered in this course complements 409B and 409C through the integration of researched-based methods and sound instructional design within a curriculum to most effectively teach students with special needs.", "prerequisite": "SPLED 404"}, {"course_name": "SPLED 409B: Writing and Content Literacy for Students with Special Needs", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Effective curriculum and materials for teaching writing and content literacy to students with special needs.  SPLED 409B Writing and Content Literacy for Students with Special Needs (3) Effective application of classroom-based measurement, curriculum development, and instructional strategies for teaching writing and content literacy to educate students with special needs will be described in this course. Students will learn how to use assessment to develop curriculum and provide scientifically based best practice instruction in writing mechanics (handwriting, spelling, capitalization & punctuation) and written expression (pre-planning to revision) to K-12 students with special needs. Students will learn how to identify, select, and teach content text structure. Methods for using assessment to develop a reading comprehension curriculum within a content classroom context and teach K-12 students with special needs to read and comprehend narrative and expository text (such as text found in Math, Science, Social Studies, and other content textbooks) will be described. Methods for using assessment to develop curriculum and teach K-12 students with special needs to respond to content text and materials through writing will also be examined.This course builds on prerequisite Special Education courses in curriculum and instructional methods. Students in SPLED 409B will have achieved mastery in basic reading theory, assessment, curriculum, and instructional methods. The content offered in this course adds to the existing course content by specifically addressing writing mechanics, written expression, and content reading, curriculum development, and instructional methods (including plans for generalization and maintenance) for students with special needs.Written responses for assigned readings will be required for each topic area. Written evaluations and class assignments (including case studies) will be given to assess student learning throughout the course time period. Students' learning will be further evaluated through projects that demonstrate understandings of applying classroom-based measurement, curriculum development, and the instructional methods required to effectively teach writing and content learning to students with special needs. Student applied projects, in coordination with practicum placement, for writing instruction will include: (1) the collection of baseline writing data for a student with special needs, (2) development of a curriculum scope and sequence, (3) development of a research validated instructional intervention, (4) implementation of the intervention, (5) the collection of writing data throughout instruction and after instruction, and (6) development and implementation of an instructional plan for maintenance and generalization. To demonstrate understandings of teaching content reading and writing, students will prepare a presentation of an identified research-based content reading or writing instructional strategy or approach taught within a curriculum scope and sequence.", "prerequisite": "SPLED 404"}, {"course_name": "SPLED 409C: Mathematics Instruction for Students with Special Needs", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Research-based practices for teaching mathematics skills to students with special needs. SPLED 409C Mathematics Instruction for Students with Special Needs (3) Research-based assessment, instruction, and intervention strategies for teaching mathematics skills to struggling students, students with learning disabilities, and chronically low performing students will be described in this course. Students will identify (a) the risk factors associated with mathematics disabilities, (b) effective prevention and remediation models of mathematics disabilities, (c) characteristics of scientifically based instruction in content-area skills (e.g., counting, addition, fractions, problem solving, geometry, algebra) for K-12 students with disabilities, and (d) how to effectively provide and assess the effects of such instruction while provided in general and special education classrooms. This course builds on prerequisite Special Education courses in curriculum and instructional methods. Students in SPLED 409C will have achieved mastery in assessment, curriculum, and instructional methods. The content offered in this course adds to the existing course content by specifically addressing how to teach content-area skills for students with special needs. Written responses and/or online discussion board posts for assigned readings will be required for the topic areas. Written evaluations, online quizzes, and class assignments will be given to assess student learning throughout the course time period. Students learning will be further evaluated through projects that demonstrate understanding of classroom-based assessment, curriculum development, and the instructional methods required to effectively teach content-area mathematics skills to students with special needs. Student applied projects, in coordination with practicum placement, for mathematics instruction will include: (1) the collection of baseline mathematics performance data for a student with special needs, (2) development of a curriculum scope and sequence, (3) development of a research validated instructional intervention, (4) implementation of the intervention, (5) on-going data collection throughout instruction and after instruction, and (6) development and implementation of an instructional plan for maintenance and generalization. To demonstrate understandings of teaching content area mathematics skills, students will prepare a lesson on a math concept for a teaching demonstration using the instructional strategies and techniques learned during the class.", "prerequisite": "SPLED 404"}, {"course_name": "SPLED 410: Culturally Responsive Pedagogy in Special Education", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Culturally Responsive Pedagogy (CRP) in Special Education is designed to help students recognize and appreciate diversity in the classroom specifically related to students with exceptionalities. This course will develop ways to encourage student engagement by creating supportive and inclusive classrooms where all students feel they belong. The student learning outcomes are engaging and include elements of active learning. Broadly, the overarching elements of the course will focus on (1) enhanced cognitive development and understanding of concepts and vocabulary related to CRP, (2) develop social and cultural connections with students and families, and (3) support student engagement and retention using cultural reciprocity and understanding.", "prerequisite": "CI 280"}, {"course_name": "SPLED 411: Intervention for Students with Severe Disabilities", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Assessment, teaching strategies, curricula, materials, and assistive techniques for use with individuals having severe disabilities.", "prerequisite": "SPLED 418"}, {"course_name": "SPLED 412: Instruction for Students with Mild Disabilities", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "The purpose of SPLED 412 is to introduce appropriate methodology for teaching academic skills to students with learning disabilities or those students who experience academic difficulties. The majority of the course deals with effective practices for designing and delivering academic instruction and independent work for students who do not learn optimally under current conditions within the general education environment. In this course, pre-service teachers will learn about the principles of effective instruction and a teaching model that applies these principles using evidence-based instructional methods to support these students. This course will also address ways that this model can be flexibly adapted to meet the needs a wide range of students, tasks, and environments.", "prerequisite": "SPLED 395W"}, {"course_name": "SPLED 415: Early Intervention and Early Childhood Special Education (EI/ECSE)", "department": "Special Education (SPLED)", "credits": "3 Credits/Maximum of 4", "description": "This course provides an introduction to Early Intervention/Early Childhood Special Education (EI/ECSE). Students will discuss the historical contexts and origins of early childhood special education affecting children with developmental delays and disabilities. Students will identify the prevalence of developmental delays and disabilities and the importance of early intervention for cognitive, physical, behavioral, and social-emotional developmental trajectories. Students will investigate family-systems theory, family-centered approaches, and family-professional partnerships as well as culturally sustaining practices in EI/ECSE. Issues of racial, cultural, and linguistic diversity will be emphasized. Building on these ideas, this course will address issues of diversity and equitable access to quality services to ensure all children thrive in their natural educational environment. Students will preview and practice conducting common screenings and assessments for infancy, toddlerhood, and early childhood. Students will learn how to choose appropriate instructional strategies, practice applying them, and discuss how to implement strategies to foster an inclusive environment and culture in home, community, and school settings.", "prerequisite": "Admission to SPLED program or at least a 4th semester standing for non-SPLED majors."}, {"course_name": "SPLED 418: Technologies for Persons with Disabilities", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "This course will teach students the role of the special education teacher in supporting the use of assistive technology (AT) by individuals with disabilities in school and community settings. Students will learn the role of the special education teacher in the AT process, including (as appropriate) how to identify student AT needs, obtain information on common AT applications and devices, make first-hand use of current AT solutions, and evaluate the use of AT to address specific student needs. Students will also learn the legal responsibilities of the special education teacher in the AT procurement and implementation process. Particular attention will be given to the use of AT to assist students with disabilities in reading, writing, math, communication, and the development of social skills. Students will learn the role and responsibilities of the special education teacher on the AT team, as well as the roles and responsibilities of the other licensed professionals on the AT team. Special attention will be given to the acquisition of strategies to engage and support the participation of family members in acquiring and implementing AT interventions. Students will also be provided with resources and strategies for making use of state and national information resources and services related to AT.", "prerequisite": "SPLED 395W"}, {"course_name": "SPLED 419: Assistive Technology for General Education Teachers", "department": "Special Education (SPLED)", "credits": "2-3 Credits", "description": "Strategies to support use of assistive technologies by students with disabilities in general education classrooms.  SPLED 419 Assistive Technology for General Education Teachers (2-3) This course will teach students the role of the general education teacher in supporting the use of assistive technology (AT) by students with disabilities in general education classrooms. Students will learn the role of the general education teacher in the AT process, including (as appropriate) how to identify student AT needs, obtain information on common AT applications and devices, make first-hand use of current AT solutions, and evaluate the use of AT to address specific student needs. Particular attention will be given to the use of AT to assist students with disabilities in reading, writing, math, communication, and the development of social skills. Students will learn the role and responsibilities of the general education teacher on the AT team, as well as issues of \"scope of practice\", and the roles and responsibilities of the other licensed professionals on the AT team. Students will also be provided with resources and strategies for making use of state and national information resources and services related to AT.", "prerequisite": "EDPSY 10"}, {"course_name": "SPLED 420: Culture & Disability: Study Abroad in Ireland", "department": "Special Education (SPLED)", "credits": "6 Credits", "description": "Study aspects of culture and disability through lecture, visiting Irish disability service agencies, and guest speakers from various disability agencies. This course is designed to increase student awareness of disability from a cross-cultural comparison between the United States and Ireland including: personal, interpersonal, and societal aspects of disability, including how disability can be defined and understood differently in varied individual, institutional and cultural contexts. Students will learn models of disability that will help (a) clearly distinguish different ways of conceptualizing disability and (b) critically think about how disability is represented and understood in varied cultural contexts. Students will examine ethical, economic, and social implications of disability. Dynamics of group, family and individual behavior that impact interactions between people, with and without disabilities, will be addressed. Interactions and assignments will aid in the introduction of students to interpersonal communication and interaction issues among international cultures. A strong emphasis will be placed on understanding disability from a variety of cultural perspectives and assessing the impact of racial, ethnic, gender, socioeconomic, and socio-political factors on disability status. Throughout the course students will engage with various service providing agencies (which may include sensory disabilities, intellectual/cognitive disabilities, and physical disabilities). Class time will be allotted to prepare for engagement and reflection as well as providing background information for understanding global policy and how to make comparisons. Students will participate in a culminating activity, such as attending the International Disability Summer School that equips students with the insights and skills necessary to translate the generalities of international positions on disabilities into tangible reform for persons with disabilities and understand disability from a global perspective. This course meets the requirement for RHS 100 (RHS majors and RHS minors and honors students), and/or up to 6 credits toward 400 level elective requirements for RHS minors. SPLED students can earn up to 6 credits towards the SPLED minor", "other": ["Cross-listed with: RHS 420", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "SPLED 425: Foundations of Special Education, Etiologies, Law, and Implications for Practice", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "This course provides an introduction to all exceptionalities included in special education programs as delineated by the most recent Federal legislation guiding service for individuals with special needs. An important component of this course is the exploration of typical developmental stages and milestones used to monitor children's growth and progress over time. Students will learn about the different types of disabilities as categorized by Federal regulations. In addition, recent legislation is explored in relation to services provided, funding requirements, accommodations and classroom placement. This course provides future educators with a solid foundation for an understanding of disabilities, services, and legislation as they enter into the special education profession. In addition, this course will prepare students to (a) address common misconceptions and myths associated with special education, (b) work with interdisciplinary teams in the formation of Individualized Education Programs (IEP), and (c) promote the preparation of exceptional individuals to assume adult roles.", "prerequisite": "SPLED 395W"}, {"course_name": "SPLED 430: Foundational Skills for Working with Students with Special Education Needs in General Education Clas", "department": "Special Education (SPLED)", "credits": "1 Credits", "description": "Introduction to working with students with special education needs in the general education classroom, including history and legal foundation.", "prerequisite": "teacher certification or permission of instructor"}, {"course_name": "SPLED 454: Assessment for Instruction", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Students enrolled in this course will gain knowledge related to research, theory, and practice of assessing learners with special needs across various education settings. After enrolling in this course, students will be able to describe and employ research findings and theory in the areas of (1) history and legal foundations of assessment in special education, (2) instructional decision making, (3) the technical adequacy and interpretation of norm-referenced tests, (4) the display and interpretation of data, (5) progress monitoring across content areas, and (6) assessing learners with severe needs.", "prerequisite": "SPLED 395W"}, {"course_name": "SPLED 461: Introduction to Autism Spectrum Disorders: Issues and Concerns", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Overview of issues, characteristics, and evidenced-based assessment strategies, and approaches for individuals with autism/PDD.  SPLED 461 Introduction to Autism Spectrum Disorders: Issues and Concerns (3) This course will center on working with individuals having Autism Spectrum Disorders (ASD) and Pervasive Developmental Disorders (PDD) in educational and related settings. Topics include an overview of characteristics and diagnosis, ethical issues in treatment, assessment, the use of science in treatment approaches, working effectively with families, and strategies for successful inclusion of students with ASD/PDD in integrated settings. Course content will be delivered through DVD lectures, and required as well as supplemental readings. Evaluation procedures will include on line multiple-choice exams. The course will be changed to assess students through 6 (v.4) online multiple choice exams. Multiple choice format offers immediate feedback to students. To ensure assessment of applications skills, exams will include case studies in which students must apply skills to areas such as child assessment, data analysis, and strategies for working effectively with parents.", "prerequisite": "4th semester standing"}, {"course_name": "SPLED 462: Autism and Applied Behavior Analysis", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "This course addresses principles of applied behavior analysis and empiricism related to instruction and special issues affecting individuals with autism.  SPLED 462 Autism and Applied Behavior Analysis (3) This world campus course will include an overview of basic principles of applied behavior analysis (ABA) and elements of empiricism and ethics in educational settings. Course objectives will center on acquisition of content related to: a) principles of ABA instruction; b) ethical standards in education; c) best practice interventions for learning; d) strategies for diagnosing and programming for behavioral issues; e) special issues affecting individuals with ASD and their families. Course content will be delivered through DVD lectures, and required as well as supplemental readings. Evaluation procedures will include on line multiple-choice exams, and on line assignments.", "prerequisite": "5th Semester Standing"}, {"course_name": "SPLED 463: Communication and Social Competence", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Overview of deficits and strategies in speech, language, and communication across the Autism Spectrum Disorder.  SPLED 463 Communication and Social Competence (3)Communication and Social Competence is the third course in the 5 course (12 credit) series leading to the Professional Development Certificate in Autism. All information, activities, and assignments are through videotaped and web-based learning. Content includes an overview of the deficits in the area of speech, language, and communication across the Autism Spectrum Disorders (ASD). Basic information on the nature of these deficits is provided from both a psycholinguistic model as well as a behavioral model. In addition to information on deficits, the majority of the course content will provide practical information related to intervention.", "prerequisite": "5th Semester Standing"}, {"course_name": "SPLED 464: Assessment and Curriculum", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Overview of screening, diagnosis, and identification of skills in developmental domains and curricula for individuals with autism.  SPLED 464 Assessment and Curriculum (3)Assessment and Curricula is the fourth course in the 5 course (12 credit) series leading to the Professional Development Certificate in Autism. All information, activities, and assignments are through videotape and web-based learning. Content includes types of assessment and identification of skills in developmental domains. Practical strategies will be outlined.", "prerequisite": "5th Semester Standing"}, {"course_name": "SPLED 495: **SPECIAL TOPICS**", "department": "Special Education (SPLED)", "credits": "3-15 Credits/Maximum of 15"}, {"course_name": "SPLED 495D: Professional Development for Special Education Teacher Candidates", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "As a new professional in the school, special educators must embrace the school and community to provide a welcoming, safe and equitable environment for all children. In this professional development course, special education teacher candidates will learn, interact and reflect on the teaching, leading, and advocacy skills needed to be effective in the classroom and beyond. Special educators play a key role in education of all students. Students will learn about the ways in which their career may look after graduation. In preparation, the criteria on which teacher candidates are evaluated, the interview process, and effective communication skills will be discussed. Special educators must collaborate with professionals in the school and community as well as family and caregivers of students to develop an effective individualized education program for each student. The course will cover the process of assessment, planning of lessons and interventions, as well as data collection and analysis for data-based decision making. Along with effective instruction and leadership, teacher candidates will learn to advocate for all learners on their caseload, and others during this course.", "prerequisite": "SPLED 409A"}, {"course_name": "SPLED 495E: Experience with Exceptional Children", "department": "Special Education (SPLED)", "credits": "3 Credits", "description": "Supervised and guided field experience in a variety of possible settings (e.g. schools, day care centers, vocational settings) where students will practice lesson design, deliver instruction, and develop appropriate instructional activities, while implementing behavior management.", "prerequisite": "SPLED 395W"}, {"course_name": "SPLED 495F: Practicum in Special Education", "department": "Special Education (SPLED)", "credits": "12 Credits", "description": "The student teaching experience is a culmination of previous coursework. As new teachers, graduates will enter classrooms prepared to meet the individualized academic and social needs of students. The student will be expected to plan and create a welcoming, equity minded environment for all students. The student will be expected to demonstrate appropriate assessment strategies for both formative and summative evaluation. The student will also be expected to develop appropriate lesson plans based on the Individualized Education Program (IEP) and state standards. Students will implement plans using the explicit instructional strategies and demonstrate good management strategies to enhance learning and decrease off task behavior. Students are expected to demonstrate appropriate interpersonal communication skills, as well as dependability regarding professional responsibilities", "prerequisite": "SPLED 409A"}, {"course_name": "SPLED 495G: Experience with an Integrated Inclusion Classroom", "department": "Special Education (SPLED)", "credits": "3-4 Credits/Maximum of 4", "description": "Supervised teaching in integrated general classrooms with activities in curriculum- based assessment, data-driven intervention, direct instruction with students in need."}, {"course_name": "SPLED 496: Independent Studies", "department": "Special Education (SPLED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "SPLED 497: Special Topics", "department": "Special Education (SPLED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]