[{"course_name": "SUST 150N: The Science of Sustainable Development", "department": "Sustainability (SUST)", "credits": "3 Credits", "description": "This course will focus on how human society depends on the environment for its continued existence. It will examine several major topics relating to environmental and social sustainability including ecosystem conservation, sustainability of food systems with special reference to the water-food-energy nexus, and current and future trends in urbanization. Within each of these topics, students will learn fundamental scientific principles and use this information to gain a better understanding of what human behaviors have led to our current resource production and consumption crisis. This class will explore ways people can modify behavior to relieve poverty in developing nations and meeting basic human needs while still affording economic growth, environmental protection, and social equality to all peoples around the world.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "SUST 200: Foundations of Leadership in Sustainability", "department": "Sustainability (SUST)", "credits": "3 Credits", "description": "SUST 200 will teach the fundamental concepts of social, environmental, and economic sustainability and the interrelationships between these metrics and human behavior. The goal of this course is to provide students with a foundation in sustainability literacy and responsibility that will facilitate their development as global citizens and sustainability leaders in their respective fields and personal lives. The course will be an introduction to and foundation for the Sustainability Leadership Minor. Primary subjects covered include sustainability literacy, the ethical foundations of sustainability, the scientific metrics used to evaluate the sustainability of systems, energy literacy, sustainable business principles, and self-awareness. The course will emphasize the importance of understanding the relationships among these topics, and the interdisciplinary approaches needed to develop a comprehensive and integrative view of the world. Class activities will focus on the cultivation of communication, critical thinking, inquiry, and problem-solving skills. Emphases will be on student engagement in personal, community, and global sustainability challenges, and the preparation of students for more immersive sustainability learning opportunities.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "SUST 242N: Issues in Sustainability", "department": "Sustainability (SUST)", "credits": "3 Credits", "description": "This course is part of the General Education Integrative Studies curriculum. As such, it combines Humanites (GH) and Social and Behavioral Sciences (GS) through the topic of sustainability. Students will read, write, and think integratively by considering the humanistic values of sustainability and how those values are connected to the political, social, and cultural forces that shape sustainable activities. The course examines the concepts and key issues of sustainability through a variety of literary, scientific, political, and popular texts. Class discussions will trace the roots of sustainability in environmental writing, will analyze the diverse debates surrounding sustainability, and will consider local, national, and international texts about sustainability. Students will interact with invited guest speakers, conduct field research on sustainability in local communities and institutions, and create their own narratives and scenarios for sustainable futures based on their findings and speculations. The course will address central issues of sustainability in society today, including: - What are the historical and cultural foundations of sustainability? - How is sustainability a political, social, and ethical issue? - How do crises and disasters create challenges for sustainability? - How is sustainability connected to local, urban, and transnational environments? The goal of the course is to develop two types of awareness. First, students will develop an awareness of the key discussions about sustainability in society today. Second, students will cultivate a critical awareness of how debates about sustainability are shaped through the written and spoken word. Sustainability is more than just protecting the great outdoors or using a recycling bin. It is also a product of the discourse surrounding it. In other words, sustainability-and what we think, say, and do concerning it-is influenced by what other groups and individuals have written or said about it. Sustainability debates are shaped by more than simply \"the facts\" surrounding environmental issues; they are also shaped by the persuasive tactics and rhetorical choices writers and speakers make. Students will spend the semester analyzing, discussing, and creating texts that engage the key issues and most important topics of sustainability and environmentalism.", "prerequisite": "ENGL 15", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "SUST 295: Internship", "department": "Sustainability (SUST)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised off-campus, non-group instruction including individual field experience, practicums, or internships. Written and oral critique of activity required.", "prerequisite": "SUST 200"}, {"course_name": "SUST 325N: Health and Environmental Sustainability", "department": "Sustainability (SUST)", "credits": "3 Credits", "description": "NURS / SUST 325N: Health in Environmental Sustainability; 3 credits. (Inter-Domain), (GHW), (GN). People live in constant contact with the environment: the built environment of homes, offices, and industrial facilities, as well as in cities or less developed areas such as farms or in nature / the outdoors. How do the air we breathe, the water we drink, the land we live on, the food we eat, and the materials and chemicals we use in these environments impact our health? At a time when nations are spending up to 1/6th of their budgets on healthcare, it is critical to understand how we impact the environment and how it impacts us back. This course covers the importance of environmental health on individual and community health, the effects of environmental hazards on diverse populations and the impact of climate change on disease. It also reviews best practices for environmental health, for building healthy communities, and introduces students to environmental health advocacy. A beneficial environment sustains human health and the well-being of all species on the planet.", "other": ["General Education: Health and Wellness (GHW)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "SUST 495: Internship", "department": "Sustainability (SUST)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised off-campus, non-group instruction including individual field experience, practicums, or internships. Written and oral critique of activity required.", "prerequisite": "SUST 200"}, {"course_name": "SUST 496: Special Topics", "department": "Sustainability (SUST)", "credits": "1-6 Credits/Maximum of 6", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "prerequisite": "SUST 200"}]