[{"course_name": "THEA 1S: First-Year Seminar: Theatre Production Practices", "department": "Theatre (THEA)", "credits": "1 Credits", "description": "An orientation to the School of Theatre production practices, resources, faculty, and practicum.  THEA 001S First-Year Seminar: Theatre Production Practices (1)(BA) This course meets the Bachelor of Arts degree requirements. THEA 001S will serve as the First-Year Seminar for all undergraduate majors in the School of Theatre. In all School of Theatre degree programs, backstage production is one of the primary curricular and experiential areas held in common. It is in this area that most theatre students gain their first practical experience in producing theatre on our stages. This course will provide the necessary training and experience for all students to safely practice in the production of live theatre in our spaces.This course will orient first-year students to faculty, facilities, and practices of production utilized in the School of Theatre season. Students will be introduced to the faculty and their areas of expertise. They will be oriented to the spaces and equipment in our theatres and taught safe operation of the equipment. They will learn the practical and professional expectations placed on students participating in a School of Theatre production. Learning will take place both in lecture/demonstration format and through the practical experience of working on a School of Theatre production.Students will be evaluated by: 1. Backstage practices and safety will be evaluated through knowledge based quizzes and/or skill demonstrations as appropriate to each subject. 2. Professionalism evaluated through attendance, reliability and skill growth as observed during the execution of practicum assignments.", "other": ["Bachelor of Arts: Arts", "First-Year Seminar"]}, {"course_name": "THEA 80: Pit Orchestra", "department": "Theatre (THEA)", "credits": "1-3 Credits/Maximum of 3", "description": "Rehearsal and performance of contemporary and historical musical theatre styles, including operetta and light opera.  THEA 080 Pit Orchestra (1-3 per semester/maximum of 3) (GA) (BA) This course meets the Bachelor of Arts degree requirements.THEA 080 provides an introduction to the particular demands of the orchestral pit player, with an emphasis on the musical theater repertoire. The course objectives is to prepare the student for a professional theatre engagement. This course parallels the orchestra ensembles in the School of Music (Philharmonia, Chamber Orchestra) but with the added techniques of theatre orchestra: standard vamps, 'vocal last time' vamps, fade on cue, cut on cue, etc. Grades are determined by (1) level of performance and improvement, and (2) attendance at all rehearsals, sectionals and performances. The special facilities for this course will include orchestral rehearsal space in the School of Music, as well as the Pit/Performance space in the School of Theatre. Enrollment will vary depending on the needs of individual musical scores; however, the performance schedule is such that an ensemble large enough to accommodate both players and substitutes is desirable. This is a repeatable course. Students will comprise the orchestra for a School of Theatre's production each semester. An audition is required for admission to this course. Emphasis will be placed on precision ensemble playing, as well as the skill of playing together as a section while simultaneously following the conductor. Because of the highly technical nature of theatrical productions, there are frequent cues given by the conductor which are vitally important to the performance. Mastering the specialized skill of splitting one's attention evenly between the music stand and the podium will be a major objective of this course. In the process of preparing the music for each production other skills will be taught and acquired, such as: learning when to accompany and when to play in a solo manner; when to follow and when to lead as a section player; for brass players, developing the 'Broadway' sound: big , bright, and focused; for reed doublers, the techniques involved in performing on multiple instruments in a single number; for all musicians, familiarity with the plethora of styles now being performed on Broadway: traditional Broadway, pop, rock, and the more classical styles of some of the contemporary theatre composers.", "prerequisite": "Audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"course_name": "THEA 100: The Art of the Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "THEA 100 The Art of the Theatre (3) (GA;US;IL) (BA) This course meets the Bachelor of Arts degree requirements. This course is a survey of all aspects of the living art of the theatre. Throughout the semester, the in-class analysis of written scripts, performance contexts, dramatic structure, and theatrical genres will give insights into the imaginative impulses of theatre artists and their audiences. As a variety of individual texts are explored, scenes are used to illustrate the various topics under consideration. The course is concerned with the universality of the theatrical impulse, and includes a selection of international and multi-ethnic voices and performance techniques. Students will experience American theatre history as a conversation that parallels the country's struggle for identity in the 19th, 20th, and 21st Centuries. Students learn about Western performance traditions alongside traditions happening elsewhere in the world in the same time period within political contexts, to create a global perspective of theatre. This course provides the groundwork for all other theatre courses and is also designed to allow the general student to experience and understand the art of the theatre.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "THEA 101N: Performance and Society", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Inspired by the evolving field of performance studies, THEA 101: Performance & Society introduces theatre and performance as artistic practice, creative action, a way of knowing, and a record and unfolding of culture. Combining the disciplinary domains of social science and the arts, the performances and performance practices we study range from the scared, to the artistic, to the commerical (and often more than one of these at once). This course positions the study of performance as interdisciplinary-drawing from foundational texts in sociology, anthropology, and literature, just as it draws from such other art forms as visual art, architecture, dance, and music. We work from the following three interrelated premises: art and culture shape each other; performance happens everywhere-in many geographies, and in spaces real and virtual; and theatre and dance are human endeavors that tell us about the past, rehearse the present, and point to possible futures. To test these ideas, students will participate in projects that explore the limits and extremities of performance through the lenses of theatre studies and social science, fields that view performance as human endeavor, and everyday life as performance, respectively. As the preceding suggests, this class is an integrative domains course that fulfills GA (arts) and GS (social science), positioning Theatre and Sociology as disciplinary partners. Thus, we take a \"dramaturgical approach\" to analyzing performance, as sociologist Erving Goffman terms it in the foundational work, The Presentation of Self in Everyday Life (1956). It is this correspondence between social science and theatre that Introduction to Performance and Society will explore. Students will: Learn their major theories, ways of thinking, and methodologies used in sociology; understand \"performance\" as an agile term used in sociology, theatre, performance studies, and other fields; experience a variety of performance spaces and places-from theatres, studios, and public places, to ad hoc and virtual spaces such as the Internet, social media platforms, and the mind; complete creative projects such as scripts, designs, dances, and collaborative performances that allow them to experience what performing artists do and how they do it; and attend and write about theatrical productions as art and social event THEA 101 asks students to study, share, and live the course's premises through collaborative activities, creative projects, and writing. Class activities ask students to interrogate the meanings of \"liveness,\" \"community,\" and \"performance,\" as well as articulate theatre's role as an art and social practice in the past, present, and future.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "THEA 102: Fundamentals of Acting", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to the art and craft of acting for non-theatre majors. THEA 102 Fundamentals of Acting teaches the basic principles of Acting and Performance. THEA 102 aims to introduce the student to basic principles of the art and craft of acting, focusing on HOW and WHY actors do what they do in preparation of and for a performance less than on the attainment of performance skills themselves. Students will become acquainted with acting processes, theatre terminology, script analysis, improvisation, and other fundamentals to give them a more inclusive sense of the totality of the actor's work as craftsperson and artist. In so doing, the student actors must tap their own powers of concentration, observation, creativity, and imagination. A major focus in the course is the development of the ability to analyze one's own work and the work of peers in the class. Problem-solving in solo, paired, and/or large group contexts is a daily requirement in class.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking"]}, {"course_name": "THEA 103: Fundamentals of Directing", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Training and experience in basic skills of directing. Designed for non- theatre majors.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 104: Fundamentals of Theatre Production", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Training and experience in basic skills of technical theatre. Designed for non-theatre majors.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 105: Introduction to Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to Theatre is a general education course intended to introduce the performing arts in all their global complexity. The course will contain elements of world theatre history; however, the focus of the course will be on the functions and practices of the art. Beginning with the shared basics of any theatrical event, the course will explore both the exotic and the familiar. Guest performers will demonstrate the conventions of South Asia and Africa. A company of actors and directors will perform scenes from many of the plays read by students and from styles, genres, or playwrights highlighted in the textbook readings. Other lessons will provide links to videos from The National Theatre of England. The last unit of the class will focus on contemporary American practice to explore how Asian, European, and African influences have culminated in American theatre practice today.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "THEA 105H: Introduction to Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "An introduction and overview of the history, craft, and art of the theatre to foster an informed appreciation of theatrical events.  This course is an alternate to THEA 100.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "Honors"]}, {"course_name": "THEA 106: Theatre Foundations", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "The THEA 106 class is an introductory examination of Theatre and Meaning designed for first-year theatre majors. It is guided by two overarching questions. Why do we (human beings) make theatre? And: how does theatre generate meaning? The course begins by considering theatre's various origin stories. It then proceeds through a series of case studies that (1) compare dramatic texts from different eras and cultures, and (2) consider historical performance practices in their proper social and philosophical contexts.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)"]}, {"course_name": "THEA 107: Introduction to Dramatic Structure", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "An introduction to structural analysis in dramatic literature.", "other": ["General Education: Arts (GA)"]}, {"course_name": "THEA 111: The Fundamentals of Singing and Vocal Production", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "The origin of singing predates the development of spoken language. Singing is the act of producing musical sounds with the human voice and provides a medium for communication universally across cultures. This course explores the fundamentals of voice production and offers tools to help singers at any level develop their singing voices. Preliminary objectives will include a basic understanding of musical information associated with singing. The main objectives of the course are: to explore and understand the four systems of singing (respiration, phonation, resonation and articulation) and how they relate to voice production; to provide a greater understanding of fundamental elements of singing; to understand basic laryngeal anatomy as it relates to voice production; to build an awareness of body alignment as it relates to singing; and to provide practice tools for continued education and vocal growth through an applied vocal exercise database. This entry level, non-major, course offering provides greater accessibility to personalized voice instruction which can often only be found in the one on one studio setting. Additionally, as singing is highly personal, this course offers students the opportunity to practice and explore singing at their own pace and in private. The objectives will be accomplished by utilizing an interactive, multimedia online curriculum including instructional videos that demonstrate vocal concepts, selected readings, selected supplementary videos, and a vocal exercise database. Evaluation methods will include quizzes, reflections and assessments of recordings of the students own singing. Students will receive (3) credits for this course, as well as (GA) designation. All videos, texts and examples will be made available to students online.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "THEA 112: Introduction to Musical Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Beginning with developing an understanding of basic musical theatre terminology, Introduction to Musical Theatre will proceed to examine musical theatre development as it parallels the quixotic historical landscape. The course is designed to allow the general student to experience and understand the art of the musical theatre. The course will begin with an exploration of foundational vocabulary and subsequently move through seven major periods of musical theatre history: Greek Tragedies (BCE-1800), Operetta (1800-1900), Cinderella Musicals (1900-1928), Champagne Musicals (1928-1943), Golden Age Musicals (1943-1966), Concept Musicals (1966-1983), and Pop Musicals (1983-Present). Students will be asked to read a libretto, and listen to the score of, one show from each of these periods to fully understand, and compare, the artistic transitions that epitomized each era. Each of these productions are seminal works in the evolution of the musical: HMS Pinafore, No, No, Nanette, Show Boat, Oklahoma, Guys and Dolls, Cabaret, Company, A Chorus Line, Rent, and Next to Normal. In addition to the studying of these works, students will be taught, in chronological order, the persons and movements that helped shape the discourse of musical theatre, as well as looking at other shows that fostered dialogues between audiences and artists. While musical theatre is a primarily American art form, the development of musical theatre in other countries will be discussed as students will explore the contributions musical theater made in the countries of Greece, South Africa, Japan, China, England, France, Italy, and parts of Latin America. Each week students will be quizzed on the content they have studied and there will be two midterms and one cumulative final examination.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "THEA 113: Musical Theatre Theory I", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Studies in the fundamentals of music notation and sight-singing. THEA 113 (2) is designed to provide the beginning musical theatre student with the fundamentals of music theory and diatonic harmony as well as the analytical skills with which to approach and appreciate the structure of songs and musical theatre scores. It is focused primarily on the musical theatre literature to enable the beginning student to learn and appreciate more efficiently the literature that will be central to the performance classes in the major. The class places a rigorous emphasis on pitch and rhythmic identification to develop a high degree of musicianship in the beginning student, both to provide a solid basis for the classes to come and to make the performer more competitive in the musical theatre industry. It is designed to be entry-level in preparation for THEA 114 (Musical Theatre Form and Analysis) and the upper-level theory classes (THEA 212 and THEA 214). The course presupposes no previous musical training or experience. For those with some previous musical theory education, the course may function successfully as a refresher before the more rigorous analysis courses to follow. It satisfies a significant need in that it focuses on the specific theoretical knowledge the musical theatre student needs to know to become competitive in a professional career.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 114: Music Theatre:  Form and Analysis", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "A survey of music theatre as an art form.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 115: B.F.A. Acting Foundations", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Fundamental aspects of training the actor's body, voice, mental focus, and imagination.  THEA 115 B.F.A. Acting Foundations (2)THEA 115 is an introduction to the awakening and enhancement of beginning students' physical, vocal, mental, and imaginative instrument in preparation for the demanding work to follow in later acting, voice/speech, and movement studios. The course will introduce physical conditioning and breathing exercises specifically for actors, introduce exercises to enhance mental focus/concentration, and lead students through a series of exercises designed to stimulate and enhance the actor's imagination and trust in the world of fantasy. Students will be exposed to a variety of techniques from which they may, over time, develop their own individual physical/mental training discipline. They will be encouraged to accurately assess their own physical/vocal/mental self-image, to develop a plan (with the instructor) to minimize intrusive mannerisms and to maximize positive traits and work habits. Grading will be based on each student's commitment to the training regimen, application of past lessons in present assignments, quality of daily work, and the ability to accurately perform the exercises taught."}, {"course_name": "THEA 116: Musical Theatre Theory II", "department": "Theatre (THEA)", "credits": "2 Credits/Maximum of 4", "description": "THEA 116 develops continues music theory for musical theatre majors and augments theory with practical piano skills. THEA 116 is an introduction to the awakening and enhancement of beginning students' physical, vocal, mental, and imaginative instrument in preparation for the demanding work to follow in later acting, voice/speech, and movement studios.   The course will introduce physical conditioning and breathing exercises specifically for actors, introduce exercises to enhance mental focus/concentration, and lead students through a series of exercises designed to stimulate and enhance the actor's imagination and trust in the world of fantasy.   Students will be exposed to a variety of techniques from which they may, over time, develop their own individual physical/mental training discipline. They will be encouraged to accurately assess their own physical/vocal/mental self-image, to develop a plan (with the instructor) to minimize intrusive mannerisms and to maximize positive traits and work habits.", "prerequisite": "THEA 113"}, {"course_name": "THEA 120: Acting I", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Fundamental skills and training in acting. Emphasis on physical/vocal awareness and the nature of dramatic communication. Theatre majors only.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 121: Fundamentals of Acting II", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course is a continuation of THEA 120 and designed to build upon the basic foundation of acting.  THEA 121 Fundamentals of Acting II (3) THEA 121 is a continuation of THEA 120 and designed to build upon the basic foundation of acting. Regardless the style or medium, good acting boils down to the process of 'living truthfully under imaginary circumstances.' THEA 121 will provide the student with practicum experiences in scene study and Monologue/Auditioning technique. The course will also deepen and expand the range of student experience to include a more sophisticated and diverse immersion into the craft of acting.", "prerequisite": "THEA 120"}, {"course_name": "THEA 130: Introduction to Theatre Scenic and Costume Technology", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to the methods, materials, equipment, concepts and processes involved in the construction of scenery and costumes for the theatre.  THEA 130 Introduction to Theatre Scenic and Costume Technology (3) This course will familiarize students with the methods, materials, equipment, concepts, and processes involved in the construction of scenery and costumes for the theatre. The emphasis of this course will be on the physical process that results in the production of both scenery and costumes. Lecture topics include: Soft Goods Layout and Construction Basic Flat Layout and Construction Dimensional Scenery Rigging and Paint The Costume Shop/The Big Picture Designer's Sketch to Wearable Costume Hand Sewing Techniques Sewing Techniques/The Sewing MachineIn addition to lectures, students will be expected to participate in hands-on laboratory activities that will reinforce and inform the classroom theory. These activities will give students an opportunity to apply the principles they will learn in the lecture component.These courses enable our students to converse intelligently withallof the members of the theatre community, regardless of their specific theatre emphasis. Students will develop a fundamental understanding of the relationship between the various areas of theatre production."}, {"course_name": "THEA 131: Introduction to Theatre Sound and Lighting Technology", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to the methods, materials, equipment, facilities, concepts and processes used to create theatre lighting and sound.  THEA 131 Introduction to Theatre Sound and Lighting Technology (3) This course will familiarize students with the methods, materials, equipment, facilities, concepts and processes used to create theatre sound and lighting. The emphasis of this course will be on the physical process that results in the production of both lighting and sound. Lecture topics include: Mixers Connectors & Cable Playback vs. Reinforcement Safety & Hanging Lights Focusing, Circuits and Dimmers Instrument types, Qualities of LightIn addition to lectures, students will be expected to participate in hands-on laboratory activities that will reinforce and inform the classroom theory. These activities will give students an opportunity to apply the principles they will learn in the lecture component.These technical theatre courses enable our students to converse intelligently withallmembers of the theatre community, regardless of their specific theatre emphasis. Students will develop a fundamental understanding of the relationship between the various areas of theatre production."}, {"course_name": "THEA 132: Survey of Theatre Production Practice", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 3", "description": "Survey and application of Scenic, Costume, Lighting, and Sound techniques and practices."}, {"course_name": "THEA 146: Basic Theatrical Makeup", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Both straight and corrective makeup, with character and styling techniques for stage, film, and television.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 150: Fundamentals of Design for the Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Exploration of the philosophy and technique of scenic, costume, and lighting design.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 152: Theatrical Design Foundations for the BFA", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 3", "description": "Study and practice of the philosophy, processes, and techniques of the theatrical designer."}, {"course_name": "THEA 159: Theatre Portfolio & Business Practices I", "department": "Theatre (THEA)", "credits": "1 Credits", "description": "This course is the first half of our professional preparation arc, intended to train the student of theatre for life as a professional theatre designer or technician. There are many challenges to working in the business of theatre, arising primarily from the fact that most theatre professionals are self-employed. It's not enough to be talented; one must also be a savvy businessperson. This class will set you up with the skills you need to effectively document your design & tech work over the course of your time at Penn State, with a focus on resumes, cover letters, photography, and some basic skills for finding and landing summer jobs & internships."}, {"course_name": "THEA 189: Principles of Stagecraft, A Look Behind the Curtain", "department": "Theatre (THEA)", "credits": "1.5 Credits/Maximum of 6", "description": "THEA 189 Principles of Stagecraft, A Look Behind the Curtain (1.5 per semester/repeatable up to 4 times) (GA)(BA). For non-theatre major students only, theatre minors are ok. This course meets the Bachelor of Arts degree requirements. Ever see a show and wonder how did they build that? THEA 189 provides introductory knowledge in to scenic, property and costume construction painting techniques, lighting technology, and safety used in theatre today. This is accomplished through online and lab components. The online component is presented in the form of modules that students take at heir own pace. These modules delve into the various topics listed above. Since the course is repeatable, multiple modules are available for each topic. Once the student has taken the class once, the next time they take the class they will simply complete another module on each topic. The lab component will provide hands-on experience in the topics learned online. Students will have the ability to work within one of the technical areas of scenery, props, paints, costumes or lighting, helping to build, hang, costume, prop or paint a produced show. NOTE: the labs are by appointment only. At the beginning of the semester students will be given access to a calendar with several labs available to sign up for. Labs may vary from week to week and include both weekday and weekend time slots. Students will be required to sign up for approximately 10-12 slots during the semester or the equivalent of about 40 hours of lab time. Students should plan their schedules accordingly to ensure they have adequate time to complete the lab portion of the class. There is no set time for this class.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "THEA 197: Special Topics", "department": "Theatre (THEA)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "THEA 197Z: Special Topics - Linked Courses", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. - Linked Courses", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "General Education - Integrative: Linked"]}, {"course_name": "THEA 198: Special Topics", "department": "Theatre (THEA)", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"course_name": "THEA 199: Foreign Studies--Theatre Arts", "department": "Theatre (THEA)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "Approval by department", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "THEA 200: Script Analysis", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "An introduction to script analysis for theatre majors, which focus on full text analysis as a foundation for area specific analysis.  Two styles of analysis (contextual and structural) are studied.  THEA 200 Script Analysis (2) THEA 200 is a course designed to teach theatre majors and minors the art and craft of understanding play texts. The course begins by exploring the nature and means of transmitting meaning through theatre texts. Discourse theory and contextual analysis are applied to at least two examples of American realism. The second method of analysis is a structuralism approach that will also be applied to at least two examples of American realism. The third area of study is the application of historicism and structuralism to non-realistic scripts.Students will work individually and in small groups to create written and oral presentations of their analyses. The course is designed to teach through practice and application of methods to a variety of types of scripts written for the theatre.", "prerequisite": "THEA 100"}, {"course_name": "THEA 201W: Script Analysis", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course is an introduction to some of the most common tools of script analysis used by designers, performers, stage managers, technicians, dramaturgs, playwrights, and other artists of the theatre. The class proceeds by examining diverse scripts in a variety of ways that help to reveal their actable / designable / directable values. Understanding any given script's inherent dramatic values is a foundational first step to making informed, meaningful, and exciting choices for its production. It is also a foundational first step toward informed, meaningful, and exciting discussions of text and productions. Ultimately, it is the development of the student's (often discipline specific) ability to recognize a script's hidden potential that is the true goal of the course.", "prerequisite": "THEA 100", "other": ["Writing Across the Curriculum"]}, {"course_name": "THEA 202: Beginning Scene Study", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to the fundamentals of scene study through readings, improvisations, exercises and scene work.  THEA 202 Beginning Scene Study (3) A continuation of work started in THEA 102, this course is designed for theatre minors who wish to further advance their understanding of the art of acting. Advanced scene work, exercises, improvisations, and text analysis are explored, along with peer evaluations and instructor feedback on both processes and performances.", "prerequisite": "THEA 102"}, {"course_name": "THEA 206: Critical Theory for Performance", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "THEA 206 is an intensive introduction to critical performance theory. Through reading, writing, and attendance at arts events, students will learn methods for experiencing, analyzing, and writing about theatre, dance, and other performing arts forms through the lenses of class, race, gender, nationalism, and abilities. To do this, students will learn and apply concepts from critical theory from its historical precedents to its contemporary forms. These theories include semiotics and structuralism; post-Structuralism and deconstruction; Marxism and materialism; feminism and queer theory; postmodernism and post-colonial theory. Students will apply concepts learned through several scaffolded writing projects-response papers, a critical essay, and a performance analysis (long-form review).", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "THEA 207: Gender and Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "A study of theatre and drama literature as formed by issues of gender, race, and ethnic background.  THEA 207 Gender and Theatre (3) (GA;US) (BA) This course meets the Bachelor of Arts degree requirements.Theatre 207 provides a basic survey of issues of representations of gender identity in theatre. The course will trace women's experiences in theatre from their absence on European classical stages to the more recent formation of feminist theatres. The course will explore issues of sexual orientation and gender identity as presented through drama and performance. The plats and writings chosen for study may include selections from African, European, African American, Latina, Asian American, Anglo American, and Native American playwrights. The course will examine issues of gender as they are presented by women of different races and cultures, by men of different races and cultures, and by women and men of various sexual orientations. The goal of the course is to examine the ways theatre and theatrical performances have portrayed individuals within a pluralistic society based on gender identity and ethnicity. Theatre has existed in every known civilization, but until recently, the contributions of predominantly white European males have provided the basis for the study of theatre. Most drama anthologies include plays written predominantly by white European males. By focusing on gender as it has been and is portrayed in theatre from diverse perspectives, THEA 207 will encourage an aesthetic appreciation of the art of theatre while exploring issues of gender identity on artistic creation and critical response.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)"]}, {"course_name": "THEA 208: Workshop: Theatre in Diverse Cultures", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "A performance-oriented class which explores the historic and contemporary theatrical works of various culturally diverse peoples. THEA 208 / AFAM 208 Theatre Workshop in Diverse Cultures (3) (GA;US;IL) (BA) This course meets the Bachelor of Arts degree requirements.Theatre Workshop in Diverse Cultures is a performance-oriented class that aims to introduce students to the broad cultural diversity that exists in artistic expression. The class will focus on several plays throughout the semester that will represent cultural, ethnic, and gender diversity as well as different literary styles. Students will be exposed to various cultures by working on plays created by artists from those cultures. The course will concentrate on a specific playwright, culture, or region, such as plays from the Caribbean. Students will be required to read, study, analyze, and perform plays from the genre. For example, the class may focus on the works, life, and philosophy of August Wilson and read Joe Tumer's Come and Gone, Seven Guitars, Piano Lesson, and Fences. The class may explore Asian styles such as Noh Theatre and Asian American works by D. H. Hwang or work by Nigerian playwright and Nobel Prize winner Wole Soyinka. The presentation of these plays will be a principle part of the class, but the reading and discussion of the material will be as important. Students will participate in some capacity with the production of these plays in areas such as stage management, dramaturgy, sets and props, lights, sound, costumes, house management, publicity, and acting. These pieces will be performed in class, in workshop, and occasionally for the general public. Students will work as an ensemble and become acquainted with basic acting and theatre techniques The course objectives are: 1) to develop and enhance students' appreciation for the discipline and commitment required for multicultural theatrical presentations 2) to help to sensitize all students to the broad cultural diversity in artistic expression 3) to provide students with an introductory engagement with drama.  THEA 208 / AFAM 208 serves as a primary selection for students pursuing the Theatre minor.", "other": ["Cross-listed with: AFAM 208", "Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)"]}, {"course_name": "THEA 209: Hip Hop Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Hip Hop Theatre defines and explores Hip Hop as an art form.  The student will explore Hip Hop culture through Hip Hop Theatre aesthetics: Emceeing, Dejaying, Beat boxing, graffiti art, and dance.  Hip Hop Theatre is designed for students with an interest in Hip Hop Theatre/culture. This class introduces students to Hip Hop Theatre through Hip Hop aesthetics: Emceeing, Dejaying, Beat boxing, graffiti art, and dance. In addition, this class includes lecture sessions and discussions about Hip Hop culture Theatre as a global, multi-ethnic, grassroots youth culture committed to social justice and self-expression through specific modes of performance. This course seeks to introduce students to a culturally significant art form, enhance theatrical discourse, and provide practical opportunities for students to apply skills learned in class via collaborative creations, text, and performance. This course is directly related to dance, theatre, African American history and other arts based and humanities based courses. Students will be evaluated on their attendance, participation in class, willingness to learn, and the effort put forth in class."}, {"course_name": "THEA 210: Hip Hop Theatre Performance Workshop", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 9", "description": "Hip Hop Theatre Performance Workshop expands on the Hip Hop Theatre lecture component and experience from Hip Hop Theatre, and delves more into a performance and workshop structure. Students will apply themes studied in Hip Hop THEA 209 or DANCE 271 to this course, which focuses on performance experiences.  THEA 210 Hip Hop Theatre Performance Workshop (3 per semester/maximum of 9) Hip Hop Theatre Performance Workshop is designed for students who want to expand their experience in Hip Hop Theatre and/or African American Dance History to a performance level. The student will use his/her knowledge of Hip Hop aesthetics, historical and cultural references, and natural talent to collaborate in creating an original theatre production. Students will demonstrate their understanding of Hip Hop as a global, multi-ethnic, grassroots youth culture through performance. This course is directly related to dance, theatre, African American history, and other arts and humanities courses. Student work will be observed throughout the semester. Student progress will be evaluated by his/her level of contribution to the process, engaging in discussions, and participation in the culminating performance. Class attendance and effort will also be assessed.", "prerequisite": "THEA 209", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 211: Dramaturgy", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "THEA 211 is an introduction to the history, theory, and practice of production dramaturgy. Students will learn to: practice theory-driven and production-oriented play analysis; to write thoughtful dramatic criticism, informed by theatre theory and critical thinking; and to practice a range of scholarly, artistic and interpersonal skills; in order to advocate for the emergent production at hand. To do this, students will study historical and contemporary dramaturgical theory, a transhistorical set of essays that argue for a certain form, content, or purpose of theatre and performance. Students will learn the historical and contemporary role of the dramaturg in production, and will practice the skills associated with the contemporary dramaturg. These include providing research support for theatre production, designing audience events such as talkbacks and receptions, and writing program pieces such as playwright bios and production histories. The cumulative dossier students create can serve as a dramaturgy portfolio for those who wish to pursue dramaturgy through graduate study or through taking the role in productions going forward. For all students, the portfolio develops an understanding of the dual role of dramaturg as scholar and artist.", "prerequisite": "DANCE 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 212: Musical Theatre Theory III", "department": "Theatre (THEA)", "credits": "2 Credits/Maximum of 2", "description": "Intermediate studies in diatonic harmony, analysis, sight-singing and dictation. THEA 212 (2) is designed to provide the intermediate musical theatre student with the mastery of harmonic and melodic analysis with which to approach and appreciate the structure of songs and musical theatre scores. It is designed to enable the intermediate student to sight-read more efficiently the literature that is central to the performance classes in the major, and to develop basic accompaniment and transposition skills that will become indispensable to the professional career. A continued emphasis on pitch and rhythmic identification will enable the intermediate student to maintain a high degree of musicianship in the performance classes required in the major and will make the performer more competitive in the musical theatre industry. THEA 113, the entry-level theory course and THEA 114, Music Theatre Form and Analysis are prerequisites to THEA 212, which is designed as the third course of the theory-form-and-analysis sequence. The course satisfies a significant need in that it focuses on the specific theoretical knowledge the musical theatre student requires to become competitive in a professional career.", "prerequisite": "THEA 113", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 214: Musical Theatre Theory IV", "department": "Theatre (THEA)", "credits": "2 Credits/Maximum of 2", "description": "Advanced studies in the technique and practice of chromatic harmonic analysis and sight-singing. THEA 214 is designed to provide the advanced musical theatre student with the analytical skills with which to approach and appreciate the harmonic and melodic structure found in the various compositional styles of musical theatre literature. It is focused specifically on musical theatre literature that is representative of the current repertoire to enable the advanced student to function more effectively in auditions and other performance venues. The course is designed to function as the culmination of the theory-form-andanalysis sequence, connecting up the terminology, techniques, and repertoire, developed throughout the four-semester process. The course satisfies a significant need in that it focuses on the specific theoretical knowledge that the musical theatre student is required to master in order to become competitive in a professional career.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 220: Acting II", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Principles of acting through improvisation, exercises, and character analysis, with emphasis on basic skills of voice and movement.  For theatre majors only.", "prerequisite": "THEA 120", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 221: Acting III", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "A continuation of Thea. 220.  For theatre majors only.", "prerequisite": "THEA 220", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 222: Acting Laboratory", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Laboratory experience in student-directed scenes and/or one-act plays.", "prerequisite": "THEA 120", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 223: Musical Theatre Performance I", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Studio training in the unique performance skills, repertoire and business of professional music theatre.  THEA 223 Musical Theatre Performance I (2) (BA) This course meets the Bachelor of Arts degree requirements.The purpose of this class is to introduce sophomore BFA musical theater students to the art of performing the solo song based on the book musical. While utilizing the performer's skills in acting, singing and dance/movement, the student will learn how to communicate clearly and compellingly 1. who his/her character is 2. to whom the character is singing 3. why the character is singing these particular words to this particular music at this particular time. The student must understand his/her environment, relationships, obstacles, tactics, and stakes in order to accomplish this task. This is the class that begins to synthesize the student's performance training for the special demands of musical theatre. Most of the work will concentrate on solo performance, building the student's power and confidence and beginning to explore both their individual uniqueness and their crucial relationship to their audience. Students must prepare two contrasting musical theatre pieces from 'book' musicals preferably from 'The Golden Age' (1920-1960s). These songs must be chosen in collaboration with musical theatre faculty and the student.Students must obtain copies of the music and lyrics for their songs and the book.A thorough knowledge of the book is as important as a through knowledge of the music and lyrics in order to make informed performance choices. Students are required to keep a journal. Written exercises about passive, active, stage directions, and character analysis as well as in-class exercises on these topics will be part of the class assignments.", "prerequisite": "THEA 114", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 224: Musical Theatre Performance II", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Studio training in the unique performance skills, repertoire and business of professional music theatre.  THEA 224 Musical Theatre Performance II (2) (BA) This course meets the Bachelor of Arts degree requirements.This course will cover three primary areas of study: musical theatre scene work, the study of the major repertoire in musical theatre from 1965-1990 (excluding Sondheim and Webber), and performance power training. Scenes that contain songs require special techniques of the actor-singer. Using the preparation and presentation of four such scenes, the musical theatre student will begin to develop successful performance strategies for musical theatre scene work. Through the use of in-class reports the musical theatre student will continue to gain understanding and appreciate the rich musical theatre literature of the late 1960s and the 1990s. Primarily, the course will cover the works and lives of Bock and Harnick, Jerry Herman, Kander and Ebb, Jule Styne, Jones and Schmidt, and Maltby and Shire. Through exercises, studies, and improvisation designed to sharpen the student's use of energy, focus, structuring skills, imagining, stylizing, and coordinating, the musical theatre student will obtain a significant increase in his/her performance power. The musical theatre student will prepare three duet scenes with song and an ensemble scene with song during the semester. Students will have two opportunities to present each duet scene. THEA 224 is a continuation of Musical Theatre Performance I. These studios represent the core of the musical theatre training program.", "prerequisite": "THEA 223", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 225A: B.F.A. Acting Studio I", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Exercises to develop truthful listening and responding as a foundation for acting studio scene study. Listening and responding in an unadorned, truthful way is the lynch-pin of the actors's work. In THEA 225A, students will begin with exercises designed to foster and increase the depth of truthful behavior on stage. In addition, this coursework includes exercises to increase awareness of the sensory world around us and its effect on the actor's imagination, availability to emotion, and mental focus. Contentless scene work leads the student through the basics of behavior on stage: playing for a purpose (goal), encountering obstacles, and finding the necessary tactics to behave appropriately in the imaginary circumstances. The final stage of the semester applies the skills acquired to a full scene from a play."}, {"course_name": "THEA 225B: B.F.A. Movement Studio I", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Introduction to techniques to condition the actor and improve physical awareness and self-use. Listening and responding in an unadorned, truthful way is the lynch-pin of the actors's work. In THEA 225A, students will begin with exercises designed to foster and increase the depth of truthful behavior on stage. In addition, this coursework includes exercises to increase awareness of the sensory world around us and its effect on the actor's imagination, availability to emotion, and mental focus. Contentless scene work leads the student through the basics of behavior on stage: playing for a purpose (goal), encountering obstacles, and finding the necessary tactics to behave appropriately in the imaginary circumstances. The final stage of the semester applies the skills acquired to a full scene from a play."}, {"course_name": "THEA 225C: B.F.A. Voice/Speech Studio I", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Introduction to actor voice and speech training.  THEA 225C is the first in a sequence of voice and speech courses for the actor. This first semester installment will focus on awareness and conditioning activities related to breath, posture, resonance and articulation. Prose and poetry readings will be used for application activities. Students will experience activities that will heighten their physical awareness of vocalizing. Most activities will involve a re-learning of how they speak, bringing to their conscious awareness the processes of voice/speech which were initially learned through early childhood nurturing. Class events will include awareness of breath patterns and the means to release inhibitive behaviors related to spinal posture, head and neck alignment, and musculature along the breath/vocal tract. Students will also gain awareness of how breath relates to their expressive/emotional system. Class activities will also include physical awareness of the consonant and vowels sounds and their phonetic transcriptions. Each event will strive to improve actors' intelligibility and increase musicality of speech. Through application assignments with word lists, sentences, poetry and prose, students will increase language sensitivity. This semester will also address voice quality issues directly and how they relate to the above. Specific events will focus on vibratory awareness in primary resonators and how to apply this awareness in all vocal life. Issues of vocal health, projection and emotional demands will be addressed."}, {"course_name": "THEA 250: Introduction to Scene Design", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to the history, processes, materials, and concepts involved in designing scenery for the theatre. THEA 250 Introduction to Scene Design (3) This course is the introductory course to the art and practice of designing scenery for the stage. The primary goals of the course are to introduce students to the history and profession of scene design, and to help students learn a fundamental design process to apply to the evolution and presentation of design for stage scenery. This process includes play analysis, script and visual research methods, analysis of dramatic action, concept evolution, and visual communication methods. Evaluations will be based on the following: 1. Students will submit papers to demonstrate text analysis skills and to explore the work of specific designers or historical trends (25%) 2. Students will receive in-class critiques to evaluate their design concepts and communication skills (25%) 3. Students will receive comment sheets for each studio project critiquing specific aspects of their design process (50%)", "prerequisite": "THEA 130"}, {"course_name": "THEA 251: Theatre Drafting Techniques", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Introduction to drafting of floor plans, section drawings, construction graphics, and mechanical perspective for the theatre.  THEA 251 Theatre Drafting Techniques (1) (BA) This course meets the Bachelor of Arts degree requirements.Theatre 251 is a foundation course for all students studying theatre design or technology. Students will learn the lexicon of lines and marks that make up the language of theatre drafting. They will be instructed in traditional drafting techniques and work to master the skills required to execute complete, accurate, and clear draftings. Drafting is the basic form of communication in theatre design and technology. All students involved in these disciplines will use drafting extensively throughout their careers. As such, the skills introduced and practiced in this course form a necessary foundation for all other design and technology courses. This course prepares students by teaching them a language necessary to advanced coursework. Theatre 251 is a required course in the theatre B.F.A. Production program. Throughout the course students complete draftings of increasing complexity. These draftings will be evaluated for content, clarity and skill. Individual drafting projects will be assigned a point value.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 252: Design Presentation Techniques", "department": "Theatre (THEA)", "credits": "1 Credits", "description": "Media and materials exploration; sketching, rendering, and modeling methods.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 253: Scene Painting", "department": "Theatre (THEA)", "credits": "1 Credits", "description": "Introduction to painting scenery for the theatre; methods and materials.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 260: Introduction to Costume Design", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to costume design process through character analysis and the use of color, line, and texture.  THEA 260 Introduction to Costume Design (3) (BA) This course meets the Bachelor of Arts degree requirements.THEA 260 provides the student the opportunity to experience the costume design process from the reading of the script to the creation of a fully rendered costume design. The work of a costume designer begins with the ability to read the play script from both the perspective of the audience and that of the human beings depicted in the imaginary premise. The student is given a specific methodology for reading a play and determining the plot, the dramatic action, and the theme or significance of the action of the play. Next, the student is exposed to research methods and techniques that illuminate historical periods and genres and allow the designer to fully appreciate the lives of human being living in different times and locations. Beginning projects are derived from contemporary dramatic material that requires relatively little examination into the social and historical period. Subsequent projects, however, move farther away from contemporary realism and require extensive research to grasp the essence of the period. The next section of the course is devoted to an examination of how this research and analysis is used by the costume designer to make artistic choices. Students are introduced to a specific technique for analyzing a character and determining what kind of clothing would be appropriate for the individual based on the student's analysis of their personality, social status, and function in the play. The final project involves the creation of a costume design for the entire play. The student is guided through the process of improving rendering skills, creating a finished representation of each garment worn in the play, and enhancing their ability to communicate these choices to a director and actors.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 261: Introduction to Costume Construction Techniques", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Intermediate study of the methods, materials, equipment, concepts and processes involved in the construction of costumes for the theatre.  THEA 261 Introduction to Costume Construction Techniques (3) This course will advance the knowledge of students in the methods, materials, equipment, concepts and processes involved in the construction of costumes for the theatre.The emphasis of this course will be on the specialized processes that result in the production of theatrical costumes. Formal course material in the form of lecture/demonstrations will address the specialized approach to the construction and tailoring of theatrical costumes for men's and women's wear. Examination of the historic context of the clothing technique, as well as the contemporary application of such techniques for theatrical use will also be addressed. In addition to lectures and demonstrations, students will be expected to participate in hands-on laboratory activities that will reinforce and inform the classroom theory. These activities will give students an opportunity to apply the principles they learn in the lecture component."}, {"course_name": "THEA 270: Introduction to Lighting Design", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "THEA 270 Introduction to Lighting Design (3) will focus on helping each student to develop a design process that takes them from script to stage. Students will study each step of the lighting design process and use these steps to create the design for a fictional production. Students will also have the opportunity to hone their design skills with a series of practical projects that will allow them to experiment with intangible qualities of light. This class will use a traditional proscenium presentation for the development of these techniques.", "prerequisite": "THEA 201W", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 280: Introduction to Technical Direction for the Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to the methods, materials, equipment, facilities, concepts and processes associated with Technical Direction for the Theatre.  THEA 280 Introduction to Technical Direction for the Theatre (3) This course will familiarize students with the methods, materials, equipment, facilities, concepts and processes used by Theatre Technical Directors to produce the spectacle of theatre. The concepts of project management will be introduced and the processes associated with project management will be explored. The steps involved in producing a technical package that will facilitate the implementation and completion of a production will be introduced and explored.The emphasis of this course will be on exploring how Technical Directors bring designs to reality on the stage. The planning and management processes will be introduced and explored through the use of exercises and projects that will reinforce and inform the lectures.", "prerequisite": "THEA 130"}, {"course_name": "THEA 282: Production Practicum", "department": "Theatre (THEA)", "credits": "3-6 Credits/Maximum of 6", "description": "Introduction to all aspects of theatre production--analysis, design, construction, production, performance--for non-theatre majors.  THEA 282THEA 282 Production Practicum (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This course will introduce and expand skills in the performance and production of plays. Students will learn about the play, the playwright, the time period, the performance history of the chosen play, and its relation to theatre history and the cultural values of society particularly as they are depicted in the arts. Students will participate actively in individually selected aspects of design/construction and performance (students may choose to focus on performance, to work primarily with the design/construction team, or to combine performance with design/technical work). After the completion of the production, students will evaluate their work.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"course_name": "THEA 285: Introduction to Sound Design", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "An introduction to sound design for the theatre.  THEA 285 Introduction to Sound Design (3)The purpose of this course is to provide an overview of the techniques and the tools of sound design and the sound designer's role in the collaborative design process in the theatre setting. The goal of this course is to develop a method of understanding sound and sound design, and discovering a language with which to express this understanding in a theatrical context. In order to accomplish these goals, there is fundamental exposure to the terms and techniques of contemporary sound design that is necessary along with an understanding of the challenges and problems inherent in designing sound for the stage. The course also serves as an introduction to continuing advanced study in topics such as audio recording and advanced sound design that relate to sound design. Projects will make up the majority of the assignments for the class, and therefore will constitute the majority of the grading. The evaluation of these projects will not only consist of written and audio submitted portions, but also the student's presentation of the project to the class. During the sections of the class based on the terminology and tools of theatrical sound design, quizzes will be administered in order to check the progress of the students and ensure their comprehension of the material. Each student will complete a final project in lieu of a final exam: the sound design of a theatrical script. This project will not only consist of the final design work, but also the class presentation of the conceptual basis for the design as well as the implementation of the design.", "prerequisite": "INART 258A"}, {"course_name": "THEA 289: Theatre Production Practicum", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 3", "description": "Supervised experience in production techniques.  THEA 289 Theatre Production Practicum (1 per semester/maximum of 3) (BA) This course meets the Bachelor of Arts degree requirements.The course is designed to provide practical training in the production techniques of theatre arts. In preparing the physical productions for the School of Theatre, the student will encounter the technology of theatre arts. Diverse areas such as construction, electricity, painting, mechanics, plastics, electronics, costuming, and sewing are experienced in an organized and directed laboratory situation. The course compliments the introductory theatre production courses and the advanced production practicum course. The B.A. program and the B.F.A.--production option requires a maximum of two credits of this course, and the B.F.A.--musical theatre option requires three credits.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 296: Independent Studies", "department": "Theatre (THEA)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 296H: Independent Studies", "department": "Theatre (THEA)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"course_name": "THEA 297: Special Topics", "department": "Theatre (THEA)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 298: Special Topics", "department": "Theatre (THEA)", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 299: Foreign Studies--Theatre Arts", "department": "Theatre (THEA)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "THEA 322: Voice and Speech I", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Vocal techniques for the actor:  articulation, voice control, support, and projection. In this class students will be working in three areas: practical voice and speech work to include relaxation, body alignment, breath, resonance, pitch and range, articulation; basic anatomy; and, text (putting the skills learnt into practice). Students will develop a set of exercises that help to release tension and build breath, muscularity and strength, and good resonance.  In addition, students will build an awareness of how the voice works (anatomy) and work with poetic and dramatic text to see how the imaginative demands of the text can be fulfilled by the voice. Students will also learn to use voice with language that is not their own and to be confident and clear in their speech. The final goal is to develop an awareness of `healthy voice' usage", "prerequisite": "THEA 115", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 323: Voice and Text", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course focuses on building the vocal and analytical skills required to embody challenging text and communicate it clearly. Building on the foundation of the previous BFA voice courses, students learn to strategically utilize the vocal tools at their disposal in order to illuminate thought and character. Students gain facility with a variety of texts, including those with poetic language and written in verse, and how to use that language to their advantage.", "prerequisite": "THEA 225C"}, {"course_name": "THEA 324: Movement for Actors I", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Techniques and skills in physical expression, awareness, control, and stage movement.", "prerequisite": "THEA 120", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 325: Movement for Actors II", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Continuation of THEA 324.", "prerequisite": "THEA 324", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 326: Music Theatre Performance Workshop", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 3", "description": "Performance studies in cabaret, revue, and club environments.", "prerequisite": "THEA 224", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 327: Musical Theatre Auditions", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Research and preparation of auditions for work in professional musical theatre venues.  THEA 327 Musical Theatre Auditions (2) (BA) This course meets the Bachelor of Arts degree requirements.Theatre 327 offers junior and senior musical theatre students an opportunity to examine the art of the musical theatre audition from research to performance. Since these students have completed two to three years of vocal and acting study, piano, and music theory, they are ready to work at honing their skills for professional auditions. Each student will prepare four to six professional auditions and simulate them in class. Feedback is provided by the class and visiting guests from the profession. All audition material is memorized and professional attitude as well as dress is required. The audition material is different for each student in the class. Grading is based on the student's ability to prepare quickly and accurately, take direction, and incorporate it into the audition on the spot. The continued research and performance of new material is required weekly. Theatre 327 is an elective course in the B.F.A. theatre musical theatre option.", "prerequisite": "THEA 224", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 386: Stage Managing Fundamentals 1", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This is a Stage Manager's Essential Tool course. Through the semester students will specialize in foundational activities and skills required of professional stage managers entering the industry. Those tools cover a wide gamut of skills stage managers in both the regional and commercial markets are required to possess. Beginning with preproduction, students will acquire the necessary knowledge to prepare for the rehearsal process, understanding what is expected of them in preproduction, and to develop the necessary organizational skills to advance to the next levels of production work in theatre.", "prerequisite": "THEA 100"}, {"course_name": "THEA 399: Foreign Studies--Theatre Arts", "department": "Theatre (THEA)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individuals or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "THEA 400: Advanced Theatre Projects", "department": "Theatre (THEA)", "credits": "1-6 Credits/Maximum of 99", "description": "Individual and group-directed study of in-depth projects involving reading, discussion, performance, and critical analysis by faculty.", "prerequisite": "7th semester standing or higher or 12 credits in THEA", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 401: Theatre History I: Ancient to 1700", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Survey of drama and theatre from primitive rites through the Renaissance.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)"]}, {"course_name": "THEA 401H: Theatre History I", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Survey of drama and theatre from primitive rites through the Renaissance.", "other": ["Honors"]}, {"course_name": "THEA 402: Theatre History II: From 1700 to Present", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Survey of European drama and theatre from the eighteenth century through the modern period.  THEA 402 Theatre History II: From 1700 to Present (3) A survey of drama and theatre from the seventeenth century through the modern period. The course is a sequential second half of the history of world theatre. Beginning with the post-Shakepearean era, students study major theatre movements in play writing, acting, theatre architecture and design. Some eras include the English Restoration and Georgian periods, the French Neoclassical period, German Romanticism, and the rise of the Beijing Opera. In addition, emerging post-colonial theaters of Africa and Asia will be explored. For each major era or movement, a play by one of the acknowledged masters of the form will be read and discussed in class. Students will write brief responses to their assigned readings, as well as experience a variety of assessment techniques.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 403: 20th Century Theatre History", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course begins in the mid-twentieth century following the theatrical experimentation and socio- political changes that influenced Modernism's Avant-Garde movement, Bertolt Brecht and Erwin Piscator's Epic Theatre, and the Theatre of the Absurd (examined in THEA 402). We explore what came after the advent of Modernism - what artists moved away from, what they repurposed, and what they imagined anew. One of the keynotes of this ensuing artistic period is the concept of \"post\": Post-Modern, Post-Dramatic, Post-Colonial, and Post-Human. Altogether, we will examine dramatic literature, influential theatre artists, and performance practices in global theatre from the mid to late twentieth century.", "prerequisite": "THEA 100", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "THEA 405W: Theatre History: American Theatre", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 3", "description": "Survey of American drama and theatre from the colonial period to the present. THEA 405 Theatre History - American Theatre is a course that introduces students to the rich history of American theatre from the colonial era to today. Each week plays and supporting materials become the focus of conversations about the intersections of race, gender, class, religion, and art. Early plays from the colonial and post-colonial years reveal the peculiar love/hate relationship between colonists and theatre. After the Revolutionary War plays become the rallying cry as the new nation attempts to forge an identity separate from and equal to Europe. In the decades that follow theatre provides a voice to previously silent Americans: women, former slaves, immigrants, and non-Christians. The course culminates in the present with readings of the three most recent Pulitzer Prize winning plays and discussion of their impact. This is a Writing-Intensive course.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "THEA 407W: Women and Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "A study of theatre practice and dramatic literature as informed by issues of gender, race, and ethnic background.  THEA (WMNST) 407 Women and Theatre (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. Theatre 407 approaches the study of theatre/performance as a valuable site for the exploration of race, class, and gender as social constructs. The focus will be on 20th century developments of women and theater. Feminist theory and theatrical practice will be a focus of the course and will reflect conflicts and differences present within feminism.", "prerequisite": "THEA 100", "other": ["Cross-listed with: WMNST 407W", "Bachelor of Arts: Arts", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "THEA 408W: History of American Musical Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "A survey of the history of American musical theatre presented in a social, cultural, and aesthetic prospective.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "THEA 410: Play Analysis", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Advanced skills in textual analysis of plays and screenplays.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 411: Dramaturgy Practicum", "department": "Theatre (THEA)", "credits": "1-3 Credits/Maximum of 12", "description": "Dramaturgy Practicum is a variable credit course (1-3) that trains theatre students in the practices of dramaturgy for production. Students may be paired with a particular School of Theatre production or project as an in-rehearsal dramaturg. Others will be assigned to dramaturgy teams or will complete particular dramaturgy tasks. These can include keeping group-sourced or single-authored blogs; posting to social media; taking and sharing photos and videos of the design process; interviewing artists in production; writing program notes; making lobby installations; hosting talkbacks with performers, audiences, and designers. Students might instead be assigned to a research or archiving project with the School of Theatre in order to learn theatre archiving skills. The 3-credit option is only open to students who have taken THEA 211 - Dramaturgy. These students will take on a major project, most typically the role of production dramaturg for a School of Theatre production or other major project. For the 1-credit option, students will either work on a dramaturgy team, or else they will focus on one kind of dramaturgy practice for several productions, such as production photography, social media posting, talkbacks, program notes, or outreach events.", "prerequisite": "THEA 211"}, {"course_name": "THEA 412: African American Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Exploration of the development of African American theatre from its roots in Africa through the diaspora, to the present time. THEA 412 / AFAM 412 African American Theatre (3) (US;IL) (BA) This course meets the Bachelor of Arts degree requirements.In this course, we will explore the development of African American theatre from its roots in Africa and Europe, through the diaspora, to the present time. We will learn something of the rich diversity of African American people and their contribution to the world's creative mainstream. We will become acquainted with both historical and contemporary artists who created and continue to create this unique American art form. The goals of the course are: 1)to develop familiarity with African American theatre and the socio-historic context in which it was created 2) to develop an understanding of the relationship of African American theatre to mainstream American theatre 3) to acquire an appreciation of the schools, styles, and techniques of African American theatre We will do this by reading and engaging plays in the context of the period in which they were created, viewing films of plays, and attending relevant productions where possible.", "prerequisite": "THEA 100", "other": ["Cross-listed with: AFAM 412", "Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "THEA 419: Musical Theatre: Business of the Business", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course is lecture and discussion based and designed to address the needs of students preparing to enter the professional musical theatre. Topics will include the techniques and skills of networking, unions, casting directors, agents and managers, headshots/ resumes, bios, life in NYC, tax preparation, and other topics related to the business side of acting for the musical theatre."}, {"course_name": "THEA 420: Scene Study I", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 9", "description": "Advanced monologue and scene study techniques. Principal focus on realism. THEA 420 Advanced Scene Study is a course in which students are allowed to explore and deepen their understanding of the art and craft of acting. The course is repeatable for credit and taught by a variety of instructors. This allows students to experience the processes of different pedagogical methodologies. Regardless of the instructor, the shared emphases include: scene work in a variety of styles (from classical verse plays to cutting edge contemporary material) tailored to the needs of the individual student; movement toward increased technical proficiency; deepening awareness that \"acting is living truthfully under imaginary circumstances,\" however similar or different those circumstances may be to the actor's personal life; and, growing self-sufficiency through self-directed scenes and individual rehearsal discipline. The environment of the classroom/rehearsal space is both safe and critical, as students begin to accept that risk is integral to successful acting. The student is also engaged in giving constructive criticism to their peers, learning to be honest, detailed, and nurturing in the process. This critical process requires students to give unconditional support to their peers, support that is geared toward mutual improvement and emotional/physical safety", "prerequisite": "THEA 115", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 421: Advanced Acting: Physical Approaches", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course builds on the physical approach to character and story creation explored in THEA 420, and aims to equip the student with a working knowledge informed by direct experience and application of physical approaches like, but not limited to, those of Jacques Lecoq, Kari Margolis, and the work of Dell Arte International School of Physical Theatre. Physical approaches are part of 21st Century theatre-making, and our students must have knowledge of current approaches that will both take their work to a more fully-embodied level, and prepare them for work in the theatre field of today.", "prerequisite": "THEA 420"}, {"course_name": "THEA 422: Advanced Scene Study", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course introduces the actor to the skills necessary for successful auditions and performances in television, film, digital media and other commercial venues.", "prerequisite": "THEA 421"}, {"course_name": "THEA 423: Musical Theatre Performance III", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Studio training in the unique performance skills, repertoire and business of professional musical theatre.  THEA 423 Musical Theatre Performance III (2) (BA) This course meets the Bachelor of Arts degree requirements.In depth preparation and performance of scenes from the works of Sondheim and Webber. Also, exploration of the adjustments needed to perform successfully in non-traditional performance venues. The third in a musical theatre performance studio sequence, THEA 423 applies performance technique and methodology studied in previous studio classes to the works of contemporary composers, particularly Stephen Sondheim and Andrew Lloyd Weber. The course also explores the adjustment to performance needed when working in non-traditional stage spaces such as ballrooms, cruise ships, and industrials. THEA 423 is a continuation of Musical Theatre Performance II. These studios represent the core of the musical theatre training program. Grading will be based on the quality of the musical theatre student's studio work, report, and demonstrated respect for the professional studio environment.", "prerequisite": "THEA 224", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 424: Musical Theatre Performance IV", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Studio training in the unique performance skills, repertoire and business of professional musical theatre.  THEA 424 Musical Theatre Performance IV (2) (BA) This course meets the Bachelor of Arts degree requirements.This studio is designed for senior musical theatre majors to hone their skills in acting, singing, and dancing in the last semester of their college career. The majority of the class will be the preparation of the Senior New York Showcase where each student will have the opportunity to perform for an invited audience of agents, alumni, and special guests. Students are responsible for all research and preparation of showcase material. Showcase material will be coached in class, but the main body of preparation relies on the students themselves, utilizing skills and techniques learned throughout their studio training. Grading will be based on attendance, preparation, and attitude. These are all critical factors for entering the profession and for successfully completing this course. Deadlines and appointments must be kept. Students must do adequate outside preparation. THEA 424 is a continuation of Musical Theatre Performance III. These studios represent the core of the musical theatre training program.", "prerequisite": "THEA 423", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 425A: B.F.A. Acting Studio II", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Scene Study  THEA 425A B.F.A. Acting Studio II (2)THEA 425A is a laboratory or practicum course requiring active student presentation of work in progress for critiques by the instructor and input from peers. Working in pairs, students will be assigned a five-minute scene from modern American realism. Students must read the play from which the assigned scene is taken, do the necessary historical/analytical homework, develop a character biography and a scene score, and present the result of their work in the initial on-the-feet working sessions for faculty critique and peer input. Taking away responses from each working session, the students are expected to rehearse outside of class to address any issues raised in the previous working session and to ready the scene for the next viewing. In THEA 425A, the instructor will serve, not as a director, but as an acting coach, asking probing questions and using his or her own energy to exhort, guide, and discipline the students, It is expected that faculty intervention will decrease and student self-reliance will increase with each passing studio.", "prerequisite": "THEA 115"}, {"course_name": "THEA 425C: B.F.A. Voice/Speech Studio II", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Advanced voice and speech training for BFA Musical Theatre students.  THEA 425C B.F.A. Voice/Speech Studio II (2)In THEA 425C, B.F.A. Musical Theatre students will continue to develop and expand their vocal instrument. Basics of vocal production will be repeated and developed with a greater focus on the individual actor's application of his/her voice in the performance of various texts. The first ten weeks will recall the basics of the past two semesters of voice/speech work and continue to expand the actors' capabilities. Extended work in the area of breath support and release, resonance and vocal range, and speech/articulation will all be explored with appropriate texts. In the last five weeks of the semester, work will focus on text in the performance setting. A short program of text performances will be devised and presented in the last week of class.", "prerequisite": "THEA 225C"}, {"course_name": "THEA 427A: B.F.A. Acting Studio III", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Continuation of THEA 425A THEA 427A B.F.A. Acting Studio III (2)THEA 427A is an extension of THEA 425A, a laboratory or practicum course requiring active student presentation of work in progress for critiques by the instructor and input from peers. Working in pairs, students will be assigned a five-minute scene from modern American realism. Students must read the play from which the assigned scene is taken, do the necessary historical/analytical homework, develop a character biography and a scene score, and present the result of their work in the initial 'on-the-feet' working sessions for faculty critique and peer input. Taking away responses from each working session, the students are expected to rehearse outside of class to address any issues raised in the previous working session and to ready the scene for the next viewing. In THEA 427A, the instructor will serve, not as a director, but as an acting coach, asking probing questions and using his or her own energy to exhort, guide, and discipline the students. It is expected that faculty intervention will decrease and student self-reliance will increase with each passing studio."}, {"course_name": "THEA 427C: B.F.A. Voice/Speech Studio III", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Stage Dialect Studies  THEA 427C B.F.A. Voice/Speech Studio IV (2)THEA 427C focuses on the acquisition of stage dialects and accents. For each dialect the student becomes aware of the resonance, phonetic, inflection, and rhythm changes necessary to perform dramatic text with an accent or dialect. Vocal agility, phonetic recall and the ability to integrate the altered vocal behavior to the demands of acting are the primary goals. Each dialect unit will have an introductory instruction, a review session, and a presentation of a reading of a dialect monologue. The final project will be the performance of two dialect monologues. Students will be evaluated upon preparedness, work ethic, focus, openness to change, growth, degree of self-reliant recall, and creative application of new skills. This studio performance class offers opportunity for assessment from the instructor in each class session. Periodic assignments will be made to assess self-reliant application of the work.", "prerequisite": "THEA 425C"}, {"course_name": "THEA 427H: Theatre Makeup", "department": "Theatre (THEA)", "credits": "2 Credits", "description": "Advanced makeup techniques, casting with moulage and rubber, construction of prosthetics, hair work."}, {"course_name": "THEA 428: Musical Theatre Performance Studio V", "department": "Theatre (THEA)", "credits": "2 Credits/Maximum of 4", "description": "Students will prepare and present workshop reading of a new musical theatre piece", "prerequisite": "THEA 224"}, {"course_name": "THEA 429: Theatre Performance Practicum", "department": "Theatre (THEA)", "credits": "1-3 Credits/Maximum of 99", "description": "Supervised experience in rehearsal and performance of significant roles.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 434: Introduction to Directing", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to principles and procedures of play direction.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 434H: Introduction to Directing", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Introduction to principles and procedures of play direction.", "other": ["Bachelor of Arts: Arts", "Honors"]}, {"course_name": "THEA 436: Directorial Processes", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Preparing a play for production including the scoring of thescript, developing ground plan, casting, and staging projects in American realism.", "prerequisite": "THEA 434", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 437: Artistic Staff for Production", "department": "Theatre (THEA)", "credits": "1-6 Credits/Maximum of 6", "description": "To provide students with experience in choreography, dramaturgy, combat, staging, voice/speech, musical direction, assisting in direction, for major productions.", "prerequisite": "approval of proposed assignment by instructor prior to registration", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 440: Principles of Playwriting", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 6", "description": "Structure, dramatic effect, characterization, and dialogue; the writing, reading, and criticism of original one-act plays.  THEA 440 Principles of Playwriting (3 per semester/maximum of 6)(BA) This course meets the Bachelor of Arts degree requirements. THEA 440 is a course in which students are allowed to explore, deepen, and exercise their understanding of the craft of playwriting. This course is repeatable and taught by one instructor. This course utilizes diverse critical commentary, craft-based texts, and plays that elaborate and illustrate the core writing techniques of structure, dramatic effect, characterization, and dialogue.The writing requirement of the class concentrates on the construction of several ten-minute plays, which are shared in the class as works-in-progress.The students engage with giving and getting constructive criticism inside a safe and nurturing space, and the students work towards articulating and exercising the technical aspects of writing in a clear, concise, and effective manner.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 447: Make-Up Design for Production", "department": "Theatre (THEA)", "credits": "1-6 Credits/Maximum of 6", "description": "Materials, research, preparation, design, execution of make-up for major University Theatre productions.", "prerequisite": "approval of proposed assignment by instructor prior to registration", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 450: Advanced Topics in Scene Design", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 6", "description": "Design emphasis on a variety of production techniques, genre, and styles.  THEA 450 Advanced Topics in Scene Design (3 per semester/maximum of 6)(BA) This course meets the Bachelor of Arts degree requirements. This course will build upon the basic design process introduced in THEA 250. Students will explore design solutions for shows requiring multiple locals. Students will also be introduced to shows reflecting a variety of dramatic styles and will explore effective design solutions within stylistic constraints. In addition to previously introduced graphic skills, emphasis will be placed on graphic techniques involved in the production of scenery, including design drafting, prop drawings, and paint elevations.As this course may be repeated, there will be a rotation of topics to ensure that students receive different content each semester. Topics within the rotation may include: Design for Shakespeare, unit settings Design for Musicals, practical and stylistic concerns Design for Opera Design for shows requiring simultaneous local Poetic or fragmented realism Design for contemporary episodic scripts Epic theatre design", "prerequisite": "THEA 250", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 451: Drafting, Drawing, and Painting for the Theatre", "department": "Theatre (THEA)", "credits": "1 Credits", "description": "Drafting, freehand drawing including perspective methods and property development, rendering techniques, and painters' elevations.", "prerequisite": "THEA 251", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 452: CAD Drafting for Theatre and other Entertainment Applications", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "CAD Drafting for theatre is an Advanced level course that focuses on the technical aspects of drafting. Students will become well versed in the use of CAD drafting programs such as AutoCAD. Students will learn all of the essential functions to accurately convey information through graphical representations in both 2D and 3D models. This course is geared specifically towards how to use CAD programs to convey information for theatrical and entertainment uses such a technical drafting, scenic elevations, lighting plots, sound diagrams and other entertainment documentation. In addition to learning about the effective use of a CAD program, students will also learn theatrical drafting standards and techniques. This includes information on standardized paper sizes, line weights and styles, use of color, dimensioning guidelines and other pertinent drafting standards. By the end of this course students will have the necessary knowledge to effectively draft, plate and present drawings in both 2d and 3d models for use in entertainment based productions.", "prerequisite": "THEA 251"}, {"course_name": "THEA 453: Advanced Scene Painting", "department": "Theatre (THEA)", "credits": "1-3 Credits/Maximum of 12", "description": "Practicum study in painting techniques currently in professional use. Exploration of tools, available paints, and texturing materials.", "prerequisite": "THEA 253", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 454: Period Research for the Theatre", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "History of decor, styles, and movements in art and architecture.", "prerequisite": "THEA 250", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 456: Scenic Projects for Production", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 6", "description": "Special projects for production; painting, properties, design assistance.", "prerequisite": "approval of proposed project by instructor prior to registration", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 457: Scene Design for Production", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 6", "description": "Design and execution of production projects.", "prerequisite": "approval of proposed project by instructor prior to registration", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 458: Digital Imaging for the Theatre", "department": "Theatre (THEA)", "credits": "1 Credits", "description": "Introduction to imaging software and its application in theatrical design and production.  THEA 458 Digital Imaging for the Theatre (1) This course will provide students with an introduction to digital imaging software and explore the use of this software in the theatrical design and production process. An introduction to Photoshop or similar programs will make up the first part of the course. As part of the introduction to software, course time will be devoted to image acquisition using techniques such as Web based research, scanning, and use of the digital camera. The remainder of the course will focus on applying imaging software to the process of evolving and presenting designs for scenery, costumes, and lighting. Design presentation will include output of images for applications such as projection, Web pages, and both large and small-scale printing.Students will execute a number of projects that will be turned in digitally to the instructor. Each project will have a specific objective and the grade will be outlined in a comment sheet.", "prerequisite": "THEA_BFA major or permission of program"}, {"course_name": "THEA 459: Theatre Portfolio & Business Practices II", "department": "Theatre (THEA)", "credits": "1 Credits", "description": "THEA 459 Theatre Portfolio & Business Practices II (1) This course is designed to prepare the student of design for life as a professional theatre designer. There are many challenges to working in the business of design, arising primarily from the fact that most theatre designers are self-employed. It's not enough to be a talented designer; one must also be a savvy business person. Contracts, taxes, record-keeping, resumes, portfolios, interviewing, job hunting, and legal considerations will all be addressed, as they relate to life as a freelance designer. Special attention will be paid to the assembly of a professional portfolio & website, which is the centerpiece of any modern designers' work.", "prerequisite": "THEA 159", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 460: Advanced Topics in Costume Design", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 6", "description": "Developing and executing a design concept in a variety of the performing arts.  THEA 460 Advanced Topics in Costume Design (3 per semester/maximum of 6) (BA) This course meets the Bachelor of Arts degree requirements.THEA 460 places emphasis on the use of text analysis and extensive historical research to make artistic choices as a costume designer in a production of a classical play, opera, or dance. Plays of this sort are of a size and scope not often found in contemporary material, which places exceptional demands on a designer. This course investigates the manner in which the theatrical imagination can be liberated to fulfill the particular requirements of classic theatre, opera, and dance. The course will require several large-scale projects that reinforce the costume design process in a variety of the performing arts. Each area of work within a project is separately graded. These projects will contain written segment components such as a design statement or character analysis, an oral presentation or explanation of the designer's choices and process, and (where applicable) a demonstration of the fully realized costume renderings. The student is expected to master the process that takes a costume designer from reading a script (or listening to a piece of music) to the creation of a design concept to the visual presentation of renderings from which clothing can be constructed. Particular emphasis is placed on developing the oral presentation skills necessary to communication with the director and other theatre artists.", "prerequisite": "THEA 260", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 461: Advanced Topics in Costume Construction and Technology", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 6", "description": "A specialized course in advanced costume construction techniques and theatrical costume technologies.  THEA 461 Advanced Topics in Costume Construction and Technology (3 per semester/maximum of 6) (BA) This course meets the Bachelor of Arts degree requirements.THEA 461 addresses the skills and techniques of theatrical costume construction necessary for the undergraduate student to understand and master in preparation for work within a professional costume setting. Emphasis is placed upon the creation of an historic silhouette as illustrated by a theatrical costume rendering for both men and women, with an eye to theatrical execution. Focus is placed on the production of clothing, as well as the creation of theatrical properties and accessories for the historic figure. The course will require several large-scale projects that reinforce the costume construction process in a variety of historic eras. Each area of work within a project is separately graded. These projects will contain supporting research and examine the understanding and identification of construction and accessory techniques as manifested in the costume rendering. A student's approach to problem solving, personal process, communication skills, and successful time management will also be addressed.", "prerequisite": "THEA 261", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 464: History of Fashion", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Survey of dress from Egyptian period to contemporary fashion.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 465: History of Fashion II", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Survey of dress from 1800 to contemporary fashion.  THEA 465 History of Fashion II (3)(BA) This course meets the Bachelor of Arts degree requirements.The course is the second part of the history of fashion that is an elective for graduate theatre students, is required for the B.F.A. Costume Design emphasis, and is an elective for the undergraduate theatre minor. The goal of the course is to identify and examine movements and trends in clothing and fashion from 1800 to the present. Each period is studied by using primary sources, slide presentations, and actual garments to illustrate the relationship between clothing and broad social, historical and artistic developments. Emphasis will be placed on plays that serve as particularly good examples of a period or style of fashion covered in the course. Grading will be based on periodic quizzes covering topics from class lectures, slide presentations, and textbook readings. There will be one oral presentation, a written comprehensive final exam, and assigned graphic presentations or 'redrawings' of clothing pieces. To complete these 'redrawings' the student will find a primary source or a photographic reproduction of a primary source and 'redraw' the garment. For example, a student may find a painting, a sculpture, or photo of a garment (usually on a figure) that represents the period being discussed in class. The student would then 'redraw' or copy that image, not trace, for the purposes of identifying the clothing pieces that are shown in the original. The 'redrawings' are graded not on the student's ability to draw but rather on the content, detail, and thoroughness of the pencil sketch.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 466: Costume Construction for Production", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 6", "description": "Execution of production projects in construction and shop management.", "prerequisite": "approval of proposed project by instructor prior to registration", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 467: Costume Design for Production", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 6", "description": "Design and execution of production design projects.", "prerequisite": "approval of proposed project by instructor prior to registration", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 470: Advanced Topics in Lighting Design", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 9", "description": "Advanced Topics in Lighting Design will rotate through opera, dance, non-traditional spaces, architecture, advanced technology, and color theory.  THEA 470 Advanced Topics in Lighting Design (3 per semester/maximum of 6) (BA) This course meets the Bachelor of Arts degree requirements.Advanced Topics in Lighting Design will utilize a rotating curriculum and may be taken twice for credit. Topics will include lighting design for opera, dance, non-traditional spaces, architecture, advanced technology, and color theory. Students will also learn to write and critique their own work, as well as the work of others, and to speak knowledgeably about design topics. There will also be some flexibility to allow students to pursue individual interests and group-directed projects.", "prerequisite": "THEA 270", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 472: Lighting Technology", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "An introduction to the basics of electricity, dimmer protocols, lightboard programming, lighting paperwork, and master electrician & assistant lighting design practices.  THEA 472 Lighting Technology (3)THEA 472 is an introduction to the basics of electricity, dimmer protocols, lightboard programming, lighting paperwork, and master electrician & assistant lighting design practices. This course will help prepare theatre designers to understand the inner workings of all of the equipment, working practices and safety requirements that are involved with the business of lighting design. This course will also provide students with many of the skills needed to get their foot in the door and get started in the business. Special attention will be paid to safety, stressing the need for safe working practices and environments over the need to get the show up no matter what. Students will learn how all of the advanced technology that is being introduced to the world of lighting functions and how these new technologies are all integrated into a functional system. Students will serve as master electricians and/or as assistant lighting designers as part of the hands-on production aspect of the class, with ample time devoted to process discussions and post-show critiques of the work. Small-group problem solving and system troubleshooting will be discussed in depth and applied to real production situations.", "prerequisite": "THEA 131"}, {"course_name": "THEA 474: Theatre Design History I", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course is the first half of a two-semester arc, intended to provide students with a fundamental understanding of the history of theatre design & technology. Beginning with the Greeks and continuing through to modern day, theatre is often a mirror to society, and it is essential that all of the designers, artisans, and craftspeople involved in each production have a visual and aural lexicon of history to draw from. In each area, we will investigate how the world history of the time influenced the creation of theatre productions, with particular attention paid to noteworthy designers, technicians, and craftspeople. Additionally, the evolution of various innovations will be studied to learn how they affected the history of theatre production, but also how theatre influenced the development of new technologies & methods. Theatre Design History I will cover the era from prehistory through to the beginning of the Industrial Revolution, along with specific study of multiple non-Western theatre traditions."}, {"course_name": "THEA 475: Theatre Design History II", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "This course is the second half of a two-semester arc, intended to provide students with a fundamental understanding of the history of theatre design & technology. Beginning with the Greeks and continuing through to modern day, theatre is often a mirror to society, and it is essential that all of the designers, artisans, and craftspeople involved in each production have a visual and aural lexicon of history to draw from. In each area, we will investigate how the world history of the time influenced the creation of theatre productions, with particular attention paid to noteworthy designers, technicians, and craftspeople. Additionally, the evolution of various innovations will be studied to learn how they affected the history of theatre production, but also how theatre influenced the development of new technologies & methods. Theatre Design History II will cover the era from the Industrial Revolution through to modern day.", "prerequisite": "THEA 474"}, {"course_name": "THEA 476: Lighting Technology for Production", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 6", "description": "THEA 476 is a 1-credit course fulfilling, in part, the requirements of the Theatre BFA Design & Technology Major. Students who are assigned to School of Theatre productions in the Lighting area as an Assistant Master Electrician, Master Electrician, Moving Light Programmer, or Lighting Systems Engineer, in support of the Lighting Design, are eligible to register. The course will be delivered as an independent study with the School's Lighting Design faculty, building on the skills learned in classes and previous productions.", "prerequisite": "THEA 289"}, {"course_name": "THEA 477: Lighting Design for Production", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 6", "description": "Design and execution of design projects.", "prerequisite": "THEA 289", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 480: Advanced Topics in Technical Direction for the Theatre", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 6", "description": "Advanced study of the methods, materials, equipment, facilities, concepts and processes associated with Technical Direction for the Theatre.  THEA 480 Advanced Topics in Technical Direction for the Theatre (3 per semester/maximum of 6) This course will build on the foundations established in THEA 280. Students will be engaged in studying advanced topics through discussions and explorations of current theatre technology, communication and the management systems used to control the processes associated with modern technical direction. Examples of topics include project management, current trends in drafting, advanced technical packages, and structural design for the stage. This course is repeatable and topics will vary.Students will participate in class discussions, hands-on exploration of equipment, investigate current practices through observation and research, and will complete projects associated with the topics studied.", "prerequisite": "THEA 280"}, {"course_name": "THEA 480B: Technical Production IV", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Discussion of problems of the technical director:  personnel management, time management, scheduling, budgeting, purchasing, and the technical drawing of production.", "prerequisite": "THEA 280", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 481: Stage and Production Management", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Production planning, scheduling, assignment of personnel, rehearsal procedures, and budgeting.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 482: Technical Production - Rigging", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "In-depth exploration of current rigging techniques used in entertainment.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 484: Sound Recording Techniques", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "Multi-track audio recording and post production techniques.  THEA 484 Sound Recording Techniques (3)THEA 484 will provide fundamental skills in recording an audio production. The first four weeks will cover basics of current recording equipment, basic microphone theory and placement according to principles of sound propagation within performance spaces. The second four weeks will expand on the principles of the first four weeks, considering the problems of recording in a variety of different locations and specific techniques for recording particular instruments. The final seven weeks will focus on work within a recording studio. Students will need to configure a mixer with a multi-rack digital recorder and create a mastered CD with all appropriate post processing (EQ, compression, reverberation, etc.). Students will work on teams for various recording projects, with one student serving as producer for each, so that they gain a comprehensive knowledge of the various duties involved in setting up and operating recording equipment. Team projects will make up the majority of the grading for the class. Periodic quizzes will be administered in order to check the progress of the students and ensure their comprehension of the material. Each student will complete a final project in lieu of a final exam. During the production of this project, they will also be expected to serve in ancillary roles for their classmates' projects. Their participation in these other projects will be considered in the grading of their final project.", "prerequisite": "INART 258A"}, {"course_name": "THEA 485: Sound for Theatre Production", "department": "Theatre (THEA)", "credits": "3 Credits/Maximum of 6", "description": "Aesthetics of live and recorded sound; recording and editing techniques for the stage.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 486: Stage Management for Production", "department": "Theatre (THEA)", "credits": "1-9 Credits/Maximum of 9", "description": "Stage manager for University Theatre production.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 487: Technical Projects for Production", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 6", "description": "Execution of practical production projects.", "prerequisite": "approval of proposed project by instructor prior to registration", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 489: Theatre Production Practicum", "department": "Theatre (THEA)", "credits": "1 Credits/Maximum of 99", "description": "Supervised experience in production techniques.  For theatre majors only.", "prerequisite": "THEA 289", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 490: London Study Tour", "department": "Theatre (THEA)", "credits": "3 Credits", "description": "An intensive academic and cultural experience in the theatre capital of the English-speaking world.  THEA 490H London Study Tour (3) Theatre-going forms the heart of the LST and of its academic identity. London is the outstanding theatre city of the English-speaking world, offering consistently superb choices in classic plays, contemporary and avant-garde theatre, musical theatre, opera and dance. Students will see a minimum of seven theatre and dance performances: some will be purchased in advance by the instructor, and others will be selected by participants from a wide range of choices. As a complement to the theatre core, the LST's faculty leaders will provide students with an orientation to London and its history, culture, and sights.", "other": ["Honors"]}, {"course_name": "THEA 494: Research Projects - Honors", "department": "Theatre (THEA)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activites on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "THEA 495: Internship Practicum", "department": "Theatre (THEA)", "credits": "1-6 Credits/Maximum of 12", "description": "Professional field experience in theatre performance, production, and management assignments.", "prerequisite": "THEA 100", "other": ["Bachelor of Arts: Arts", "Full-Time Equivalent Course"]}, {"course_name": "THEA 496: Independent Studies", "department": "Theatre (THEA)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 496H: Independent Studies - Honors", "department": "Theatre (THEA)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts", "Honors"]}, {"course_name": "THEA 497: Special Topics", "department": "Theatre (THEA)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 498: Special Topics", "department": "Theatre (THEA)", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"course_name": "THEA 499: Foreign Studies--Theatre Arts", "department": "Theatre (THEA)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "prerequisite": "THEA 100", "other": ["International Cultures (IL)"]}]