[{"course_name": "WFED 1: Education for Work:  Trends and Issues", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Overview of the history and philosophies of education for employment, current issues, and school to work transition system."}, {"course_name": "WFED 99: Foreign Studies", "department": "Workforce Education and Development (WFED)", "credits": "1-12 Credits/Maximum of 12", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript.", "other": ["International Cultures (IL)"]}, {"course_name": "WFED 100: Orientation to Teaching Vocational Industrial Education/Health Occupations Education Subjects", "department": "Workforce Education and Development (WFED)", "credits": "2 Credits", "description": "Basic elements of preparing to teach vocational trade and industrial/health occupations education subjects in the schools of Pennsylvania."}, {"course_name": "WFED 101: Early Field Experience in Teaching Vocational Industrial Education/Health  Occupations Education Sub", "department": "Workforce Education and Development (WFED)", "credits": "1 Credits", "description": "Discussion and observation of in-school practices to aid the student in making vocational industrial education/health occupations education career decisions."}, {"course_name": "WFED 105: Integrated Curriculum Implementation", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Occupational analysis for instructional planning; emphasis on instructional methods to deliver a competency based program in an integrated learning environment."}, {"course_name": "WFED 106: Program and Facilities Management", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Organization and management of learning laboratory to facilitate the delivery of a competency based program in a safe environment."}, {"course_name": "WFED 197: Special Topics", "department": "Workforce Education and Development (WFED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WFED 199: Foreign Studies", "department": "Workforce Education and Development (WFED)", "credits": "1-12 Credits/Maximum of 12", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript.", "other": ["International Cultures (IL)"]}, {"course_name": "WFED 207W: Assessment Techniques", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Assessment, recording, and reporting of learning in an integrated competency based vocational education system.", "prerequisite": "WF ED105", "other": ["Writing Across the Curriculum"]}, {"course_name": "WFED 270: Introduction to Industrial Training", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Overview of training profession.  Introduction to economic and psychological foundations.  Examination of relationship of industrial training to education.  WF ED 270 Introduction to Industrial Training (3) This course is designed to prepare individuals for a variety of training practitioner roles in businesses and industry. This course is actually the first of two courses and is an introduction to the required core courses for emphasizing the training and development professional curriculum in the Department of Adult Education, Instructional Systems and Workforce Education and Development. It is the intent of this course to equip participants with entry-level knowledge and skill to successfully pursue other designated professional core courses on needs assessment, organization development, and cross-cultural training. All of theses courses fall into the category called Human Resource Development (HRD).Industry trainers have had the opportunity to provide formal training to many persons with a wide variety of skills and competencies. Previous train-the-trainer courses in this series have addressed presentation techniques, assessment, facilities management and safety. This course will help trainers gain a total understanding of their role in the larger picture of Human Resource Development. Although traditional education is often focused on helping individuals lead better lives, training is usually focused specifically on the work that people do in one organizational setting. HRD deals with the financial value of human beings to organizations. In this course, the HRD field will be examined with respect to the training component with which participants are connected."}, {"course_name": "WFED 296: Independent Studies", "department": "Workforce Education and Development (WFED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "WFED 297: Special Topics", "department": "Workforce Education and Development (WFED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WFED 299: Foreign Studies", "department": "Workforce Education and Development (WFED)", "credits": "1-12 Credits/Maximum of 12", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript.", "other": ["International Cultures (IL)"]}, {"course_name": "WFED 310: Leadership Competencies for Supervisors", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Designed to teach contemporary supervisory leadership competencies for mid- career learners with front-line supervisory responsibilities in the workplace.  WF ED 310 Leadership Competencies for Supervisors (3) Leadership Competencies for Supervisors is a course designed primarily for adult learners engaged in supervisory roles and functions in the workplace. Its purpose is to ensure that all students are equipped with the contemporary supervisory leadership competencies that are needed to function effectively in today's workplace. Upon completion of this course, the student should be able to a) Recognize the important role and function of supervisory leadership, b) Relate common critical situations experienced by supervisors and how they were handled, c) Demonstrate proficiency in competency areas important to supervisory success such as effective communication strategies, methods for resolving conflict, managing employees, etc., and d) Demonstrate ability to develop individuals and teams. Students will be assessed and evaluated through quizzes, instructor and peer observation, self-assessments and reflection, and demonstration of project deliverables.", "prerequisite": "two years of work experience, or fourth-semester standing, or   prior approval by instructor"}, {"course_name": "WFED 323: Vocational Student Organizations", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Methods in originating, managing, and advising vocational student organizations."}, {"course_name": "WFED 395A: Trade and Industrial Occupational Experience", "department": "Workforce Education and Development (WFED)", "credits": "1-8 Credits/Maximum of 24", "description": "Individual work experience in manufacturing environment or skilled craft area to develop professional competence in specific occupation.", "prerequisite": "completion of an occupational learning period in the field   of certification or field of specialization", "other": ["Full-Time Equivalent Course"]}, {"course_name": "WFED 395B: Occupational Resources Competence", "department": "Workforce Education and Development (WFED)", "credits": "1-8 Credits/Maximum of 24", "description": "WF ED 395B Occupational Resources Competence (1-8 per semester/maximum of 24) Occupational Resources Competence is a course designed primarily for adult learners who demonstrate an adequate understanding of contemporary resource usage and management related competencies that are needed to function effectively in today's global business environment. These competencies include: resource usage, resource management, computer and basic literacy, and understanding of systems in the workplace. Students will demonstrate competence through documentation of tasks performed and reflection on specialized accomplishments.", "prerequisite": "completion of a two-year formal learning period in the field   of specialization", "other": ["Full-Time Equivalent Course"]}, {"course_name": "WFED 395C: Occupational and Professional Competence", "department": "Workforce Education and Development (WFED)", "credits": "1-8 Credits/Maximum of 24", "description": "WF ED 395C Occupational and Professional Competence (1-8 per semester/maximum of 24) Occupational and Professional Competence is a course designed primarily for adult learners who demonstrate an adequate understanding of contemporary professional mastery related competencies that are needed to function effectively in today's global business environment. These competencies include: interpersonal competence, oral and written communication, conceptual thinking, learning and information, self-responsibility and management in the workplace. Students will demonstrate competence through documentation of tasks performed and reflection on specialized accomplishments.", "prerequisite": "completion of a two-year formal learning period in the field of   specialization", "other": ["Full-Time Equivalent Course"]}, {"course_name": "WFED 395D: Occupational Work Experience", "department": "Workforce Education and Development (WFED)", "credits": "1-8 Credits/Maximum of 24", "description": "Individual work experience in the manufacturing, health, service, or financial arena.", "other": ["Full-Time Equivalent Course"]}, {"course_name": "WFED 397: Special Topics", "department": "Workforce Education and Development (WFED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WFED 399: Foreign Studies", "department": "Workforce Education and Development (WFED)", "credits": "1-12 Credits/Maximum of 12", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript.", "other": ["International Cultures (IL)"]}, {"course_name": "WFED 402: Supervision of Vocational Education", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "For administrators, supervisors, and teachers responsible for improvement of instruction through supervision or for students preparing for supervisory work."}, {"course_name": "WFED 403: Technologies for Work Effectiveness", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "This seminar-style course is designed to provide workforce professionals with opportunities to learn about contemporary workplace technologies, tools and platforms, share experiences, and to be able to make informed decisions regarding their use. The course will focus on technology affordance in specific contexts and a deeper understanding of the use of such technologies in terms of their benefits, costs and implementation challenges.", "prerequisite": "7th semester standing or higher or permission of program"}, {"course_name": "WFED 405: Project Management for Professionals", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Covers the essential concepts and skills needed to make effective contributions on projects, on time and within budget.  WF ED (ENGR) 405 Project Management for Professionals (3) Professionals in the workplace carry out many different projects every day ranging from somewhat small tasks, e.g.,planning events and designing courses, to big projects, e.g., launching an enterprise wide system. Project Management for Professionals is a practical \"hands-on\" course designed for mid-career adult students and covers the essential concepts and skills needed to make effective contributions and have an impact on the successful accomplishment of projects on time and within budget. Project management principles and techniques are presented with an emphasis on how they are applied to real world workforce development projects. Topics include the project management life cycle and process; techniques for planning, scheduling, budgeting, and controlling project performance; project manager responsibilities and skills; project team development and effectiveness; project communication; and organization structures.", "prerequisite": "4th semester standing. Students with no 4th semester standing need to provide evidence to the instructor of their work experience.", "other": ["Cross-listed with: ENGR 405"]}, {"course_name": "WFED 410: Leadership Competencies for Professionals", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Designed to teach contemporary professional leadership competencies for workforce professionals who do not currently have supervisory responsibilities.  WF ED 410 Leadership Competencies for Professionals (3) Leadership Competencies for Professionals is a course designed primarily for adult learners who demonstrate high leadership potential and who may not have significant supervisory and managerial responsibilities. Its purpose is to ensure that all students develop an adequate understanding of the contemporary professional leadership competencies that are needed to function effectively in today's global business environment. These competencies include: collaboration / multi-disciplinary team-building, leadership in diversely distributed team environments, interpersonal communication in the workplace, conflict resolution / human performance management, project management, problem-solving / creative thinking / ethical decision making, and contemporary and emerging technology usage. Students will be assessed and evaluated through quizzes, instructor and peer observation, self-assessments and reflection, and team projects and presentations.", "prerequisite": "two years of work experience, or fourth-semester standing,   or prior approval by instructor"}, {"course_name": "WFED 411: Occupational Safety and Health for Workforce Education and Development     Professionals", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "This course assists participants in creating and supporting workplaces and educational environments free of occupational safety and health hazards.  WF ED 411 Occupational Safety and Health for Workforce Education and Development Professionals (3) This course is designed to offer participants the knowledge and skills they need to create and support workplaces and educational environments free of occupational safety and health hazards. It provides Occupational Safety and Health Administration (OSHA) compliance and workplace safety training to educators, managers, supervisors, and other employees in the Career and Technical Education field as well as the Oil and Gas Drilling Industry, Advanced Manufacturing, and Construction industries.", "prerequisite": "a minimum of 2 years work experience or 4th semester standing"}, {"course_name": "WFED 413: Workforce Education for Diverse Learners", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "This course assists students in creating and supporting educational environments which promote enhanced learning and skill development for diverse learners. A primary focus is placed on program modifications, supplementary services, and resources required for diverse learners (including learners with disabilities) in workforce development and education programs. Topics such as the role of assessment and how it can be utilized to bring about positive changes in curriculum and pedagogy to promote the transfer of learning will be addressed. This course will also introduce participants to instructional tools and strategies that will help teach to multiple levels of student abilities. Workforce education program modifications, supplementary services, and resources required for diverse learners will be provided throughout this course. Students will also learn to develop specialized adaptations and accommodations for diverse learners."}, {"course_name": "WFED 414: Teaching Career and Technical Education Content to Diverse Learners", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "This course explores the legal aspects of transitioning students from school to college and work, to assist Career and Technical Education (CTE) teachers in becoming active participants in assisting learners with special needs. Topics such as the role of assessment and how it can be used to bring about positive changes in curriculum and pedagogy to promote enhanced learning and skill development will be addressed. This course will also introduce participants to instructional tools and strategies that will help teach to multiple levels of student abilities. This course explores the legal aspects of transitioning students from school to college and work, to assist Career and Technical Education (CTE) teachers in becoming active participants in assisting learners with special needs. Topics such as the role of assessment and how it can be used to bring about positive changes in curriculum and pedagogy to promote enhanced learning and skill development will be addressed. This course will also introduce participants to instructional tools and strategies that will help teach to multiple levels of student abilities. Workforce education program modifications, supplementary services, and resources required for diverse learners will be provided throughout this course. Students will learn to develop specialized adaptations and accommodations based on educational research to promote the transfer of knowledge and skill. Special attention will be placed on data driven decisions in workforce education and the role CTE teachers.", "prerequisite": "WFED 105"}, {"course_name": "WFED 424: Facilitating Career Development", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "This course provides individuals with relevant skills and knowledge to assist others in planning careers and obtaining meaningful work.  CN ED (WF ED) 424 Facilitating Career Development (3) This course provides individuals with relevant skills and knowledge to assist others in planning careers and obtaining meaningful work. This course addresses the following 12 Career Development Facilitator (CDF) competencies: 1) helping skills, 2) labor market information and resources, 3) assessment, 4) diverse populations, 5) ethical and legal issues, 6) career development models, 7) employability skills, 8) training clients and peers, 9) program management/implementation, 10) promotion and public relations, 11) technology, and 12) consultation. These 12 competencies are identified by the National Career Development Association (NCDA) for those who (will) deliver career development programs and services in a variety of settings. Potential job titles of CDFs include career group facilitator, job search trainer, career resource center coordinator, career coach, career development case manager, intake interviewer, occupational and labor market information resource person, human resource career development coordinator, employment/placement specialist, and workforce development staff. With certain years of work experience in career development, students who complete this course are eligible to apply for the Global Career Development Facilitator (GCDF) certification through the Center for Credentialing & Education (CCE), which is affiliated with the National Board for Certified Counselors (NBCC). A GCDF is a person who works in any career development setting or who incorporates career development information or skills in their work with students, adults, clients, employees, or the public. As of January 2011, about 18,000 individuals acquired the GCDF certification world-wide including Bulgaria, Canada, China, Germany, Japan, Romania, Turkey, South Korea, and New Zealand. The goal of the GCDF credential was to provide standards, training specifications, and credentialing for diverse career development practitioners. This GCDF credential differentiates two levels of career practice, which are 1) career counseling and 2) career facilitation that does not require a counseling degree. This differentiation reflected the reality where many individuals who are currently providing career assistance are not professional counselors. This course is taught by a nationally and internationally trained CDF Instructor (CDFI) who is certified by the NCDA. In addition, the CDF curriculum is updated every three years by the Career Development Leadership Alliance (CDLA) under the supervision of the NCDA CDF Advisory Council in order to keep up with recent changes in the field.", "prerequisite": "300-400 level Psychology, HD FS, or Education courses or   permission of the program", "other": ["Cross-listed with: CNED 424"]}, {"course_name": "WFED 428: Fiscal Accounting and Management for Workforce Development Professionals", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits/Maximum of 3", "description": "This course explores the subject of accounting through the sub-disciplines of financial and managerial accounting for Workforce Development Professionals.", "prerequisite": "two years of work experience, or fifth semester standing, or prior approval by instructor"}, {"course_name": "WFED 441: Conceptual and Legal Bases for Cooperative Vocational Education", "department": "Workforce Education and Development (WFED)", "credits": "2 Credits", "description": "History, conceptual and legal bases for a cooperative vocational education program.", "prerequisite": "WF ED445"}, {"course_name": "WFED 442: Operating Cooperative Vocational Education Programs", "department": "Workforce Education and Development (WFED)", "credits": "2 Credits", "description": "Student and training station selection, training plan and related subject development, records and reporting systems, school-industry coordination.", "prerequisite": "WF ED441"}, {"course_name": "WFED 445: Vocational Guidance", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Problems and possibilities of vocational guidance; the field of guidance and guidance literature; methods of field work; school guidance techniques.", "prerequisite": "WF ED105 ; fourth-semester standing"}, {"course_name": "WFED 450: Cultural Diversity in the Workplace", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Provides opportunities for students to explore different cultures and mores that are changing the dynamics of the workplace.", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "WFED 451: Lean-Sigma for Professionals", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "The course focuses on essential lean and six sigma concepts to improve processes in any industry.", "prerequisite": "two years of relevant work experience or fourth semester standing   or prior approval by program"}, {"course_name": "WFED 471: Training in Industry and Business", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Appraisal of training functions and development of competencies in work analysis, design, development, delivery, and evaluation of training.", "prerequisite": "seventh-semester standing or higher"}, {"course_name": "WFED 472: Platform Skills for Workplace Learning and Performance", "department": "Workforce Education and Development (WFED)", "credits": "3 Credits", "description": "Platform skills focuses on theory and practice related to delivering well-crafted and effective training presentations. Platform skills are particularly critical in business, industry and technical education, as the content covered in these fields involves direct application of the cognitive, affective and psychomotor learning domains in real world situations. Therefore, the purpose of this course is to provide participants with the skills and abilities needed to develop and deliver high quality professional presentations within business, industry and applied educational settings. Through this highly dynamic and interactive course, students will enjoy using their creativity to successfully communicate important information through oral presentations. A major emphasis will be placed experiential teaching and learning techniques and theory to practice connections which will enable participants to develop and deliver well-crafted and effective training presentations, while having fun in the process."}, {"course_name": "WFED 495: Internship", "department": "Workforce Education and Development (WFED)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised off-campus, nongroup instruction including field experiences, practicums, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "WFED 495A: Cooperative Education Practicum", "department": "Workforce Education and Development (WFED)", "credits": "2 Credits", "description": "Validation of competencies learned in prerequisite courses during interaction with professional staff while functioning under the supervision of a certified cooperative coordinator.", "prerequisite": "WF ED445"}, {"course_name": "WFED 495C: Student Teaching", "department": "Workforce Education and Development (WFED)", "credits": "10 Credits/Maximum of 10", "description": "Supervised observation and practice teaching in approved vocational industrial schools/health occupations education settings.", "prerequisite": "successful completion of occupational competency evaluation. PA   Act 34 clearance required. In addition, non-Pennsylvania   residents must provide evidence of an FBI background information   check. (Forms: 228 Chambers)"}, {"course_name": "WFED 495D: Instructional Internship in Industrial Training", "department": "Workforce Education and Development (WFED)", "credits": "5 Credits", "description": "Supervised internship in industrial training. Interns will be expected to perform instructional duties in industrial environments.", "prerequisite": "WF ED105 , WF ED106 , WF ED207W , WF ED270 , WF ED471 ; successful completion of occupational competency examination"}, {"course_name": "WFED 496: Independent Studies", "department": "Workforce Education and Development (WFED)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "WFED 497: Special Topics", "department": "Workforce Education and Development (WFED)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WFED 499: Foreign Studies", "department": "Workforce Education and Development (WFED)", "credits": "1-12 Credits/Maximum of 12", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Several different topics may be taught in one year or semester. A specific title may be used in each instance and will be entered on the student's transcript.", "other": ["International Cultures (IL)"]}]