[{"course_name": "WFS 150S: First-Year Seminar", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "The objectives of this first-year seminar course are to: (1) Engage and prepare first-year college students for academic success by orienting them to the scholarly community and introducing them to available academic resources. (2) Introduce students to Pennsylvania's forests and some of the research and other activities currently underway at Penn State that supports the conservation and management of these resources. (3) Introduce students to strategies they can use while at Penn State to prepare for careers related to forestry, wildlife/fisheries, and other natural resources disciplines.", "other": ["First-Year Seminar"]}, {"course_name": "WFS 209H: Wildlife and Fisheries Conservation", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Survey of current and historical issues in wildlife and fisheries conservation; emphasis on vertebrate biodiversity, habitat management and protection, and populations.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors"]}, {"course_name": "WFS 209N: Wildlife and Fisheries Conservation", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "The conservation and management of our natural resources is critical to all aspects of human existence. Wildlife and fishery resources are integral to our food supplies, the quality of our lands, and form a deep foundation of our culture. This course will introduce students to fisheries and wildlife and basic ecological principles as they relate both to the natural and human-influenced environment. It is open to all students with a basic background in biology. Students will learn to identify and analyze the interacting components of fisheries and wildlife systems and to apply basic ecological principles to current wildlife and fisheries management and conservation issues. The course will explore the basic tools, practices, and concepts used in the conservation and management of fish, wildlife, and their respective habitats. The course will also explore the human dimensions aspects of managing common property resources, like fish and wildlife, including the roles various stakeholders have in the management of these resources.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "WFS 296: Independent Studies", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"course_name": "WFS 297: Special Topics", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WFS 299: Foreign Studies", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "WFS 300: The Vertebrates", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "Overview of the evolution, systematics, ecology, and behavior of the subphylum vertebrata.  W F S 300 The Vertebrates (2) The purpose of this course is to introduce students to vertebrate zoology and will include overviews of vertebrate evolution, systematics, anatomy, physiology, ecology, and behavior. The course will begin by introducing the phylum Chordata. The cephalochordata, amphioxus (Branchiostoma lanceolatum), will be discussed and used as a model of a prevertebrate. The basic organization and theories of vertebrate evolution will be reviewed. The superclasses, Agnatha and Gnathostomata, will be introduced. The origin of each of the major group of vertebrates will be traced. The general approach will be phylogenetic and include discussions of the major changes associated with each group's evolution and selected elements of their extant diversity and biology.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 301: Vertebrate Laboratory", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "W F S 301 Vertebrate Laboratory (2) The purpose of this course is to introduce students to the anatomy of the vertebrates and to expose students to the diversity of vertebrates that reside in Pennsylvania. Students will dissect and learn the anatomy of the dogfish, frog, and cat or mink. Additional laboratory periods will concentrate on collecting/observing, and identifying fish, amphibians, reptiles, birds, and mammals. Museum curation techniques will be taught, and students will be required to construct dichotomous keys to specimens that inhabit Pennsylvania. The identification part of the course is meant to introduce students to representatives of the taxa that occur within the Commonwealth in preparation for higher-level courses in ichthyology, herpetology, ornithology, or mammalogy. Collection techniques will emphasize the proper collection and preservation of organisms for natural history museums."}, {"course_name": "WFS 310: Wildlife and Fisheries Measurements", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Wildlife and Fisheries Measurements will introduce students to basic measurements used to describe fish and wildlife populations and their habitats. Laboratory exercises will stress sampling approaches and implementation, common techniques for collecting information about amphibians, fish, birds, and mammals and their respective habitats, mapping and orienteering, and methods for summarizing and reporting findings."}, {"course_name": "WFS 340: Statistics for Conservation of Wild Populations", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Statistics for Conservation of Wild Populations provides an overview of the statistical techniques used by wildlife and fisheries biologists to research wild animal populations and guide management and conservation. Wildlife and fisheries researchers use many approaches that are not taught in general statistics classes, because they deal with wild populations that cannot be censused, randomly sampled, or consistently resampled. We will cover methods used to estimate animal abundance, survival, occupancy, and habitat use, as well as how we can test hypotheses about individual, temporal, and spatial variation. Students will learn how to implement these methods using standard statistical software (such as program R and MARK), how to determine the best method for answering a question, and how to interpret statistical results in the context of management and conservation.", "prerequisite": "STAT 200"}, {"course_name": "WFS 406: Ornithology Laboratory", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "W F S 406 Ornithology Laboratory (2) Ornithology Laboratory establishes the basic skills for identifying bird species in the field. This laboratory and field course is open to students with some background in wildlife and should be taken after completing or at the same time as the ornithology lecture course. The objectives of this course are for students to use laboratory specimens, identification software, field guides, and instructor-led field trips to 1) define, locate, and recognize anatomical features used to describe birds and characterize families; 2) recognize and identify approximately 160 species of birds by sight and approximately 60 by song in the field and/or lab; and 3) describe habitat, seasonal abundance, and distribution of bird species within the state. Most weeks include an introductory lecture followed by field instruction."}, {"course_name": "WFS 407: Ornithology", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Introduction to the biology, ecology, adaptations, and conservation of birds.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 408: Mammalogy", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "IDENTIFICATION, SYSTEMATICS, CHARACTERISTICS, ADAPTATIONS, ECOLOGY, BEHAVIOR, NATURAL HISTORY AND CONSERVATION, AND SOCIO-ECONOMIC ASPECTS OF MAMMALS.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 409: Mammalogy Laboratory", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "W F S 409 Mammalogy Laboratory (2) Mammalogy Laboratory provides the necessary skills for identifying North American mammals. Taken concurrently with or after completing the mammalogy lecture course, this laboratory and field course is open to students with some background in wildlife. The objectives of this course are for students to 1) identify North American mammals by skulls and skins, 2) identify eastern North American mammals by tracks in the field, 3) capture and measure small mammals, and 4) gain an understanding of the characteristic behavior and ecology of North American mammals. Fields skills include animal handling, tracking, and observation. Additional skills may include skin and skull preparation and museum techniques for the care of mammals."}, {"course_name": "WFS 410: General Fishery Science", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Introduction to the study, management, and uses of fish populations; methods of investigation, culture, and harvest of fishes."}, {"course_name": "WFS 422: Ecology of Fishes", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Role of fishes in aquatic communities and general ecosystems.  Environmental factors influencing fish as individuals, populations, and communities.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 430: Conservation Biology", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "The application of biological principles to issues in the conservation of biodiversity.  FOR (W F S) 430 Conservation Biology (3) This course applies basic principles of ecology and genetics to issues regarding the conservation forested ecosystems and their associated fisheries and wildlife. The objective of this course is to provide a broad appreciation of the concepts in conservation biology that are important to solving contemporary natural resources problems. Students will be exposed to the history of conservation biology, values of biodiversity, definitions of species concepts, protecting the genetic structure of species, extinction as a natural process, vulnerability to extinction, biodiversity at the community, ecosystem, and landscape levels, habitat fragmentation, metapopulations, legal aspects of conservation, ecosystem management, exotic species, pollution, human population issues, measuring genetic diversity, attitudes towards nature, ex-situ conservation, and ecosystem restoration.", "prerequisite": "BIOL 220W", "other": ["Cross-listed with: FOR 430"]}, {"course_name": "WFS 435: Limnology", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Biogeochemistry and natural history of freshwater ecosystems.  W F S (E R M) 435 Limnology (3)This course will define and describe major principles (physical, chemical, biological, and ecological) that govern the structure and function of freshwater ecosystems (ponds, lakes, and rivers). Current scientific literature will be critically reviewed and discussed in relation to comparative philosophy, methodology, and case studies that cover a range of topics in limnology. The objectives of E R M (W F S) 435 are to familiarize students with the major physical properties, chemical cycles, taxonomic groups of organisms, and ecological interactions that define and describe the natural function of aquatic ecosystems. The course will use case studies to illustrate and examine pertinent issues (e.g., excessive material loading, introduction to exotic species, habitat fragmentation, and climate change) that can alter the structure and function of aquatic ecosystems. Knowledge of these basic ecosystem principles will be applied towards formulating real-life resolutions to the issues identified in class, in order to better manage aquatic resources (methods to reduce material loads, transport controls of exotic species, habitat restoration, and reduction of global gases). This course will be useful to both undergraduate and graduate students seeking degrees in Environmental Resource Management, Wildlife and Fisheries Science, Ecology, and other related subjects. At the undergraduate level, the course will serve as a 400-level selection in both the Environmental Resource Management and Wildlife and Fisheries Science degree programs. At the graduate level, the course will compliment several Wildlife and Fisheries courses that form the compliment of that degree program. Moreover, the course can satisfy the course requirement for ecosystems ecology in the inter-college Ecology graduate program and serve as a breadth course in Water Resources for graduate students in the Watershed Stewardship program.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: ERM 435"]}, {"course_name": "WFS 436: Limnological Methods", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Application of current methodologies to evaluate the biological, chemical, and physical characteristics of aquatic ecosystems.  E R M (W F S) 436 Limnological Methods (3)Limnological Methods will instruct students to apply state of the art analytical measurements in order to gain an understanding of how and why ecosystems support specific biodiversity and biogeochemical cycles. The course will help students define key ecological elements (e.g., ecosystem metabolism, resource limitation, predator-prey relations) in both qualitative and quantitative terms, thereby making them tangible, tractable, and readily understandable. The course will use an instructional rubric to integrate conceptual, analytical, and communicative exercises in order to instruct students about how to evaluate variation in natural ecosystems. This course provides experiential training in the scientific process (rubric), so students can learn by doing, thereby internalizing their knowledge. Course content is organized into three 5-week sections, each of which will emphasize one component of the biogeochemical cycle (physical, chemical, biological). In each section, students will carry out a focused group study designed to evaluate how a pertinent environmental perturbation can affect that component of the aquatic biogeochemical cycle. The course content in each five-week block will have students: 1) review the experimental design and hypothesis, 2) implement the experimental design in the field or laboratory, 3 and 4) process and analyze samples in the laboratory, and 5) make statistical and graphical evaluations of the experimental results relative to their hypothesis (in class) and present these findings in written form. Knowledge of these basic ecosystem principles will be applied towards formulating real-life solutions to the issues identified in class, in order to better manage aquatic ecosystems. This course will be useful to undergraduate students seeking degrees in Environmental Resource Management and Wildlife and Fisheries Science, as well as graduate students pursuing degrees in Ecology, Forest Science, Wildlife and Fisheries Science, Watershed Stewardship, and other related subjects. At the undergraduate level, the course will serve as a 400-level elective in Environmental Resource Management degree program, Wildlife and Fisheries Science degree program, and the inter-college Marine Science option. At the graduate level, the course will complement several Forest Science and Wildlife and Fisheries courses. Moreover, the course can also satisfy the requirements for the ecosystems ecology focus in the inter-college Ecology graduate program. Grades will be based on three research papers, and a final laboratory practical.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: ERM 436"]}, {"course_name": "WFS 446: Wildlife and Fisheries Population Dynamics", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Concepts and estimation of mammalian, avian, and fish populations; processes of mortality, natality, growth, and regulation.", "prerequisite": "W F S209"}, {"course_name": "WFS 447M: Wildlife Management", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Management of renewable wildlife resources by applying ecological concepts, habitat evaluation, and decision-making; writing and editing reports are emphasized.", "other": ["Honors", "Writing Across the Curriculum"]}, {"course_name": "WFS 447W: Wildlife Management", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Management of renewable wildlife resources by applying ecological concepts, habitat evaluation, and decision-making; writing and editing reports are emphasized.", "prerequisite": "W F S209 or W F S309", "other": ["Writing Across the Curriculum"]}, {"course_name": "WFS 450: Wetland Conservation", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Wetland types, classification, functions and values; hydrology, soils, and plants; introduction to wetland identification and delineation; wetland regulations.  E R M (W F S) 450 Wetland Conservation (3) Wetlands are unique ecosystems, differing in many ways from both terrestrial and aquatic environments. They provide recognized values and functions to society, although these values and functions remain difficult to quantify. The study of wetlands is interdisciplinary, requiring background knowledge in science, management and policy disciplines. This course will explore the variety of wetland types and functions, and emphasize the diverse hydrological, biological, chemical, and physical interactions that occur within wetlands. Because wetlands are recognized as valuable assets in the landscape, issues surrounding wetland management and regulation have taken on increased importance; we will address these issues as well. Topics will also include the restoration of degraded wetlands and wetland creation, along with the construction of wetlands for pollution abatement.Students will become familiar with different wetland types and how they are classified, and will develop skills in understanding the interactions between wetland hydrology, hydric soils and hydrophytic vegetation. They will also develop an understanding of important national and state policies and regulations pertaining to wetlands and their protection and delineation. Classroom assessment will be based on three cumulative exams, homework assignments, and a final project.The course will fulfill 3 credits of electives or technical selections in the Wildlife and Fisheries Science major. Other students university-wide may be interested in the course, and the intention is to develop a course that is accessible to a wide variety of traditional and non-traditional students. For proper instruction, a technology classroom with computer projection equipment will be required.E R M 450 will be offered each fall semester. Enrollment will be limited to 60-80 students.", "prerequisite": "E R M300 or W F S209", "other": ["Cross-listed with: ERM 450"]}, {"course_name": "WFS 452: Ichthyology", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "Ichthyology is the study of fishes, the largest and most diverse group of vertebrate animals. This course covers a wide range of topics including systematics, classification, morphology, physiology, behavior, and ecology of fishes. Students will learn the characteristics and natural history of the major groups of fishes and consider conservation and management implications.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 453: Ichthyology Laboratory", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "Ichthyology Laboratory establishes the basic skills for identifying freshwater fish with a focus on the fishes of Pennsylvania. Students use laboratory specimens, field guides, and dichotomous keys to define and recognize anatomical features used to describe fish and characterize families. Students learn to identify fish species using scientific and common names and to describe factors that affect the distribution and abundance of species across the state. Field trips to local waterways allow students to learn collecting techniques and practice identification skills in the field.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 454: Field Ichthyology", "department": "Wildlife and Fisheries Science (WFS)", "credits": "2 Credits", "description": "Field Ichthyology is designed familiarize students with collection, observation, and field identification of Pennsylvania's fish fauna. Students will get hands-on instruction on how to collect, preserve, catalog, curate, and observe fishes. Additionally, students will learn how to gather pertinent in situ behavioral and distribution information on fishes and how to manage, record, and store field data. With the increasing emphasis on biodiversity and environmental monitoring, students need to be able to collect, manage, and store data as well as secure the chain of custody. This course is offered annually in partnership with agencies, research centers, and universities within Pennsylvania. Classes begin Sunday evening and extend until Friday afternoon. After the three-hour introductory class on Sunday evening, students meet each day for field collections/observations from 8am-5pm (weather dependent). In the evenings, students reassemble in the laboratory for additional activities and lectures. On one day, a series of night collections is made that extends until midnight. Students are responsible for their motel and food expenses during the week. All transportation to and from the collection sites is provided. The class will meet at least four times by appointment during the fall semester to enable students to process preserved samples that they collected.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 460: Wildlife Behavior", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Scholarly discussion and critique of history, concepts, and application of wildlife behavioral concepts to conservation issues. The course will give an in-depth coverage of concepts related to an understanding of wildlife behavior. Particular focus will be given to a discussion, critique, and development of these concepts and their application to contemporary issues in conservation and natural resource management of wildlife because there is a general lack of understanding of behavior by conservationists and natural resource managers.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 461: Animal Welfare: Science and Ethics", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Understanding animal welfare and well-being in farmed, wild and captive animals, and the implications for policy, legislation and conservation.  Whether we interact with farmed animals, wild animals in natural settings, or captive reared wild animals bred for research or for re-introductions, there is a growing interest in their welfare. What do animals need to manifest good welfare and well-being? To find answers we need to devise experiments that determine what animals want and what they find aversive. This allows us to find ways to decrease fear and stress associated with handling and captivity. This course covers the practical issues of animal welfare; animal ethics in wildlife management, conservation, and agriculture; and the use of animals in research. The course provides a framework with which to consider philosophical positions on animal use (covering aspects such as rights-based views versus utilitarian views) and the history of ethical debate over the interactions that humans have with other species. The course also addresses the current social, economic, and legal developments related to animal welfare and animal ethics.", "prerequisite": "BIOL 110"}, {"course_name": "WFS 462: Amphibians and Reptiles", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "This course explores the evolution, ecology, and conservation of amphibians and reptiles. This course is open to all students with some background in biology. The objectives of this course are for students to 1) describe the evolution, anatomy, reproduction, and physiology of amphibians and reptiles, 2) place contemporary research in the context of the natural history traits and behavioral ecology of herps, and 3) critically evaluate the application of these concepts to natural resource management for salamander, frog, turtle, lizard, and snake species and populations.", "prerequisite": "5th Semester standing or higher and 6 credits of BIOL"}, {"course_name": "WFS 463W: Fishery Management", "department": "Wildlife and Fisheries Science (WFS)", "credits": "3 Credits", "description": "Management of sport and commercial fisheries, including biological, political, social, and economic factors; regulations and other management techniques.  W F S 463W Fishery Management (3) This course will introduce students to the management of recreational and commercial fisheries. The course emphasizes fishery management as a goal-oriented process that adapts over time to changes in fish populations and societal goals. Students will learn to recognize and understand that ecological, economic, political, and social forces shape this management process. Major methods of fisheries management involving people, population, and habitat management will be surveyed. Case studies highlighting the application of these management strategies to current fishery management are explored. Writing reports and management plans is emphasized.", "prerequisite": "W F S209 , W F S300 , W F S301 , W F S310", "other": ["Writing Across the Curriculum"]}, {"course_name": "WFS 489: Supervised Experience in College Teaching", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-3 Credits/Maximum of 3", "description": "The Supervised Experience in College Teaching course provides select undergraduate students with formal, supervised teaching experience in a Wildlife and Fisheries Science course. Faculty recruit students who excel in a particular course to serve as undergraduate teaching assistants for subsequent offerings of that course. Duties may include serving as peer tutors, teaching assistants, or laboratory assistants, and developing and/or evaluating course activities and materials. Students participating in this course will develop a deeper understanding of the focus course material by actively helping teach the material. The course is only available to students who are invited to serve as teaching assistants for a Wildlife and Fisheries Science course and enrollment is by permission of the instructor.", "prerequisite": "Permission of program"}, {"course_name": "WFS 494: Undergraduate Research", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-12 Credits/Maximum of 999", "description": "Supervised student activities on research projects identified on an individual or small group basis.", "prerequisite": "Permission of the Wildlife and Fisheries Science Program"}, {"course_name": "WFS 494H: Undergraduate Research", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-12 Credits/Maximum of 999", "description": "Supervised student activities on research projects identified on an individual or small group basis", "prerequisite": "Permission of the Wildlife and Fisheries Science honors adviser,   Schreyer Honors College", "other": ["Honors"]}, {"course_name": "WFS 495: Wildlife/Fisheries Internship", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised field experience related to the student's major.", "prerequisite": "approval of proposed assignment by instructor prior to   registration", "other": ["Full-Time Equivalent Course"]}, {"course_name": "WFS 496: Independent Studies", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "WFS 497: Special Topics", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WFS 499: Foreign Studies", "department": "Wildlife and Fisheries Science (WFS)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]