[{"course_name": "WMNST 1: Introduction to Women's Studies", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Interdisciplinary consideration of the scholarly theories and research pertaining to women's experiences and women's status in contemporary American society.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "WMNST 8: Gender Matters", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Feminism is one approach to addressing systematic oppressions of both women and men. This course examines various feminist philosophical approaches to issues such the construction of gender, sex, and sexuality, the nature of gender injustice, and the intersectionality of oppressions. It also addresses contemporary issues, including sexual harassment and assault, abortion, explicit and implicit bias, and discrimination and exclusion.", "other": ["Cross-listed with: PHIL 8", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 83N: First-Year Seminar in Women's Studies", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "WMNST 83N First-Year Seminar in Women's Studies (3) This course introduces first-year students to the complex and interdisciplinary field of Women's, Gender, and Sexuality Studies. Students develop an understanding of a feminist approach to understanding stratifications of power and privilege in society not only impact but co-constitute constructions of gender and sexual identity that are sometimes at odd with an individual's lived experience. Students learn that social variables such as gender, age, social class, religion, ethnicity, race, sexual orientation and place of residence affect the way people view the world, behave and communicate. Students will develop the ability to locate, organize, and evaluate information about these identity intersections from a variety of sources, and use them to synthesize and analyze their own lived experience as a gendered being. Through the reading of texts, discussions, debates, and individual and collaborative projects, students are introduced to: feminist analysis of current topics and issues in women's and gender studies; to using women's and gender studies as a discipline and form of critical engagement; to the concepts of interdisciplinary vs. multidisciplinary research and scholarship; to intersectional analysis of identity, power, and oppression; to scholarly conduct and responsibilities Students will be expected to develop an understanding of current issues and debates within and beyond the field of women's and gender studies as they relate to contemporary fiction and nonfiction writing as well as feminist thought through social media. Students will recognize that social variables such as gender, age, social class, religion, ethnicity, race, sexual orientation, and place of residence affect the way people view the world, behave, and communicate. Students will develop the ability to locate, organize, and evaluate information about these identity intersections from a variety of sources and use them to synthesize and analyze their own ideas as well as come to an understanding regarding the stratification of power and privilege in society.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "First-Year Seminar", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 100: Introduction to Women's and Gender Studies", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This introductory survey course fulfills requirements for General Education in Social Sciences, the Bachelor of Arts degree in Social and Behavioral Sciences, and US and International Cultures competence. It is also a prerequisite for upper-level courses in Women's, Gender, and Sexuality Studies. This class focuses on women's shared and unshared experiences, issues of gender roles and stereotyping, questions related to sex/gender systems, and the different disciplinary approaches to the study of women and gender. The course asks how women's behavior, activities, accomplishments, roles, sexuality and status have been shaped by biological, psychological, sociological, cultural, historical and political determinants, as well as by women's experiences based on their racial, class and sexual identities. Topics include the history of women's liberation movements, women's experiences in home, work and educational settings, gender roles and stereotyping as influenced by media, culture, education, and other social institutions, health and body image issues, and multiple forms of oppression. The course will focus equally on feminist issues in both the US and on a global scale and is both interdisciplinary (drawing information and readings from history, psychology, political science, and sociology) and broadly inclusive (addressing at all times the relationship between gender, race, class, ethnicity and sexual orientation).", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 100U: Introduction to Women's and Gender Studies", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This introductory survey course fulfills requirements for General Education in Social Sciences, the Bachelor of Arts degree in Social and Behavioral Sciences, and US and International Cultures competence. It is also a prerequisite for upper-level courses in Women's, Gender, and Sexuality Studies. This class focuses on women's shared and unshared experiences, issues of gender roles and stereotyping, questions related to sex/gender systems, and the different disciplinary approaches to the study of women and gender. The course asks how women's behavior, activities, accomplishments, roles, sexuality and status have been shaped by biological, psychological, sociological, cultural, historical and political determinants, as well as by women's experiences based on their racial, class and sexual identities. Topics include the history of women's liberation movements, women's experiences in home, work and educational settings, gender roles and stereotyping as influenced by media, culture, education, and other social institutions, health and body image issues, and multiple forms of oppression. The course will focus equally on feminist issues in both the US and on a global scale and is both interdisciplinary (drawing information and readings from history, psychology, political science, and sociology) and broadly inclusive (addressing at all times the relationship between gender, race, class, ethnicity and sexual orientation).", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 101H: The African American Woman", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "The sociological, historical and political experiences of African American women, their roles and contributions to society.", "other": ["Cross-Listed", "General Education: Humanities (GH)", "Honors"]}, {"course_name": "WMNST 101N: African American Women", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course offers an introduction to the sociological, historical, and political experiences of African American women, their roles and contributions to society. Through an interdisciplinary approach, we will pay particular attention to historical and contemporary responses to intersectional challenges African American women face. Drawing from the 19th, 20th, and 21st centuries, through the use of print and digital texts, oral histories, film, music, poetry, and local events, we will investigate various forms of social and political activism including work in labor, civil rights, black power, feminist, womanist, and other movements, the impact of popular culture on what it means to be an African American woman, as well as the implications of claiming such an identity. By focusing on key moments, institutions, and figures in history, the course demonstrates African American women's central roles in the development of American institutions as we know them today, and challenges students to engage critically with questions of race, gender, class, and sexuality, as they wrestle with theories of Black Feminist Thought and Womanism.", "other": ["Cross-listed with: AFAM 101N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 102: Women of the African Diaspora", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Women of the African Diaspora is an introduction to studying the lives of African Diaspora women and the systems of power that shape them across cultures and geographies. The course centers on the politics of race and gender, on notions of origins and belonging and the meaning of resistance as a cultural and political tool. We will engage with patriarchy as a system of power implicated in identity formation and social relations. We will pay particular attention to the ways colonial histories and racial legacies have shaped the experiences of women in Diaspora. To this end, students will explore the complex and contested ways in which multiple economic, political, and cultural institutions affect the lives of women in the diaspora and examine a variety of issues including economy and labor, mobility and Activism, creativity and literary production and spirituality and social change. Rooted in a diasporic and transnational feminist framework, the course addresses issues of power, culture, racial formation, and citizenship and explores spatiality, movement and border crossings. It follows an intersectional approach to the politics of race and gender and engages diaspora as a historical and contemporary condition that addresses the realities of women in African decent as shaped by the legacy of slavery and the contemporary racial and social pattern of globalization. Students will explore broad patterns, changes, and continuities between diasporic communities globally and the way they shaped women's experiences through an analysis of the history of colonization, slavery, independence struggles, nation-building, imperialism, neo-colonialism, revolution, violence and social movements. The course will provide and interdisciplinary perspective to develop a nuanced understanding of the histories and the lived experiences of women of African descent both globally and in the context of their local geographies. To this end, the course explores both similarities and differences of diasporic experiences. It examines the complex and contested ways in which multiple economic, political, and cultural institutions affect lives of women of African Descent both in the US and globally and by addressing the relationship between economy and labor, mobility and Activism, creativity and literary production, spirituality and social change. It challenges universal and homogenous notions of blackness and engages feminist politics of solidarity as a site of both difference and commonality. The course incorporates interdisciplinary approaches and materials such as films, music, novels, short stories to examine how racial, gender, sexual, and class identities are constructed in the context of the diaspora.", "other": ["Cross-listed with: AFAM 102", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "WMNST 103: Racism and Sexism", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This survey course examines racism and sexism as cultural, political and economic processes that shape contemporary social life in the United States. It provides an historical overview of the roots of modern racism and sexism and will explore these structural inequalities continue to matter in a \"post-racial\" and \"post-feminist\" era. Students will engage a broad range of texts that discuss these forms of inequality as intersecting, mutually constituted forms of marginalization. Students will develop a deeper understanding of how race, gender, sexuality, and class conditions identity formation; racism as a structural process that shapes and limits the life chances of non-white communities; and the long tradition of resistance that women and communities of color have developed to combat these social inequalities. The course is divided into two sections. The first introduces a range of terms: race, gender, class, sexual politics, intersectionality and neoliberalism. The second half considers various case studies: mass incarceration, toxic waste, (un)natural disasters, reproductive justice, and Islamophobia in the war on terror. Students will leave with both an understanding of key theoretical terms in the study of racism and sexism and be able to apply these concepts to contemporary social issues.", "other": ["Cross-listed with: AFAM 103, SOC 103", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 104: Women and the American Experience", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Selected aspects of the role of women in United States history and culture from colonial to modern times. AMST 104 / WMNST 104 Women and the American Experience (3) (GH;US)(BA) This course meets the Bachelor of Arts degree requirements. AMST 104 / WMNST 104 is a broad-ranging introduction to women in American history and culture from colonial to modern times. While specific topics may vary from class to class, this survey course examines the history of American women, paying particular attention to issues of race and diversity and examining how American women's cultural, political, and economic roles have changed over time. Major themes and topics might include: work and the sexual division of labor; civic activities and the political dimensions of women's historical experience; political power and processes in American history; the role of family and personal life; women as active makers of history in the full range of national experience; the influences of art, literature, popular culture, technology, geography, regionalism, religion, immigration, and other sociological and cultural factors. This course offers students valuable experience in critical thinking, analysis, and writing and a broad introduction to American women's issues, and so serves as preparation for more advanced courses in American studies, American literature, American women's history, and women's and gender studies. AMST 104 / WMNST 104 counts towards the American Studies major and minor and the Women's Studies major and minor.", "other": ["Cross-listed with: AMST 104", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 105N: Living in a Diverse World", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This introductory survey course fulfills General Education Integrative Studies requirements in humanities and social sciences, and also meets the requirements for the United States Cultures Designation and Bachelor of Arts in Humanities and Social and Behavioral Sciences. This course uses literature, film and scholarly texts to inspire students to explore how conceptions of social difference, such as those linked to categories of gender, race, sexuality, class, ethnicity, and disability, shape society and everyday interactions historically and today. The course takes an intersectional perspective to explore how and why these categories vary over time and space, the effects of such variations for individuals and communities, and the connections between identity and the exercise of power. Geographically, the course emphasizes the relationship between social difference and power in the U.S. history and society, but takes a transnational perspective when possible by making comparisons to contexts beyond the United States. Furthermore, the class examines how individuals and communities most directly marginalized by these processes contest and re-imagine dominant categories and assumptions. Materials and discussions in the class trace broad social and historical trends as well as dive into the facets of everyday life. The class is designed to encourage reflection on the ethical challenges that arise when we become aware of how privilege, power and difference are intertwined in our world and daily lives. Students who successfully navigate this course will be able to: 1. Apply basic theories of identity, difference, social power and privilege to a wide range of textual and visual materials, and to their own interactions in the context of day-to-day life. 2. Critically engage at an introductory level histories of how race, gender, sexuality, class and disability have been constructed in the U.S. context. 3. Consider transnational dimensions of similar dynamics and contrast these with the U.S. context. 4. Identify and analyze the multiple ways individuals, communities and social movements have resisted and remade categories of identity and changed relations of power over time and space. 5. Recognize and explore the ethical dimensions of social, political and/or economic marginalization rooted in constructions of social identity.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 106N: Representing Women and Gender in Literature, Art and Popular Cultures", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Interdisciplinary consideration of primary works and scholarship pertaining to women in the humanities and the arts. WMNST 106N Representing Women and Gender in Literature, Art and Popular Cultures (3) (GA;GH;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This is an introductory survey course that fulfills General Education Integrative Studies requirements in humanities and arts, and also fulfills United States and International Cultures requirements. The course is a prerequisite for upper level women's studies courses. WMNST 106N is an introduction to the interdisciplinary field of Women's, Gender, and Sexuality Studies, with an emphasis on the experiences, achievements, and status of women in the arts and humanities in the U.S. and global context. While providing a broad overview of scholarly research and theory pertaining to women and gender, students will also see many examples of contemporary women's creative practice through the visual arts, media, and popular culture. Students will learn about the challenges women artists have faced in making their way in a male-dominated arts and media industry; they will learn how these artists sought and continue to seek new languages and forms, whether in paint, words, film, music, crafts, to reassess and re-imagine notions of sex and sexuality, gender, race and ethnicity that underlie many forms of social injustice. Depending on the location where the course is taught, class meetings may be a mixture of lectures, group discussions, individual and group exercises, films, and guest speakers. Assigned readings and class meetings may be designed to help students reassess predominant modes of thought and to give students tools to appreciate the creative work of highly diverse women. Depending again upon location, evaluation methods will include a balanced selection from among short papers, longer research papers, journals, book reviews, quizzes, exams, group assignments and other creative activities.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "WMNST 106Q: Representing Women and Gender in Literature, Art and Popular Cultures", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course is an interdisciplinary consideration of primary works and scholarship pertaining to women in the humanities and the arts. This course meets the Bachelor of Arts degree requirements in Arts and Humanities and fulfills General Education Integrative Studies requirements in both Arts and Humanities, as well as U.S. and International Cultures requirements. It is a prerequisite for upper level courses in the department of Women's, Gender, and Sexuality Studies. This course is an introduction to the interdisciplinary field of Women's, Gender, and Sexuality Studies, with an emphasis on the experiences, achievements, and status of women in the arts and humanities in the U.S. and global context. While providing a broad overview of scholarly research and theory pertaining to women and gender, students will also see many examples of contemporary women's creative practice through the visual arts, media, and popular culture. Students will learn about the challenges women artists have faced in making their way in a male-dominated arts and media industry; they will learn how these artists sought and continue to seek new languages and forms, whether in paint, words, film, music, crafts, to reassess and re-imagine notions of sex and sexuality, gender, race and ethnicity that underlie many forms of social injustice. Class meetings will be a mixture of lectures, group discussions, individual and group exercises, films, and guest speakers. Assigned readings and class meetings are designed to help students reassess predominant modes of thought and to give students tools to appreciate the creative work of highly diverse women. Given that this is an honors section, assignments will be geared towards taking advantage of small class sizes and fully engaged learners to generate dynamic classroom discussions and creative innovation.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "WMNST 110: Sociology of Gender", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Changing sex role expectations and behavior for men and women in contemporary society.  SOC (WMNST) 110 Sociology of Gender (3) (GS;US) (BA) This course meets the Bachelor of Arts degree requirements.This course provides an introduction to the analysis and understanding of how men's and women's lives are different and how they intersect with each other. The course focuses on the social construction of gender and the impact of gender on experiences in a variety of social contexts and institutions throughout the life course, including cross-cultural comparisons of gender expectations. An overriding objective is to help students better assess and analyze the effects of gender throughout history and in their everyday lives. Class sessions are a mixture of lectures, discussions, group exercises, guest speakers, and films designed to engage the students in the learning process. Each session helps students to critically evaluate the effects of gender discussed in their readings and experienced in their everyday lives. The evaluation tools used for this course extend this critical evaluation. Although the specific evaluation methods vary by sections, all sections use some form of reaction papers, book reviews, and/or journals. These writing assignments require students to demonstrate an understanding of the class readings, lectures, and activities, and to offer an evaluation and assessment of these readings and presentations. Because the social construction of gender is intertwined with family, work, religion, education, government, and all interpersonal interaction, the course overlaps with courses in each of these areas. This course meets a General Education requirement in Social and Behavioral Sciences. It can be used as a lower-level sociology course in the Sociology BA major and the Sociology minor. It can also be used as a supporting course in the Women's Studies major and minor.", "other": ["Cross-listed with: SOC 110", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "WMNST 116N: Family and Gender Roles in Modern History", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course explores the transformation of modern families in the \"Western\" world, beginning with the basic context and elements of families as early as sixteenth-century Europe and Colonial America. The course has a primary focus on marriage, parents and children, and gender in the context of the history of family, family life, and gender roles in the United States. The course focuses on the social history of families, encompassing the ever-changing elements of sociological, political, and gender history within American families.", "other": ["Cross-listed with: HIST 116N", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 117: Women in United States History", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "HIST 117 / WMNST 117 provides students with an overview of the most important historical developments in the history of women in the United States, including women's actual experiences as members of a class, a race, and an ethnic community, the progress women have made as individuals, workers, and citizens as well as the opposition they have faced. While ¿knowing the facts¿ is obviously important to historical understanding, this course helps students develop critical thinking skills. These skills include: close and thoughtful reading and analysis of primary and secondary sources; looking for a broader coherence or ¿order¿ to the material; independent analysis and effective articulation (both in writing and in class discussion) of well-reasoned, well-crafted conclusions and interpretations and arguments (conclusions/interpretations/arguments which are supported by specific factual evidence derived from a variety of sources). The three specific course objectives underscore its scholarly dimensions: (1) Students will gain a knowledge and understanding of the diverse experiences of different groups of American women. (2) Students will gain an understanding and knowledge of the political, economic, and social processes that shaped the history of women in the United States. (3) Students will learn how to ¿think historically¿ by placing documents written in the past in their historical contexts, and to consider the relationship of the past to the present. By the end of the course students will: Demonstrate an understanding of the chronology of United States women¿s history. Demonstrate an understanding of the diverse experiences of different groups of American women. Demonstrate an understanding of the social, political, and ideological structures that shaped the history of American women and continue to shape the modern United States.", "other": ["Cross-listed with: HIST 117", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 117H: Women in Modern History", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Modernization and women: changing images and roles since mid-eighteenth century in the family, workshop, politics, society.  Cross-cultural comparisons.", "other": ["Cross-Listed", "General Education: Humanities (GH)", "Honors"]}, {"course_name": "WMNST 120: Sex, Gender, and the Body", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This introductory course considers core topics in the field of feminist sexuality studies to both unsettle popular mainstream discourses on sexuality and to aid students in developing a more comprehensive, inclusive, and ethical lens through which to view intersections of gender, sexuality, and the body. Over the course of the semester, students will engage critical conversations in the field of feminist sexuality studies, from debates on pornography and sex work to subcultural and queer sexual practices to the emergence \"hook-up culture\" and new technologies transforming the landscape of sexual knowledge and practice. The course also substantively engages the ethics of sexual consent, sexual pleasure, and sexual communication. Utilizing an intersectional approach, the course examines how sexual idenities and experiences are informed by differences of race, ethnicity, gender, class, and dis/ability status. The course is interdisciplinary and grounded in the behavioral and social sciences, drawing from feminist sociological, psychological, historical, ethnographic, and public health literatures in order to provide students with a comprehensive and multi-faceted introduction to recent, contemporary, and emergent scholarship on sexual health and diverse forms of sexual practice. Geographically, the course emphasizes the relationship between social difference, power, and sexuality in U.S. history and society, but takes a transnational perspective when possible by making comparisons to contexts beyond the United States. Furthermore, the class examines how individuals and communities most directly marginalized by these processes of sexual stigmatization contest and re-imagine dominant categories and assumptions. Materials and discussions in the class trace broad social and historical trends as well as dive into the facets of everyday life. The class is designed to encourage reflection on the ethical challenges that arise when we become aware of how privilege, power and difference impact sexual knowledge and practice.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 136: Race, Gender, and Employment", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course will ask how race and gender affect work in the contemporary United States. We will consider how race and gender shape people's work opportunities, their wages at work, and whether they participate in paid or unpaid labor (or both). We will begin with an overview of work and the changes in the workforce over time; we will move to investigate how workplace structures reproduce gender and race inequalities; will ask how race and gender inequalities are informally maintained through education systems and social networks; will consider differing dimensions of inequality across poverty, immigration, and sexuality; and will consider how studying unpaid labor helps us better understand the formal paid economy. This course meets the Bachelor of Arts degree requirements.", "other": ["Cross-listed with: AFAM 136, LHR 136", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 136Y: Race, Gender, and Employment", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course will ask how race and gender affect work in the contemporary United States. We will consider how race and gender shape people's work opportunities, their wages at work, and whether they participate in paid or unpaid labor (or both). We will begin with an overview of work and the changes in the workforce over time; we will move to investigate how workplace structures reproduce gender and race inequalities; will ask how race and gender inequalities are informally maintained through education systems and social networks; will consider differing dimensions of inequality across poverty, immigration, and sexuality; and will consider how studying unpaid labor helps us better understand the formal paid economy. The course emphasizes writing in the form of short assignments and longer papers as a means to develop comprehension of these ideas. This course is a writing intensive course designed to develop formal writing appropriate for a business context. We will use an active and engaged writing process using the course topics of diversity and employment inequality to strengthen writing skills.", "other": ["Cross-listed with: AFAM 136Y, LHR 136Y", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"course_name": "WMNST 137: Gender, Sexuality, and Religion", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "WMNST 137 explores the history of different conceptions of gender and sexuality as they are understood within major religions (e.g. Hinduism, Judaism, Islam, Christianity, Buddhism, indigenous spiritual systems). The course emphasizes modern and contemporary contexts of gender/religion debates, introducing feminist historical methods in order to trace the origins and trajectories of today's controversies. Students should expect to gain a comparative historical perspective on at least three theological traditions. Possible topics include: history of gender and religious practices; femininities and masculinities in a spiritual context; the flesh and the spiritual body; and sexuality, and both ethical and theological approaches to theories of gender, feminism, and identity. We will explore ways in which religious teachings, in both historical and contemporary contexts, inform secular understandings of gender and the ways in which contemporary conceptions of gender inform religious practice. While religion plays a crucial role in defining sex and gender norms, changing sex and gender norms can pressure the doctrine, discourses, practices and organizational structures of faith institutions, some established centuries or millennia ago. The course considers not only the roles of women and men, or constructions of masculinity and femininity, but also the impacts of non-binary genders and sexualities that may be acceptable (even celebrated) in some religions and shunned in others. We will address urgent and perennial questions from different religious perspectives: what is the spiritual meaning of sexuality? Is sexuality an obstacle or a vehicle for spiritual fulfillment? Who are the voices of authority who set the sacred rules on sexuality and who gets to enforce them? How do we (or should we) balance the tensions of non-aligned government and religious concerns, as in contemporary debates around same-sex marriage; abortion and reproductive rights; legal definitions of \"family\"; the Muslim veil in secular contexts; divorce; trans rights; attitudes toward the body; gender mutilation and/or sex-reassignment surgery; sexual violence towards women, gay, and trans individuals around the world; child and sexual abuse among the clergy; and religious leadership and inclusion. The course also touches on the impacts of colonialism, globalization, and migration on gender and sexuality.", "other": ["Cross-listed with: RLST 137", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 157: Science, Technology, and Gender", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "The role of women and gender in science, technology, and engineering.  S T S (WMNST) 157 Science, Technology, and Gender (3) (GS;US)(BA) This course meets the Bachelor of Arts degree requirements. S T S/WMST 157 examines the role of gender in science, engineering, and technology. The course offers a broad interdisciplinary overview of scholarly research and theory pertaining to women and issues of gender in science, engineering, and technology. The course is interdisciplinary (drawing materials from the natural and social sciences) and cross-cultural (taking a comparative approach to western and non-western sciences and technologies), and it examines the ways that different beliefs and practices related to gender have shaped the practice of science in different times and places. Students study great women scientists and also barriers institutional and ideological - that women have had to overcome in order to participate in science, asking how the presence and absence of women have affected those studies. Students will be graded by several quizzes and two short exams during the semester. To evaluate progress in developing critical thinking skills, the students will be required to write a response journal and/or response papers to major topic areas during the semester. Also, one individual or group presentation will be required. These instruments enable the instructor to assess students' acquisition of knowledge relevant to the general objectives of General Education.", "other": ["Cross-listed with: STS 157", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"course_name": "WMNST 166: History of Sexuality", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "WMNST/HIST 166 History of Sexuality (3) (GH;US)This is a 100-level course on the history of sexuality, spanning several centuries and a wide range of contexts. The study of sexuality offers a particularly good lens for developing students' analytical ability to think historically about something that is often considered both natural and exclusively modern. Topics will include the role of religion, medicine, law, and politics in controlling and shaping sexuality; change and controversy over birth control, abortion, and gender roles; the connections between prescriptive literature and lived experience; the origins and meanings and racial violence in the context of ideas about sexuality; the concept of respectability; and the experiences and conflicts that have shaped the emergence of modern lesbian, gay, and trans identities. Students evaluate large questions about sources, methods, and analysis that historians face, including: How do we recover stories of private life, from societies and eras different from our own? How does our own understanding of what sexuality \"is\" complicate our historical exploration? What can we learn about gender and sexuality, repression and resistance, deviance and acceptance, identity and community from studying persons of nonconforming gender from the past? How has racism been employed to justify particular reproductive and sexual practices, as well as to limit claims to sexual respectability? To what extent is the study of sexuality inherently a study of gender, sex roles, and feminism? While focused primarily on the United States, the course will offer students opportunities to examine these questions in other, transnational contexts.", "prerequisite": "one introductory level course in History or Women's Studies", "other": ["Cross-listed with: HIST 166", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 175N: Fashion, Gender, and Identity", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Do clothes really \"make\" the woman? In this course, we explore how the living art and practice of fashion intersects with gender, and shapes our multiple identities. This is an integrative learning course, which means we bring together the methods, theories and skills taught in general education arts courses (GA) with those practiced in general education humanities courses (GH). Our course is grounded in visual literacy, and we learn how to read clothing through the study of formal elements including material, color, form, line, texture and mood. Our inquiries place women's fashion into cultural, political and social contexts. We concentrate on three areas of study: the construction of particular kinds of femininity through fashion, challenges and subversions, and the contributions of women at all levels of the fashion industry, from factory labor to haute couture. Along the way, we will be encountering diverse individuals who have shaped women's fashion, from Michelle Obama to the pop star Selena to Vera Wang. Finally, in this class we connect theory to practice by situating ourselves as creators of fashion. During interactive laboratories, we empower ourselves by acquiring skills including basic sewing, cutting, sketching, draping, and embellishing garments; we also digitally design a collection using specialized software.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"course_name": "WMNST 194: Women Writers", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Short stories, novels, poetry, drama, and essays by English, American, and other English-speaking women writers. ENGL (WMNST) 194 Women Writers (3) (GH;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. English 194 will constitute a wide ranging study of works by American, British, and other English-speaking women writers, including novels, short stories, poems, plays, and prose. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Bradstreet, Wollstonecraft, C. Rosefti, M. Shelley, Austen, C. Bronte, E. Bronte, G. Eliot, D. Wordsworth, Dickinson, Wharton, Stowe, Freeman, Jewett, Fuller, H.D., Moore, Sitwell, Bishop, Brooks, Plath, Cather, Woolf, Stein, Lessing, Bowen, O'Connor, Welty, Porter, Oates, Olsen, Sarton, Gordimer, Atwood, Morrison, Kinkaid, McCarthy, and Churchill. The course seeks to make students aware of the extensive body of literature written by women through the analysis, evaluation, and appreciation of specific works by women writers. The course also seeks to help students understand the female perspectives-the varying values and interests of women--reflected in the texts at hand and to position these perspectives within wider social, historical, and political contexts. The course also seeks to make students aware of the special problems faced by both women writers and the female inhabitants of the societies they describe in their work. As a course in women's literature, ENGL/WMNST 194 concerns itself with questions of gender. In so far as some of these women writers are black or women of color, it concerns itself with questions of race and ethnicity. In as far as the course looks at women's literature in the context of men's literature, it is concerned with the inter-relationship between dominant (male) and non-dominant (female) culture in the United States as well as in Britain. In so far as the course covers lesbian writers, it is concerned with sexual orientation. Topics under consideration will vary from class to class, but may include a chronological introduction to the development of women's literature, a consideration of a principle theme or themes common to women's literature through a number of works from across a number of historical periods, a consideration of a number of women's works in the context of historical events central to their creation, a consideration of a number of women's works in the context of formal or aesthetic elements common to those works and their various effects. This class will prepare students for advanced courses in women's literature as well as other academic courses that engage in the verbal and written analysis of complex written texts.", "other": ["Cross-listed with: ENGL 194", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 197: Special Topics", "department": "Women's Studies (WMNST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WMNST 199: Foreign Studies", "department": "Women's Studies (WMNST)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "WMNST 200: Global Feminisms", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course introduces students to the complexity of feminisms in the context of contemporary globalization. Much of the course focuses on the variety of feminist movement transnationally, particularly as those movements respond to not only local culture and politics, but also to global politics, and as such it touches again and again on the history of power. Explorations of the interanimating systems of power in a given area or region includes attention to ideologies of gender, race, sexuality, colonialism, imperialism, health and welfare, any or all of which are either supported or disrupted by globalism. The course holds a feminist lens to issues such as: gender and sexualities; the politics of the body; ongoing effects of colonialism-in theory and practice-on women worldwide; women's health; women and the environment; women's labor; political economy; transnational migrations; global class relations; women and/in the media; violence against women; women and war; the global sex/human trafficking trades; silence and marginalization; citizenship politics; women in politics and activism around the globe. The course examines contemporary feminist theory in the Global North and the Global South, highlighting the ways in which the term \"feminism\" continues to be contested. Given that we no longer talk about \"feminism\" in the singular in the United States, lack of agreement on the priorities of feminists worldwide is even more acute, given diverse cultural, political and economic positions of women around the globe. Thus the course also asks students to resist the kinds of generalizations that have led to inadequate feminist response to urgent challenges faced by women around the world. At the same time, the course will ask what kinds of connections can be made between local feminisms, and transnational feminist movement.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 200U: Global Feminisms -Honors", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This honors course introduces students to the complexity of feminisms in the context of contemporary globalization. Much of the course focuses on the variety of feminist movement transnationally, particularly as those movements respond to not only local culture and politics, but also to global politics, and as such it touches again and again on the history of power. Explorations of the interanimating systems of power in a given area or region includes attention to ideologies of gender, race, sexuality, colonialism, imperialism, health and welfare, any or all of which are either supported or disrupted by globalism. The course holds a feminist lens to issues such as: gender and sexualities; the politics of the body; ongoing effects of colonialism-in theory and practice-on women worldwide; women¿s health; women and the environment; women's labor; political economy; transnational migrations; global class relations; women and/in the media; violence against women; women and war; the global sex/human trafficking trades; silence and marginalization; citizenship politics; women in politics and activism around the globe. The course examines contemporary feminist theory in the Global North and the Global South, highlighting the ways in which the term \"feminism\" continues to be contested. Given that we no longer talk about \"feminism\" in the singular in the United States, lack of agreement on the priorities of feminists worldwide is even more acute, given diverse cultural, political and economic positions of women around the globe. Thus the course also asks students to resist the kinds of generalizations that have led to inadequate feminist response to urgent challenges faced by women around the world. At the same time, the course will ask what kinds of connections can be made between local feminisms, and transnational feminist movement.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 202N: Women, Gender, and Feminisms in Africa", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This introductory course provides students with a broad interdisciplinary overview of scholarly research and theory related to women and gender studies in Africa, using both historical and contemporary examples from across the continent. We will explore the complex, and oftentimes contradictory, meanings attached to gender and sexuality in various African contexts. For example, what does it mean to be a \"good\" woman in Uganda today? How does this definition change (or not) if she comes out as a lesbian? What if s/he identifies as a transgender man or rejects gender binaries altogether? What if gender did not matter, or even, did not exist? In addition to exploring these types of questions, we will also examine African feminist thought, paying close attention to the ways in which African feminisms are similar to and/or different from other forms of feminism worldwide. We will also consider what these movements looked like in practice. What strategies did African feminists utilize to promote social change? What challenges did they face? What victories resulted from their efforts? Although topics may vary from semester to semester, key themes include environmental activism, anti-war/peace activism, political activism, sex worker rights activism, activism to support peoples living with HIV/AIDS, and activism against harmful traditional practices. Finally, we will examine the ways in which African feminists have contributed to global debates and initiatives on women's rights and gender equity. Students in this course can expect to engage with diverse texts from the humanities (esp. history, literature, film studies, and philosophy), as well as from the social and behavioral sciences (esp. anthropology, geography, sociology, and political science).", "other": ["Cross-listed with: AFR 202N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "WMNST 205: Gender, Diversity and the Media", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "COMM (WMNST) 205 Gender, Diversity and the Media (3) (GS;US)(BA) This course meets the Bachelor of Arts degree requirements. This course examines diversity, equity and inclusion issues in media content, media business and media practice. Students examine communications scholarship, theory, media effects research and critical analysis of media content, policy and practice. Students learn about the media industry, its diverse distribution formats and representation patterns and the media role as public educator and social reality framer. Students research scholarship on human diversity issues in media representation and media effects and explore economic, political and social implications of media practice. Students critically analyze media content and media industry practice to build knowledge about ethical and responsible media practice. Course content is designed to help build deeper knowledge of how media interacts with identity formation, public knowledge and social understanding or misunderstanding of gender, race, ethnicity, ability, sexual orientation and class diversity, equity and inclusion. Students learn relevant communication theory to help explain how media interacts with our identity formation and our capability to navigate human difference in society. Students build critical thinking and media literacy skills, which are essential to navigate media and distinguish truth from fallacy. The course provides a foundation for further study of media in our diverse complex US democracy and global society and empowers students to interpret and pursue their interests, rights, and opportunities with ethics and integrity as media professionals.", "other": ["Cross-listed with: COMM 205", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 207N: LGBTQ+ Identity, Culture and The Arts", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "WMNST 207N: LGBTQ+ Identity, Culture and the Arts will blend theories and methods in the Social and Behavioral Sciences (GS) with those of the Integrative Arts (GA). The course introduces key ideas, concepts and issues related to LGBTQ+ identity and culture, while highlighting aesthetic values of LGBTQ+ expression. The course broadly traces the historical, global, political and academic trajectories of LGBTQ+ studies and considers contemporary topics (for example, global-local influences, intersectionality, activism, and the media) as they relate to LGBTQ+ identity and the arts. The course is attentive to the ways that sexual identities intersect with other types of identities, such as age, gender, race/ethnicity, ability, religion. The course will also help students develop arts-related skills and teach students to recognize and value the arts as an integral part of LGBTQ+ cultural expression. Students will write critical papers, participate in discussions with artists and scholars, explore queer art and art spaces, as well as create a performance or installation art project. Incorporating seminar - and lecture-style instruction with constructivist-creative learning and experiential strategies, the course seeks to develop a learning community stimulated by discourse, collaboration, and creative/aesthetic exploration. This course is a General Education interdomain (N) course for General Education Social and Behavioral Sciences (GS) and General Education Arts (GA), with US Cultures (US), International Cultures (IL) designate. The course is cross listed in both Women's Studies and Arts.", "other": ["Cross-listed with: ART 207N", "Bachelor of Arts: Arts", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 213Y: African American Women's History", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course examines the social, political, and economic history of African American women in the United States from slavery to the present. Using secondary and primary sources along with film and discussion, we will explore the varied lived experiences of African American women paying special attention to the themes of family, sexuality, labor, politics, and religion. We will examine how the simultaneity of racial and sexual oppression influence African American women¿s actions. Additionally, we will consider dominant images of African American women in a historical context. While the course is primarily discussion in format, the professor will lecture when necessary. As the course is writing-intensive, papers of various lengths constitute the bulk of student assessment.", "other": ["Cross-listed with: AFAM 213Y, HIST 213Y", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"course_name": "WMNST 220: Beyond Birth Control: Feminist Perspectives on Women's Sexualities", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course explores various aspects of women¿s sexualities from an interdisciplinary and intersectional feminist perspective. Assigned reading from feminist theory, social science research, and feminist sexologists will explore: the female body and embodied identities; the social construction of sexualities; sexual rights; sexual pleasure and desire; impacts of racism, poverty, sexism, heterosexism and transphobia on sexual identities; and how women make meaning of their sexual experiences. We also investigate models of sex and sexuality education that attend to queer and trans desire, sexuality and sexual identities.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 225N: Sexuality and Modern Visual Culture", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "ENGL 225N / ARTH 225N / WMNST 225N Sexuality and Modern Visual Culture (3) (GA;GH) An examination of the visual expression of gender and sexual identities in English-speaking cultures since the late nineteenth century. The terms \"feminist\" and \"homosexual\" were invented by the Victorians and reflect profound shifts in conceptions of identity. Another invention of the nineteenth century was the idea of the literary and artistic \"avant-garde\" as a minority contingent with politically and/or aesthetically advanced views. These ideas of minority culture were deeply enmeshed with one another, and have exerted profound influence ever since. This course explores that history with the objectives of expanding students' knowledge of modern art and literature, and of fostering more sophisticated understandings of how evolving socio-political ideas affect our sense of who we are and how we relate to texts and images. The course is relevant to students of American and English studies, art, art history, and women's, gender and sexuality studies.", "other": ["Cross-listed with: ARTH 225N, ENGL 225N", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 227: Introduction to Queer Theory", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "ENGL 227 Introduction to Sexuality Studies (3) (GH;US) This course focuses on the body of critical writings known as queer theory in order to analyze issues of sexuality and gender since 1969. The course interrogates sexual norms and their deviations, with a particular focus on the relationships between sexuality, imagination, and ethics in the making of sexual communities and fostering activism around sexuality and gender. We will study how class, race, and gender have been shaped, and themselves shape, the production of and resistance to sexual norms. Queer Theory engages issues \"queer space\" and \"queer time,\" related concepts that relate bodies and environments to history and memory, and to fantasy, imagination, and utopianism. We will also explore the ways marginalization, shame, and criminalization have been transformed into visionary acts of \"world-making\" that have changed contemporary understandings of bodies, identities, social formations, literature and visual culture. Throughout, our focus will be on the relationships between sexuality and ethics, and how both shape the history of queer culture and activism.", "other": ["Cross-listed with: ENGL 227", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 235: Gender and the Global Information Technology Sector", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Integrates information technology and gender studies. Overview issues and socio-cultural shaping of gender in the IT field.", "other": ["Cross-listed with: IST 235", "United States Cultures (US)"]}, {"course_name": "WMNST 240Q: Artistic Patronage in Europe", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course surveys the institutions and social networks in which European fine arts were created, consumed and critiqued. Beginning with the medieval period and ranging to the early 20th century, the course will examine the variety of communities where public and private often intersected and which sponsored innovations in the arts. Often indexing social movements and political change, such communities include convents and cathedrals, royal academies and courts, coffee houses, salons, and theaters. Artists, performers, patrons, politicians, journalists, and others collaborated and competed in these spaces. Such communities could embody political and economic power, or foster resistance to it. This approach to the history of the arts in western culture puts the focus less on the individual creative genius of great composers, writers, painters, and sculptors, and more on the social exchanges and institutions that sponsored and received their work. Such an approach brings to light particularly the ways in which women played significant roles in the production and reception of culture: as salon hostesses, patronesses, and divas, women often enabled and enacted cultural production. Some examples of particular units of study might include: the German convent of Hildegard of Bingen (1098-1179), where monophonic chant and allegorical morality plays developed; the Mantuan (Italy) court of Isabella d'Este ,the first lady of the world, (1474-1539) where the roots of the madrigal began and where notable painters found support and sponsorship; the French salons of Mme. Geoffrin (1699-1777) and Mme. de Staël (1766-1817); and the student residences in Madrid where avant-garde writers and artists interacted. Each unit will also consider the relationships between the aesthetic norms and values of a period and the economic and political realities of sponsorship. The course will require that students attend at least one musical performance or concert held on campus during the semester and complete a brief writing project based on that experience. This requirement will encourage students to think about their own university as a contemporary space of cultural sponsorship.", "other": ["Cross-listed with: CMLIT 240Q, HIST 240Q, IT 240Q", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 245: Introduction to LGBTQ Studies", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "An introduction to the dominant themes in Lesbian, Gay, Bisexual, Transgender, and Queer Studies, with an emphasis on both literary & cultural studies. This course explores the history of modern, western ideas about sexual identity as manifested in literature, theater, film, and other narrative forms of popular culture. Drawing on the substantial body of \"queer theory\" generated by scholars in the humanities since the 1990s, this class examines sexuality not as a \"natural\" or consistent phenomenon, but as a set of beliefs that have changed over time and manifest themselves differently in different cultural and historical contexts. Starting in the late nineteenth century, scientific and medical authorities began categorizing individuals into sexual types based on their manifestations of gendered characteristics and their erotic attractions and practices. This medical typing corresponded with the development of subcultures associated with deviance from sexual norms; these subcultures produced a rich variety of texts, images, performances, and social forms, many of which became central to both popular and high culture. This course explores this rich archive, moving among media. It investigates constructions of sexual conformity and how sexual nonconformists positioned themselves in relation to cultural and medical group identities. It examines how distinctions between gendered, raced, and classed bodies were historically produced and culturally contested. It considers what commonalities gay identities may - or may not -- share with lesbian identities and how transgender and other identities have altered perceptions of sexual identity. The course also explores the relationship of the avant-garde to the mass media and how sexual subcultures have shaped literary and other cultural forms of expression. Comparative study of issues of sexual mobility beyond and between the borders of the United States expands the course's critical scope beyond dominant forms of western culture. This course does not propose definitive answers to the questions of identity it addresses. Instead it negotiates the ways sexualities have enabled individuals to articulate -- and disarticulate -- themselves within social bodies past and present. This course, therefore, has wide relevance for students interested in how group identities come into being and transform over time in dynamic relation to other historical forces. Exploring a wide variety of cultural forms associated with the history of sexual identity as well as a variety of interpretations of that history, this course opens students to an archive of literature, theater, film, and other narrative arts with the potential to inform and enrich their understandings of many kinds of challenges to regimes of normativity today.", "other": ["Cross-listed with: ENGL 245", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 250: Sexual Identity over the Life Span", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Concepts of affectional and sexual orientation over life span, with emphasis on lesbian and gay male personal, family, and community adaptation.  HD FS (WMNST) 250 Sexual Identity over the Life Span (3) (US) This course reviews concepts of sexual identity as informed by a human development perspective. Concepts of sexual orientation are discussed in the context of a review of lesbian, gay male, and bisexual lives. Developmental processes of lesbian and gay life are detailed: personal change from the teenage years through adulthood, changes in family and relationship patterns, and impact of communities, laws, and culture. These processes are contrasted to the developmental processes of women and men who identify themselves as heterosexual. The complex effect of gender, race, ethnicity, class status, and historical time on sexual orientation and its expression has generated ongoing controversies in scholarship as well as in public discourse. The course will be an introduction to these controversies as informed by human development research.", "prerequisite": "3 credits in ANTH or BBH or CAS or COMM or CRIM or CRIMJ or GEOG or HDFS or HIST or PSYCH or SOC or WMNST", "other": ["Cross-listed with: HDFS 250", "United States Cultures (US)"]}, {"course_name": "WMNST 266Y: Sexuality and Violence in Nineteenth-Century America", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "HIST/WMNST 266Y explores the social and cultural history of sexuality and violence in the United States during the nineteenth century. Both sexuality and violence are extremely broad topics, and the course will focus on a few intriguing elements of sexuality and violence, including courtship, prostitution, the early popular culture of sports, slavery, military violence, exploitative journalism, and sexuality and violence as metaphor. The course also examines the \"creation\" of homosexuality in the nineteenth century, and manner in which masculinity has been historically constructed.", "other": ["Cross-listed with: HIST 266Y", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"course_name": "WMNST 270: Race and Gender in Literature Translated from French", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "A critical presentation, taught in English, of changing ideas and values on race and gender in French and Francophone literatures.", "other": ["Cross-listed with: FR 270", "Bachelor of Arts: Humanities"]}, {"course_name": "WMNST 280: Gendering the Divine in Indian and South Asian Religions", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Throughout South Asia, ancient religious beliefs and cultural traditions interact with forms of modernity that constitute the daily lives and practices of women and men today. Focusing on conceptualizations of sex and gender over South Asia's long history, this course investigates the ways in which religious traditions and cosmologies have informed gender roles and hierarchies in India, Nepal, and other neighboring nations from the ancient period through the present day. In so doing, the course also explores how political realities-revolutions, terrorism, elections, nationalist movements, for example-can both exploit and challenge the gendered entanglements of religion and secular life. Students engage basic historical methods as well as feminist analytical methods (e.g., intersectionality) as they read a variety of cultural histories and ethnographies, as well as religious, philosophical and literary texts.", "prerequisite": "WMNST 83N", "other": ["Cross-listed with: JST 280, RLST 280", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 294: Research Project", "department": "Women's Studies (WMNST)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "WMNST 296: Independent Studies", "department": "Women's Studies (WMNST)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"course_name": "WMNST 297: Special Topics", "department": "Women's Studies (WMNST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WMNST 299: Foreign Studies", "department": "Women's Studies (WMNST)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "WMNST 300: Latinx Gender and Sexuality Studies", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "WMNST/LTNST 300 Latinx Gender and Sexuality Studies (3) (GH/US/BA) This course examines the historical development, theoretical premises, and political, social, and artistic contributions of Latinx feminisms in the United States. It shows the connections to as well as the divergences from Latin American feminism by beginning with an analysis of how the Spanish conquest, the imposition of Catholicism, and subsequent years of colonialism shaped gender and sexual identities. It examines the contemporary effects of these historical issues and inquires into the common concerns of Latin American feminists and Latinx feminists. It asks how theories and practices have diverged given different geographies, both between the U.S. and Latin America and within the U.S. The course will examine changes in the 1960s and 1970s in the U.S., when Chicano and Puerto Rican nationalist movements also gave rise to a feminist consciousness amongst Latinas; the conjuncture of race, ethnicity, gender, and sexuality is considered, with attention to how Latinas critiqued Anglo feminism's narrow focus on gender. The course will focus on family formations, considering social science and feminist discourse on the issues of patriarchy. How have Latinx feminists valued yet also rearticulated the traditional family? What critiques have made been against heterosexism? How has the LGBTQ community formulated new kinds of families? How does migration shape family relations? The course will explore how Latinx artists in different genres have responded to and resisted traditional gender and sexual roles. Literature, film, poetry, performance art, and hip hop are all examined for their diverse representations of sexual desire.", "prerequisite": "WMNST 100", "other": ["Cross-listed with: LTNST 300", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "WMNST 301N: Sexualities, Gender and Power: Feminist Thought and Politics", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "WMNST 301N Sexualities, Gender and Power: Feminist Thought and Politics (3) (GH;GS;US;) This course is an interdisciplinary survey of historical and contemporary feminist theories in both the United States and international contexts. While attention is given to key historical moments in feminist thought, the course stresses theoretical trends and debates in feminism today. Course themes will include: (1) feminist epistemology and standpoint theory, epistemic privilege and epistemologies of ignorance; (2) postcolonial critiques of western feminism, and contemporary efforts to define a transnational and anti-racist feminism, (3) gender identity and the very viability of the category; (4) the concept of freedom, liberation, and of women's agency in feminist narratives of liberation, (5) theoretical implications for defining productive labor for women that is not exclusively the labor of childbirth, and the subsequent care of children and family; (6) the ongoing search for new paradigms of embodiment and interdependency (such as feminist disability and care studies) that counter patriarchal epistemologic constructions.", "prerequisite": "WMNST 100", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"course_name": "WMNST 303: Race and Gender in the Americas: Latin American and Caribbean Cultures", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Utilizing a theoretical framework of intersectionality, this course examines historical and cultural constructions of race and gender in Latin America and the Caribbean. AFAM 303 / ANTH 303 / WMNST 303 Race and Gender in the Americas: Latin American and Caribbean Cultures (3) (GS;IL) Utilizing a theoretical framework of interesectionaly this course examines how racial, gender, sexual, and class identities are constructed in Latin American/Caribbean societies. The course applies an anthropological perspective to a wide range of countries in the region to reflect on how historical events such as the conquest, colonization, slavery, and independence movements are relevant to understanding the region today, as well as how race, gender, and sexuality inform contemporary themes of empire, nation-building, imperialism, neo-colonialism, revolution, violence, militarization, social movements, religion, neoliberalism, U.S. involvement/relations, and popular culture. The course addresses issues of power, culture, racial formation, and citizenship by incorporating interdisciplinary material beyond ethnography such as newspapers, grassroots media, biographies, films, music, novels, personal testimonies, etc. Rooted in feminist anthropological scholarship, this course emphasizes how power (from above and below) and culture mediate relationships between individual/community agency and institutions/structures. As an effort to encourage students to think about Anthropology and culture beyond superficial or romanticizing celebrations of multiculturalism, food, and music, the course stresses the theoretical importance of situating power and privilege amidst difference. We conceptualize culture not only as socially transmitted patterns of behavior and ideas/meanings, but as a complex and dynamic process/medium grounded in unequal relations in which power is constituted and resisted. The ethnographic emphasis of the course centers on the complex lived realities and voices of people, encouraging students to learn, understand, and respect cultural difference. The course offers students a broad sense of how power is central in the production of knowledge (particularly within the disciplines of Anthropology and History). Students will critically engage an array of topical issues in Latin America beyond dichotomous thinking. Discussion of course material includes contemplating issues of ethics, subjectivity, bias, and privilege. Conversations regarding processes of \"Othering\" and traditional \"us vs. them\" debates that often occur when discussing developing countries will prompt students to situate their own power/privilege and challenge our assumptions and preconceived notions of Latin America. Moreover, this course teaches Latin American Cultures within a global context of racialization. As such it also stresses the historical and contemporary social, economic, cultural and political significance of the U.S. in Latin America, to demonstrate how we are connected and responsible to what happens \"over there.\"; In order to promote service learning, a core tenant of feminist pedagogy, this course also offers students the opportunity to participate in an optional embedded program entitled \"Cuba: Identity, Diversity and Popular Culture\". This two week course in Havana, Cuba promotes interactive learning in and outside the classroom with international study. This course component successfully combines academic classes, hands-on activities, and service learning.", "other": ["Cross-listed with: AFAM 303, ANTH 303", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)"]}, {"course_name": "WMNST 350: Gender, War, and Militarism", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This interdisciplinary seminar uses feminist theory to critically examine the ways in which war and militarism are deeply gendered. We will look at women's experiences of armed conflict across the world, but also the militarization of everyday life and the politics of gender within various military structures, both in the US and abroad. We will also examine the differential ways that men and women are affected by the war system and will consider the role of women and gender norms in peace and anti-militarism movements. This course focuses on women who actively participate in and/or support war, as well as those who actively oppose war and mobilize for peace. It also considers the experiences of those who become victims of the war system. Given that men and militarized understandings of masculinity play such a prominent role in warfare, the course will also explore the ways that masculine gender norms have been used to perpetuate cultures of war. Students can expect to engage with a variety of different types of texts: documentaries, feature films, memoirs, novels, newspapers, scholarly books and articles.", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "WMNST 364N: Black & White Sexuality", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course explains how narrow, \"black and white,\" ways of thinking limit our understanding of the diverse expressions of human sexuality. The course title's double meaning also references the various ways that sexuality is socially constructed in relation to race. For example, we will explore how stereotypical beliefs about the sexuality of people of African descent persist in the United States and have been legitimized historically by various cultural discourses, social institutions, and academic fields. Course assignments will require us to rethink and challenge what we understand as \"sexuality\" and consider its many influences like race, gender, class that shape our emotions, needs, desires, relationships, representations, practices, and public policies. An aim of this course is to begin to make sense of the long, entangled, and inextricable relationship between race and sexuality in the United States.", "other": ["Cross-listed with: AFAM 364N", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"course_name": "WMNST 395: Internship", "department": "Women's Studies (WMNST)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"course_name": "WMNST 399: Foreign Studies", "department": "Women's Studies (WMNST)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"course_name": "WMNST 400N: Debates in Contemporary Feminism", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course is an advanced seminar in feminist and gender theory. The primary focus is critical engagement with social, political, and cultural theories of the social construction of gender and gender difference, and of the sources, causes, and effects of gender inequality and strategies for reducing or eradicating inequality. While emphasis will be placed on gender difference and inequality, substantial time will be spent on theories of how gender is implicated in and supported by other forms of inequality such as sexuality, race, ethnicity, and class. Standpoint and intersectional approaches will ground much of the course, and provide one dominant framework for thinking about identity, oppression and social power inequalities. Students will also take on more advanced readings addressing feminist epistemology and ontology, methodology and praxis. While topics change from instructor to instructor (for example: reproductive rights; women's health; labor; politics and voting; creative arts and representation; individual and social identities; gender and militarism) students can expect a balance between US and transnational contexts. This balance reflects contemporary feminism's acknowledgement of US global hegemony, and thus the impacts of US policies on the welfare of other nations and regions, while also emphasizing both oppositional and coalitional movements in those same nations and regions. Case studies of effective activist intervention at both local and global levels will support the bi-focal emphasis of the course.", "prerequisite": "WMNST 100", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"course_name": "WMNST 401: Doing Feminism: Theory and Practice", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Advanced analysis of feminist theory and the nature of its integration (sometimes uneasily) within feminist movements and practices.  WMNST 401 Feminist Perspectives on Research and Teaching (3)The course explores current themes organizing debates and discussions within feminist discussions of teaching and research. Students will become familiar with various research perspectives that feminist researchers use including interviews, ethnography, and action research. The course will examine debates within feminist research and teaching including power, difference, and race. Key themes will include questions around the politics of representation, the relationship of research to colonialism, the authority of the researcher, researcher-researched relations, and power/knowledge relations in research, classrooms, and knowledge production broadly defined. The aim is not to identify a feminist orthodoxy but rather: 1) to identify and understand the varieties of feminism existing today; 2) to become knowledgeable about a range of themes currently emerging in feminist debates on teaching and research; and 3) to arrive at an appreciation of the transformative effect upon teaching and research these new paradigms, debates, and themes have meant across a range of disciplinary boundaries.", "prerequisite": "WMNST100 , or WMNST106 , or WMNST005 and WMNST301"}, {"course_name": "WMNST 407W: Women and Theatre", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "A study of theatre practice and dramatic literature as informed by issues of gender, race, and ethnic background.  THEA (WMNST) 407 Women and Theatre (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. Theatre 407 approaches the study of theatre/performance as a valuable site for the exploration of race, class, and gender as social constructs. The focus will be on 20th century developments of women and theater. Feminist theory and theatrical practice will be a focus of the course and will reflect conflicts and differences present within feminism.", "prerequisite": "THEA 100", "other": ["Cross-listed with: THEA 407W", "Bachelor of Arts: Arts", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "WMNST 412: Education and the Status of Women", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "An examination of the relationship of education to the status of women in American society.", "other": ["Cross-listed with: EDTHP 412"]}, {"course_name": "WMNST 420W: Gender and International Development", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course examines gendered processes of economic and social change in the Global South in a context of rapid globalization. We will study how gender inequities and inequalities shape and are shaped by economic restructuring, environmental change, international migration, the global spread of ideas and culture, and the shifting goals of International Development agencies. Readings and discussions are organized around three main learning units: 1) Approaches to Gender in Development; 2) Gender, Work, and Identity in the Global Economy; and 3) Rights, Reproduction and the Body. Particular attention will be paid to representations of women and men by Western organizations acting in the name of Feminism and/or Development, and to the responses of feminist communities in the South to these portrayals. In studying these issues, we will resist the tendency to conflate \"gender\" with \"women\", instead looking comprehensively at the identities, rights, and lived experiences of diverse gendered identities. We will carefully consider differences using an intersectional frame that considers social factors such as sexuality, race, economic class, and legal status. Students will explore issues through diverse materials including reports, articles, book chapters, documentaries, presentations, and popular media.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: CED 420W", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "WMNST 423: Sexual and Domestic Violence", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Legal, sociological, and psychological perspectives on sexual and domestic violence. CRIMJ 423 / CRIM 423 / WMNST 423 Sexual and Domestic Violence (3) (US) This course investigates violence against women, specifically domestic, sexual, and relationship violence. Students will examine some of the legal, sociological, and psychological perspectives about sexual, domestic, and relationship violence as well as the social and cultural roots of violence against women. Students will also gain an understanding of the experiences of victims of domestic and sexual violence as well as the issues presented by perpetrators. Students will be evaluated based on performance on exams, and two research papers. CRIMJ 423 / CRIM 423 / WMNST 423 is a supporting course in both the WMNST major and minor as well as a supporting course in the CLJ major. It may also be used to satisfy a GI requirement. This course is offered fall and spring semester with an enrollment of 60 students each semester.", "prerequisite": "CRIMJ100", "other": ["Cross-listed with: CRIM 423, CRIMJ 423", "United States Cultures (US)"]}, {"course_name": "WMNST 424: Women and Sport", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "An interdisciplinary approach to contemporary issues related to women and sport from historical, physiological, psychological, and sociological perspectives.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: KINES 424", "United States Cultures (US)"]}, {"course_name": "WMNST 426W: Gendered Worlds", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Gendered Worlds examines how systems of dominance manifest in everyday life. Through an intersectional approach to social differences, such as gender, race, class, ethnicity, age, ability, and sexuality, the course highlights the significance of difference in shaping experiences of space and place in a global context. The course incorporates approaches from cultural, postcolonial, subaltern, queer, gender, and critical race studies, all of which have influenced current debates across the field of geography. Feminist scholars have long been concerned with the spatial politics of cultural difference. As a point of entry to discussions of gender and geography, this course will explore the diverse ways in which geographers have conceived of, analyzed, and redefined gender as a contested spatial practice that intersects with other facets of identity such as race, class, and sexuality. Using contemporary geographic texts, we will explore the gendered dynamics of geographic research, citizenship, violence, security, nationalism, nature,and globalization. The purpose of this course is to examine how gender is understood and utilized in the field of geography. This course also aims to enhance students' ability to engage in first-hand critical research, as well as collaborative learning, through a reflective and on-going process of research and writing over the course of the semester. At the end of the course, the successful student will be able to: 1. Deploy contemporary debates around gender theory, gendered spatial practices, and cultural difference. 2. Critique the cultural and social construction of gender across time and cultures. 3. Analyze representations of gender in social institutions such as the media. 4. Apply theories of gender and cultural difference in the context of critical written analysis.", "prerequisite": "GEOG 220", "other": ["Cross-listed with: GEOG 426W", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"course_name": "WMNST 428: Gender and Politics", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Gender in politics in the United States and around the world; major areas of women and politics research.  PL SC (WMNST) 428 Gender and Politics (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed as an overview to the field of women and politics. It examines the role that women play in politics in the United States and around the world. Students will begin by examining how women are socialized differently from men and how that socialization effects women's political attitudes and participation. Then students will focus on women in different political offices and how their behavior compares to that of their male counterparts. Students will then analyze the women's movement in the United States. Finally, students will turn to different theories of the ideal position of women and men in politics and use those theories to explore the issue of pornography. Students will be evaluated on a final exam, short essays ( 4 3-5 page essays), class participation, and a research paper (15 pages). This is an advanced course with 6 credits prerequisite in Women's Studies or Political Science. This course fulfills the American Politics and Comparative Politics distribution as well as the advanced course requirement for the Political Science major. It is an elective for a Women's Studies major. It also fulfills an International/Intercultural competency requirement. This course will be offered once a year with 35 seats per offering.", "prerequisite": "3 credits in political science or women's studies", "other": ["Cross-listed with: PLSC 428", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "WMNST 430: Women in American Society", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "A historical study of women's roles and experiences in the United States.", "prerequisite": "6 credits of American Studies, Sociology, or Women's Studies", "other": ["Cross-listed with: AMST 430", "United States Cultures (US)"]}, {"course_name": "WMNST 438: Seminar in Feminist Philosophy", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course will explore some of the influential theories and texts in the field of feminist philosophy. Feminist philosophy encompasses a broad range of inquiry, from political and ethical issues to foundational metaphysical and epistemological problems - e.g., What is a woman? What is the relationship between knowledge, epistemology, and power? Feminist philosophical approaches are diverse and include thinkers from all approaches to philosophy and are often richly influenced by work in women of color feminisms (e.g., intersectionality, Latinx), approaches to sexuality studies (e.g., LBGT studies and Queer Theory), post- and decolonial studies, and disability studies. Assigned readings will typically offer a range of approaches to feminist philosophy. While a majority of the readings will cover issues discussed by contemporary thinkers, a few historically significant feminist philosophers will often be included. Through reading and discussion, this course will introduce students to some of the central approaches to feminism, some of the most pressing issues, as well as the central controversies of feminist philosophy. Students will develop their interpretative and philosophical skills, while gaining a deeper understanding of the importance of feminist philosophy to the tradition of philosophy as well as to the general betterment of society.", "prerequisite": "114", "other": ["Cross-listed with: PHIL 438", "Bachelor of Arts: Humanities"]}, {"course_name": "WMNST 439: Women and the Holocaust", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Analysis of women's experience in the Holocaust and exploration of the role of gender in Holocaust Studies.  J ST (HIST/WMNST) 439 Women and the Holocaust (3) Most of the early study of the Holocaust focused almost exclusively on the experiences of Jewish men. It was men who wrote the first and most widely read Holocaust memoirs and men who produced the first studies of the Holocaust. The first question motivating this class is thus what we can learn from examining women's experiences. Is it possible that the ghetto, the camp, and the forest look different from women's perspectives? Are there factors we miss when we read primary documents written by only half of the participants in these historical events? Beyond this, however, our exploration will also lead us to look more broadly at gender as a category of analysis. What do we gain by bringing questions of gender to bear on our study of the Holocaust? Are there any ethical concerns that should inform our approach?", "prerequisite": "HIST 121", "other": ["Cross-listed with: HIST 439, JST 439"]}, {"course_name": "WMNST 450Y: Gender and Sexuality in Ancient Greece and Rome", "department": "Women's Studies (WMNST)", "credits": "3 Credits/Maximum of 3", "description": "An examination of gender, sexuality, and sexual desire in ancient Greece and Rome. This course examines issues of gender and sexuality in Greece and Rome. Through close analysis of ancient texts and artifacts, we will explore representations of gender in literature and art, medical theories of the male and female body, sexual norms and codes, and views on marriage, rape, adultery, and prostitution. In addition, we will consider how eroticism and gender both support and subvert political and social ideologies. The objective of this course is to enable students to analyze gender identities and conventions surrounding sexuality in the context of the Greek and Roman worlds. This course will also invite students to consider the influence of ancient conceptions of gender and sexuality on modern discussions and debates. Authors and texts may include Homer, Hesiod, Sappho, Sophocles, Aristophanes, Plato, Aristotle, the Hippocratic corpus, Catullus, Virgil, Ovid, and Augustine. These ancient readings will be supplemented with selections from modern feminist theorists and gender studies.", "prerequisite": "3 credits in CAMS", "other": ["Cross-listed with: CAMS 450Y", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"course_name": "WMNST 452: Women's Health Issues", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Recommended Preparations: BIOL 141; PSYCH 100; WMNST 100  N452 examines major health issues concerning women today. The topics covered include, but are not limited to: developing a healthy life style--nutrition and exercise; family planning--birth control methods; violence against women--relationship rights and signs of a batterer; eating disorders--anorexia, bulimia, and binge eating; sexual wellness; substance abuse--alcohol, prescription drugs; menopause signs and symptoms, treatments; and medical conditions affecting women today such as cancer, arthritis, multiple sclerosis and heart disease. The course emphasizes that women's lives are influenced by social, economic, political, and cultural conditions.", "other": ["Cross-listed with: BBH 452, NURS 452", "United States Cultures (US)"]}, {"course_name": "WMNST 453: Women and the Criminal Justice System", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course focuses on the experiences of women as offenders, victims, and professionals in the criminal justice system. CRIMJ 453 / CRIM 453 / WMNST 453 Women and the Criminal Justice System (3) (US) The course will examine the role of women in the criminal justice system and look at the issues related to women as offenders, victims of crime, and as professionals in the system. Students will gain an understanding of the issues concerning women in the criminal justice system, examine how societal arrangements affect women as offenders, victims, and criminal justice professionals, and better understand the overlooked problems faced by women in the criminal justice system. Students will be evaluated on the basis of exams, presentations, and papers. CRIMJ 453 / CRIM 453 / WMNST 453 is a supporting course for both WMNST and CLJ majors, as well as the WMNST minor. This course may also be used to satisfy a GI requirement. This course will be offered twice a year with 60 seats per offering.", "prerequisite": "CRIMJ100 or WMNST100", "other": ["Cross-listed with: CRIM 453, CRIMJ 453", "United States Cultures (US)"]}, {"course_name": "WMNST 455: Gender Roles in Communication", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Explores the literature on gender research in the discipline of human communication.  CAS (WMNST) 455 Gender Roles in Communication (3) (US) This 400-level course is a theory and application course which also satisfies an intercultural requirement. CAS/WMNST 455 strives to ensure that students understand female and male differences and similarities in communication patterns, perceptions of the opposite sex, and expectations and stereotypes regarding the opposite sex. Many researchers find that gender communication is 'cross cultural' i.e., that women and men come from two different cultures, and therefore misunderstanding of each others' intent and expectations may frequently occur. This course examines how distinctions in meaning and interpersonal dynamics may create these two differing cultures, and promotes understanding and possibilities for adaptation. It also investigates when and if changing communication styles is desirable, and in which settings. A goal of the course is to help students to solve puzzles toward understanding those we work with and relate to, as well as to apply their knowledge to their own lives and contexts. The course content and format reflects these goals. CAS/WMNST 455 begins with theoretical information, later applying it to situations of interest to most -- relationships, language use differences (verbal and nonverbal), media messages, and workplace issues. Lecture incorporates considerable discussion and exploration of gender issues, and most topics are followed by activities, which illustrate how theories work in real life. This course is useful for any students seeking an intercultural course. It is recommended to Communications Arts and Sciences and Women's Studies majors and minors due to emphasis on communication theory and gender issues. Business, counseling, psychology, sociology, education and any social science majors may fulfill a US requirement through 455.", "prerequisite": "3rd Semester Standing", "other": ["Cross-listed with: CAS 455", "United States Cultures (US)"]}, {"course_name": "WMNST 456: Gender, Occupations, and Professions", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "The role of gender in shaping contemporary North American patterns of employment, occupational roles, and statuses.", "prerequisite": "3 credits of sociology", "other": ["Cross-listed with: SOC 456", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "WMNST 458: Critical Feminist Issues in Reproduction", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course examines women's reproductive health issues from a feminist perspective. Reproduction has always been thought of as 'women¿s work,' yet decisions about reproduction are rarely made by women. This course will focus on how various political institutions (e.g., religious, economic, governmental, legal, medical, etc.) influence all aspects of human reproduction, and how these influences affect women's reproductive health, both ideologically and practically, as well as how women's reproduction affects women's lives. This course will examine four aspects of reproduction from a feminist perspective: reproductive rights, including access to birth control and abortion along with the right to be free of forced sterilization; infertility and the new conceptive technologies; pregnancy, including screening, sex selection, maternal and 'fetal rights'; and childbirth options. Throughout the course, we will return to the question of the 'politics of reproduction' by asking ourselves which powerful institutions govern each particular aspect of reproduction and whether the decisions made are good for women. Using a feminist perspective, we'll focus on making women and their health needs the center of discussion and examining the relative lack of power held by women in decisions made about their reproductive health. In addition to class readings (which are both theoretical and applied in nature) students will learn through class discussions, films, and group projects.", "prerequisite": "WMNST 100", "other": ["Cross-listed with: BBH 458", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"course_name": "WMNST 462: Reading Black, Reading Feminist", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "This course examines intersectional identity and its representations of gender, class, race, sexuality, and cultural difference in texts by black American women. The course also identifies analyzes major issues concerning the discovery and development of a black feminist tradition and the ways in which that tradition has engaged issues of racism, sexism, class exploitation, and/or heteronormativity.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: ENGL 462", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"course_name": "WMNST 464: Feminine/Masculine", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Study of sex role learning; investigating feminine/masculine labeling; implications for contemporary society.  BE SC 464 BE SC (WMNST) 464 Feminine and Masculine (3) (US) This course provides a critical examination of the concepts of masculinity and femininity through a consideration of how these have shifted and changed historically and cross-culturally. It considers a variety of theories of gender difference. It investigates how gender is socially constructed and practiced. Thus, it examines how gender is enacted in interpersonal relationships and defined, reinforced, and challenged through processes of socialization as well as through the various institutional spheres of social life. The course addresses the diversity of masculinities and femininities within a single society. Thus, attention is given to race and class-based differences as well as to trans-genderism and homosexuality.", "prerequisite": "general psychology or general sociology", "other": ["Cross-listed with: BESC 464", "United States Cultures (US)"]}, {"course_name": "WMNST 466: Lesbian and Gay History", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Critical exploration of the history of sexuality, focusing especially on the emergence of modern lesbian and gay identities.  WMNST (HIST) 466 Lesbian and Gay History (3) (US;IL) This course will explore the relationships in different cultures and historical periods between the dominant culture and homosexuals, whom the culture deemed, at different times, sinful, deviant, criminal or, more recently, a minority community. Students will confront the very nature of difference, and how it has been played out in European and American history. The course will challenge students to deal with how societies define difference itself; how they isolate or punish deviants; and how the creation of the 'homosexual' helped establish not simply difference but 'normalcy' in a highly sexualized modern culture. Finally, the course will explore notions of identity itself, focusing on the creation of a modern gay and lesbian identity and its impact on broader questions of gender, community, civil rights, and political discourse in the United States.An example of evaluation methods would be: course presented in a seminar format with grades based on class participation, brief analytical papers, and a longer research or historiographic paper.", "prerequisite": "WMNST100 , WMNST117", "other": ["Cross-listed with: HIST 466", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "WMNST 471: The Psychology of Gender", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Theories and research on gender differences and gender roles.  Emphasis on women's and men's current positions in society.", "prerequisite": "PSYCH100 , PSYCH221", "other": ["Cross-listed with: PSYCH 479", "United States Cultures (US)"]}, {"course_name": "WMNST 472: Work-Life Practices and Policies", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Explore the causes and consequences of conflicts between work, family, and other life commitments, and how these may be resolved. LER 472 Work-Life Practices and Policies (3)(BA) This course meets the Bachelor of Arts degree requirements. The interdisciplinary field of work-family and work-life developed as a result of middle-class women's entry into the labor force, a movement that generated conflict between family and paid work commitments. Overall, the course addresses the reasons the field developed, relevant theoretical perspectives regarding the issues, and related problems as well as proposed solutions at both the public and private sector levels. The overarching objectives of the course are to expand students' understanding of conflicts between work and family commitments, and how these might be resolved through private and public sector initiatives. Specifically, the course concerns how individuals, families, and organizations interact to help hinder the achievement of balance between work and life commitments, and relevant effects on those involved. The changing demographics of the family, laws and trends around working time, father and mother time with children, the expanded need for elder care, work-life programs such as flextime, concierge services, paid parental leave, part-time careers, paid time-off banks, and the role of unions, corporations and government legislation are covered. The course attempts to link the likely future needs of students to broader trends in society and how balance could be achieved at the level of individuals, families, other stakeholders in the community, and for society as well. Fields of research relevant to the course include labor studies, women's studies, Industrial/Organizational psychology, the sociology of work and of family, and child development. Students will be evaluated on the basis of class participation, through two in-class examinations, and through a final written or oral project providing a chronology and analysis of an adult's work-family history.", "prerequisite": "3 credits in LER/LHR", "other": ["Cross-listed with: LHR 472, SOC 472", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"course_name": "WMNST 476W: Anthropology of Gender", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Cross-cultural construction of gender and sex roles; theories of gender construction; case studies and practical effects. ANTH 476 / WMNST 476 Anthropology of Gender (3)Students will learn the current theoretical approaches in anthropology to the cultural construction of gender and sex roles. The first 2-3 weeks of the course will concentrate on exploring and understanding these theoretical approaches. The remaining weeks will focus on case studies of non-western gender systems, and on the practical effects of those systems, but students will also be encouraged to relate these systems to their own experience. Each meeting will be based on discussion of the readings assigned for that meeting and students will be expected to participate. During the period devoted to theoretical approaches, discussion will focus on the assumptions, advantages, and disadvantages of each approach. For the part of the course devoted to readings on individual societies, one reading each week will be the basis for a critical essay of approximately five pages. These essays will be expected to include: 1) an identification of the theoretical approach that informs the work, 2) a statement of the author's arguments or questions, 3) a discussion of the methods used to provide data in support of the arguments or to answer questions, 4) a critique of the adequacy of data, and 5) a statement suggesting which additional elements might make for a better study. These essays will be graded for both content and form and students will have the option of rewriting essays (and improving their grade) after they receive comments. These essays will provide 60% of the course grade, while participation in discussions will provide another 15%.A short research paper will also be required. The paper must focus on a question or hypothesis concerning gender, and a preliminary proposal that includes the focus of the paper, its relevance to the course, and a beginning bibliography is required. A first draft of the paper will be required two weeks before the end of the semester. The research paper will provide 25% of the course grade.The course complements other courses in Anthropology that deal with sex differences, but will provide a perspective on gender that is not available elsewhere in the curriculum. The course can be used to fulfill a Behavioral Anthropology requirement in both the major and minor in Anthropology and a writing across the curriculum requirement. It will also provide students in other departments with the opportunity to study aspects of diverse, non-western cultures. The course is currently identified as one that may be taken to fulfill the requirements of the Women's Studies minor.", "prerequisite": "3 credits of ANTH or 3 credits of WMNST", "other": ["Cross-listed with: ANTH 476W", "Writing Across the Curriculum"]}, {"course_name": "WMNST 477: Sociology of Sexuality", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "An analysis of the demographic, social, and cultural factors affecting the developments and experience of sexuality in contemporary society.", "prerequisite": "3 credits in Sociology", "other": ["Cross-listed with: SOC 477"]}, {"course_name": "WMNST 480: Italian Women Writers Through the Centuries", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Analysis of the works of women authors in their historical and literary contexts.  IT 480 Italian Women Writers Through the Centuries (3) Italian women have been stereotyped as the \"mamma\" or grandmother who cooks, prays, and idolizes her sons. Such an image does not accommodate the wide variety of experiences, perspectives, and contributions of Italian women throughout history. This seminar will explore the writings of female authors from delimited historical periods (alternating among Renaissance, 19th and 20th Centuries). Depending on time period, genres will include autobiography, poetry, historical novel, drama, film, nonfiction. Throughout the course we will consider the political and social developments in Italy with an emphasis on issues of special relevance to women. As we approach each text, we will examine such questions as: the significance of its form; the author's use of language; the ways in which masculinity and femininity are constructed; intersections with the text's historical moment; the political, philosophical and/or theological questions posed by the text; the ways in which the text inserts or distances itself from the Italian literary canon; and the text's depictions, re-evaluations and uses of history. Through their journal assignments in class discussion, students will be encouraged to reflect upon the implications of course concepts in their own culture and historical moment. Evaluation methods include participation in class discussion, journal entries, short analysis papers, and a longer (8-10 page) research paper. In Italian. Prerequisite: any 300-level Italian course. This course is conducted in Italian and counts for the Italian major and minor. The ability to screen VHS and DVD videos is necessary. Enrollment is limited to 20, and the course will be offered at lease once every four semesters.", "prerequisite": "junior standing or permission of program", "other": ["Cross-listed with: IT 480"]}, {"course_name": "WMNST 489: British Women Writers", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "A study of selected British women writers.  ENGL (WMNST) 489 British Women Writers (3) This course provides the opportunity to study writing by British Women from a historical perspective and to explore the views these women have of themselves as artists. The course will concentrate on a careful reading of works by a variety of authors. It will address the question of the role gender plays in the selection of literary forms and the development of character, theme, symbols, and rhetorical strategies. It will also explore what particular dimensions British women writers have brought to the British literary tradition.Students will be active learners through keeping reading journals, presenting background reports on the history of women in England, participating in small-group discussions about the texts, and writing 2 shorter essays and one longer research essay for the class. This course focuses on an area of British literature, which more traditionally structured courses tend to obscure. The course will be attractive to students from a variety of programs, including English majors, Women's Studies minors, and Interdisciplinary Humanities students. The course will be offered once every two years. Estimated class size 20.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: ENGL 489", "Bachelor of Arts: Humanities"]}, {"course_name": "WMNST 490: Women Writers and Their Worlds", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "American and British literature written from the perspective of women.  ENGL (WMNST) 490 Women Writers and Their Worlds (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. ENGL/WMNST 490 covers particular aspects of American and British literature written from the perspective of women. The courses stress the diversity of women's authorial worlds, both through time and/or space. The readings and specific focus vary from semester to semester. ENGL/WMNST 490 seeks to make students aware of the extensive body of literature written by women, but, unlike ENGL 194, which is a survey course of women's literature, ENGL/WMNST 490 can be a more intensive course, focusing on selected themes and topics of particular concern to women as reflected in the poetry and fiction of twentieth-century American and British women writers. The class can also be taught in relationship to earlier periods, dealing, for instance, with English women novelists from 1775-1865. In such a class, readings would include fiction by Fanny Burney, Mary Wolistonecraft, Ann Radcliffe, Jane Austen, Mary Shelly, Emily Bronte, Elizabeth Gaskell, and George Eliot. The course would then place each novel in its historical, social, intellectual, and literary context, and explore the various ways in which some of England's best writers transformed their female experience of the world into fiction that extended the range and influenced the development of the novel. Regardless of the particular focus, all sections of the course pose the following questions throughout: Do women use the same myths, archetypes, and literary conventions as male writers? Or do they sometimes have to modify the myths, archetypes, and literary conventions originated by their male precursors in order to adapt them to female experience? Is there such a thing as a distinctively female imagination, with a symbolic language of its own? Is there such a thing as a chain of literary influence linking women writers to each other? What are the strategies for coping with the anxieties of authorship? What is the interaction between gender and genre? In what ways are creativity and procreativity modes of defying prevailing ideologies? Does a woman's psychological development have an effect on the plots a woman novelist conceives? How does women's literature reflect the realities of women's lives? As a course in women's literature, ENGL/WMNST 490 concerns itself with questions of gender. In so far as some of these women writers are black or women of color, it concerns itself with questions of race and ethnicity. In as far as the course looks at women's literature in the context of men's literature, it is concerned with the inter-relationship between dominant (male) and non-dominant (female) culture in the United States as well as in Britain. In so far as the course covers lesbian writers, it is concerned with sexual orientation. Students should expect to complete a minimum of three written assignments in the course, two course papers, and an essay final exam in class. The papers each will ask students to choose a text to analyze in relationship to one of the thematic modules the course has chosen, for instance, to discuss how Virginia Woolf s Mrs. Dalloway analyzes the position of upper-middle class women in a particular moment in history when women had achieved the vote, but were still largely constrained by patriarchal social norms. In addition to written assignments, students will be evaluated on class discussion and general participation. The course not only prepares students for taking up literary and cultural analysis in English classes, but also in any other class that engages in the verbal and written analysis of complex written texts, and in other classes in Women's Studies or in other Penn State departments that address the social, cultural, or ethical issues of gender. The course may be used as English Major elective credit or as credit towards the English Minor; it may also be used in the Women's Studies major and minor. It will be offered once a year with 40 seats per offering.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: ENGL 490", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"course_name": "WMNST 491: American Women Writers", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "A study of selected American women writers. ENGL 492 / AMST 476 / WMNST 491 American Women Writers (3) A study of selected women writers, this course provides the opportunity to study writing by American women from an historical perspective and to explore the views these women have of themselves as artists. The course will concentrate on a careful reading of works by a variety of authors. It will raise the question of the role that gender--as well as other differences such as race, class, and ethnicity--play in the selection of literary forms and the development of character, theme, symbol, and rhetorical strategy. It will also explore the dimensions American women have brought to the American literary tradition. The course satisfies the area requirement in culture for American Studies majors and is open to all majors meeting the prerequisite requirements. The course will be offered once every two years and enrollment is 25.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AMST 476, ENGL 492", "Bachelor of Arts: Humanities"]}, {"course_name": "WMNST 492W: Contemporary Feminist Analysis: The Capstone Senior Seminar", "department": "Women's Studies (WMNST)", "credits": "3 Credits", "description": "Applied critical analysis of any aspect of society and/or culture from a contemporary feminist perspective.  WMNST 492W Current Feminist Issues This course is the capstone course for the Women's Studies major. We keep the course small (15-20 students) and offer it every spring. It is constructed to provide you the opportunity to apply the knowledge and skills you have developed in Women's Studies to some of the major topics being addressed in current academic feminist discourse. The first goal of the course is for each student to become familiar with the major arguments and evidence regarding some of the current major topics in feminism. The second goal is for each student to learn more about the multidisciplinary perspectives of women's studies. The third goal of the course is for each student to develop and demonstrate her skill at carrying out feminist scholarship.There are two core elements of the course. The first is class discussion of readings addressing some of the major current feminist issues. Each year a new set of these topics is put together by the instructor, drawing upon the suggestions of other Women's Studies faculty and majors. The second core element of the course is each individual student doing a term paper. Work on these papers will take place both publicly and privately, so that everyone in the course will learn something about how feminist projects are constructed in the various disciplines represented by the students' choices of topics for their papers.Because this is a W course, 2/3 of your grade will be based on writing assignments. Throughout the course, you will write short (2 page) papers on the readings that we will be discussing in our seminars. You will also write a term paper and some preliminary assignments related to it, including a topic justification paper, an annotated bibliography accompanied by a text description of the major themes identified in the bibliography, a class presentation on your paper topic, and the final 10-15 page paper. The other third of your grade will be based on your participation in seminar discussions.", "prerequisite": "WMNST001 , WMNST301 , WMNST400", "other": ["Writing Across the Curriculum"]}, {"course_name": "WMNST 494: Research Project", "department": "Women's Studies (WMNST)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"course_name": "WMNST 494H: Research Project", "department": "Women's Studies (WMNST)", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"course_name": "WMNST 495: Internship", "department": "Women's Studies (WMNST)", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"course_name": "WMNST 496: Independent Studies", "department": "Women's Studies (WMNST)", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside scope of formal courses."}, {"course_name": "WMNST 497: Special Topics", "department": "Women's Studies (WMNST)", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"course_name": "WMNST 499: Foreign Studies", "department": "Women's Studies (WMNST)", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]