[{"department": "AA", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AA", "number": "100", "credits": "3 Credits", "description": "The arts of the world can be simultaneously universal and unique. By conveying qualities of the human condition (mortality, love, lust, virtues, vices, etc.) the arts can be universal. However, the arts communicating these qualities can be as unique as the cultures that produced them. Consequently, the arts are representative of the commonality and diversity of the peoples of the world.  AA 100 will use the arts to consider similarities and differences among cultures. The primary objective of this course is to develop an appreciation of the arts from a variety of cultures. The scope of this course will be open to all arts from all cultures excluding the United States of America. Given how large a field of study this represents, the course will concentrate on but will not be limited to visual arts, architecture, designed environments, theatre, and music. It will not include all arts from all countries but rather, case studies will be used to provide an in-depth examination of specific examples. Individual case studies will be selected based on qualities indicative of the culture of origin. Care will be given to selecting case studies representative of a wide variety of cultures and time periods. Effort will be made to include examples from the Americas, Asia, Africa, Oceania, South America, and Europe.  AA 100 satisfies Penn State's General Education Arts (GA) and International Cultures (IL) requirements and serves as the foundation course for the International Arts Minor in the College of Arts & Architecture.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "AA", "number": "103", "credits": "3 Credits", "description": "We spend most of our time in interior space where we live, work, learn, and play, and the interior design of these spaces impacts human health and wellbeing. Individual interior spaces and the sequences of interior spaces enable us to make sense of the physical surroundings, enrich our experiences, and express particular personalities and identities. This course introduces the spectrum of interior design necessary to meet physical, psychological, and social human needs for the quality of life. The elements and principles of design in interior space and Gestalt psychology will be explored, while space planning and environmental human behavior theory will be discussed. Considering sustainability, indoor environment quality, and interior materials and finishes will be discussed. Interior design for special needs such as universal design and design for special populations will be introduced. Ultimately, students will recognize interior design as a profession and identify the design process and communication employed by the interior design profession.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AA", "number": "106", "credits": "3 Credits", "description": "This course will consist of 5 modules that will introduce students to emerging technologies that are applicalbe to interdisciplinary electronic design study.  A&A 106 Interdisciplinary Digital Studio (IDS) Seminar II (3) This second foundational course will consist of five three-week modules during which students will be introduced to further study in digital design process and applications that are necessary for IDS design research and creative production. What students learn in this first of two preliminary courses during the first of year in the IDS major will have direct application in digital design problems that will be introduced in the beginning, intermediate, and advanced courses in the IDS Program. Accomplished digital artists and designers consisting of faculty in the School of Visual Arts, the School of Music, the Department of Architecture, and the Department of Landscape Architecture will teach the modules. Content of the five modules will include two and three-dimensional modeling, animation; sound, and game design concepts and processes.", "prerequisite": "DART 100"}, {"department": "AA", "number": "120N", "credits": "3 Credits", "description": "Introduction to Art Therapy is designed to introduce undergraduates to the philosophical, pragmatic and historical bases of the human service field of art therapy, with emphasis on current applications in the field of art therapy. This course provides a brief introduction to art therapy globally, with emphasis on art therapy within the United States, and other expressive therapies and their application to the overall mental health and human service professions. Art experiences, class discussions, case studies and study of artistic productions will be utilized to explore the relationship between art and healing. Students will relate material learned in class to their community by producing a community art project that will address their local community social or cultural needs. The intellectual frameworks and methodologies of art and psychology will be explicitly outlined and drawn upon within the course lessons. Weekly discussions include prompts to stimulate integrative thinking and additionally, reflective visual journaling will be required. Drawing upon the curricular materials of both INART 1 and PSYCH 100 (though not prerequisite courses), assignments for each lesson will include both reading and written discussion about art therapy. While students will acquire knowledge of part of the practice of art therapy, they will not study to the extent of a graduate program in the field. The narrowing of scope allows for a more basic introduction to the field of art therapy, as well as providing a solid foundation for those interested in practicing to pursue a graduate degree. And while students will acquire considerable knowledge of the major approaches in the field, as articulated in selected readings, they will not complete the work necessary to become a practicing art therapist. Instead, the selected readings will allow students to reflect on the relationships and connections between case studies and their own life experiences. The main objectives of the course are to explore the scope and practice of art therapy as a human services profession, art and art making act as a non-verbal benefit to communication, how to become an art therapist, credentials and prerequisites, multiple forms of expressive therapies, and community needs that can be addressed through art making.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AA", "number": "121", "credits": "3 Credits", "description": "This course is an introductory, general education level course based on the premise that design is a fundamental human activity that everyone engages in one way or another. Design encompasses both the ability to imagine that which does not yet exist and to make it appear in concrete form. Design is a form of deliberate, considered action that seeks solutions to problems and creates useful and purposeful artifacts. Design is simultaneously used as a noun and a verb, and to describe a discipline and many fields of practice. Yet design remains essentially a black box to most people - its methods, processes, and components are mysterious, magical, and opaque. This course will turn the \"black box\" of design into a glass box. The course focuses on the relationship between ideas, tools, and artifacts in order to connect theory, practice, and outcomes. Using theory, practice, and artifacts from a range of design fields (including architecture, landscape architecture, product design, engineering, graphic design, environmental design, and design theory itself), the course will empower students to understand design from the perspective most useful to them and their work - ideas, application, and the things they encounter in the world. The course focuses on the kinds of problems, situations, and processes of thinking that are critical for designers, business professionals, engineers, humanists, social scientists and natural scientists. The course is divided into five distinct units, allowing a thematic and comparative analysis of a breadth of design topics: About Design; Design Thinking; The Elements of Design; Design as a Game; and, a Step-by-Step Guide to Design in Action. By the end of the course, students will be equipped with the necessary knowledge and skills to understand and analyze the role of design in the world and to take action themselves, including: * the breadth of design in the world * the power and responsibility of design * a range of design artifacts * how designers think and work * what creativity is and what it entails * understandings of design, design thinking, and creativity across a breadth of disciplines * the parts of design problems * how the design process can be described * strategies and methods applicable to the stages of the design process There are no prerequisites for this course. The course will serve as an introduction to fundamental ideas of design and complement design-focused courses in other departments/programs across the university. The course satisfies general education requirements for Arts (GA) requirements.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AA", "number": "122", "credits": "3 Credits", "description": "Introduction to Graphic Storytelling is a studio exploring the visual language of comics and graphic novels. Assignments will include writing and drawing exercises, and weekly comics projects. Subjects of study and discussion will include contemporary comics and graphic novels, visual communications, comprehensive critical response, creative ideation and development, and the history and theory of sequential art. Through exercises, projects, readings, discussion, and communal feedback, students will develop a personal process for producing graphic narratives.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AA", "number": "130N", "credits": "3 Credits", "description": "Creative Arts Therapies are intermodal professions that combine the visual arts, movement, drama, music, writing and other creative processes to foster deep personal growth and community development. While AA 120N provides cursory knowledge with a brief introduction to expressive arts therapies, Creative Arts Therapy Applications is designed to introduce undergraduates to the depth and practical application of the creative arts therapies, using a variety of approaches to wellness and healing with diverse populations. There is a need to acknowledge the rise in mental health diagnoses and recognize the need for growth and acceptance of helping professions locally, nationally and globally. Professional therapists will explain the needs of their clients, the goals of therapy with these populations, and demonstrate their approaches. Art experiences, class discussions, case studies and study of artistic productions will be utilized to explore the relationship between the arts and healing. Students will relate material learned in class to their self exploration and community by producing a reflective, interdisciplinary course project that will address social or cultural needs through art making. The intellectual frameworks and methodologies of art and human development will be explicitly outlined and drawn upon within the course lessons. The main objectives of the course are to explore the scope and practical applications of the creative arts therapies, the arts and art making of multiple modalities, credentials and prerequisites for how to become a creative arts therapist, and how health and wellness can be impacted by the creative arts at the local, national and global level.", "other": ["General Education: Arts (GA)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AA", "number": "160N", "credits": "3 Credits", "description": "The Virtual Transformational Leadership Development (VTLD) Experience is designed to help develop the next generation of leaders to serve as agents of change in pursuit of a more civil, equitable, and just workplace, society, and world. A guiding principle of The VTLD Experience is that diversity is a fact, inclusion is a choice, equity is an action, and belonging is an outcome.  It leverages technology, including artificial intelligence, machine learning, interactive arts and and employs high impact teaching practices including micro-lessons, rapid learning, reflective exercises, online discussions, meditation and mindfulness practices, an online journal, and synchronous individual transformational leadership development coaching sessions conducted via Zoom. Students enroll in the VTLD Experience from the University Park and the Commonwealth Campuses and have an opportunity to engage with artists curated by the Center for the Performing Arts at Penn State. This involves viewing performances from a distance and digital programming. Fundamentally, the course is an anti-racist, anti-oppression leadership development experience and aligns with the following foundations and thematic priorities of the university's 2016 - 2025 strategic plan:  Foundations  - Engaging Our Students  - Advancing Inclusion, Equity and Diversity  - Enabling a Sustainable Future  Thematic Priorities  - Transforming Education  - Empowering Through Digital Innovation  - Advancing the Arts and Humanities  - Stewarding our Planet's Resources", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AA", "number": "193N", "credits": "3 Credits", "description": "This course combines the literary analysis of comics and graphic novels with the creative practice of making comics. Students will learn through an integrated and ongoing process of interpreting select comics texts and also making their own work in that same medium. Students will gain a technical vocabulary for discussing and assessing comics, which they will then apply to formal analysis of compositional and narrative elements in select assigned texts. This analysis will occur first in class discussion, facilitated by the instructors, and then through a sequence of individual written assignments. At the same time, students will receive formal instruction in making comics as they create their own work over the course of the semester, workshopping with peers and instructors as a way of gaining further insight into the creative and technical processes of the studied texts. Formal analysis and creative work will be coordinated and progressive across the course of the semester. The culmination of this collaborative learning would be an integrated understanding and appreciation of comics art.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "AA", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AA", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AA", "number": "295", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internship. Written and oral critique of activity required."}, {"department": "AA", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "AA", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AA", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AA", "number": "322", "credits": "3 Credits", "description": "Topics include: arts markets, consumptions models, targeted development of aesthetic products, analysis of websites and other marketing materials that communicate artistic value.  A&A 322 Arts Marketing (3)(BA) This course meets the Bachelor of Arts degree requirements. This course will introduce and outline the role, purpose, and perception of \"art\" in various marketplaces and contexts for the emerging arts entrepreneur. Topics include: issues in marketing aesthetic products, consumer identification through art, models of consumer behavior, art and technology, targeted development of arts products/services, and the analysis of websites and other marketing materials that communicate artistic value to appropriate market(s).", "prerequisite": "Third-semester standing", "other": ["Bachelor of Arts: Arts"]}, {"department": "AA", "number": "323", "credits": "3 Credits", "description": "Course outlines the cultural and economic environment of the arts in the United States. Topics include: feasibility study and start-up of for- and non-profit arts ventures, the role of geography, demand and infrastructure considerations in entrepreneurial decision-making.  A&A 323 Arts Enterprise Development (3)(BA) This course meets the Bachelor of Arts degree requirements. This course will introduce and outline the cultural and economic environment of the arts in the United States. Topics include: feasibility study and start-up of for- and non-profit arts ventures, economic and social impact of art and artists in communities, public and private arts support, non-profit culture and basic grantsmanship, arts policy, creative economy efforts, the role of geography, demand and infrastructure considerations in entrepreneurial decision-making, and competition analysis.", "prerequisite": "Third-semester standing"}, {"department": "AA", "number": "324", "credits": "1 Credits/Maximum of 1", "description": "Course surveys general legal considerations in the arts and pertinent issues for monetizing creative work. Course surveys general legal considerations in the arts and pertinent issues for monetizing creative work. Class meetings consist of arts and law faculty collaboratively leading discussions and/or workshops that identify and define areas of legal concern from the perspectives of artistic persons and art implicated organizations. Students will learn how to navigate the U.S. legal system and gain an understanding of intellectual property implications pertaining to the arts. Additionally, students will begin to think, speak, and act in an informed manner when dealing with legal matters, thus enabling them to better identify potential legal issues, recognize when to seek professional legal advice, and be successful artists operating within the domains of business and the law. Topics include: navigating the legal system, intellectual property, contracts, business organization and start-up, taxation, etc.", "prerequisite": "4th semester standing"}, {"department": "AA", "number": "325", "credits": "1 Credits", "description": "AA 325 Arts Entrepreneurship and Professional Photography is an entrepreneurially oriented course, which introduces students to basic ethical professional business practices in photography. Students will learn the foundational knowledge necessary to understand key issues and to remain current as they pursue a professional career in photography or related fields. The course closely follows the best industry practices defined by the principal respected professional photographic organizations such as the American Society of Media Photographers. Professional photographers commonly work as freelance artists and technicians. Such freelance work is by nature entrepreneurial, which presents substantial challenges for creatively motivated students after graduation. This course will augment the creative focus of their arts education with the business realities they will inevitably face in their working life. It links industry best practices with the ethical behaviors necessary to establish and preserve professional reputations."}, {"department": "AA", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AA", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AA", "number": "401", "credits": "1-3 Credits", "description": "The final project required for the International Arts Minor.  A&A 401A&A 401 International Arts Minor Final Project (1-3) The requirements for the International Arts Minor specify that the course applied toward the minor reflect a coherent course of study constructed around a geographic, chronological, or thematic concentration. Also required for the minor is a culminating project that relates to the chosen concentration. The final project is intended to capitalize on the knowledge and experience gained from the prerequisite components of the minor.The topic of the project will be chosen by the student in consultation with the person in charge of the minor. Work toward completion of the project will be overseen by the person in charge of the minor with advice or assistance from other member(s) of the faculty as appropriate.For the purpose of the minor, the arts are very broadly defined to include topics such as the visual arts, architecture, design environments, theatre, music, and literature so most any creative endeavor may be considered for the subject of the final project. The project may result in formats such as a written paper, a work of art, an exhibition, a recital, or a musical composition as long as it conforms to the intent of the requirement for the minor. It is anticipated that the subject of most projects will be cross-cultural or multicultural in nature. For example, a research paper might be thematic such as an intercultural comparison of adaptations of a Greek myth. A studio project might be technical, such as the wood firing techniques employed by Japanese ceramicists.The requirements for the International Arts Minor specifies a project of at least one (1) credit. A7A 401 International Arts Minor Final Project will be offered for one (1) to three (3) credits to accommodate students who may been more than one (1) credit to complete the minor and for those who may propose a project worth more than one (1) credit. A&A 401 may not be repeated.", "prerequisite": "AA 100", "other": ["Bachelor of Arts: Arts"]}, {"department": "AA", "number": "424", "credits": "3 Credits", "description": "Mentored research on an arts venture idea equips students for immediate, informed, individually specific action upon completion of the program.  A&A 424 Arts Entrepreneurship Capstone Research Project (3) This course functions as the impetus for students to bring their specific venture idea(s) into being, by researching the geographic region where they want to operate, using the actual infrastructure necessary to their specific project. By incorporating the acquired knowledge gleaned from previous courses as applied knowledge towards their chosen venture, the students will be operating literally as the CEO, while being mentored and guided through the process. This course is a mechanism for integrating and implementing the feasibility and marketing strategies developed in the previous courses, thus equipping the students for immediate, informed, individually specific action upon completion of the program.", "prerequisite": "AA 323"}, {"department": "AA", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "AA", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "AA", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"department": "AA", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "AA", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AA", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]