[{"department": "AED", "number": "62", "credits": "3 Credits", "description": "Contemporary African and African American Arts and Culture is a hybrid studio/web course in which students have first-hand experiences with African and African American artists, dancers, writers, and musicians to gain understandings of cultures different from their own. Interactive explorations of contemporary African and African American arts reveal multiple histories and perspectives. Transcultural exchanges in this course provide opportunities for self-reflection through the arts.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AED", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AED", "number": "101S", "credits": "3 Credits", "description": "This course introduces students to issues, concepts, and ideas in Art Education.  A ED 101S Introduction to Art Education (3) The objective of the course is to introduce students to basic ideas, areas of inquiry, and experiences in art education. This will be a required course that serves as the first of a sequence of courses in the Art Education major and will provide a beginning point for the rest of the courses in the major. The Art Education Program has two emphases. The first leads to public school teacher certification and the second to an understanding of arts education in settings such as museums and community arts organizations. This introductory course will be broadly based and the content and will be applicable to students in both emphases. This course will be conducted in a seminar format. Evaluation methods for the course will include, for example, critical response papers to readings, observation reports of early field experiences, tests, and portfolio assessment.", "other": ["First-Year Seminar"]}, {"department": "AED", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AED", "number": "201W", "credits": "3 Credits", "description": "Introduction to historical, philosophical, and sociological foundations art education in schools and cultural institutions, museums, and community organizations.  A ED 201W A ED 201W History and Philosophy of Art Education in Schools and Cultural Institutions (3)Art education is not an isolated phenomenon; art teaching and learning has always occurred in the context of broader cultural changes and a range of social factors, including technological developments and population diversity. This course examines the historical, philosophical, and sociological foundations of art education in the United States. Art education can be found in a variety of formal and informal settings, including schools, community arts organizations and museums. Students will examine questions such as, what was the purpose of teaching art in the past? Was art study a means to improving social status, to attaining technical literacy, or to vocational training? Did education in art promote a democratic way of life? Or did it help reproduce existing divisions of race, gender, class, and ethnicity in American society? This course examines past and present developments in art education, paying special attention to the relation of art teaching and learning in contexts of art worlds, schooling, cultural institutions, and changing demographics. While the course will focus on art education in the United States, art education in a global context will be addressed as appropriate.", "other": ["Writing Across the Curriculum"]}, {"department": "AED", "number": "211", "credits": "3 Credits", "description": "Examination of psychological, cultural, aesthetic, philosophical and educational perspectives on creation and response to art in children, adolescents and adults.  A ED 211 Interpreting Art Experience: Social and Behavioral Perspectives (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine the shared human experience of making and responding to visual images and artifacts from the broadest possible range of perspectives, encouraging students to develop an understanding of the role of art experience in their own lives and in the lives of others. How art is learned within specific cultures and subcultures, how understanding and appreciation of particular images and objects evolves, and how experience and learning interacts with fundamental processes of perception, cognition, and interpretation are central themes. Students will draw upon their own personal and cultural histories and consult accounts written by others to explore the role of visual art in contemporary life. Classic and contemporary studies of artistic development and aesthetic response will be reviewed through well-illustrated lectures and amplified through students' active involvement in small scale, collaborative research studies based upon methods commonly used to study the art experience of children, adolescents, and adults without professional expertise in the visual arts; these activities will include close observation, interviews, and the design of preference and drawing studies. As a final course project, each student will construct a case study of a child, adolescent, or adult which describes in detail one perspective on that individual's experience of art in the home, school, museum, and/or other cultural institutions and settings.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "AED", "number": "212", "credits": "1 Credits", "description": "In-depth study of the educational implications of the information on art making and response introduced in A ED 211.  A ED 212 Interpreting Art Experience: Educational Implications (1) A special discussion section attached to A ED 211 and required of students majoring in art education. A ED 212 focuses on the educational implications of the perspectives on art experience presented in A ED 211. This segment of the course will attend specifically to issues related to learners and learning in the visual arts, including characteristics of learners at various stages of development and the ways in which curriculum and instruction can and should be shaped by these considerations."}, {"department": "AED", "number": "225", "credits": "3 Credits", "description": "Issues of diversity in art, education, visual culture, and pedagogy.  A ED 225 Diversity, Pedagogy, and Visual Culture (3) (GA;US)(BA) This course meets the Bachelor of Arts degree requirements. This interdisciplinary course will serve to introduce students to critical understandings of issues of diversity, as they arise in contexts such as the art world, cultural institutions (such as museums and community arts organizations), schools, visual culture, and the culture, educational texts (such as curricula), and history, while developing a theoretical base from educational and cultural theory. By the end of the course, students will understand diversity as broadly defined in relation to visual culture and be able to critically explore the complex dynamics of race, gender, sex, and class, and the pedagogical issues posed by diversity.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)"]}, {"department": "AED", "number": "233N", "credits": "1-3 Credits", "description": "This course is an examination of the strategies, techniques, and theories of learning associated with participatory communities of art, design, and craft practice often found in makerspaces, as well as an introduction to case study methodology for studying these communities both online and in person. This broad range of materials, technologies, and processes emphasizes creativity, sharing knowledge, and do-it-yourself practices that are a part of maker culture. In this context, making may include advanced digital fabrication and traditional forms of craft. Coursework will involve students' hands-on creative production choosing from a variety of maker practices. Additionally, readings and discussion will focus on social and cultural factors in community practices, iterative and creative processes of design, and collaborative learning in maker settings. To increase our understanding of makers and makerspaces, students will utilize case study as a social science methodology.  Students will learn by making artifacts, doing case study research, and synthesizing theories and practices of learning in maker cultures.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AED", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "AED", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "AED", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AED", "number": "303", "credits": "3 Credits", "description": "Basic concepts of current art education theory and practice for the elementary teacher."}, {"department": "AED", "number": "322", "credits": "3 Credits", "description": "The course explores how emerging technologies impact beliefs, practices, research, and communication regarding the nature of knowledge, learning, teaching, remix culture, visuality, materiality, self, and art. Engage with emerging technologies to learn about media arts and pedagogies that address bioethical issues of injustice, equity, diversity, and inclusion in which the borders of self are questioned. Course content considers the premise that humans are not discreet entities but connected through technologies in ways that are socio-cultural, geopolitical, and techno-biological. Through course experiential activities, gamification pedagogies, and a virtual fieldwork component in building and piloting ethical and accessible educational practices in online teaching, students explore identity formation encoded in social-technological practices. The Transcultural Dialogue project builds international relationships creating collaborative art and generating dialogue. The transcultural dialogue theme weaves, throughout the course, issues of contemporary visual culture, cultural practices in relation to particular places, and pedagogical approaches designed to erode assumptions, ignorance, and misunderstandings. Through media arts pedagogies, the course raises bioethical concerns such as systemic injustice and approaches creativity as a social process in developing curriculum and teaching with emergent technologies.", "prerequisite": "5th semester-standing", "other": ["Cross-listed with: BIOET 322", "International Cultures (IL)"]}, {"department": "AED", "number": "323", "credits": "3 Credits", "description": "The study and creation of contemporary art forms as visual culture critiques provide curricular and pedagogical approaches to art education.  A ED 323 Visual Culture and Art Education (3)This course is for Art Education majors in the Schools option. Students will: * Read, critically examine, and discuss postmodern \"texts\" in relation to the ways in which the works and the critical writing that surrounds them participate in, among other issues, the construction of race and gender, and the creation of power and control. * Reflect critically on contemporary writings that address the nature of art, visual culture, artmaking, exhibition, and interpretation as pedagogical processes for making meaning through art. * Create installations, videos, and performances or any combination of the three forms, individually and/or in groups. The purpose of this course is: 1. To assist students to insightfully interpret and create artworks through both writing and artistic media. 2. To provide students with the bases for understanding, interpreting, and critically analyzing contemporary visual culture, which can provide the content of curriculum outlines and unit and lesson plans that students develop in the course for use during internships, student teaching, and as art educators. 3. To provide students with opportunities to develop connections between artworks and their own lives, the lives of their prospective students, and the societies in which they will live. 4. To encourage students to consider race, class, sexual identity, age, and gender issues in art, art education, cultural production, exhibition venues, and career opportunities. TEXTS include popular arts, film, television, video/computer games, music, theatre, fashion, museums, contemporary art, and newsmedia.", "prerequisite": "AED_BS major"}, {"department": "AED", "number": "355Q", "credits": "3 Credits", "description": "Show Me Where It Hurts: Healthcare and Creative Inquiry is an interdisciplinary exploration of the dynamics of healthcare using both storytelling and artmaking as research methods. Stories of healthcare professionals, caregivers, and self-care will be explored to understand the actions and emotions that constitute empathy as the ability to relate to another person's experiences. By the end of the course, students' deeper understanding for how sharing experiences through the arts can increase empathy in human relationships will augment perspectives on care within healthcare systems either as professionals or patients. The course investigates methods for developing empathy that employ narrative and arts-based inquiry while also exploring a range of resources unique to Penn State to increase understanding such as the Graphic Medicine Series and the Art and Design Research Incubator (ADRI). Students will develop multiple modes of communication appropriate to the social sciences and the arts to develop effective communication in writing, presenting, and artmaking in thematic projects. The course pursues three themes throughout the semester: Theme 1: Seeing, Knowing, and Understanding \" Engaging with forms of narrative, art and performance to understand how artists and social scientists use observation, data, and interpretation to inform their practices Theme 2: Developing Capacity for Empathy \" Utilizing art studio explorations with materials and techniques combined with reflective writing practices, students engage in creative thinking skills to heighten empathic ways of knowing through the medium of art and narrative. Theme 3: Analyzing Perspectives in Art and Health \" Analyze case studies focused on art and health to explore healthcare from three perspectives: healthcare professionals, caregivers, and self-care.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AED", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "AED", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AED", "number": "401", "credits": "3 Credits", "description": "Preparation of curricula, pedagogical, and assessment strategies for elementary/secondary school and museum art education programs.", "prerequisite": "AED_BS Major or Permission of Instructor"}, {"department": "AED", "number": "488", "credits": "1-3 Credits/Maximum of 3", "description": "Supervised field experience in a museum or other cultural institution, including planning, implementation, and evaluation of an educational project.", "prerequisite": "AED 401"}, {"department": "AED", "number": "489", "credits": "4 Credits", "description": "This course provides a broad exploration of student teaching experience and professional practices at the preK, primary and secondary levels. In particular, it investigates areas of curriculum development and classroom management under supervision from a qualified instructor. It considers teacher preparation and builds an awareness of best practices for art educators, especially in relation to experiential learning. As this course serves as the final capstone course for the art education major, students will learn of the importance of professional standards and practices in art education and identify and apply contemporary approaches in art education to determine their own preferred methods of teaching. Teacher preparation and experiential learning are enhanced through reflection, refinement, and synthesis of coursework. Building on these insights, students conduct eight weeks of supervised student teaching and apply this practicum experience to create a comprehensive professional art teacher portfolio. Students will complete and publicly present, their teaching and learning portfolios that includes evidence of professional preparation, biographical information, samples of artwork and writings on art, and reflective statements explaining the selection and significance of specific items.", "prerequisite": "AED 401"}, {"department": "AED", "number": "490", "credits": "3 Credits/Maximum of 3", "description": "Synthesis of preservice art education coursework; introduction to professional practices and standards; completion of teaching and learning portfolio.  AED 490 Capstone Course in Art Education (2) The capstone course has four major objectives for student learning. Each student will synthesize the experiences and understandings developed through prior courses in the undergraduate art education program. - Students will become aware of emerging trends in art education and reflect on implications of those trends for their future teaching and learning. Each student will complete, and publicly present, a teaching and learning portfolio that includes evidence of professional preparation, biographical information, samples of artwork and writings on art/visual culture, and reflective statements explaining the selection and significance of specific items. Students will gain understanding of the importance of professional standards and practices in art education. Student learning will be evaluated through assessment of the preprofessional teaching portfolio, and through a combination of written assignments, individual and small group oral presentations, and active participation in class discussions. Students will collaborate on a final installation, performance or exhibition demonstrating their readiness for the final internship. Since this is the final course in the major prior to student teaching or the internship, attendance is very important and will count toward part of the final grade. Students need access to a computer lab. The capstone course in the art education major should be taken in the final semester before student teaching or a final internship. Since one goal of the course is helping students synthesize what they have learned in their prior courses, successful completion of all of the required courses in the major is prerequisite to enrollment in the capstone course. Students will have been introduced to the teaching and learning portfolio in their introductory art education course and should have developed pieces for their pre-professional teaching portifolios in most of their earlier art education courses. Much of the work of the capstone course will, therefore, focus on reflection, refinement, and synthesis.", "prerequisite": "Admission to Teacher Preparation Program and successful   completion of all required courses in the major except Student Teaching or final internship."}, {"department": "AED", "number": "494", "credits": "3 Credits", "description": "Museum education: issues, theories of aesthetic education and practices in schools, museums, and community art centers."}, {"department": "AED", "number": "494H", "credits": "3 Credits", "description": "Museum education: issues, theories of aesthetic education and practices in schools, museums, and community art centers.", "other": ["Honors"]}, {"department": "AED", "number": "495", "credits": "15 Credits", "description": "Comprehensive instruction in craft, health, cultural, museum, studio, gallery or social agency. Students supervised by University personnel and arts personnel.", "prerequisite": "AED_BS majors only or permission of instructor"}, {"department": "AED", "number": "495A", "credits": "7 Credits", "description": "A ED 495A A ED 495A Art Education Student Teaching Practicum (7) The Pittsburgh-based elementary or middle-level field experience fulfills the student teaching requirement for Pennsylvania certification to teach art in elementary and secondary schools. It is offered each semester, and student teachers are placed through the School District University. Collaborative in Pittsburgh Public Schools. An on-site Art Education faculty Supervisor supervises students. Assignments, required seminars, and professional development activities meet the teaching prerequisites outlined by NCATE (National Council for Accreditation of Teacher Education) and the Standards for Pre-Service Teachers in Urban Education. Experiences and assignments provide evidence in each of the four domains for teacher preparation: Domain A - Planning and Preparing for Student Learning, Domain B - Teaching, Domain C - Analyzing Student Learning and Inquiring into Teaching, and Domain D - Fulfilling Professional Responsibilities. The work completed in this course (a digital and/or paper-based portfolio, and documented performance-based assessment of teaching as assessed by the university supervisor and mentor teachers/clinical instructors) will demonstrate fulfillment of the teaching/domain standards. The outcome of this work is to produce multiple experiences that support professional and personal development while preparing students for upcoming positions teaching art in multiple public and private contexts at both elementary and secondary levels. At the culmination of the student teaching semester, students will have both practical and theoretical understandings in addition to materials for application within the classroom.", "prerequisite": "AED 489"}, {"department": "AED", "number": "495B", "credits": "8 Credits", "description": "A ED 495B A ED 495B Art Education Student Teaching Practicum (8) The Pittsburgh-based middle-level or secondary field experience fulfills the student teaching requirement for Pennsylvania certification to teach art in elementary and secondary schools. It is offered each semester, and student teachers are placed through the School District University Collaborative in Pittsburgh Public Schools. An on-site Art Education faculty Supervisor supervises students. Assignments, required seminars, and professional development activities meet the teaching prerequisites outlined by NCATE (National Council for Accreditation of Teacher Education) and the Standards for Pre-Service Teachers in Urban Education. Experiences and assignments provide evidence in each of the four domains for teacher preparation: Domain A - Planning and Preparation for Student Learning, Domain B - Teaching, Domain C - Analyzing Student Learning and Inquiring into Teaching, and Domain D - Fulfilling Professional Responsibilities. The work complete in this course (a digital and/or paper-based portfolio, and documented performance-based assessment of teaching as assessed by the university supervisor and mentor teachers/clinical instructors) will demonstrate fulfillment of the teaching/domain standards. The outcome of this work is to produce multiple experiences that support professional and personal development while preparing students for upcoming positions teaching art in multiple public and private contexts at both elementary and secondary levels. At the culmination of the student teaching semester, students will have both practical and theoretical understandings in addition to materials for application within the classroom.", "prerequisite": "AED 489"}, {"department": "AED", "number": "495C", "credits": "7 Credits", "description": "A ED 495C A ED 495C Art Education Student Teaching Practicum (7) The Centre Region-based elementary or middle-level field experience fulfills the student teaching requirement for Pennsylvania certification to teach art in elementary and secondary schools. It is offered each semester, and student teachers are placed through the School of Visual Arts at Penn State in cooperation with public schools in the Centre Region. An Art Education faculty Supervisor supervises students. Assignment, required seminars, and professional development activities meet the teaching prerequisites outlined by NCATE (National Council for Accreditation of Teacher Education) and the Standards for Pre-Service Teachers in Urban Education. Experiences and assignments provide evidence in each of the four domains for teacher preparation: Domain A - Planning and Preparing for Student Learning, Domain B - Teaching, Domain C - Analyzing Student Learning and Inquiring into Teaching, and Domain D - Fulfilling Professional Responsibilities. The work completed in this course (a digital and/or paper-based portfolio, and documented performance-based assessment of teaching as assessed by the university supervisor and mentor teachers/clinical instructors) will demonstrate fulfillment of the teaching/domain standards. The outcome of this work is to produce multiple experiences that support professional and personal development while preparing students for upcoming positions teaching art in multiple public and private contexts at both elementary and secondary levels. At the culmination of the student teaching semester, students will have both practical and theoretical understandings in addition to materials for application within the classroom.", "prerequisite": "AED 489"}, {"department": "AED", "number": "495D", "credits": "8 Credits", "description": "A ED 495D A ED 495D Art Education Student Teaching Practicum (8) The Centre Region-based middle-level or secondary field experience fulfills the student teaching requirement for Pennsylvania certification to teach art in elementary and secondary schools. It is offered each semester, and student teachers are placed through the School of Visual Arts at Penn State in cooperation with public schools in the Centre Region. An on-site Art Education faculty Supervisor supervises students. Assignments, required seminars, and professional development activities meet the teaching prerequisites outlined by NCATE (National Council for Accreditation of Teacher Education) and the Standards for Pre-Service Teachers in Urban Education. Experiences and assignments provide evidence in each of the four domains for teacher preparation: Domain A - Planning and Preparing for Student Learning, Domain B - Teaching, Domain C - Analyzing Student Learning and Inquiring into Teaching, and Domain D - Fulfilling Professional Responsibilities. The work complete in this course (a digital and/or paper-based portfolio, and documented performance-based assessment of teaching as assessed by the university supervisor and mentor teachers/clinical instructors) will demonstrate fulfillment of the teaching/domain standards. The outcome of this work is to produce multiple experiences that support professional and personal development while preparing students for upcoming positions teaching art in multiple public and private contexts at both elementary and secondary levels. At the culmination of the student teaching semester, students will have both practical and theoretical understandings in addition to materials for application within the classroom.", "prerequisite": "AED 489"}, {"department": "AED", "number": "495E", "credits": "15 Credits", "description": "S ED 495E A ED 495E Internship in Museums and Cultural Institutions (15) The internship at a museum or other cultural institution completes the requirements for the Museums and Cultural Institutions option for the BS in Art Education. It is generally scheduled full-time for a period of 12 consecutive weeks during a double summer session, although it may also be taken during the fall or spring semester. The internship enables interns to meet their own educational objectives through participation in a supervised experience that moves them out of the classroom into the workplace. Prospective interns are encouraged to select internship sites that offer educational experiences relevant to their professional goals and desired careers.The internship incorporates guidelines consistent with theStandards and Guidelines for Museum Internshipsprepared by the New England Museum Association and published by the American Association of Museums (1993, 2000). A formal written internship agreement signed by the intern supervisor at the sponsoring museum or cultural institution, and by the prospective intern and university supervisor outlines the objectives of the internship, the intern's duties and responsibilities, the responsibilities of the museum and university supervisors, and the means by which the intern's work will be evaluated. Interns are integrated into the ongoing work and education programs of the museum and treated as staff members. They assume professional responsibilities and are expected to complete a project or some discrete portion of a major project that is being undertaken by the education department of the museum. Interns become acquainted with functions, programs and departments of the museum in addition to those to which they have been assigned in order to understand the relationship of their educational work to that of the museum, to the community, and to the museum field in general. Interns may participate in any workshops, lectures, professional courses, and staff training seminars that may occur at the museum during period of internship. They are also encouraged to seek professional employment after completion of the internship, and reasonable accommodation is made to allow them time to look for positions, prepare application materials, and attend interviews.Interns submit a weekly journal of activities and reflections to the university supervisor, as well as a summary report at the end. The museum supervisor submits an evaluation documenting the intern's actual working/learning experiences and critically assessing these experiences. The final evaluation is based on this assessment, on the intern's weekly journal and final report, and on the university supervisors's onsite observations and interviews.", "prerequisite": "AED 489"}, {"department": "AED", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "AED", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "AED", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]