[{"department": "AG", "number": "100", "credits": "1 Credits", "description": "Strategies and skills designed to identify career/life goals and implement career decisions.", "other": ["Cross-listed with: SC 101"]}, {"department": "AG", "number": "113", "credits": "1 Credits", "description": "Examination of career opportunities in agriculture with an exploration of the relationship between student interest and career decisions."}, {"department": "AG", "number": "150", "credits": "2 Credits", "description": "Students explore agricultural issues and research methodologies through literature review, library searches, field studies, and critical thinking.", "prerequisite": "first- or second-semester standing", "other": ["First-Year Seminar"]}, {"department": "AG", "number": "160", "credits": "3 Credits", "description": "This course covers ethics and the social contract to include substantive ethical theories focusing on rights-based ethical theories (libertarianism and egalitarian theories) and consequentialist theories (utilitarianism and axiology). These theories assist in conceptually defining levels of participation and consent in democracy. This course explores the circumstances in which rational persons and political groups historically agree to be bound in collective decision making. The primary focus by examines four separate ethical themes illustrating why and how individuals accept a variety of terms.The course highlights philosophical/ethical decisions related to agriculture issues during the history of the United States. Issues range from non-interference rights to opportunity rights dealing with food, fiber, natural resource and environmental issues. Procedural theory emphasizes the formation of legitimate and defensible rules rather than ethics. Policy choices are assumed to be legitimate and defensible as long as individuals follow the rules/procedures for decision making. The content of this course meshes the procedural and the substance theories found throughout historical debates in agriculture communities. The course identifies traditional agrarian problem identification, policy formation, policy adoption and funding, program implementation and program evaluation.How ethics figures historically in agriculture policy processes is applied in a variety of case studies and debates as well as selected readings. The course includes an examination of the ethics of when, how and where the policy process historically influenced agriculture public policies. The course emphasizes the need to critically think about various points of view expressed by various conflicting authors.", "other": ["Cross-listed with: CED 160", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AG", "number": "160S", "credits": "3 Credits", "description": "Introduce students to the University and College of Ag Sciences preparing them to succeed. Review ethical theories and issues in American agriculture.  AG 160S Introduction to Ethics and Issues in Agriculture (3)This course introduces students to contemporary issues, ethical theories and principles, and the application of critical thinking and communication skills related to topics in agriculture, renewable natural resources, and the environment. Additional emphasis will be placed on developing the skills that help achieve academic success at Penn State through these speakers and activities. Course content will include analyzing moral positions based on three ethical theories: normative ethics, descriptive ethics, and metaethics; and four ethical principles: beneficence, nonmaleficence, respect for autonomy, and justice. Guest speakers, field trips and interactive activities, which feature disciplines in the College of Agricultural Sciences, will supplement the course materials and enrich the educational experience. In addition, various career and networking opportunities with internationally acclaimed faculty and staff, current students, and alumni will be featured.", "prerequisite": "first or second semester standing", "other": ["General Education: Humanities (GH)"]}, {"department": "AG", "number": "180N", "credits": "3 Credits", "description": "This course addresses how past and present impacts of food, agriculture, and natural resources have played a role in human, community, and land development in Pennsylvania and the United States within the context of the global community. With a focus on contemporary issues, ethical theories and principles, and the application of critical thinking and communication skills related to topics in agriculture, renewable natural resources, and the environment. Students will analyze moral positions based on ethical theories, principles, and ethical values.  This will be accomplished through interactions with College of Agricultural Science faculty/staff, guest speakers, student investigation on various topics, exposure to the mission and role of a land grant university, introduction to issues, challenges, and discoveries in the food and fiber production and processing disciplines.", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AG", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "AG", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AG", "number": "400", "credits": "4 Credits", "description": "Application of statistical techniques to experimental and survey research in the life sciences.", "prerequisite": "6 credits in the natural sciences"}, {"department": "AG", "number": "422", "credits": "1 Credits", "description": "This course provides opportunities to develop effective communication skills within the context of scientific research. Students participating in independent studies with faculty mentors will use their independent research projects as the subject of a series of exercises that will enhance their abilities to share scientific ideals and findings with a variety of audiences including grant writing, poster presentations, and both technical and non-technical oral presentations about research topics. This course will prepare students for graduate school and, importantly, provide students with a set of skills that would be applicable to any career.", "other": ["Cross-listed with: FDSC 422"]}, {"department": "AG", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "AG", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "AG", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Independent study and supervised field experience related to the student's major. Written and oral critique of activity required.", "prerequisite": "approval of proposed assignment by instructor prior to advance   registration deadline in semester preceding that semester in   which the assignment is to be carried out", "other": ["Full-Time Equivalent Course"]}, {"department": "AG", "number": "495A", "credits": "1-3 Credits"}, {"department": "AG", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]