[{"department": "AGBM", "number": "101", "credits": "3 Credits", "description": "This course introduces students to microeconomic principles in the context of food and agriculture. More specifically, the course examines market supply and market demand in various food and agricultural products, then examines how consumers make decisions about food to maximize their utility subject to a budget constraint, then examines profit-maximizing decisions by farms and food industry firms, and finally looks at special topics related to food and agriculture. By the end of the course, students will have key literacies on economic modeling and decision making as well as the food and agricultural sectors of the U.S. economy.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "AGBM", "number": "102", "credits": "3 Credits", "description": "Introduction to topics designed to develop an understanding of how the food production, processing, and marketing system works and evolves."}, {"department": "AGBM", "number": "106", "credits": "3 Credits", "description": "Development of quantitative problem-solving skills applied to specific examples of agribusiness management problems, using EXCEL spreadsheets. AGBM 106 Agribusiness Problem Solving (3) The goal of this course is to develop agribusiness problem solving skills. These skills include optimization, marginal analysis, time discounting, and measuring efficiency. Examples will be implemented using Microsoft EXCEL spreadsheets rather than algebra, calculus and abstract mathematics. This course, then, plays an important role by building skills for use in later agribusiness management courses as well as teaching important problem-solving skills to non-majors who want to learn quantitative economics problem-solving skills in the context of agribusiness management. Material will be organized according to the course topics areas: optimization, marginal analysis, time discounting, and efficiently measurement. Each topic area presentation will rely on specific examples of agribusiness management problems. The first lecture of each week will be a standard lecture emphasizing concepts, presented in a passive learning format. The second lecture of each week will be presented in a technology classroom with spreadsheet examples being worked out by the professor in front of the class, who will guide the students. The third lecture of each week will be taught in a computer laboratory, with students solving the problems actively, but with supervision. Problem solving skills will be reinforced by assigning problem sets for students to do on their own after the computer laboratory experience. It is permitted for students to submit identical lab answers but problem sets should not be identical.", "prerequisite": "AGBM 101", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "AGBM", "number": "170", "credits": "3 Credits", "description": "Our food system is a product of complex interaction of three systems: the natural ecosystem, the managed agricultural system, and the socio-economic system. Farming, food processing, food distribution, and consumption decisions are all governed by the interaction of these systems. Consequences of these decisions, along with the interactions themselves, have generated a number of overarching scientific and social \"hot-button\" topics that affect or are affected by the food system such as genetically modified organisms (GMOs), organic crops and food, agricultural and food policy, environmental implications from agriculture food safety, food safety, diet and health, agricultural trade and international development, and food insecurity and food access.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AGBM", "number": "170Z", "credits": "3 Credits", "description": "The American food system is a product of complex interaction of three systems: the natural ecosystem, the managed agricultural system, and the socio-economic system. Farming, food processing, food distribution, and consumption decisions are all governed by the interaction of these systems. Consequences of these decisions, along with the interactions themselves, have generated a number of overarching scientific and social \"hot-button\" topics that affect or are affected by the food system such as genetically modified organisms (GMOs), organic crops and food, agricultural and food policy, environmental implications from agriculture food safety, food safety, diet and health, agricultural trade and international development, and domestic food insecurity and food access. Students in this course will investigate and discuss all of these topics by reading both popular press accounts and peer-reviewed academic research, and by hearing guest speakers from a variety of fields and academic disciplines. However, to provide additional relevance, the course will use specific foods or crops to provide a more concrete examination of these topics. For a wide range of foods and crops grown in or imported to the U.S, students will learn the following: 1. Where many of our crops are grown and why. 2. How labor intensive, chemical-intensive, biotechnology intensive, and equipment intensive many of our crops are. 3. What U.S. policies affect production, distribution, and consumption of many crops and food. 4. How large agribusiness companies may influence our crops' production, distribution, and consumption. 5. How consumer groups may influence our crops' production, distribution, and consumption. And, 6. Whether or not alternative production and marketing systems exist for many crops. AGBM 170Z is linked to NUTR 175Z", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "General Education - Integrative: Linked", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AGBM", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction", "other": ["International Cultures (IL)"]}, {"department": "AGBM", "number": "200", "credits": "3 Credits", "description": "Application of management principles and processes to agricultural business firms in their planning and operating in domestic and international markets. AGBM 200 Introduction to Agricultural Business Management (3) AGBM 200 is the course for people who wish to combine a technical major with an interest in the business management of agricultural and food based businesses. This is the combination of skills that employers most desire when they look for potential employees.Examples from a variety of industries in agribusiness are used to present the principles of business management. In addition, emphasis is also given to exploring the institutions, and issues such as food safety and biotechnology that are unique to managers in the agribusiness sector. The presentation of the material in an agricultural and food context enhances your chances for learning so you can become more \"employer ready.\" Regardless of your major, most people will find themselves as business managers some time during their careers because they will have to manage time, money and people. The material you will learn in this class focuses on the principles of agribusiness management. Principles endure and are always applicable regardless of when and where you apply them. When you have completed AGBM 200 successfully you will have a firm grasp of the critical agribusiness management skills you will need to successfully handle just about any management situation you might face.NO PRIOR BUSINESS EXPERIENCE IS REQUIRED OR EXPECTED OF THOSE TAKING THIS COURSE. AGBM 200 deals primarily with the principles of agribusiness management. I will not be teaching you the material in the book. Classroom time will be spent discussing and applying the reading material and decision cases that were assigned for that day. This approach will allow us to cover more material in greater depth. It should enhance your learning because it will engage your higher level thinking skills."}, {"department": "AGBM", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "AGBM", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "AGBM", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AGBM", "number": "302", "credits": "3 Credits", "description": "Analysis of economic and psychological determinants of the demand for food; marketing decisions in an increasingly consumer-driven food system.", "prerequisite": "AGBM 101"}, {"department": "AGBM", "number": "308W", "credits": "3 Credits", "description": "This course is designed to analyze strategic decision making among agribusiness firms and other economic agents in a market environment characterized by imperfect information and market power. The course draws upon game theory and other strategic decision tools to analyze four broad types of strategic decisions, each of which corresponds with the four main parts of the course: 1) Strategic Decisions Between Rival Firms : Focusing on firm decisions made between rivals with full information, part one includes the following topics and strategies: limit pricing, entry deterrence, predatory pricing, excess capacity, wars of attrition, strategic commitment, tit-for-tat pricing, and retaliation. 2) Strategic Firm Decisions in an Uncertain World : Focusing on firm decisions made with incomplete information, part two, includes topics on probabilities, expected value and expected utility, learning curves, investment decisions, flexibility, and option value. 3) Strategic Decisions Between Unequal Partners: Focusing on firm decisions made between unequal partners with asymmetric information, part three includes topics on vertical coordination, incentive compensation, franchising, and auctions. 4) Cooperation and Strategic Alliances: Part four investigates how firms can overcome informational problems described above through the use of strategic partnerships. This writing, intensive course will rely on both class lectures and a substantial amount of class discussion. The course content will feature eight to ten industry applications and case studies of individual companies to reinforce economic theory. Learning Objectives- Students will: Classify practical agribusiness problems by the type of available information - full, incomplete, or imperfect and by the nature of market power in an industry. Construct and analyze game trees and other representative models of strategic decisions facing businesses and employees. Solve strategic business problems using economic models based on game theory and other economic principles. Write business-style memos and reports that summarize a business decision, plan, or solution that is supported by economic analysis.", "prerequisite": "AGBM 101", "other": ["Writing Across the Curriculum"]}, {"department": "AGBM", "number": "320", "credits": "3 Credits", "description": "Students learn how prices are determined and learn how to analyze and forecast how prices change as the underlying conditions change. This involves learning those tools that are used to analyze and understand how commodity markets work and how prices are determined. The class mixes theory with practical knowledge and examples, and aims to create a balanced representation of the tools used in market analysis. The students learn how to find data, manipulate it and analyze and apply these skills to test the validity of simple economic models, to forecast commodity prices, to understand market trends and learn the use of derivative instruments to manage price risk. One objective of this class is to improve the understanding of economic modeling and to increase the familiarity of students when applying statistical functions and regression analysis to solve applied problems. These core competencies rely on previous knowledge of basic statistic tools and data manipulation. In the process, students will learn to analyze market fundamentals and better understand those forces that affect prices. This will also help them better understand supply and demand and the ability of market participants to adjust to changing conditions.", "prerequisite": "AGBM 101"}, {"department": "AGBM", "number": "338", "credits": "3 Credits", "description": "Managing agribusinesses in the global food industry, international food product marketing, key public institution and policies affecting food trade.", "prerequisite": "AGBM 101", "other": ["International Cultures (IL)"]}, {"department": "AGBM", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "AGBM", "number": "407", "credits": "3 Credits", "description": "Economic principles applied to the management of farms, with particular emphasis on the financial aspects of management.", "prerequisite": "AGBM 101"}, {"department": "AGBM", "number": "408", "credits": "3 Credits", "description": "Develop financial management and business analysis skills, integrating previous course work and finance training; principles of financial management, planning, control.", "prerequisite": "FIN 301"}, {"department": "AGBM", "number": "420", "credits": "3 Credits", "description": "Understand and forecast price level and volatility for commodities, differentiated products, services.  Why markets work and why they may not.", "prerequisite": "AGBM 320"}, {"department": "AGBM", "number": "430", "credits": "3 Credits", "description": "This course introduces students to the broad array of food and agricultural policies in the United States. Food and agricultural policies encompass laws, regulations, decisions, and actions by governments, industry, and other institutions that influence food production, distribution and consumption. Real-world controversies and debates motivate the course's attention to economic principles, research tools, policy analysis, and contemporary data sources. The course assumes that society is concerned not just about the economic interests of farmers, but also about nutrition, food security, the environment, and welfare of all participants in the food system. Topics covered may include crop subsidies, crop insurance, agro-environmental policies, farm labor and immigration policies, USDA national organic standards, tariffs and other trade policies, food-safety and food-labeling policies, and food-assistance and food-access polices. For a wide range of specific policies, students will study and discuss policy mechanics, the underlying issues that created a need for the policies, the institutional settings of the policies, and the policies' effectiveness.", "prerequisite": "AGBM 338"}, {"department": "AGBM", "number": "440", "credits": "3 Credits", "description": "A problem-based course designed to enhance decision-making skills in the context of industry's approach to developing new food products.", "prerequisite": "AG BM302 or junior/senior standing in Food Science"}, {"department": "AGBM", "number": "445", "credits": "3 Credits/Maximum of 6", "description": "Recommended Preparations: Completion of AGBM 308 or Completion of MGMT 215 or ENGR 310 New firm creation and venture funding within food, agriculture and biorenewables (AgTech) is occurring at a record pace. Venture capitalist have invested billions of dollars in business start-ups that address pressing needs in food, agriculture and bio-renewables. New firm formation and venture funding are expected to significantly increase over the coming decades. Numerous stakeholders recognize the transformative power of entrepreneurship and innovation in agriculture. AgTech entrepreneurs are viewed as powerful change agents for our next innovative age in agriculture as we seek to provide for humanity and our ecosystem while addressing the constraints of population growth and resource scarcity. The proposed course will provide students with an introductory overview of entrepreneurship opportunities in AgTech, basic understanding of entrepreneurial concepts and address whether an entrepreneurial career suits their interests. Students will be guided through several self-evaluation exercises to identify their professional strengths, weaknesses and interests. In addition students will develop their business research, evaluation, writing, presentation and critical thinking skills. In order to simulate a realistic preview of entrepreneurship this course will allow students to practice self-organization skills for opportunity effectuation where few guidelines are provided. Several core entrepreneurial concepts will be reviewed in this course and contextualized within AgTech when possible. Topics are founder/team dynamics, value proposition, business models, market research, financial analysis, funding sources/considerations, business ethics and intellectual property. Each topic will be presented in a summative format with access to additional resources for better in-depth understanding. After completing the course students will have improved general business knowledge that is contextualized for new firm creation. The course utilizes a blend of lecture content, student discussion, interaction and hands on exercises that help build student comfort with ambiguity, uncertainty and complex problem solving. Students will also be required to work on projects in teams. Student teams will conduct a start-up due diligence project and lead one class discussion on an AgTech subsector topic of their interest. Students will also be required to prepare a formal eight-minute business idea pitch with accompanying investor prospectus brief.", "prerequisite": "AGBM 308W"}, {"department": "AGBM", "number": "455", "credits": "3 Credits", "description": "The nature, operation, and management of retail garden centers, winery tasting rooms, and independent food retailers. Overview of retail marketing principles and practices as they pertaining to horticultural retail businesses. Lectures, discussions, and projects focus on: selecting and pricing goods and services ; how independent retailers effectively use traditional promotion avenues and social media networks to connect with customers; and how to develop a relevant brand, cause marketing effort, and loyalty program. Students will also learn: about retail layout and display strategies; that each consumer segment has different wants, interests, and abilities to obtain goods and services, and about effective employee management.", "prerequisite": "AGBM 101", "other": ["Cross-listed with: HORT 455"]}, {"department": "AGBM", "number": "460", "credits": "3 Credits", "description": "Firm management in the food system; coordination with suppliers and customers, including supply chain management, strategic thinking, risk management.", "prerequisite": "AG BM320 , AG BM338"}, {"department": "AGBM", "number": "470A", "credits": "2.5 Credits", "description": "This course is designed to explore key similarities and differences in the food and agricultural systems of the United States and France. It introduces students to a number of overarching food and agricultural topics that pertain to both countries, and students explore and analyze these key issues from both countries perspective. These overarching topics include the structure of agricultural and environmental policies, the use agricultural land for biofuel production, organic agriculture, food safety, attitudes and policies surrounding the use of genetically modified crops, the role of large agribusiness firms, attitudes towards diet and health, and several others important topics. Students conduct background reading on these topics, hear lectures -- sometimes from guest presenters -- that frame the topics from both the U.S. and France's perspective, and write reports on specific crops or foods that expose key similarities and differences between the two food systems. Finally, students pick one crop or food for an oral presentation that contains background information on how that crop fits into the two food systems, U.S. and France, and analyzes the key issues that relate to the overarching topics already identified. This course has two components that must be taken in partnership: 470A (FOOD SYS US/FRANCE I) and 470B (FOOD SYS US/FRANCE II). The first is a classroom - based course, and meets regularly during the semester. The second is a two - week component that takes place after the end of the semester. In this second component, after traveling to France, students hear presentations from the French perspective on the overarching topics identified earlier and also explore the topics first hand via field trips to farms, wholesale markets, retail markets, and other places relevant to the French food system. This component is organized by a host university, AgroParisTech. For these two weeks, students live in dorms within the city of Paris. Knowledge of French is not required.", "prerequisite": "AGBM 101", "other": ["Cross-listed with: INTAG 470A"]}, {"department": "AGBM", "number": "470B", "credits": "0.5 Credits", "description": "Explore key differences and similarities in the food and agricultural systems of the United Sates and France. INTAG 470B / AGBM 470B Comparing Agricultural and Food Systems in the US and France: Travel (0.5) This course is designed to explore key similarities and differences in the food and agricultural systems of the United States and France. It introduces students to a number of overarching food and agricultural topics that pertain to both countries, and students explore and analyze these key issues from both countries perspective. These overarching topics include the structure of agricultural and environmental policies, the use agricultural land for biofuel production, organic agriculture, food safety, attitudes and policies surrounding the use of genetically modified crops, the role of large agribusiness firms, attitudes towards diet and health, and several others important topics. Students conduct background reading on these topics, hear lectures -- sometimes from guest presenters -- that frame the topics from both the U.S. and France's perspective, and write reports on specific crops or foods that expose key similarities and differences between the two food systems. Finally, students pick one crop or food for an oral presentation that contains background information on how that crop fits into the two food systems, U.S. and France, and analyzes the key issues that relate to the overarching topics already identified. This course has two components that must be taken in partnership: 470A (FOOD SYS US/FRANCE I) and 470B (FOOD SYS US/FRANCE II). The first is a classroom - based course, and meets regularly during the semester. The second is a two - week component that takes place after the end of the semester. In this second component, after traveling to France, students hear presentations from the French perspective on the overarching topics identified earlier and also explore the topics first hand via field trips to farms, wholesale markets, retail markets, and other places relevant to the French food system. This component is organized by a host university, AgroParisTech. For these two weeks, students live in dorms within the city of Paris. Knowledge of French is not required.", "prerequisite": "INTAG470A or AG BM470A", "other": ["Cross-listed with: INTAG 470B"]}, {"department": "AGBM", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group basis."}, {"department": "AGBM", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by a faculty supervisor that culminates in the production of Agribusiness Management honors thesis.", "prerequisite": "junior or senior standing in the Schreyer Honors College and   permission of the Agribusiness Management honors advisor", "other": ["Honors"]}, {"department": "AGBM", "number": "495A", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised field experience in an agribusiness or rural development setting.", "prerequisite": "prior approval by department", "other": ["Full-Time Equivalent Course"]}, {"department": "AGBM", "number": "495B", "credits": "6 Credits/Maximum of 6", "description": "Supervised field experience related to student's major, minor, or option.", "prerequisite": "prior approval by department", "other": ["Full-Time Equivalent Course"]}, {"department": "AGBM", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "AGBM", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "AGBM", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Study in selected countries of agricultural economic institutions and current agricultural economic problems.", "other": ["International Cultures (IL)"]}]