[{"department": "AGECO", "number": "3", "credits": "3 Credits", "description": "The Future of Food is an introductory-level science course that introduces students to an integrated human-environment perspective on food systems and their environmental contexts in locations within the United States and internationally. It offers a global perspective on the major challenges and opportunities facing the development of the current environment-food systems, including sustainability of agriculture, organization of global food systems and local food initiatives, food insecurity, and the influence of modern diets on human health. Topics covered include introduction to the coupled natural human system (CNHS) perspective of human-environment interactions, geographic and historical development of food systems and environmental resources, socio-economic aspects of the food system, interaction of the food system with the earth's environmental systems including soil, water, biota and climate, and the future of the food system considering potential changes such as in climate, urbanization, dietary choices, and demography. When students successfully complete this course, they will be prepared to: o Understand and apply the concept of coupled human-environmental interactions through the Coupled Natural-Human System (CNHS) framework to food systems nationally and internationally through which: (1) humans and their societies exert impacts on the environment; and (2) the environment provides feedbacks and conditions impacting food systems that can influence human societies. o Analyze the land, biological, energy and water resources and climatic conditions in relation to food production systems. o Analyze how human food systems significantly alter earth's ecosystems, landscapes, surface processes, atmosphere and waterways. o Apply the perspective of coupled human-environmental interactions through the Coupled Natural-Human System (CNHS) to such issues as the evolution and functioning of food systems and the characteristics of resilience, adaptive capacity, and vulnerability. o Evaluate scenarios for the future of food considering resilience in the context of climate change, human population growth and socio-economic, and cultural factors."}, {"department": "AGECO", "number": "121", "credits": "3 Credits", "description": "This course is an introduction to plant biology with a strong emphasis on plant \"stress\" biology - how plants deal with the many hazards that they face, including diseases, insects, the weather, and animals. The course covers major aspects of plant biology and physiology, including photosynthesis, light perception, sense of touch, hormones, secondary metabolism, growth, development, and structure. The course also covers how plants obtain food and water, see their neighbors, communicate with each other, reproduce, compete with each other, consume insects, and even move around - all without muscles, eyes, or brains. The course relates all of these topics to plant stress coping mechanisms and to human needs and desires. Course activities include lectures, class discussions, in-class written assignments, guest lectures, an outdoor walk to observe plants on campus, and movies. This General Education (GN) course is designed to be accessible to non-science majors.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "AGECO", "number": "121H", "credits": "3 Credits", "description": "The many hazards faced by plants and the dynamic ways that plants respond to these problems are examined.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "AGECO", "number": "122", "credits": "3 Credits", "description": "Atmospheric Environment: Growing in the Wind is for students who are interested in learning about the dynamic effects of weather on plants and animals. It is about how processes at the ground surface and in the air govern weather conditions on Earth. Growing in the Wind focuses on five major weather elements: energy, temperature, moisture, pressure and wind and how these factors influence ecosystems and habitation of our planet. Emphasis is also given to human impacts on weather and climate, and current environmental issues involving the atmosphere. The lectures are organized around the central theme that the unequal distribution of incoming solar energy (both spatially and temporally) produce temperature and pressure contrasts at the Earth's surface and in the atmosphere that in turn cause storms and control the weather and climate.", "other": ["Cross-listed with: METEO 122", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AGECO", "number": "134N", "credits": "3 Credits", "description": "This inter-domain (GN/GS) general education course addresses the science, socio-economics, and politics of managing food and fiber production systems; and the sustainability implications of current practices and future options. The course will teach students about the soil, plant, animal, and ecological sciences; technologies, socio-economic implications, and policies of our agroecosystems in an integrated manner. We will examine agricultural scientific, agricultural policy, and economic opportunities to enhance the sustainability of agriculture for food and fiber production. Students will have many opportunities to examine and critically analyze scientific knowledge and policies during discussions, writing exercises, and role playing to develop analytical and communication skills. There are no prerequisites for this course. This course can link with other courses that address how research and efforts in agricultural sciences, ecology, policy, economics, philosophy, education, and communication influence sustainable management of natural resources for the present and the future.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AGECO", "number": "144", "credits": "3 Credits", "description": "An introduction to the science, principles and practices of organic agricultural systems for food production. This natural sciences general education (GN) 3 credit course will teach students about the science of agroecology, with a focus on organic agriculture. We will examine the science, history and development of organic agriculture and its principles and practices. Students will learn about the scientific basis and implementation of fundamental organic farming principles and practices including soil health, diversified cropping systems, organic pest management, and a system perspective. We will also discuss certified organic regulations and policies, organic farming business management and marketing. Learning activities include: i) reading and discussing agricultural scientific articles, ii) listening to guest speakers and videos, iii) hands-on laboratory and greenhouse activities, iv) field trips and group projects. The only prerequisite for this course is a high school level biology or ecology course. This course can link with other courses that address the agricultural sciences, food systems, environmental resource management and policy, land use management and design, and natural resources.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "AGECO", "number": "154", "credits": "2 Credits", "description": "Introduction to the cultural methods and equipment used in agronomic crop production."}, {"department": "AGECO", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AGECO", "number": "201", "credits": "3 Credits", "description": "Introduction to the processes and considerations that lead to the development of integrated solutions to crop production problem solving."}, {"department": "AGECO", "number": "295", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required."}, {"department": "AGECO", "number": "418", "credits": "3 Credits", "description": "AGECO 418 / ANSC 418 / SOILS 418 Nutrient Management in Agricultural Systems is a senior-level course that applies the fundamentals of animal, plant and soil sciences to the issues and solutions in the area where livestock production intersects with water and air quality. Modern regionalization and concentration of animal production systems comes with environmental implications due to a net influx of nutrients to livestock farms. While some nutrients leave the farm in the form of animal products, 60 to 70% of the nutrients are excreted and applied to nearby crop land. If not properly managed these nutrients represent a risk to environmental quality. Students in this cross-listed course gain both scientific and practical understanding of sound nutrient management principals and strategies. The course considers big picture concepts such as nutrient cycling as well as farm-level implementations such as Nutrient Management Planning.", "prerequisite": "BIOL 11", "other": ["Cross-listed with: ANSC 418, SOILS 418"]}, {"department": "AGECO", "number": "429", "credits": "2 Credits", "description": "This course will teach proper crop scouting techniques and provide reference material to aid in identification of crop pests and determination of pest economic threshold levels.  AGECO 429 Crop Scouting (2) This course will introduce and provide experiential learning opportunities to students in crop scouting. Students will be taught principles and technique associated with proper crop scouting. This will include but is not limited to: identifying crop development problems, pests or damage symptoms, pest biology and economic thresholds associated with various pest control options. Students will learn: how abiotic stresses may alter crop development; pest identification; when (spring, summer, fall, wet conditions, dry conditions etc.) different pests are likely to appear; scouting techniques to properly quantify pest infestation; how to read and interpret internet sources that help forecast pest activity; and how to use Infestation/Economic Threshold Charts.", "prerequisite": "AGRO 28"}, {"department": "AGECO", "number": "438", "credits": "4 Credits", "description": "The study of weeds and their management is a challenging and demanding task that requires diverse abilities. The term weed is an anthropocentric construct meaning it is a human colored definition. We will study the biology and ecology of weedy plants drawing on examples from a wide range of plant systems; those systems include agricultural fields (agronomic and horticultural crops) and forests. Of course our knowledge of the biology and ecology of weedy plant populations will then be used to underpin and assess control tactics and their integration. The discipline has a history of equating management with herbicidal control and in fact some 80% of the pesticides used in U.S. agriculture are herbicides. However through novel farmer designed management systems, through a research community focused on alternative methods of management and through increased focus on invasive species, exciting breakthroughs are occurring in alternative methods of management and prevention. This course seeks to introduce you to the breadth of management approaches in use and under study. The specific objectives are for students to describe and identify: 1) the local weed flora, 2) the fundamental aspects of weed biology and ecology relevant to managed landscapes, 3) the control methods used in managing weed populations, 4) how control measures can be integrated to accomplish acceptable levels of pest suppression, 5) operationalizing a weed management plan, 6) how herbicides enter and move to their site of action in plants, 7) classifying herbicides by their site of action, and 8) the distinction between herbicide concentration in soils and plant available herbicide concentration.", "prerequisite": "AGRO 28", "other": ["Cross-listed with: AGRO 438"]}, {"department": "AGECO", "number": "457", "credits": "3 Credits", "description": "Integrated study of pest complexes and their management, emphasizing ecological principles drawing on examples from a range of agricultural, forestry and urban systems. This course is designed for sixth, seventh, and eighth semester students and graduate students. AGECO 457 / ENT 457 Principles of Integrated Pest Management (3) The goal of this course is to introduce upper level undergraduates and graduate students to the principles and practices of integrated pest management (IPM). This course addresses IPM issues concerning insects, plant diseases, and weeds in agriculture, natural systems and urban environments. Rooted in ecology, IPM also addresses the influence of human social, economic and regulatory systems in pest management. Emphasis is placed on the basic tactics and tools of IPM including biological, cultural, legal, mechanical and chemical controls, host plant resistance, pest monitoring and decision making. The overarching goals of environmental protection, economic viability and social welfare are considered throughout the course. In addition, students will learn about IPM program implementation both domestically and internationally, including pest population modeling and the use of internet resources to inform decision makers. Several projects will provide real-world examples. These may include field trips and a semester-long project where students research and solve an actual pest management problem.", "prerequisite": "PPEM 405", "other": ["Cross-listed with: ENT 457"]}, {"department": "AGECO", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required."}, {"department": "AGECO", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "AGECO", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AGECO", "number": "499", "credits": "1-2 Credits/Maximum of 4", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]