[{"department": "ANSC", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ANSC", "number": "100", "credits": "3 Credits", "description": "This course will introduce students to the breadth and scope of animal agriculture in North America with emphasis on food producing animals. Additionally, fiber producing animals, pets, pleasure animals, and alternative livestock will also be studied. Students will be exposed to biological concepts and their relationship to contemporary production systems, economics, terminology and industry issues to enhance understanding of and appreciation for various uses of animals in North America. The course is available in a web-based format with extensive use of video tours of animal housing facilities, expert interviews, and explanations of the biology behind common production and food safety practices.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ANSC", "number": "107", "credits": "3 Credits", "description": "This web based course provides students with basic knowledge about equine science and its application to the industry to prepare them to be more effective communicators with industry personnel. Inductive and deductive reasoning are introduced as a part of the scientific method and its application in critically evaluating products and concepts important to equine science and the industry. Equine science topics include basics of equine evolution, genetics and breeds, anatomy, physiology, reproduction, and nutrition. While these topics focus on the horse as a target, each topic also allows for comparisons to other mammalian species. Equine industry topics include history of use, disciplines, organization of the industry, components and careers; and prepare students to proceed into further studies in equine science. The course features presentations and interaction with industry professionals and instructors of higher level equine science courses at Penn State. In addition to the academic topics addressed, the course introduces students to using the university course management system, and the utilization of web based communication tools as individuals and as a team.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ANSC", "number": "110", "credits": "1 Credits", "description": "An introductory survey of animal biotechnology in society, the role for biotechnology and how it will benefit society. ANSC 110 Contemporary Issues in Animal Biotechnology and Society (1) This First-Year Seminar is designed to provide an introduction to the field of animal biotechnology. Emphasis will be placed on providing the student a perspective of the history of biotechnological innovation in animal agriculture and an overview of the scientific bases for animal biotechnology. The history, need for and development of food biotechnologies will be discussed. A major component of the course will focus on the regulatory processes in place in the U.S. for approving animal biotechnologies and the benefit/risk evaluation process used to assess safety and efficacy of new animal biotechnologies. Social and economic implications of animal biotechnology will be discussed as well as overview about how to effectively communicate the benefits of the new food biotechnologies to policymakers and the public.", "other": ["First-Year Seminar"]}, {"department": "ANSC", "number": "117", "credits": "2 Credits", "description": "Principles of marketing and event planning including marketing systems, advertising, management systems, team building and other aspects of conducting a purebred livestock sale.  Students learn through the planning and conducting of the annual Penn State Equine Science Showcase and Registered Quarter Horse Sale. ANSC 117 Equine Marketing (2)The Equine Marketing course is designed to allow students the opportunity to learn information related to the marketing of horses. Specific topics will include letters on marketing methods, event planning and management, advertising layout and design, the significance of pre-purchase exams to the marketing process, preparation and presentation of sale animals, and the role of the auctioneer. In addition to classroom lectures, students will have the opportunity to put the information gathered to use through the planning of Penn State's annual Equine Science Showcase and Registered Quarter Horse Sale. Students will be assigned to committees and will be responsible for all of the planning and implementation of the event. Specific tasks will include development of advertisements, public relations, development of press releases, development of an online and hard copy sale catalog, development of all office paperwork for the sale, interaction with industry leaders to gain industry buy in for the event, working with outside breeders who participate in the event, set up, clean up, and preparation and presentation of the horses being offered for sale. Through the process students will also learn many skills necessary to be successful in their future careers above and beyond those related to the marketing of horses. Some of these skills include working within a group, team building skills, communication with industry professionals, development of plans of work, and many more."}, {"department": "ANSC", "number": "150S", "credits": "2 Credits", "description": "ANSC 150S is for first year University Park students intending an Animal Science major. Students will engage in college success strategies including time management, advising resources, University practices, policies and procedures, as well as campus resources and opportunities. Students will explore Penn State's animal facilities and interact with peers and faculty while building research, oral, and written communication skills.", "other": ["First-Year Seminar"]}, {"department": "ANSC", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ANSC", "number": "198", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ANSC", "number": "201", "credits": "4 Credits", "description": "Scope of animal and poultry science; genetic, physiological, nutritional, and health factors in food production.  ANSC 201 Animal Science (4)This course examines the scope and diversity of disciplines comprising the animal and poultry sciences. The first portion of AN SC 201 focuses on animal products such as milk, meat, eggs, and wool. Students learn product compositions and their relevance to humans worldwide. Later lectures outline the roles that environmental, housing, nutrition, and health play in current animal production systems. A major focus of the course is digestive physiology. In-depth topics include nutrients, monogastric and ruminant digestion, and feed analysis methods. The final portions of the course focus on reproduction, lactation, behavior, genetics, and biotechnology. These areas are critical to successful animal production systems. Throughout the semester, current issues in animal sciences that are related to the course material are integrated into the lectures. The laboratories support the concepts presented in lecture related to animal products, nutrition, animal health, and reproduction."}, {"department": "ANSC", "number": "202W", "credits": "3 Credits/Maximum of 3", "description": "ANSC 202W, Contemporary Issues in Animal Agriculture, is a 3 credit 200 level course, emphasizing the appropriate citation of sources and writing about contemporary issues facing the animal sciences field. Thus, writing assignments will center on new and emerging issues facing animal science students entering today's job market. Students completing this course will have produced a writing portfolio that includes a range of works appropriate for different audiences, as well as having participated in extensive self and peer evaluation of writing. Students scheduling the course should first complete ANSC 100, or have completed or be concurrently enrolled in ANSC 201. Course objectives are to teach written communication skills that will be valuable to those pursuing an education and career in animal science related fields. Upon completion of this course, students should be capable of developing a focused writing objective based on some knowledge of the designated audience, finding reliable sources of evidence, critically evaluating evidence and sources, correctly citing sources for various types of material, developing an effective outline, writing and revising drafts for a final piece of written communication, performing self and peer evaluations of writing, and producing a final piece of written communication that achieves the original objective and is valuable to the designated audience.", "prerequisite": "ANSC 100", "other": ["Writing Across the Curriculum"]}, {"department": "ANSC", "number": "207", "credits": "2 Credits", "description": "Composition, safety, palatability, preservation, and processing of foods from animals, impact of animal production and handling practices on product properties. FDSC  207 / ANSC 207 Animal Products Technology (2) This course is intended to give students knowledge and understanding of production and processing of foods derived from animals (meat, milk, and eggs). Upon completion of this course students will be able to describe and explain the physical and biochemical characteristics of muscle foods, milk, and eggs. Students will be able to describe and compare harvesting, processing, and preservation procedures used in preparation of animal products for human consumption. Students will be prepared to predict the impact of variations in animal production, handling, harvesting, and product processing on meat, milk, and egg product characteristics. This is one of a group of courses dealing with foods from animals. Related courses offered in Animal Science covers animal growth and development and evaluation of animals and meat products. Related courses in Food Science cover food microbiology, food chemistry, and meat and dairy processing technology. The content of this course is intended to emphasize the connection between animal production and the resulting food products. FDSC  207 / ANSC 207  is intended to be of general interest to people who produce or eat animal products and thus is an integral part of the Animal Sciences major. This course will also be useful for strengthening meat industry knowledge for students in Food Science. FDSC  207 / ANSC 207 will be offered one semester per year. Student performance will be evaluated through written exams, quizzes, and written reports.", "other": ["Cross-listed with: FDSC 207"]}, {"department": "ANSC", "number": "208", "credits": "1 Credits", "description": "Harvesting and processing of foods from animals; hands-on and demonstration exercises; industry procedures for processing meat, milk, and egg products.  FDSC 208 / ANSC 208 Animal Products Technology Laboratory (1) This laboratory is intended to be taken along with or following Animal Products Technology lecture. Providing students with an opportunity to experience the procedures involved in harvesting and processing foods from animals. Upon completion of this course students will be able to describe, demonstrate, and explain procedures commonly used in harvesting and processing of muscle food, milk, and egg products. Students will be able to recognize and predict the impact of incorrect procedures for harvesting and processing muscle food, milk, and egg products. The course includes hands-on exercises and demonstrations that allow students to experience the \"look and feel\" of industry procedures used in harvesting and processing meat, milk, and egg products for human consumption. Focus on issues related to food safety and food quality. Student performance is evaluated through weekly written reports, and a final lab exam.", "prerequisite": "or concurrent: AN SC207", "other": ["Cross-listed with: FDSC 208"]}, {"department": "ANSC", "number": "211", "credits": "3 Credits", "description": "Introduces the biology of birds; lectures, laboratories on anatomy and function, incubation, breeding, disease control, management techniques, and student projects.", "prerequisite": "BIOL 110"}, {"department": "ANSC", "number": "213", "credits": "3 Credits", "description": "This course provides an early exposure to the emerging and diverse field of animal biotechnology. Basic principles underlying recombinant DNA technology, genetics, gene transfer technology, genomics and their technological applications will be discussed. This course is taught from the technological perspective that differs from the perspectives of basic science, or technique-oriented courses. The information provided in the required text-book, accompanying websites and current literature will be discussed extensively in the form of formal lectures, tutorials and review sessions.", "prerequisite": "CHEM 101"}, {"department": "ANSC", "number": "215", "credits": "3 Credits", "description": "ANSC 215 Pets in Society (3) (GS)Companion animals have far-reaching influence on many aspects of human society. How humans relate to pets varies from individual to individual and is influenced by many factors. The field of human-animal interactions is quickly evolving and is supported by a variety of disciplines and empirical research. This course provides a broad introduction to the varied roles and influences of pets on human life and society. Topics of discussion include the historical, social, economic, scientific, and legal roles of pets in American society. The influence of companion animals on human development and mental health throughout the lifespan and in the case of disability is examined from a social science perspective. Genetics, breed, physical, and environmental influences play obvious and important roles in the development of canine and feline behavior and are used as examples of the multiple causes of behavioral development and expression. Learning theory and operant conditioning are discussed as they relate to dog and cat training. Newly discovered risks and benefits of animal ownership on human health are discussed, including the influence of pet ownership on cardiovascular disease and allergy development. Issues of responsible pet selection and ownership are discussed in relation to animal welfare and societal responsibility. Because of the emerging nature of human-animal interaction research, an important goal of the course is to instruct students on the scientific method and recognition of research methodologies. Critical evaluation of theoretical models and empirical research in class and small group discussions is used to show how these questions can be addressed scientifically. Throughout the course, students have the opportunity to gather information from various sources and make informed decisions on controversial topics and to understand the impact of individual actions and decisions on broader society.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ANSC", "number": "217", "credits": "2 Credits", "description": "Introductory analysis of halter and performance classes of stock-type horses, with emphasis on conformation, gaits, patterns, and oral reasons.  ANSC 217 Introduction to Horse Judging (2)  encompasses the introductory information necessary for students to begin their competency in horse evaluation. From external parts and critical evaluation of conformation of halter horses, to rail classes with gaits and transitions, to pattern classes with objective evaluation and scoring methods, to more specialized classes (trail, hunter hack, pleasure driving, etc.), students will expand their depth and breadth of knowledge for evaluating suitability to purpose of stock-type horses. Careful observation, critical thinking, decision-making and oral communication skills of students are repeatedly critiqued and enhanced in this course. Following successful completion of ANSC 217, students who elect to take ANSC 417 will be eligible to compete for a position on the Penn State Intercollegiate Horse Judging Team.Furthermore, this course serves as an elective for students outside of the Animal Sciences major and students throughout the University who simply have an equine interest; as well as a required course for students enrolled in the Equine Sciences minor offered by the Department of Dairy and Animal Science."}, {"department": "ANSC", "number": "225", "credits": "1 Credits", "description": "Training in the visual evaluation of dairy cattle and practice in defending decisions through oral reasons.  ANSC 225 Introduction to Dairy Judging (1) Students will learn the basic concepts used in dairy cattle judging and evaluation. The Purebred Dairy Cattle Association Unified Scorecard will provide the framework for students to make decisions and enhance observation skills based on industry standards. Students will become familiar with terminology used to describe differences between cattle of the seven major dairy breeds as they judge classes of cows and heifers. They will develop communications skills by defending these evaluation decisions through oral reasons."}, {"department": "ANSC", "number": "226", "credits": "2 Credits", "description": "Training in identifying, grading, and judging carcasses and wholesale cuts of meat and in selection and identification of specification cuts.  ANSC 226 Meat Selection and Grading (2)Students will learn skeletal and musculature anatomy in order to evaluate carcasses and wholesale cuts of beef, lamb, and pork. They will be required to learn quality and yield grading of carcasses of various species and be expected to learn the various parts and evaluative terminology of carcasses and cuts. In addition, students will be trained in the identification and cutting procedures required for the institutional meat specification cuts and retail cuts.", "prerequisite": "AN SC201"}, {"department": "ANSC", "number": "290", "credits": "1 Credits", "description": "ANSC 290 is a required course for Animal Science majors and minors. Each week during class, students are exposed to varied potential career paths within the animal industries. Students will develop a resume and cover letter, and attend the College's career fair to interact with potential employers."}, {"department": "ANSC", "number": "291", "credits": "1-2 Credits/Maximum of 4", "description": "Students will obtain a one-week on site work experience with an animal-related agribusiness.  ANSC 291 Externship with Animal Science Business (1-2 per semester/maximum of 4) This course will provide an opportunity for students to acquire on-site skills and knowledge in a potential interest area of an animal-related agribusiness. Externship opportunities are provided during one week of winter break and one week of spring break and 1 credit is earned for each experience. Student responsibilities are to: prepare a cover letter and resume; participate in the interview process; maintain and submit a typed summary of a daily log of activities; prepare a final report to the instructors (copy sent to the agribusiness sponsor); present an oral presentation of the externship experience to their peers and a group of faculty; and complete a self evaluation of ANSC 291. Limited to Animal Sciences majors."}, {"department": "ANSC", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ANSC", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ANSC", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ANSC", "number": "300", "credits": "3 Credits", "description": "An integrated study of the biology of domestic animal growth and the underlying cellular, endocrine and immune systems involved.", "prerequisite": "BIOL 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "ANSC", "number": "301", "credits": "3 Credits", "description": "Nutrients and their metabolism; the nutritional requirements of livestock; the nutritional value of various feeds; principles of ration formulation.", "prerequisite": "CHEM 202"}, {"department": "ANSC", "number": "305", "credits": "3 Credits", "description": "Principles of care and nutrition and contemporary importance of companion animals with emphasis on canine and feline species. ANSC 305 Companion Animal Nutrition and Management (3)Students of the animal sciences must be equipped for a variety of career opportunities in the twenty-first century. It is apparent that most students will benefit from a balanced exposure to a variety of animal species. This is especially true for students who pursue a career in the many supportive agricultural industries such as the commercial feed industry, animal health, and research and development.This course is part of a series of courses related to the nutrition and management of animals. While the other courses will be related to farm animal species, this course will be the only one addressing companion animals. As such it should meet the demand of students without a strong farm background or interest; those planning to attend a veterinary or professional school; as well as a large group of students with a non-professional interest in companion animals. It is felt that the sophomore or junior level of the course is appropriate after students have completed Animal Science 201.", "prerequisite": "AN SC201"}, {"department": "ANSC", "number": "306", "credits": "3 Credits", "description": "Students enrolled in ANSC 306 Swine Production and Management will study business and production-related concepts associated with modern swine production. The course will combine biology, nutrition, reproduction, health and welfare of pigs with business management, operations management, quality assurance, and marketing. Field Trips and hands-on labs at Penn State Swine Center expose students to hands-on application of classroom concepts."}, {"department": "ANSC", "number": "308", "credits": "3 Credits", "description": "ANSC 308 Sheep and Goat Production and Management (3) encompasses the requisite information for students to manage any of the small ruminant livestock species including meat and wool sheep, hair sheep, and meat goats. Students will critically evaluate genetic, reproductive, nutritional, economic, and management criteria that influence profitability and sustainability of small ruminants as viable agricultural animal enterprises in Pennsylvania, the United States and the world. Hands-on learning to develop practical management skills will be provided via the laboratories held at the Penn State Sheep Barns.", "prerequisite": "ANSC 201"}, {"department": "ANSC", "number": "309", "credits": "4 Credits", "description": "Beef Production and Management will provide a comprehensive review of the business-related and production oriented concepts associated with modern beef production. This course will combine traditional disciplines of beef management with business management, operations management, quality control and marketing. Additional topics will include economics and factors affecting cost of production. As the course progresses, and following the exposure of students to the fundamentals of beef production, they will be given the opportunity to evaluate real production scenarios for development of business and management recommendations. In addition to the classroom, the Penn State Beef Center, College computer labs, and selected field trips will comprise the facilities used to teach the course.  In addition, students will conduct problem solving exercises on beef enterprises throughout the state. Beef Production and Management will be included in the series of other production courses offered in this department. Having completed the course, students will be able to: 1. Describe the necessary management procedures in a beef enterprise that are vital for efficient and profitable production. 2. Describe and understand the fundamentals of the various segments of the cattle industry. 3. List the important components of a business management plan  for a beef operation, including short and long-term capital requirements, and a projected budget. 4. Discuss the trends and important issues facing the beef industry in Pennsylvania, the nation and world. 5. Critically evaluate business and production scenarios to provide an in depth analysis and a recommended course of action for improving a beef enterprise."}, {"department": "ANSC", "number": "310", "credits": "3 Credits", "description": "Principles of dairy management including the dairy industry and control points associated with nutrition, genetics, lactation, reproduction, and housing.", "prerequisite": "AN SC201"}, {"department": "ANSC", "number": "311", "credits": "3 Credits", "description": "The application of fundamental concepts and preparation for careers in the economically integrated commercial poultry industry.  ANSC 311 Poultry Production and Management (4) Poultry Production and Management will provide a comprehensive review of the business-related and production oriented concepts associated with modern commercial poultry production. The course will provide the student with an overview of poultry nutrition, physiology, genetics, health, welfare, and products and describe how these disciplines integrate with effective and efficient management, quality control, and marketing of poultry and poultry products. Additional emphasis will be given to the economics of poultry production, as well as current issues and challenges facing the industry. Throughout the course, students will be provided with experiential learning opportunities and will be required to use this knowledge to solve problems and to evaluate \"real world\" production scenarios in order to develop effective management and production skills.Having completed this course, students will be able to:1. Describe and evaluate the key operational and management factors in a commercial broiler, egg-layer, and turkey operation.2. Describe and understand the important business, environmental, food safety, and welfare issues and challenges facing the poultry meat, and egg industries in Pennsylvania, the nation, and the world.3. Critically evaluate poultry business and production scenarios to provide a fact based analysis and recommended course of action for solving management or production problems.", "prerequisite": "AN SC 100"}, {"department": "ANSC", "number": "315", "credits": "3 Credits", "description": "Introduction to the principles of small animal health, including the recogniti recognition, prevention and control of common small animal diseases. ANSC 315 Small Animal Health and Disease (3) Small animals play increasingly important roles in human lives. In addition to their function as pets, they serve the disabled; protect human well-being through the police, military and border inspection services; and act as research subjects for the development of medical and technological advances. Control of disease and promotion of animal health is important in all small animal industries and uses.This course is designed to provide a basic background in the principles of health in small animal species (primarily dogs and cats). Emphasis will be on the maintenance of a healthy animal system, including the recognition, prevention and control of the most common small animal diseases.Because of the increasing among of information available to all people through the internet and media, students will be given tools to understand basic medical terminology and will practice reading and interpreting scientific research. In addition, the importance of animal disease on public health will be addressed.Diagnosis and treatment of disease will only be covered in a general, illustrative fashion. This course is not intended to train students in the diagnosis and treatment of specific diseases, but rather to recognize the conditions and factors which encourage disease, but rather to recognize the conditions and factors which encourage disease spread and to understand how to control and rectify those situations.Because of the varied situations in which small animals function, a primary objective will be to be able to apply the principles of animal health and disease prevention to varied facets of the small animal industry (e.g. private ownership, veterinary medicine, shelter work and management, service animal breeding/training, biomedical and nutritional research).This course is designed for students planning to work in or having a special interest in the small animal industry, including veterinary medicine, the pet food and pet products industry, the working dog industry, live animal sales, pharmaceutical sales, and research.", "prerequisite": "MICRB106 or MICRB201 or permission of program"}, {"department": "ANSC", "number": "317", "credits": "3 Credits", "description": "Responses of horses to various stimuli during the training period. Laboratory exercises involve extensive practice with young horses.", "prerequisite": "AN SC327 and approved level of horsemanship"}, {"department": "ANSC", "number": "322", "credits": "3 Credits", "description": "Fundamental principles of genetics as applied to breeding farm animals.  ANSC 322 Animal Genetics and Selection (3) This course teaches fundamental concepts related to genetic variation and how genetic change occurs in domestic animal populations. Students are introduced to the structure of animal genomes and molecular genetics. We discuss transcription, translation and factors that alter gene expression. Examples of mutations that underlie phenotypic variation are given and the contrast between traits influenced by single genes versus variation across the genome is emphasized. Students will learn how genetic material is passed from parent to offspring and how principles of inheritance are extended to populations. The concept of heritability for quantitative traits and factors that determine breeding values and the rate of genetic change for quantitative traits are considered. We discuss how biotechnologies can be used to alter genetic response in domestic animals, how genetic change for one trait can alter expression of correlated traits, and the animal welfare consequences that can arise due to genetic change. Genetic relationships among animals and inbreeding control strategies such as crossbreeding are considered. Students are also exposed to controversial issues relating to genetics and selection. Students participate in a breeding simulation and contrast population genetic change throughout semester to changes observed by their classmates.", "prerequisite": "BIOL 110"}, {"department": "ANSC", "number": "322H", "credits": "3 Credits", "description": "Fundamental principles of genetics as applied to breeding farm animals.  ANSC 322H Animal Genetics and Selection - Honors (3) This course teaches fundamental concepts related to genetic variation and how genetic change occurs in domestic animal populations. Students are introduced to the structure of animal genomes and molecular genetics. We discuss transcription, translation and factors that alter gene expression. Examples of mutations that underlie phenotypic variation are given and the contrast between traits influenced by single genes versus variation across the genome is emphasized. Students will learn how genetic material is passed from parent to offspring and how principles of inheritance are extended to populations. The concept of heritability for quantitative traits and factors that determine breeding values and the rate of genetic change for quantitative traits are considered. We discuss how biotechnologies can be used to alter genetic response in domestic animals, how genetic change for one trait can alter expression of correlated traits, and the animal welfare consequences that can arise due to genetic change. Genetic relationships among animals and inbreeding control strategies such as crossbreeding are considered. Students are also exposed to controversial issues relating to genetics and selection. The course consists of textbook and online readings, classroom activities and a laboratory section dedicated to problem solving. Students participate in a breeding simulation and contrast population genetic change throughout semester to changes observed by their classmates. Honors students will research genetic selection or conservation programs for a species of their choice early in the semester. The student will submit a report that details the traits emphasized in the breeding program, how animals are evaluated for genetic merit, methods and cost of seedstock dissemination, and genetic trends for the species. This information will be used to guide selection decisions made during the breeding simulation. At the end of the breeding simulation, students will select an animal they developed during the semester and create a marketing report for the animal that details their genetic merit, pedigree, level of inbreeding, and performance of progeny.", "other": ["Honors"]}, {"department": "ANSC", "number": "324", "credits": "3 Credits", "description": "Live animal and carcass evaluation of cattle, sheep, and swine to determine value of market animals and meat products."}, {"department": "ANSC", "number": "327", "credits": "4 Credits", "description": "ANSC 327, Horse Production and Management, is a 4 credit course for students pursuing careers that are directly or indirectly associated with the horse industry. This course is an in-depth examination of a broad range of topics that are fundamental to the care and welfare of all horses, as well as to managing a successful equine business. The course begins with an examination of equine behavior, with a focus on safe handling. Horse selection and judging are discussed and practiced. General health care, specific diseases, and parasitology are all covered. Significant time is spent on nutrition, reproduction, and exercise physiology. Finally, topics like facility design and management, coat color genetics, and emergency preparedness are discussed. Students completing this course should be able to: 1) Demonstrate and describe the production and management techniques necessary for the successful operation of the horse enterprise. 2) Describe the utilization of the horse's unique athletic ability in various disciplines. 3) Evaluate and apply the relationship of form to function in the use of horses for work and recreation. 4) Discuss and utilize the principles of selection, breeding, feeding, and management of horses in a range of scenarios. 5) Summarize the scope and diversity of the horse industry", "prerequisite": "ANSC 201"}, {"department": "ANSC", "number": "332N", "credits": "3 Credits", "description": "This interdomain course introduces students to the science and policy of greenhouse gas emissions. The course focuses on emissions from natural sources, energy production and food production. Policy components will introduce students to the fundamentals of environmental policy and examine key policy options for mitigating and managing emissions. Global in scope, the course will also address how emissions and policy options differ in developed and developing countries. Topics will include overviews of the global carbon cycle, agriculture and land use change emissions, history of global energy use and production, overview of global climate change policy, frontiers in climate, energy and agriculture policy, amongst others.", "prerequisite": "ENGL 015.", "other": ["Cross-listed with: GEOG 332N, METEO 332N", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ANSC", "number": "346", "credits": "3 Credits", "description": "Evaluating livestock operations within and across enterprises has become a vital skill to being profitable today. The nexus of financial performance and production management is the catalyst to profitable and sustainable operations. This requires the skillset and digital fluency to evaluate and interpret whole farm and enterprise analyses. Throughout the course students will investigate interactions of key livestock enterprise management practices with enterprise and whole farm finances; utilize the information provided in the laboratory sessions to interpret farm financial reports and develop well-written reports and to further understand information for a livestock farm operation; evaluate and assess financial data from various livestock enterprises and make sound recommendations for management practices improvements; develop digital fluency skills for understanding financial reports and their influence on management concepts for improving farm practices and profits."}, {"department": "ANSC", "number": "350", "credits": "2 Credits", "description": "Students will use dairy records to analyze herd performance in order to identify bottlenecks for higher productivity.  ANSC 350 Dairy Problem Solving (2)This course will develop case based approaches to problem solving using dairy records. Students will learn to read and interpret dairy herd improvement herd summaries. Herd performance will be benchmarked against parameters from similar herds across the Northeast in order to identify production bottlenecks. Popular dairy herd management software will be used to analyze bottlenecks more completely. Additionally, the use of herd management software to record cow health events and set up management routines will be demonstrated. Classes will include in depth analysis of nutritional, reproductive, culling, genetic and milking management parameters as they relate to the dairy enterprise. In addition, economic and fiscal management will be presented as it relates to various aspects of the dairy industry.", "prerequisite": "or concurrent: AN SC310"}, {"department": "ANSC", "number": "357", "credits": "3 Credits", "description": "ANSC 357, Equine Broodmare and Foal Care, is a 3 credit course for students pursuing careers that are directly or indirectly associated with the horse industry. This course is an in depth study of late gestation broodmares, fetal development, pre-foaling indicators of readiness for birth, and post-partum care and management of the mare and foal. Students completing this course should be well prepared to be employed on breeding farms as broodmare or foaling managers. Additionally, students completing this course should be able to: 1) Describe the basic endocrinology of gestation in the mare. 2) Summarize the development of the fetus during gestation. 3) Compare and contrast normal and the abnormal foaling process. 4) Recognize and understand the meaning of pre-foaling predictors. 5) Assist with the foaling process as needed.", "prerequisite": "ANSC 327"}, {"department": "ANSC", "number": "389", "credits": "1-3 Credits/Maximum of 4", "description": "The Supervised College Teaching course provides selected undergraduates with formal, supervised teaching experience in an Animal Science course. Faculty recruit students who excel in a particular course to serve as undergraduate teaching assistants for subsequent offerings of that course. Duties may include peer tutoring, teaching, or laboratory assistance, and developing and/or evaluating course activities and materials. Students participating in this course will develop a deeper understanding of the course material by actively teaching the material. The course is only available to students who are invited to serve as teaching assistants for an Animal Science course and enrollment is by permission of the instructor.", "prerequisite": "Permission of program"}, {"department": "ANSC", "number": "395", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised field experience and study related to the student's major professional interest. Written and oral critique of activity required.", "prerequisite": "Animal Sciences majors; 6 credits in major plus approval of   proposed assignment by instructor prior to advance registration   deadline in semester preceding the semester in which the   assignment is to be completed", "other": ["Full-Time Equivalent Course"]}, {"department": "ANSC", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ANSC", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ANSC", "number": "410", "credits": "4 Credits", "description": "Application of dairy herd management principles using case studies and actual dairy farm situations.", "prerequisite": "AN SC310"}, {"department": "ANSC", "number": "413", "credits": "3 Credits", "description": "The principles and concepts used to generate genetically engineered animals by pronuclear, knockout, and cloning methods; and applied biotechnology applications.  ANSC 413 Transgenic Biology (3) The Transgenic Biology course is offered each spring semester for those students interested in learning the concepts, principles, and applications of genetic engineering in animals. The mouse is used as a model system, but the discussion encompasses large animals and commercial applications. Techniques covered are pronuclear, embryonic stem, and somatic-nuclear transfer generated animals. Content also includes the use of morpholinos and RNAI use to \"knockdown\" gene expression. Other systems discussed are Zebrafish and Xenopus as well as gene analysis by mutagenesis and gene trapping. The course objectives are (1) to provide the student with a working knowledge of the processes involved in functional analysis of gene expression using model animal systems and (2) to give the student understanding for the practical aspects of generating transgenic animals including microinjection, screening, breeding, and phenotypic analysis. Students are typically evaluated using several parameters including exams, presentations of current journal articles, abstracts of current journal articles, and a paper dealing with an aspect of transgenesis in the student's field of interest.", "prerequisite": "BIOL 230W"}, {"department": "ANSC", "number": "415", "credits": "3 Credits", "description": "Detailed study of companion animal behavior; including individual, developmental, and environmental bases of behavior with applied demonstration and discussion.", "prerequisite": "BIOL 110"}, {"department": "ANSC", "number": "418", "credits": "3 Credits", "description": "AGECO 418 / ANSC 418 / SOILS 418 Nutrient Management in Agricultural Systems is a senior-level course that applies the fundamentals of animal, plant and soil sciences to the issues and solutions in the area where livestock production intersects with water and air quality. Modern regionalization and concentration of animal production systems comes with environmental implications due to a net influx of nutrients to livestock farms. While some nutrients leave the farm in the form of animal products, 60 to 70% of the nutrients are excreted and applied to nearby crop land. If not properly managed these nutrients represent a risk to environmental quality. Students in this cross-listed course gain both scientific and practical understanding of sound nutrient management principals and strategies. The course considers big picture concepts such as nutrient cycling as well as farm-level implementations such as Nutrient Management Planning.", "prerequisite": "BIOL 11", "other": ["Cross-listed with: AGECO 418, SOILS 418"]}, {"department": "ANSC", "number": "419W", "credits": "3 Credits", "description": "Assessment of management practices impacting animal welfare; devoted to livestock species, companion animals, captive exotic species, and animals in research.", "prerequisite": "AN SC201 or 6 credits of biology", "other": ["Writing Across the Curriculum"]}, {"department": "ANSC", "number": "420", "credits": "4 Credits", "description": "Feedstuff evaluation, quality control, handling, storage:  life cycle feeding of beef cattle, dairy cattle, sheep, swine, horses, and poultry.", "prerequisite": "AN SC301"}, {"department": "ANSC", "number": "421", "credits": "3 Credits", "description": "Poultry Evaluation and Selection is a hands-on course that will provide the opportunity for students to apply the principles used and standards that directly relate to evaluate the evaluation and selection of Purebred and meat breeding birds, egg production traits, as well as the processing aspects of the poultry industry. In addition, the course will cover practical and safe handling techniques of live poultry and poultry products. This course is taught every spring semester.", "prerequisite": "ANSC 100"}, {"department": "ANSC", "number": "422W", "credits": "3 Credits", "description": "The course will focus on understanding the role of records and available information in designing breeding programs. Students will gain an understanding of breeds, conformation and genetic evaluation methods throughout the world. Topics will include type appraisal and linear classification, reading information sources such as sire summaries and pedigrees, and evaluating and integrating data to make herd breeding program decisions and merchandising selections. Industry breeding programs and current issues will be emphasized. A major focus throughout the course will be information management to make informed breeding decisions to maximize genetic progress and herd improvement.", "prerequisite": "ANSC 322", "other": ["Writing Across the Curriculum"]}, {"department": "ANSC", "number": "423", "credits": "3 Credits", "description": "A comparative approach to understanding body function in domesticated avian and mammalian species.", "prerequisite": "BIOL 110"}, {"department": "ANSC", "number": "424", "credits": "3 Credits", "description": "Evaluation and selection of beef cattle, sheep, swine, and horses; critical analysis of performance records and genetic evaluations.", "prerequisite": "AN SC324"}, {"department": "ANSC", "number": "425", "credits": "3 Credits", "description": "Principles of pathogenesis and control of diseases in poultry and other avian populations.  Case material used where appropriate.  ANSC 425 / VBSC 425 Principles of Avian Diseases (3) This course discusses the major diseases of domestic poultry, with etiology, prevention, and treatment reviewed on each disease. Since many of these diseases also affect wild birds and pet birds these are also reviewed. Lastly, avian disease with zoonotic (human public health) potential are also discussed in the course. This course is required by those seeking a poultry minor.Previous coursework in pathogenic microbiology is beneficial.", "prerequisite": "MICRB 106", "other": ["Cross-listed with: VBSC 425"]}, {"department": "ANSC", "number": "426", "credits": "2 Credits/Maximum of 4", "description": "ANSC 426 provides students with critical thinking and communication skills through evaluation and selection of animals and animal products. This course provides intensive training in evaluation and selection of meats, dairy, poultry, horses or meat animal livestock using subjective and objective measurements as well as the use of oral or written reasons to explain and defend decisions. Enrolled students may compete against students from other colleges and universities at regional and national contests.", "prerequisite": "ANSC 225"}, {"department": "ANSC", "number": "427", "credits": "3 Credits", "description": "Development and physiology of the mammary gland and factors which affect the amount and composition of milk produced.", "prerequisite": "AN SC201"}, {"department": "ANSC", "number": "429", "credits": "3 Credits", "description": "Application of scientific and business principles to practical production and management issues using case studies or selected live settings.  ANSC 429 Advanced Beef Cattle Production (3) This course was developed to train students to critically evaluate management, facility, and husbandry practices of working beef cattle operations. Students visit owner facilities where they gather necessary information by interacting with the owners and inquiring about the owner's practices. The students use knowledge gained through previous courses and material covered in class to make recommendations. The students work in teams to present to the owners possible solutions to their problems. Each team will present a 30 minute critical evaluation of each case study with the owners being present. Students interact and answer questions concerning their presentation from the owners, students, and faculty. Students are introduced to the NCBA and Cattle FAX which they can use to stay abreast of beef industry concerns after completion of the class. If available, a field trip to either national or Pennsylvania state agriculture offices will occur.", "prerequisite": "AN SC309"}, {"department": "ANSC", "number": "431", "credits": "4 Credits", "description": "This course is a detailed study of reproductive processes in animals. Students will gain a fundamental understanding of the development, organization and functions of the reproductive system with a focus on domestic animals. This will include understanding endocrine regulation of reproductive processes and how hormones affect cellular function. Comparisons to primates, rodents, wild species and non-mammalian species will also be made. Students will develop an understanding of factors that affect reproductive success and how this knowledge can be used to regulate/manage reproductive processes of domestic animals, wildlife and humans. Recommended Preparations: ANSC 300", "prerequisite": "ANSC 201"}, {"department": "ANSC", "number": "432", "credits": "1 Credits", "description": "Demonstration and practice in cattle artifical insemination technique and semen handling. Instruction in reproductive systems anatomy, estrous cycle and estrus synchronization programs.  ANSC 432 Techniques in Cattle Reproduction (1) This course provides instruction in the technique of artificial insemination and the associated applications of this technology. A minimum level of expertise in this technique will be achieved through an understanding of cattle reproductive system anatomy, the estrus cycle and estrus synchronization programs. There will be a significant amount of time spent practicing artificial insemination technique in cows. This will be accompanied by instruction in semen handling and the proper use of the equipment used to store semen and to inseminate a cow. Evaluation will be based on proficiency in artificial insemination technique and semen handling in addition to a written exam. This course is offered during the fall semester by appointment.", "prerequisite": "AN SC309 or AN SC310"}, {"department": "ANSC", "number": "437", "credits": "3 Credits", "description": "Equine Facilitated Therapy uses equine-related activities to contribute positively to the well-being of people with disabilities. AEE 437 / ANSC 437 Equine Facilitated Therapy (3)The primary goal of this course is to acquaint the participant to equine facilitated therapy (therapeutic riding) and to introduce them to individuals who benefit/participate in such programs through lecture, audio-visual media, discussions, program visitation, independent research and via a practicum at a therapeutic riding program. Additionally, this course is designed to introduce the participant to various exceptional characteristics and conditions which may benefit from exposure/participation in equine facilitated therapy and other animal related therapy programs.", "prerequisite": "AN SC327", "other": ["Cross-listed with: AEE 437"]}, {"department": "ANSC", "number": "447", "credits": "3 Credits", "description": "ANSC 447, Equine Exercise Physiology, is a 3 credit junior/senior-level course for students interested in the basic and applied aspects of exercise physiology of the horse. The course begins with discussion on the history of equine sport. Students then explore the biochemistry and energetics of exercise followed by the anatomy and physiology that make the horse a unique mammalian athlete. The course then moves to the more applied aspects of exercise and training responses and training regimes specific for different disciplines. Finally, student will explore important management practices associated with the care of the equine athlete. Upon completion of this course students should be able to: 1. Apply an understanding of form and function of the horse to the diverse and unique athletic capabilities of the horse. 2. Discuss physiologic responses of the muscular, skeletal, respiratory, and cardiovascular systems of the horse to various exercise and training regimes. 3. Prepare and/or evaluate appropriate training regimes for horses preparing for different disciplines. An important component of this will be the ability to use knowledge of the basic science to improve application. 4. Design and describe physical therapy strategies for horse recovering from exercise or training related injuries. 5. Communicate to clients, customers and peers important information about exercise physiology, training, and exercise related issues, enabling them to improve the health and performance of their horse", "prerequisite": "BIOL 110", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ANSC", "number": "450", "credits": "3 Credits", "description": "Capstone course emphasizing integration of dairy farm management principles into whole farm systems.", "prerequisite": "AN SC310 , AN SC350 , AN SC410 ; or permission of program"}, {"department": "ANSC", "number": "451", "credits": "1-2 Credits/Maximum of 2", "description": "Students will evaluate all systems of a working dairy farm business.  ANSC 451 Dairy Systems Analysis (1-2 per semester/maximum of 2) This course will provide an overview of all areas of dairy business management. This course is designed to complement the dairy production courses and is meant to train students to organize material in a farm evaluation format. Various instructors (within their areas of expertise) as well as industry experts and dairy producers will be utilized to provide students with current concepts in dairy management. Requirements of the course include working in teams to visit, evaluate and make a presentation about a dairy farm business including an action plan for improving the business.", "prerequisite": "AN SC310 , prerequisite or concurrent: AN SC410"}, {"department": "ANSC", "number": "456", "credits": "3 Credits", "description": "This course will be focused on three main aspects of the application of 'Omics' techniques in research to answer real-world problems. Students will be introduced to the concepts of multiple 'Omics' techniques, study designs, and data analysis methods. The roles played by the microbiome in different species will be discussed. Those concepts will then be put into practice through appraisal of primary literature. By the end of the semester, students will be able to apply the concepts learned to discuss scientific literature and be familiar with data analysis techniques.", "prerequisite": "MICRB 106"}, {"department": "ANSC", "number": "457", "credits": "3 Credits", "description": "Equine Reproduction and Breeding Farm Management is intended to expand on the knowledge of equine reproduction and breeding farm management acquired in other classes. The students will get hands on experience in artificial insemination of mares and semen collection of stallions. Having completed the course, students will be able to: A. Collect semen from a stallion. B. Assess seminal characteristics and process the chilled semen to be sent to another farm. C. Artificially inseminate a mare. D. Apply scientific principles to make the decisions necessary to manage an equine breeding facility. The information covered will include but not be limited to reproductive management of the mare and stallion, foaling, and neonatology. Evaluation will typically be based on written tests, research and presentation of a selected topic, and laboratory attendance and participation.", "prerequisite": "ANSC 327"}, {"department": "ANSC", "number": "467W", "credits": "3 Credits", "description": "Equine gastrointestinal anatomy and physiology; energy and nutrient requirements for body functions; applied interrelationships between nutrition, health, and performance.  ANSC 467 Equine Nutrition and Feeding (3)  is a 3 credit junior or senior-level course emphasizing the application of biological principles to the proper nutrition of horses. Students scheduling this course must first complete ANSC 301. Course objectives are that upon completion of the course, students should be able to a) Apply an understanding of form and function of the equine gastrointestinal tract to actual feeding management problems associated with athletic performance or health concerns; b) Describe the nutrient and energy requirements of horses in different physiologic states and apply these in diet evaluation and formulation; c) Communicate to clients, customers and peers important information about equine nutrition, enabling them to improve the health and performance of their horse without having to take a course on equine nutrition. Each student will complete a 3000 to 3500 word paper on how some aspect of nutrition might be applied to improve equine health or performance. The writing project will involve an oral presentation, multiple drafts and require students to review and provide feedback on each others' work. Students will be evaluated via a series of assigned homework, exams, class participation, and the overall writing project.", "prerequisite": "AN SC301", "other": ["Writing Across the Curriculum"]}, {"department": "ANSC", "number": "477", "credits": "1 Credits", "description": "Management of equestrian riding lessons, teaching techniques, lesson plans, program planning, time management, and handling of mounted groups.  ANSC 477 Riding Instructor Training (1) The Equine Riding Instructor Training course relates to teaching, equestrian skills, developing lesson plans, program planning, events coordination, staff management, time management, and handling of mounted groups from beginners to more advanced level riders. There are many opportunities for riding instructors in the equine industry throughout the United States. Career areas include breed associations, cooperative extension, and equine facilities/stables. This course will help give students the tools to be safer and better-prepared equine riding instructors. Successful completion of the course implies students will be able to: Conduct horse riding lessons at all horsemanship skill levels, understand safe horsemanship; manage large mounted equestrian groups; and develop appropriate lesson plans.", "prerequisite": "AN SC327 ; a demonstrable level of horsemanship"}, {"department": "ANSC", "number": "479", "credits": "3 Credits", "description": "Endocrine mechanisms regulating the morphogenesis, homeostasis, and functional integration of animals.", "prerequisite": "BIOL 141", "other": ["Cross-listed with: BIOL 479"]}, {"department": "ANSC", "number": "480", "credits": "3 Credits", "description": "Animal growth and development is the understanding of tissue interactions as they influence each other and whole animal complexity from conception to maturity. An understanding of growth and development in livestock species improves scientific advancements and improves efficiency in which animals reach growth or activity goals placed on them by producers, trainers, and caretakers. This course focuses on growth and development of meat animal species and its influence on economically important tissues and final meat quality, however concepts are applicable across mammalian species.", "prerequisite": "ANSC 201"}, {"department": "ANSC", "number": "488", "credits": "3 Credits", "description": "Germ cells are highly specialized cells that give rise to the next generation. The life history of germ cells from formation of primordial germ cells in the early embryo to formation of mature gametes will be traced in several mammalian species. Gamete maturation, fertilization and early embryo development will be covered in detail to highlight the unique features of these processes and the close relationship between germ cells, early embryonic cells and pluripotent stem cells. Special emphasis will be placed on the processes of meiosis and epigenetic reprogramming that occurs in both germ cells and early embryos. The effect of environmental factors such as diet, stress, endocrine disruptors on germ cell and early embryo reprogramming will be discussed. In the second half of the course, we will discuss how knowledge of germ cell physiology has led to the widespread use of assisted reproductive technologies (ART) which have fundamentally changed the way fertility is managed in animals and humans. ART topics covered include artificial insemination, gamete manipulation, in vitro embryo production, preimplantation genetic testing and control of ovulation. We will discuss how these technologies are used to treat infertility in both men and women. We will also cover the potential benefits and challenges of recent efforts to develop male and female non-hormonal contraceptive methods. Finally, the ethical and societal implications of advanced reproductive technologies will be discussed.", "prerequisite": "ANSC 300"}, {"department": "ANSC", "number": "494", "credits": "1-6 Credits/Maximum of 6", "description": "Independent undergraduate research directed by an Animal Science faculty supervisor.", "prerequisite": "junior or senior status, approval of an Animal Science faculty   supervisor, and approval of the Undergraduate Program   Coordinator."}, {"department": "ANSC", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by faculty supervisor culminating in an Animal Science honors thesis.", "prerequisite": "junior or senior status in the Schreyers Honors College and   permission of an Animal Science honors advisor.", "other": ["Honors"]}, {"department": "ANSC", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ANSC", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ANSC", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ANSC", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]