[{"department": "APLNG", "number": "83", "credits": "3 Credits", "description": "This course introduces the idea of understanding language use as social practice. This means studying how language serves to represent and to constrain  speakers in various social and cultural contexts. The activity of using language will be viewed through the lens of several research domains in the field of Applied Linguistics, a discipline that studies language in the way that real speakers and writers actually use it. The class will present readings taken from fields as varied as sociolinguistics (language as social performance); second language acquisition research (language as cognition, language as participation); language and identity; pragmatics (speech, act theory; conversational analysis); and language and power (language an power (language policy; gender and language). Whether being studied as a formal school subject or learned at a mother's knee, language is in extricabley bound up with who we are and who we become. Theoretical terminology, research-based findings, and innovative ideas about what language 'really' is will be introduced and explored through accessible and engaging readings and activities. Students will learn to look at language use in social contexts from multiple perspectives, seeing how it both reflects, and shapes, identity in context (while at the same time allowing speakers to modify and shape those very contexts). Given that this is a first-year class for first-semester students, emphasis will be placed on how the understanding these basic ideas of Applied Linguistics can help us to pursue a satisfying and enriched sense of self, whether as a speaker of a specific language, or as a member of multiple discourse communities. Students will conduct an interview project to better understand the issues faced by language learners in the local community. International students are particularly invited to join this course.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "APLNG", "number": "200", "credits": "3 Credits", "description": "This course is an introduction to the study of language as a communication system and to contemporary thought on the interrelationships among language, culture, and social interaction and their fundamental links to social identities and discourse communities in today's culturally diverse and technology driven environments. It investigates the fundamental links of language, culture, and social interaction to social identities, social role relationships, and discourse communities. Students will develop an awareness of their interpersonal and intercultural skills and who they are as communicators, an appreciation for variations and dialects of languages, and an understanding of issues related to bilingualism, language learning, and identity.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "APLNG", "number": "210", "credits": "3 Credits", "description": "Having developed since the fifth century in the British Isles, English has now become a global language used by millions of native and non-native speakers around the world. This course examines the historical roots of English and the factors that explain its spread as the lingua franca of globalization, adopting the metaphor of `ecology¿ to illustrate how English has adapted INTERNALLY in response to, and in conjunction with, EXTERNAL circumstances. Readings and activities will explore how English language has been instrumental to globalization and how globalization has changed English. After studying the historical and geopolitical bases for the rise of English, we explore the implications of decolonization, diaspora communities, the Internet, and the new economy for diversifying the structure, norms, and usage of the English language. We will place particular emphasis on exploring new modes of literacy and discourse practices, the fluid relationships between English and other languages and cultures, and the continuing reconceptualization of language standards, linguistic identities, and literacy practices.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "APLNG", "number": "220N", "credits": "3 Credits", "description": "This course will explore how research into language acquisition intersects with the lived experiences of multilingual speakers. Drawing upon both social sciences and the humanities, the course will give students the opportunity to understand and appreciate multilingualism, and the complex relationships that language has with culture, education, family life, and the structures of power, gender, and class. In addition to reading formal studies of scholarly research into language acquisition, language education, motivation and identity, students will read excerpts from literary works that illuminate these topics through the lens of narrative, memoir, and fiction. The stories we read will help us find answers to questions such as these: How can we understand the processes of language learning and language loss? What are the documented cognitive benefits of bilingualism? What are the factors that influence language learning, including motivation, age, and social context? In addition to reading, analyzing, and discussing texts, students will conduct a community outreach project in which they collect and analyze stories from multilingual individuals in the local community, including members of their own family, recent immigrants, long-term residents, international students or scholars, retirees, heritage language learners or parents in a multilingual household.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "APLNG", "number": "230N", "credits": "3 Credits", "description": "This course examines the contribution of language to a variety of social justice agendas by exploring how language is used to form and support unjust social structures. The course has two main aims. First, drawing from sociolinguistic theories of linguistic ideologies, the course aims to show the significance of language in how the hierarchization and ranking of languages in a society are produced, maintained, and reinforced. The second aim is to demonstrate the effects of such a hierarchization and ranking of languages on (in)equality in educational institutions and before the law. The topics covered in this course include the role of language in structuring individual identity and human relations and how this process characterizes the nature of social institutions in producing social inequality. As the course touches on issues pertinent to our daily lives, students' questions, comments, and relevant personal experiences and observations will play an important role in our exploration of how the language we use can affect opportunities and privileges in society.", "other": ["Cross-listed with: AFR 230N", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "APLNG", "number": "250", "credits": "3 Credits/Maximum of 3", "description": "This class provides theoretical and practical training to prepare Writing Center Peer Tutors with specific expertise in tutoring international/multilingual students. This course provides a theoretically-grounded introduction to the principles and practices of peer tutoring with multilingual writers (writers for whom English is not a first language). It is designed specifically for undergraduate students who wish to be employed as Peer Tutors with Penn State Learning at the Writing Center. Like ENGL 250, the class provides a basic orientation to the techniques of being an effective writing tutor, but offers a deeper understanding of the issues faced by writers whose first language is not English. The class may be of particular interest to students who study languages or education, who plan to work in academia, or who have a strong interest in cross-cultural communication or international education. However, undergraduate students of any major and of any language background are welcome to enroll in this course. Drawing upon research in second language acquisition, instructional theory, and composition pedagogy, the class examines the central roles of identity, belief, and cultural perspective in the development of tutoring expertise. Exploring the student's own development as a writer and learner, engaging in practical training activities, writing intensively, talking about writing, and engaging in reflective exercises comprise the first set of topics in the semester. In the second unit, through readings, interaction, observation and discussion, each tutor-in-training will explore the cultural and linguistic factors in the development and maintenance of second-language writing proficiency for international students in an American university context. There is a strong focus as well on tutoring pedagogy, and the class includes a 10-week structured practicum experience during which each student will tutor an ESL student from a first-year writing class (ESL 15). Students who want to work as Peer Tutors must have completed their own first-year writing requirement; it is recommended that they have completed ENGL 202 also.", "prerequisite": "ENGL 015; ESL 015"}, {"department": "APLNG", "number": "260", "credits": "3 Credits", "description": "Applied Linguistics is an interdisciplinary field that investigates and aims to study social issues through a linguistic lens. APLNG 260 - Language and Technology - is designed to introduce students to how technology helps shape language learning, education in general, and its impact on society. To develop students' skills in Social and Behavioral Science (GS), students are introduced to various learning theory-informed technological applications, such as natural language processing. These applications include virtual reality, gaming, speech recognition within deep learning, and virtual assistants. To develop students' skills in humanities (GH), students will develop critical and ethical awareness of applying technology use in education based on learners' needs. Theories of learning and methods will be introduced and applied to technological applications, such as learner-centered design, cloud computing, and open-source learning. The intersection of language learning and technology will be examined by understanding what is second language acquisition (SLA) and its technologies that support SLA, such as using a corpus and using mobile apps to aid in pronunciation production. Through critical reflections and designing instructional methods/materials integrating technology into various educational contexts, students will broaden their intellectual horizon regarding technological use in society, and more importantly, gain further understanding on the possible research directions linking technology, language learning within Applied Linguistics, and education.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "APLNG", "number": "280N", "credits": "3 Credits", "description": "APLNG 280N Conducting International Comparative Research. (3) (Gen Ed;IL; Integrative) (BA) This course meets the Bachelor of Arts degree requirements and may also serve as a methods course in the Global and International Studies (GLIS) major. The goal of this course is to equip students with effective methods for conducting international and cross-cultural research that addresses issues and problems occasioned by an increasingly globalized world. Students will acquire the background knowledge and skills necessary to analyze and evaluate existing international comparative literature and to design and propose new cross-national and cross-cultural research. The course focuses on projects in five key, contemporary domains of globalization: human rights, culture and identity, global conflict, wealth and inequality, and health and environment, and it draws on multidisciplinary methods from across the humanities and social sciences - including qualitative, quantitative, and mixed methods. Particular attention is paid to working with international datasets and the issue of translation and interpretation. As a result of the course, students will be able to: (1) locate and understand the structure and import of existing international databases, (2) design comparative, cross-national and cross-cultural research projects, (3) evaluate the validity, reliability, and significance of published international comparative research, (4) conduct basic comparative analyses of social, political, and cultural texts (documents) and oral interview data and other audio and visual data, (5) evaluate comparative quantitative data from cross-cultural surveys and other quantitative instruments, and (6) design reports and multimedia presentations of international comparative research.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "APLNG", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "APLNG", "number": "310", "credits": "3 Credits", "description": "This is a course on language rights, policy, and planning from individual, group, inter-ethnic, and national perspectives. Linguistic minorities are a consequence of colonization by European powers in different regions of the globe. Other effects of colonization and political conflicts include mass movement, migration, and the emergence of nationalism. In such contexts, minorities have made demands for language rights and used language policy and planning as strategies to realize demands for social justice. This course will examine how linguistic minorities secure opportunities to use their own languages and have them accommodated in official legislation as mother tongue, second, or foreign languages. The course will adopt a global perspective and analyze language rights as well as language policy and planning in diverse regions of the globe, including but not restricted to, Africa, Asia, and South America. Analysis will primarily focus on how language policies can be carried out from different perspectives (e.g., literary, linguistic, and political) in different geographical regions. After examining how language policies operate in and influence society, the course will use sociopolitical ideologies to explore the nature of the relationship between language policies and language rights and the ways this relationship enables one to achieve an expanded understanding of the impact of language policies and language rights on local language practices.", "other": ["Cross-listed with: AFR 310, GLIS 310", "International Cultures (IL)"]}, {"department": "APLNG", "number": "402", "credits": "3 Credits", "description": "This course is a linguistic introduction to the relationship between language, culture, and cognition with a focus on Chinese, Japanese, and Korean. In this course, we study the cognitive linguistic view that human cognition is fundamentally embodied and shaped by various figurative processes such as metaphor and metonymy grounded in our bodily and cultural experiences, and that human thought and language are fundamentally metaphorical in nature. We examine how we think and speak figuratively and conceptualize our experience metaphorically in everyday life, and compare the languages in terms of cognitive universals and cultural variations. The objectives of this course are threefold: (1) to lead language students to a linguistic approach to language analysis so that they learn about how individual linguistic expressions fit into a coherent linguistic system; (2) to enable them to see how linguistic structures reflect underlying cognitive, conceptual structures which are derived from the interplay between human embodiment and cultural environment; and (3) to provide them with a broad perspective on similarities and differences among Chinese, Japanese, and Korean as components that form a coherent category known as \"East Asian\". Class work will include some lecture but will emphasize guided discussions, literature review writings, student presentations, and research papers. This interactive approach is intended to encourage students' participation, involvement, and cooperation in learning, to help them understand the relationship between language, culture, and cognition, and to assist them in developing both analytic and expressive abilities. This course is designed to count as a BA \"Other Cultures\" and International Culture. Students can take this course as long as they have an interest in the relationship between language, culture and cognition, especially in the context of East Asia.", "prerequisite": "ASIA 100", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "APLNG", "number": "410", "credits": "3 Credits", "description": "Study and application of principles of North American English phonetics and theories of teaching pronunciation. APLNG 410 Teaching American English Pronunciation (3)(BA) This course meets the Bachelor of Arts degree requirements This course, for teachers who deal with speakers of other languages, integrates research and theory on the acquisition and development of pronunciation, as well as current pedagogy, to enable them to construct their own principled theory of teaching pronunciation. Students are introduced to the characteristics of the consonant and vowels systems of English. In addition, students are introduced to variations in the production of consonants and vowels by speakers of languages other than English. Students are expected to understand and to be able to describe the stress rhythm, and intonation of English as well as the adjustments that are made in connected speech. Students will learn how grammar and orthography influence the pronunciation of phonemes. Students will learn how to diagnose an individual's difficulties in the production of North American English and will learn how to develop appropriate curriculum. By focusing on instructional strategies from fields as diverse as theater arts, psychology, and instructional technology, students will be able to individualize their instruction by providing alternative ways to better respond to second language speakers' learning styles and preferences. Moreover, this course requires students to develop and implement appropriate curriculum for both hypothetical, real tutorial, and whole class instruction.The objectives of this course are for teachers 1) to develop a satisfactory understanding of the phonetics of North American English, including consonants, vowels, rhythm, stress, intonation and prominence, 2) to develop an understanding of the relationship between listening and pronunciation, as well as orthography and pronunciation, 3) to develop an ability to explain these phonetic concepts appropriate to students with varying learning styles using a variety of techniques such as kinesthetic and tactile reinforcement, 4) to develop an ability to diagnose speakers' particular pronunciation difficulties and to create instructional materials in response, 5) to develop a coherent philosophy of the teaching of pronunciation, and 6) to develop an ability to evaluate pronunciation textbooks and materials and supplement them when necessary.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "APLNG", "number": "412", "credits": "3 Credits", "description": "This course provides opportunities for exploring various perspectives on theory, research, and pedagogial applications in second language writing.  APLNG 412 Teaching Second Language Writing (3) This course has been designed to provide opportunities to explore various perspectives on theory, research, and pedagogical applications in second language writing. Through readings, writing, class discussion, and development of practical applications, students may develop an understanding of how research and theory can inform their practice, as well as an awareness of how personal and professional factors come together to inform their own theory of second language writing. By engaging in instructional activities, such as evaluating writing, responding to writing, and developing materials, students may begin to develop an understanding of how to implement theory in practice aligned with understanding. The overriding objectives are for students to help develop self-awareness as a writer and a teacher of writing, develop their own philosophy of teaching composition in an additional language context and to develop curriculum that embodies this philosophy. Students will be evaluated on reading journals, tutoring in the Writing Center, literature review, materials development project and developing of materials. APLNG 412 is an elective course in the M.A. TESL program and/or PhD option in Applied Linguistics."}, {"department": "APLNG", "number": "482Y", "credits": "3 Credits", "description": "Application of theories of language to psycholinguistics, philosophy of language, anthropological linguistics, sociolinguistics, bi/multilingualism, second language acquisition and teaching. APLNG 482 Introduction to Applied Linguistics (3) (IL)This is a survey course concerned with the application of theories of language to issues in the areas of psycholinguistics, philosophy of language, anthropological linguistics, sociolinguistics, bi/multilingualism, second language acquisition, and second language teaching. Specifically, the course focuses on: a) how language influences the way people think and bring meaning to what they do, b) how language users match their utterances to specific functional purposes within specific social contexts, c) how the language practices of a particular culture are closely tied to the beliefs and conceptual principles by which people in the culture live, d) how language is used by speakers of different races, genders, and ethnic backgrounds, and e) how language is acquired, used, and perceived within bi/multilingual societies. Through reading, writing, and discussing the major issues in each of these areas students will come to understand how theories of language have influenced the way we think and bring meaning to what we do, the ways we communicate within different cultures and societies, and the way languages are learned and used.", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "APLNG", "number": "484", "credits": "3 Credits", "description": "Develop a working knowledge of the structure of English and apply such knowledge to research and/or classroom situations. APLNG 484 Linguistic Structures for English as a Second Language (3)This course is designed to enable prospective and practicing ESL/EFL teachers to understand the linguistic structures of the English language. Through the use of transformation grammar, students will interpret and analyze the basic grammatical structures of the English language. Students will apply their developing skills of linguistic analysis to recognize, and analyze, and remediate both oral and written grammatical errors in ESL/EFL instructional contexts. Students will understand the current theoretical issues related to pedagogical grammars and develop an appreciation for the practical and theoretical relevance of linguistics analysis for second language educators."}, {"department": "APLNG", "number": "491", "credits": "3 Credits", "description": "An investigation into current issues in the theoretical bases of second language acquisition. APLNG 491 Theory: Second Language Acquisition (3) This course considers the relationship between second language acquisition (SLA) theory and language teaching. An examination of various aspects of first language (l1) and second language (L2) learning/acquisition processes provides a framework for consideration of basic questions in SLA research and interpretation of findings to date. Of particular interest is the relationship of this research to teaching materials and methods. The questions addressed include the following: What is SLA? What are the methods and aims of SLA Research? How are theories of SLA related to major theoretical models of human language and human learning? What have been or could be important interdisciplinary perspectives in SLA?"}, {"department": "APLNG", "number": "493", "credits": "3 Credits", "description": "Theory, research, and pedagogy that focus on the teaching of English to speakers of other languages in varied contexts. APLNG 493 Teaching English as a Second Language (3) (IL) This course focuses on the teaching of English to speakers of other languages. Specifically, the course explores the multidimensional nature of the teacher as a learner of teaching, the context of schools and schooling within which teaching occurs, and the activities and content of second language teaching and learning.Throughout the semester, students will engage in a range of theoretical, pedagogical, and reflective activities that will enable them to: 1) understand their own beliefs and knowledge about language learning and language teaching and become aware of the impact of such knowledge and beliefs on their classroom practices, 2) recognize the highly situated and interpretative processes involved in language teaching and be able to reflect on, critically analyze, and evaluate their own teaching practices, 3) become sensitive to the complex social, cultural, political, and institutional factors that affect language teaching and students' language learning, 4) come to recognize students' strengths and development as learners and language learners, 5) understand subject matter content from an instructional perspective and learn to anticipate areas that may require additional instructional support, 6) use their knowledge of theory to inform their instructional practices, 7) participate in professional collaborations with other teachers as they learn about language teachers, language teaching, and language learning.", "other": ["International Cultures (IL)"]}, {"department": "APLNG", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "APLNG", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]