[{"department": "ARTSA", "number": "301", "credits": "3 Credits", "description": "This course provides students with a survey of the major concepts and practices of arts administration."}, {"department": "ARTSA", "number": "401", "credits": "3 Credits", "description": "Planning and managing an event for an arts organization.", "prerequisite": "MKTG 301"}, {"department": "ARTSA", "number": "402W", "credits": "3 Credits", "description": "Study of strategic planning for commercial and non-profit arts organizations.", "prerequisite": "MKTG 301", "other": ["Writing Across the Curriculum"]}, {"department": "ARTSA", "number": "403", "credits": "3 Credits", "description": "This course explores strategies to identify and secure financial support for arts organizations and not-for-profit institutions.  ARTSA 403 Fundraising and Grant Writing (3) ARTSA 403, Fundraising and Grant Writing, is an upper level requirement for the Bachelor of Arts degree in Arts Administration. This course will provide students with an understanding of common institutional and leadership structures in the world of not-for-profit organizations. The course will explore proven strategies to create and maintain fiscal stability by generating revenue from a variety of potential financial sources. These include individuals and businesses, federal, state, and community resources, and charitable foundations. Students will also examine practical methods for development, including special events, long and short term campaigns, and the writing of proposals and grants. Upon completion of this course, ARTSA majors will be equipped with the skills necessary to plan and develop organizational solvency."}, {"department": "ARTSA", "number": "404", "credits": "3 Credits", "description": "Students individually plan their own arts event in a workshop setting that guides them through organization and implementation. ARTSA 404, Event Planning Practicum, is an upper level requirement for the Bachelor of Arts degree in Arts Administration. The course will function as a workshop for the planning and execution of students' capstone projects, in which they organize and implement an arts event either on or off campus. Projects may take the form of an exhibition of visual art or a theatrical or musical performance. Although students will be working independently on their own projects in consultation with a faculty advisor, the course is structured so that they will progress through the stages of event planning as a class, regularly presenting and critiquing work in progress. Topics to be covered include budget preparation, grant writing and fundraising, marketing, and program evaluation. Significant class time will also be devoted to discussing the implementation of each student's project. On completion of this course, students will be able to manage all aspects of the planning and execution of an arts event.", "prerequisite": "ARTSA 301"}, {"department": "ARTSA", "number": "495", "credits": "3 Credits"}, {"department": "ARTSA", "number": "495A", "credits": "3 Credits/Maximum of 3", "description": "Arts Administration Off Campus Internship (3) A professional internship experience with an established arts agency or organization outside of the university.", "prerequisite": "ARTSA301"}, {"department": "ARTSA", "number": "495B", "credits": "3 Credits/Maximum of 3", "description": "On Campus Internship in Arts Administration (3) An internship with an on-campus arts organization or program.", "prerequisite": "ARTSA301 , ARTSA401 , ARTSA495A"}, {"department": "ARTSA", "number": "496", "credits": "3-9 Credits/Maximum of 9", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}]