[{"department": "ASIA", "number": "3", "credits": "3 Credits", "description": "Religious experience, thought, patterns of worship, morals, and institutions in relation to culture in Eastern religions. RLST 3 / ASIA 3 Introduction to the Religions of the East (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will explore the foundations, development, and diversity of religious traditions in Asia, focusing mostly on Hinduism, Buddhism, Confucianism, Daoism, and Shinto. It is organized according to two sections: Foundations and Developments. The Foundations section provides an introduction to the worldviews and practices of Eastern teachings. We will also discuss the structure of society, the social expectations on individuals based on gender and class, and rituals, which expose us to rich mythologies or intricate ceremonies. The second section, Developments, traces the evolution of religious doctrine and practice through history. Here, we learn to distinguish among large and small-scale movements and schools, and to familiarize ourselves with the geographical scope of each religion in South, Southeast, and East Asia. An abiding emphasis in this course will be on how to read and interpret the varied scriptures and primary texts of these religions.", "other": ["Cross-listed with: RLST 3", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASIA", "number": "4", "credits": "3 Credits", "description": "Satisfies General Education (GH), International Cultures (IL), Other Cultures (BA) requirements. This course is designed to act as a gateway to Asian literatures and cultures - through English translation - of selected fictional and cinematic texts from Japanese, Chinese, Korean, and Asian diaspora literature (our main focus is on literature of modern Asia). Exploring the historical and cultural contexts of each work, we will pay attention to the ways in which each text depicts the diversities within geographical areas (for instance, \"Japanese culture\" is not monolithic than \"U.S. Culture\" is, and writers might see the same social reality in quite differently). The cross/inter-cultural approach used in this course invites students to acquire a global perspective on the rich traditions of Asian cultures and literatures. Students are expected to develop the ability to comparatively analyze and express, in speech and writing, their views through the reading of literary texts and watching of films.", "other": ["Cross-listed with: CMLIT 4", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ASIA", "number": "83S", "credits": "3 Credits", "description": "The meaning and advantages of a Liberal Arts education in context of a specific discipline.  ASIA 083S Asian Studies First Year Seminar (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course provides an introduction to the meaning and advantages of a liberal arts education in the context of Asian Studies. Through reading, discussion, research, and writing, students in this course will develop many of the basic skills central to a liberal arts education. The specific topic will vary by instructor, but will address one or more countries of Asia. Materials may include works of fiction and literary criticism, historical documents and analysis, or other scholarship and primary materials related to the specific discipline of the instructor. Through reading, discussing, and further exploring such materials, students will build their skills of critical analysis, research, and argumentation, as well as enhancing their intercultural and international perspectives. The course fulfills the first-year seminar requirement as well as a general education or a Bachelor of Arts humanities requirement.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning"]}, {"department": "ASIA", "number": "100", "credits": "3 Credits", "description": "What are the factors that bind and define a region? What makes a geographical area, a set of cultures, or a certain group of people into a single entity? Who decides? Asian history provides a view of how a region is formed and reshaped over time. This course will address the question of what makes Asia a region by examining the shared experiences and interlocking histories and cultures of its people. This will entail study of art and architecture, literature, history, religion, philosophy, social structures, economics, and international relations, with particular attention to reading both visual and textual materials. The goals of this class are two-fold; we aim not only to learn something about times and places far removed from our own, but also to encourage thought about what we do when we study Asia. Students in this class will be expected to think critically about assigned texts and make their own interpretations of their meanings.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "100Z", "credits": "3 Credits", "description": "What are the factors that bind and define a region? What makes a geographical area, a set of cultures, or a certain group of people into a single entity? Who decides? Asian history provides a view of how a region is formed and reshaped over time. This course will address the question of what makes Asia a region by examining the shared experiences and interlocking histories and cultures of its people. This will entail study of art and architecture, literature, history, religion, philosophy, social structures, economics, and international relations, with particular attention to reading both visual and textual materials. The goals of this class are two-fold; we aim not only to learn something about times and places far removed from our own, but also to encourage thought about what we do when we study Asia. Students in this class will be expected to think critically about assigned texts and make their own interpretations of their meanings. ARTH 120Z is linked to ASIA 100Z", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education - Integrative: Linked", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "101N", "credits": "3 Credits", "description": "The history and contemporary practice of athletics in Asia shows that sports are much more than just games. Taking a multi-disciplinary approach to the study of sports in Asia, this course will examine what meanings have been attached to the participation in and planning of athletic events and institutions by Asian peoples and nations. The course will begin with a historical perspective, examining the place of traditional athletic practices, then tracing the introduction of Western-style athletics to various Asian countries in the 19th and 20th centuries and their incorporation into programs of national development. The second part of the course will focus on the international relations of sports mega-events like the Olympic Games and the FIFA World Cup. The third part will focus on the sociology of sports: what meanings do athletic activities and competitions hold in Asian societies, how does that shape people's behavior, and how does it compare to Western societies? Finally, the course will include an anthropological component that seeks to understand Asian societies in new ways by focusing on specific athletic activities, such as Japanese baseball and the Beijing Olympics, and by tracing the changing meanings of Asian sports like judo and karate as they spread to other parts of the world. The aim of this course is not only to build understanding of distant places and disparate peoples, but also to gain new perspectives on our own society through the shared activity of sports.", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASIA", "number": "102", "credits": "3 Credits", "description": "An exploration of popular culture in Asia. ASIA 102 Asian Popular Culture (3) (GH;IL)(BA) Asian popular culture encompasses a broad array of cultural practices and forms that shed light on the politics and societies of Asia. This course examines \"low\" or non-elite cultures that allow us insight into the day-to-day lives of the people who created or enjoyed them. Along the way, we will consider how popular culture intersects with issues such as politics, economy, and society, whether on a local, national, regional, or even global scale. Through examining the contested meanings and presentations of popular culture symbols and forms, students will be introduced to the diverse media through which popular culture has been disseminated and consumed. Themes and topics will vary depending on the instructor, but may include cities and urban culture, commercial cultures, television and theater dramas, film, anime, digital video, mass literature, comics, game shows, video games, youth cultures, gender and its representations, martial arts, popular religion, food, and net cultures and social media.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "103", "credits": "3 Credits", "description": "Historical overview of the development of ideas that forms the basis of the south Asian religious culture. ASIA 103 / RLST 103 Introduction to Hinduism (3) (GH;IL)(BA). This course meets the Bachelor of Arts degree requirements. We begin with a discussion of the pre­-Vedic Indus Valley civilization reflecting upon its influence on later south Asian cultures. The course then traces how the Vedic ritual tradition, and the Vedantic philosophy gave rise to the concepts of Karma (individual action and its underlying motives), Samsara (the cyclical view of life), and the Atman (nature of the individual). Moreover, we pause here to explore the relationship between the emerging idea of civic responsibility (Dharma) and its relationship to the Vedic and Vedantic thought. Next we examine how the Vedantic philosophical tradition may have incorporated a diversity of philosophical views including both Brahmanical as well as non-­Brahmanical traditions of Buddhism, Jainism, Lokayata, etc. The class will read excerpts from the religious literature of the era. The first part of the course concludes with selected readings from the Bhagavadgita, Mahabharata, as well as some Buddhist and Jaina texts. All of these readings will be in English. Class discussions focus on how the classical Hindu worldview may have emerged from the philosophical foundation of the Vedantas, and later built the groundwork for the Hindu Bhakti (devotion) movements. The second part of the course focuses on the various regional Bhakti traditions from the middle ages onwards, analyzing how the regional cultures may have related with the great classical Brahmanic tradition. The course concludes with a discussion of how Hinduism in the post 1800s responded to the forces of colonization, exploring how the different religious and cultural traditions of south Asia may have interacted with other religious cultures (both indigenous and foreign) like Buddhism, Jainism, Islam, and Christianity. We shall read excerpts from noteworthy thinkers and writers of nineteenth and twentieth century to understand the very interesting dynamics between religion and civil society of more recent times. This course concludes with a discussion of how Hinduism in the post 1800s responded to the forces of colonization, exploring how the different religious and cultural traditions of historical south Asia may have interacted with other religious cultures (both indigenous and foreign) like Buddhism, Jainism, Islam, and Christianity. We shall read excerpts from noteworthy thinkers and writers of nineteenth and twentieth century to understand the very interesting dynamics between religion and civil society of more recent times.", "other": ["Cross-listed with: RLST 103", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "ASIA", "number": "104", "credits": "3 Credits", "description": "A general survey of the basic doctrine, practice, and historical development of Hinayana and Mahayana Buddhism. RLST 104 / ASIA 104 Introduction to Buddhism (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is a general survey of the historical development, basic doctrines, and practices of Hinayana, Mahayana, and Vajrayana Buddhism. The course is structured around the \"Three Jewels\" of Buddhism: Buddha, Dharma, and Sangha.That is to say, we will learn about the Buddha as a historical figure and spirit; we will come to understand the basic elements of his doctrinal teachings; and we will examine the community of followers who have practiced his teachings. Special attention will be paid to the various \"geographies\" of Buddhism as expressed through different cultures in ancient India,Southeast Asia, and East Asia. At the conclusion of the course, we will encounter Buddhism as a relatively new cultural force in America. The course revolves around the discussion of key issues in the philosophy, ethics, and theology of various forms of Buddhism.", "other": ["Cross-listed with: RLST 104", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASIA", "number": "105", "credits": "3 Credits", "description": "The history and memory of the Hiroshima and Nagasaki, Nanking massacre, the Cambodian genocide and other forms of mass violence are often taught separately in different disciplines within Asian Studies and beyond. This course will examine them together through the various ways different Asian societies dealt with, experienced and understood them. Using the extensive literature on the history of genocide, this course further suggests the mutual impact of these entangled tragic events. Specific content will vary according to individual instructor, but topics may include victim cultures, ethnic cleansing, trauma, human rights, dark tourism, memorials, and architecture, as well as the general impact of these tragedies on Asian and global politics.", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASIA", "number": "106N", "credits": "3 Credits", "description": "This course provides an introduction to historical and contemporary traditions of health, medicine, and the body from various parts of Asia. Potentially including such diverse topics as Ayurveda, yoga, acupuncture, taiji, qigong, Tibetan medicine, and other systems of practice, the course emphasizes comparative and multi-disciplinary frameworks. The semester finishes with sections on the modernization and globalization of Asian traditions, including their practice in the US. Throughout, the class will approach all Asian ideas and practices on their own terms, encouraging comparison among the various traditions as well as with contemporary American ideas about health and wellness.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASIA", "number": "120Y", "credits": "3 Credits", "description": "The course traces the cultural history of South Asia by studying its literary tradition from ancient to modern times. ASIA 120Y South Asia: A Literary History (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. Asian 120Y provides undergraduate students a taste of the inherent pluralism of South Asian culture and the readings emphasize the broad idea of plurality. The readings and discussions may include, but not necessarily remain confined to a) architectural b) literacy c) musical etc. traditions, depending on the research interests of the individual faculty members teaching the course. Asian Studies undergraduates should be able to recognize both the richness of diversity, as well as the nature of the continuity of the cultural tradition in South Asia that has fascinated outsiders for centuries", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "Writing Across the Curriculum"]}, {"department": "ASIA", "number": "122", "credits": "3 Credits", "description": "This course will examine the formation of Japanese culture through the lens of exchange and adaptation. Seeking to examine our understanding of \"Japan\" and \"culture,\" the course will explore the interplay between culture and identity, with the Japanese experience providing a viewpoint that differs from the standard Western-centric narrative in important ways. Focusing primarily on cultural studies and history, we will also consider not only how the world influenced Japan, as is the standard narrative, but also, how Japanese culture impacted other cultures, both near and far, as the country emerged from being an obscure Asian island to a cultural superpower at the beginning of the 21st century.", "other": ["Cross-listed with: JAPNS 122", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASIA", "number": "171", "credits": "3 Credits", "description": "This course will offer students a general introduction to the cultures and societies of the South Asian subcontinent from the early modern to the contemporary through both the colonial and postcolonial periods. Beginning with an introduction to Mughal rule, the course traces the rise of British power, and the various responses to it from collaboration to mutiny before moving on to the development of competing nationalisms and anticolonialisms, including secular, socialist, Hindu and Muslim variations culminating with the creation of the postcolonial states of India, Pakistan, Bangladesh, Nepal, Sri Lanka, and Afghanistan. It then follows the continuing trajectories of these countries after independence, from the Nehruvian years to the neoliberal shift, with attention to emerging social movements and issues including caste and gender relations; religious and separatist politics; struggles around land and development; urbanization, and labor migration; leading into the 21st century. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: HIST 171", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "172", "credits": "3 Credits", "description": "This course surveys the development of civilization in Japan from ancient times to the present. Among the key goals of this course is to discuss what is distinctive about \"Japanese civilization.\" As a survey of Japan it includes topics such as external relations and cultural exchanges with Japan's neighbors and the world more broadly; the nature of indigenous beliefs, Shinto and Buddhism; the making of the Japanese bureaucratic state and gentry society; the rise of the commercialized economy; the growth of Japanese culture; Tokugawa Japan, It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: HIST 172, JAPNS 172", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "174", "credits": "3 Credits", "description": "This course provides students with an overview of the most important historical developments and external relations of China, Japan and Korea from ancient times to the end of the eighteenth century. As a comparative survey of China, Japan and Korea it includes topics such as external relations and cultural exchanges; early Chinese dynasties; Confucianism, Daoism, Shinto and Buddhism; the making of East Asian bureaucratic state and gentry society; the rise of Ming-Qing commercialized economy; the growth of Japanese culture; Tokugawa Japan, and the role of Korea in East Asia. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: HIST 174", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "175", "credits": "3 Credits", "description": "This course is a comparative survey of the internal developments and external relations of China, Japan and Korea since the early 1800s. Topics include interaction with the West, internal rebellions and reforms, the importance of certain key figures, the changing roles of women, student protests, and current social problems. Considerable focus will be placed on the transition from imperial to constitutional governments, rise of nationalism, World War II in the East Asian context and the phenomenal role China, Japan and Korea have played in shaping the post-World War II world. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: HIST 175", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "176", "credits": "3 Credits", "description": "Survey of cultural, institutional, and political history from ancient times to the present.  HIST 176 Survey of Indian History (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course surveys the history and civilization of India or South Asia from the earliest times to the modern period. The goal of the course is to enable students to form a comprehensive conception of the various facets of Indian or, South Asian civilization in a historical context. This course is an excellent foundation for the history of modern India and also complements a variety of existing courses on the history of the non-western world. In addition to satisfying the GI requirement, HIST 175 satisfies the general credit requirements for the history major or minor, including the 'non-western' component of the major. Non-majors may use this course to satisfy a general education humanities selection. Typically, students will be evaluated on in-class quizzes, written exams, participation in class discussions of assigned readings and critical reviews of books. This course is offered once every year and has an enrollment of 50 students.", "other": ["Cross-listed with: HIST 176", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "ASIA", "number": "177", "credits": "3 Credits", "description": "This course looks at Southeast Asia from the rise of early empires to the present. Beginning with the great empires of Southeast Asia this course surveys the rise of Southeast Asian politics, culture and society before examining the colonial period when the region was dominated by European imperial powers, and concluding with the formation of the modern-day nations of Burma (Myanmar), Cambodia, Laos, Thailand, Indonesia, Malaysia, Singapore, Vietnam, and the Philippines. As part of this discussion, issues of Indianization, colonization, life under Japanese during World War II, and the way in which Cold War politics shaped the region. By the end of the course, students should have a firm understanding of changes in Southeast Asia and be able to assess these historical factors that shaped the current societies.", "other": ["Cross-listed with: HIST 177", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "181", "credits": "3 Credits", "description": "A survey of the history, philosophy, and cultural impact of the major Far Eastern religions: Confucianism, Taoism, Buddhism, and Shinto. ASIA 181 / RLST 181 Introduction to the Religions of China and Japan (3)(GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This is an introductory survey of the historical, philosophical, and cultural dimensions of the major religious traditions in China and Japan. The course delineates and highlights the organic view of the universe and the hierarchical ordering of society in East Asia. It traces the evolution of the major traditions (Confucianism, Daoism, Buddhism in China, as well as Shinto, Buddhism and Confucianism in Japan) by examining their ideas of humanity and nature, morality and society, and metaphysics and ethics. It also reveals the interaction and interrelation between ideology, politics and society, and their impact on the development of the major religious traditions in history. A major focus is the relation between the popular and folk practices and beliefs of esoteric Daoism, devotional Buddhism, and fertility-cult Shinto and the elite and literate doctrines and precepts of Confucianism, philosophical Daoism, and monastic Buddhism. The course also devotes some attention to the influence of religion on various facets of culture, such as medicine, science, literature, art and food. The objectives of the course are first to acquaint students with the religious beliefs, values, and practices of China and Japan by looking at their historical formations and contemporary manifestations, and second, to locate them in a global and comparative context.", "other": ["Cross-listed with: RLST 181", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning"]}, {"department": "ASIA", "number": "182", "credits": "3 Credits", "description": "An historical overview of economy, industrialization, globalization and capitalism in Asia from the 16th century to present.  ASIA (HIST) 182 Asian Trade: Economy, Industrialization and Capitalism in Asia (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. Asian economies have experienced spectacular growth in the second half of the 20th century. But this growth is part of a longer story of Asian commerce and trade and its relationship to and integration with (and, in some cases, isolation from) global patterns of exchange. Moreover, these exchanges are best understood alongside the politics, society, and culture--sometimes local, sometimes regional--that shaped trade and business in entrepots, capitals, and hinterlands throughout Asia. This course begins with a historical exploration of the economic development and social change and ends by asking what lies in store for one of the world&rsquo;s fastest growing economic regions. By offering a historical frame for Asian economic experience , students will gain insight into the strengths and weaknesses of prevailing theories that tend to overstate centralized control, market mechanisms, and cultural determination. Asian economies and markets are quite diverse, consisting of emerging and mature markets, making it difficult to view them through a single lens. As a result this course seeks to introduce students to a variety of conceptual frameworks in these countries. Examinations of the major economic players China, India, and Japan form the backbone of the course, but the precise geographic emphasis will vary with instructor, and may also include discussions of Japan, Korea, Vietnam, Singapore, Indonesia, Taiwan, and other Asian states. Themes of the course will vary depending on instructor, but may include industrialization, sustainability and the environment, gender and labor, protest and political reform, and consumerism and advertising, among others. The course will also offer a general introduction to economic theories that underpin the concepts of globalization, capitalism, and socialism as they are understood in an Asian context. This course is intended as an introduction to Asia for those with particular interests in Business, Economics, Global Studies, Labor, and/or Government. Through weekly readings, films and class discussion students will be introduced to the development of Asian economies in the global context.", "other": ["Cross-listed with: HIST 182", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "ASIA", "number": "183", "credits": "3 Credits", "description": "This course tracks the changes in East Asian gender roles, relationships, and family life from 1800 to the present, placing private life at the center of the history of China, Japan, and Korea. Among the topics covered are the examination of gender and family life in early modern East Asia, considering topics such as marriage customs, the cult of female chastity, birthing practices, male-male sexuality as well as tracing the remarkable shifts in gender and private life in East Asia beginning in the nineteenth century and continuing to the present. The course will likely also cover issues such as women's liberation, changing expectations for courtship, marriage and sex, homosexuality, cross-dressing and androgyny, gender and revolution, and the state's role in regulating sex and procreation.", "other": ["Cross-listed with: HIST 183", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "184", "credits": "3 Credits", "description": "This course examines will explore the origins, nature, and consequences of World War II in the Pacific. Moving beyond the common American focus on the war as a U.S.-Japanese conflict, it will explore the different nations, political movements, ideologies, and empires that clashed across. Asia-Pacific from 1931 to 1945. Topics include the culture and society of modern Asia in the periods immediately before, during and after the Pacific War. This course looks at social and historical roots of the war across Asia from the 1890s to the present to better understand the causes of the war and the affect it had on people throughout Asia.", "other": ["Cross-listed with: HIST 184", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "186", "credits": "3 Credits", "description": "Taking cross-cultural communication and connectivity as its central themes, this course explores the central role that the silk roads and Indian Ocean maritime routes have played throughout Eurasian history. The course provides a historical survey of the land and sea routes and networks connecting Europe and Asia, the peoples and cultures that flourished along these routes, and a variety of exchanges that took place by way of these routes.The course develops insight into trends and patterns over a long period of history, from ancient to modern times; the course also focuses on distinctive periods of history when patterns were disrupted and reformed, and when relationships changed among the peoples and states involved in the silk roads and maritime routes.", "other": ["Cross-listed with: HIST 186, JST 186", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "187", "credits": "3 Credits/Maximum of 3", "description": "This course examines the historical, cultural, and ethnic dimensions of Taiwan over several centuries to the present day. Taiwan's rich history and important economic role in contemporary East Asia clashes with its exclusion from international organizations like the UN and WHO and resultant international isolation. This class will examine the history and culture of Taiwan to better understand how it got here and where it might go. Topics covered will include the Dutch incursions in \"Formosa,\" Japanese colonization, years of military dictatorship and cross-straits tension, rebirth as one of the four \"Asian Tiger\" economies, and its current rowdy democracy and warming ties with the People's Republic of China. We will also explore the literature, film, and culture of this multi-ethnic, multi-lingual, and multi-cultural island.", "other": ["Cross-listed with: HIST 187", "International Cultures (IL)"]}, {"department": "ASIA", "number": "188", "credits": "3 Credits", "description": "Few places generate as much curiosity, interest, or controversy, in the Western mind than Tibet. This course examines Tibet from a variety of perspectives from Tibet's political unification under a single ruler in the seventh century up to Tibet's incorporation into the People's Republic of China in the latter half of the twentieth century. Adopting a Tibet-centered focus, this course examines three core dimensions of Tibet namely its people, its religion and its strong sense of place to allow for a more nuanced and comprehensive understanding of Tibet to emerge. No background or specialized knowledge about Tibet is expected though a willingness to read primary documents on a variety of religious, ethnic and political themes will be quite useful. In this course students can expect to gain an appreciation for how religion, history and politics contribute to contemporary portrayals of Tibet, Tibetans and their society.", "other": ["Cross-listed with: HIST 188", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASIA", "number": "189", "credits": "3 Credits", "description": "A historical introduction to unlawful, illegitmate and forbidden ideas, goods, people and places in modern Asia.  ASIA (HIST) 189 Illicit Asia: An Alternative Introduction to Asia (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines patterns of illicit ideas, goods, peoples and places of modern Asia. Traditional introductions to Asia emphasize a history of the powerful, of the center, of the victors. This course seeks to invert the customary narrative by telling the tale of Asia's early modern and modern past from the perspective of those working against the interest of the elite, popular and mainstream. At the same time, traditional introductions to Asia often risk perpetuating stereotypes of a mysterious, sinister Orient. In fact, dominant discourses both cross-culturally (such as Orientalism) and within a given society (such as elite nationalism) have tended to criminalize or pathologize all kinds of countercultures, alternate economies, non-normative sexual practices, and so forth. But attitudes to orthodoxy and legality may depend on one's relationship to the dominant system, and the dominant narrative. This class seeks to reveal those phenomena in a different light, according to their own contextual logic. Often omitted or ignored, understanding why illegal activity occurs, how it occurs and who the relevant actors are can offer an extremely potent introduction to the roles traditional boundaries of political, cultural and societal activity played in the shaping of Modern Asia. Specific content and regional focus will vary according to individual instructor, but the course will be divided into four general sections that focus on forbidden ideas, goods, places and peoples. Topics may unpack heterodox beliefs like secret societies or anarchist movements; trace the production and distribution of illegal goods like opium or counterfeit items; map out notorious places like the Golden Triangle or the internal workings of human traffickers; or examine the practices and scope of criminal elements like pirates or brigands. The objectives of the course are not only to learn about the illicit activities across modern Asia, but are also organized to encourage us to rethink the way we understand standard interpretations of the past and the factors that go into those perceptions. Students will also consider the changing justifications for and definitions of what is legal, normal and orthodox.", "other": ["Cross-listed with: HIST 189", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "ASIA", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "ASIA", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ASIA", "number": "200", "credits": "3 Credits", "description": "Introduction to the interrelated notions of language, interaction, and culture centering on regions and languages covered in Asian Studies. The purpose of the course is to introduce the interrelated concepts of language, interaction, communication, and culture. The focus is on Asian languages (Korean, Japanese, Chinese, Persian, Hindi, Punjabi, and Urdu) spanning the regions addressed by the Department of Asian Studies. Students explore which concepts in language and culture are universal (e.g., basic reference, time, space) and which are language-culture specific. The course examines what constitutes human language and how human language differs from other forms of communication, e.g., animal communication, artificial languages, and computer-related languages. At issue is the concept of meaning, gradations of meaning, nuances of meaning, literal meaning, implied and inferred meaning, and so forth. The course provides an overview of the essential branches of linguistics (phonetics, phonology, morphology, semantics, syntax, and pragmatics) initially using English examples to illustrate these areas of linguistic focus. English is also used to illustrate the classical notions of parts of speech. The course provides an overview of the geographic regions in which each of the seven languages are spoken, as well as an overview of writing systems, the notions of standard languages, official languages, government oversight of language purity, and dialects. The course examines pragmatics, including basic theories of politeness. Students will gain an in-depth understanding of some of the socio-political underpinnings of the notions of \"standard\" language, deviant language, and dialects. Students will gain a basic understanding of the types of concepts in language and culture that are universal (e.g., basic reference, time, space) and those that are language-culture specific. Students will be expected to discern the multitudes of ways that meaning is created in language and interaction. This course is open to any students interested in learning about the language-culture interface as it applies to languages offered in Asian Studies (plus Persian). Students of any proficiency level of any of the target languages are welcome, from absolute beginners to heritage and/or native speakers.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "ASIA", "number": "215", "credits": "3 Credits", "description": "Survey of the architecture/art of South/Southeast Asia (emphasis on India) from the Bronze Age to a globalizing present. ARTH 215 / ASIA 215 Architecture and Art of South and Southeast Asia (3) (GA;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course has a focus on the architecture and art of South Asia (India, Pakistan, and Bangladesh) and Southeast Asia (particularly Thailand, Cambodia, and Indonesia). Topics will span a time period that begins with Bronze age urbanization in South Asia and concludes with the emergence of globalized architecture in the context of modern nation states. The course will be an opportunity for students to engage with artistic traditions and patronage systems that have adapted to cross-cultural currents, including the more recent forces of colonialism and globalization. Early Buddhist and Hindu architecture and sculpture, the medieval Hindu temple, the advent and adoption of Islam and its artistic forms, the emergence of an early modern empire under the Mughals and their patronage of architecture and painting, British colonial architecture and contemporary interpretations of Modernist architecture and art, are some of the topics that will be covered. Besides paying attention to the formal aspects of buildings, cities and objects, lectures will incorporate information on the emergence of Art History as a discipline in South and Southeast Asia. Lectures, exams and reading assignments will aid in providing students with an intensive introduction to the region's cultural and artistic diversity.", "other": ["Cross-listed with: ARTH 215", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASIA", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ASIA", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "ASIA", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ASIA", "number": "300", "credits": "3 Credits", "description": "Individual projects involving research, reading, and writing; preparation of a thesis in Asian Studies.", "prerequisite": "Participation in the Schreyer Honors College", "other": ["Honors"]}, {"department": "ASIA", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"department": "ASIA", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ASIA", "number": "400", "credits": "3 Credits", "description": "Study of the role of culture in East Asian regional and East-West international relations. ASIA 400 (PL SC 486/HIST 489) International Culture in East Asia (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine the place of culture in international history through a comparative look at the role of cultural circulation and exchange in relations among China, Korea, and Japan (and between East Asia and the West) from the propagation of Buddhism in the first century A.D. to present-day circulation of popular music, movies, and comics. We will explore the international politics of culture and the politics of international culture, considering questions of what constitutes culture, whether it is ever entirely separate from politics, and how that separation has evolved over time. These larger themes of the course will be tackled by following the historical movement of concrete objects and people throughout the region. This is a course in international history, but it also seeks to explore aspects of international relations. The goals of the class are not only to gain an understanding of the uses and impact of culture in international relations, but also to develop the skill of building such an understanding through primary and secondary sources, both written and visual. Students in this class will think critically about assigned texts to develop their own interpretations of their meanings. Through readings, discussions, presentations, and the final project, students will enhance their ability to think critically and to express their ideas clearly in both speech and writing. Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. This participatory approach is intended to deepen students' appreciation of the assigned readings, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytic and expressive abilities.", "prerequisite": "ASIA 100", "other": ["Cross-listed with: PLSC 486", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "401", "credits": "3 Credits", "description": "Role of technology in modernization, national identity, and foreign relations of one or more Asian countries from 19th century to present day. ASIA 401 Technology & Society in Modern Asia (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. The countries of Asia are often seen (or imagined) in the West today in terms of their technological capabilities. This course will examine the role of technology in the modernization, national identities, and foreign relations of one or more countries of East, South, or Southeast Asia from the mid-19th century to the present day. Specific content will vary according to individual instructor, but topics may include the relationship between technological development and international relations, national power, leisure, domestic political and aesthetic movements, war, empire, and trade, as well as the impact of technology on interconnected images of self and other on the part of the peoples of Western and Asian countries.The objectives of the course are not only to learn about the role of technology in modern East Asia, but also to encourage us to rethink the way we view other countries and the factors that go into those perceptions (as well as developing a new way of understanding of what contributes to the views other peoples hold of their own countries). Students will also consider the changing role that technology has played (and continues to play) in all modern societies.", "prerequisite": "ASIA 100", "other": ["Cross-listed with: HIST 401", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "402", "credits": "3 Credits", "description": "This course is a linguistic introduction to the relationship between language, culture, and cognition with a focus on Chinese, Japanese, and Korean. In this course, we study the cognitive linguistic view that human cognition is fundamentally embodied and shaped by various figurative processes such as metaphor and metonymy grounded in our bodily and cultural experiences, and that human thought and language are fundamentally metaphorical in nature. We examine how we think and speak figuratively and conceptualize our experience metaphorically in everyday life, and compare the languages in terms of cognitive universals and cultural variations. The objectives of this course are threefold: (1) to lead language students to a linguistic approach to language analysis so that they learn about how individual linguistic expressions fit into a coherent linguistic system; (2) to enable them to see how linguistic structures reflect underlying cognitive, conceptual structures which are derived from the interplay between human embodiment and cultural environment; and (3) to provide them with a broad perspective on similarities and differences among Chinese, Japanese, and Korean as components that form a coherent category known as \"East Asian\". Class work will include some lecture but will emphasize guided discussions, literature review writings, student presentations, and research papers. This interactive approach is intended to encourage students' participation, involvement, and cooperation in learning, to help them understand the relationship between language, culture, and cognition, and to assist them in developing both analytic and expressive abilities. This course is designed to count as a BA \"Other Cultures\" and International Culture. Students can take this course as long as they have an interest in the relationship between language, culture and cognition, especially in the context of East Asia.", "prerequisite": "ASIA 100", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "403", "credits": "3 Credits", "description": "Food Cultures of Asia explores cuisine as a window to the region's geography, history, and culture. Tracing the specific histories of certain Asian dishes, spices, and grains, we will not only learn about Asian cultures, but also develop an understanding of how people around the world relate to food, both as consumers and producers. Because of the diversity of cultures within Asia, and the increasing interaction of cultures across the globe leading to the emergence of novel forms of fusion cuisine, this course is well situated to fulfill not only the international cultures requirement, but also address the broader need of a well rounded education expected from a Bachelor of Arts degree. Through a comparative approach, we will reflect on our own food choices and think deeply about food's relationship with culture and identity. With readings drawn from historical records, scholarly essays, food memoirs, and popular books and podcasts on the science and culture of food habits in various Asian cultures, the course will provide insight into specific Asian societies, as well as a general awareness of food's role in cultural identity.", "prerequisite": "ASIA 100", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "404H", "credits": "3 Credits", "description": "Selected works from the major poetry, fiction, and drama of such countries as India, China, Japan.", "other": ["Cross-Listed", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Honors"]}, {"department": "ASIA", "number": "404Y", "credits": "3 Credits", "description": "Selected works from the major poetry, fiction, and drama of such countries as India, China, Japan.  CMLIT 404 / ASIA 404 Topics in Asian Literature (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements.  This course focuses on Asian literature in a comparative and international frame. Different iterations of this course will have different topics as well as different historical or geographic foci, but may include literatures from the countries of East Asia (China, Japan, Korea), Southeast Asia (Thailand, Vietnam, Laos, Indonesia, Cambodia), or South Asia (Bangladesh, India, Pakistan). Because the course is comparative it will highlight relationships between and among literary traditions of Asia, or between Asia and the rest of the world, whether in the fields of poetry, drama, or fictional and non-fictional prose.", "prerequisite": "3 credits in literature or related field appropriate to this   course", "other": ["Cross-listed with: CMLIT 404Y", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "ASIA", "number": "405", "credits": "3-6 Credits/Maximum of 6", "description": "Advanced seminar in Asian Studies  ASIA 405 Seminar in Asian Studies (3-6 per semester/maximum of 6)(BA) This course meets the Bachelor of Arts degree requirements. This seminar focuses on advanced topics in the field of Asian Studies and is intended to function as a senior capstone course for majors, as well as an upper-level, research-intensive course for any student seeking to gain in-depth knowledge of a specific issue relevant to Asian culture.The course will have very different focuses in different semesters, depending on the research expertise of the instructing professor. (Potential topics might include, for instance, an examination of human rights policy in Asia, an exploration of maritime empires in the premodern period, an historical archeology of the Islamicization of western Asia, a literary investigation of vernacular literatures, or an art historical examination of urbanization and the built environment in major Asian cities.)Regardless of focus, extensive topic-specific readings will be required, and the goal of the course will be to help students develop and polish advanced research skills in Asian Studies.", "prerequisite": "ASIA 100", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures"]}, {"department": "ASIA", "number": "405Y", "credits": "3 Credits/Maximum of 6", "description": "Seminar in Asian Studies (BA;IL) This course meets the Bachelor of Arts degree requirements. This seminar focuses on advanced topics in the field of Asian Studies and is intended to function as an upper-level, research-intensive course for any student seeking to gain in-depth knowledge of a specific issue relevant to Asian culture. The course will have very different focuses in different semesters, depending on the research expertise of the instructing professor. (Potential topics might include, for instance, an examination of human rights policy in Asia, an exploration of maritime empires in the premodern period, an investigation of popular cultures, or an art historical examination of urbanization and the built environment in major Asian cities.) Regardless of focus, extensive topic-specific readings will be required, and the goal of the course will be to help students develop and polish advanced research skills in Asian Studies.", "prerequisite": "ASIA 3", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "ASIA", "number": "406", "credits": "3 Credits", "description": "This course aims to provide basic pedagogical training for teaching Asian languages as second/foreign language. It involves critical reading and discussion of major pedagogical principles and issues in teaching Asian languages as second languages, with emphasis on topics such as current trends and issues in the field of language teaching (general and Asian-specific), foundation for classroom practices, teaching by principles, agency and motivation in language learning, teaching across proficiency levels, social-cultural and cognitive foundations of language acquisition, teaching language skills (listening, speaking, reading, and writing), teaching grammar and vocabulary, language assessment/measurement, and emerging trends in Asian language learning and teaching. Practical topics such as lesson planning, classroom observation, peer teaching, classroom activities, self- and peer evaluations, best practices in teaching Asian languages, and heritage language instruction are also discussed. This course is suitable for those who have completed an advanced level of Asian Languages and who wish to teach these languages in the future. The course is also suitable for those who wish to teach English in Asian countries.", "prerequisite": "CHNS 402", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures"]}, {"department": "ASIA", "number": "414", "credits": "3 Credits/Maximum of 3", "description": "The study of Chinese language and culture and a perspective on the way of life in contemporary Chinese society. Through this course, the students are introduced to a cognitive approach to the study of Chinese language and culture and a broad perspective on the Chinese way of life in contemporary Chinese society. In particular, we will study how the interaction between Chinese language and culture frames the worldview of Chinese speakers, how the usage of the Chinese language manifests the underlying conceptual structure, which in turn is shaped by the physical (including bodily) and cultural experience of its speakers, and how conventional usage of linguistic expressions of Chinese reflects, and possibly influences, the ways in which Chinese speakers see or conceptualize the world. We will focus on conventionalized expressions, which include compound words, idiomatic phrases, and proverbial sayings, in the Chinese language, and study the Chinese conventional ways of talking about reality, both external and internal, as windows into Chinese culture and cognition. More generally, we will try to understand the embodied nature of human cognition as we see how abstract thought is grounded in bodily experience in and with the physical and cultural world. We will also look at various domains of life in contemporary China in order to gain a better understanding of Chinese society. The objectives of this course are threefold: (1) to lead Chinese language students to a linguistic approach to language analysis so that they learn about how individual linguistic expressions fit into a coherent linguistic system; (2) to enable them to see how linguistic structures reflect underlying cognitive, conceptual structures which are derived from the interplay between human embodiment and cultural environment; and (3) to provide them with a broad perspective on contemporary Chinese society.", "prerequisite": "ASIA 4", "other": ["Cross-listed with: CHNS 414", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "415", "credits": "3 Credits", "description": "Study of modern and contemporary Chinese culture in its diversity and its intercultural contexts. CHNS 415 China Beyond China (3) (IL) In order to begin to understand Chinese culture, we cannot treat it as a monolithic, unified whole. This course will give an introduction to modern and contemporary Chinese culture (focusing on the 20th and 21st centuries) by paying special attention to China's inner diversity, as well as the continuous shaping of Chinese culture in contact, dialogue, and tension with other cultures. Through the study of literary texts, films, and other cultural material - as well as a small number of theoretical essays - this course will focus on: 1) Chinese culture in its variety by focusing on Chinese cultural spheres beyond the People's Republic (Taiwan, Hong Kong), the Chinese diaspora, as well as other ethnicities and cultures within Mainland China; and 2) the ways in which Chinese modernity was impacted by intercultural impulses, as well as the recent self-representation of China in the context of globalization. Course Objectives include: 1. Understand modern and contemporary China in its cultural diversity, as well as shaped by intercultural and global processes. 2. Critically analyze processes of cultural contact and the representations of cultural differences. 3. Think critically about globalization with its impact on such categories as the local and the national. 4. Question your assumptions about the world, re-examine your own points of view, and understand cultures and value systems that may different from (or be shared with) your own.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "416", "credits": "3 Credits", "description": "Study of gender roles and the imaginary of sexuality in the literary, filmic, and artistic production of modern China. CHNS 416 Gender and Sexuality in China (3) (IL) This course explores gender roles and the imaginary of sexuality in the literary, filmic, and artistic production of modern China (from the end of the 19th century up to today), paying attention also to developments in Chinese cultural spheres beyond the People's Republic, such as Taiwan, Hong Kong, and the Chinese diaspora. This course will use the representation of gender, sex, and sexuality as a lens through which modern and contemporary Chinese culture can be understood in its historical, social, and aesthetic changes. The analysis of representations of gender and sexuality throughout the class will focus on literary and filmic texts, as well as art, rather than on theoretical work on gender and sexuality (in China or in general). Course Objectives include:1. Critically assess the complex construction of gender roles and sexuality in modern and contemporary Chinese literature and film2. Reflect critically on different ways of understanding and representing gender difference.3. Critically assess the connections between gender and sexuality and changing political, historical, and cultural contexts.4. Question your assumptions about gender and sexualities in the context of cultural difference, understand cultures and value systems that may be different from (or be shared with) your own.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "417", "credits": "3 Credits", "description": "This course provides an introduction to major classical Chinese novels by focusing on three character types: the warrior, the courtesan, and the ghost. CHNS 423 417 The Warrior, the Courtesan and the Ghost in Classical Chinese Novels (3) (IL) A narrowly defined notion of modern literature is a relatively recent phenomenon that dates back only to the early twentieth century in the Chinese context. There is, however, a long tradition of the vernacular novel that remains influential till today, in spite of its marginalization by the Western-influenced Chinese Enlightenment project. This course provides an introduction to major classical Chinese novels by focusing on three character types: the warrior, the courtesan, and the ghost. The warrior is commonly found in historical romances, tales about errant knights and assassins, and martial arts fiction. Although the typical setting for the courtesan is in novels about prostitution (Xia Xie Xiaoshuo), this course will relate this figure to other female types in various domestic space, thereby tracing the genealogical connections between the domestic fiction and the courtesan fiction. The ghost can be found in Accounts of the Strange (Zhi Guai) and Tales of the Miraculous (Chuan Qi). This course will relate this figure in these narrative genres with other types of the supernatural being, such as Gods and Demons. Most readings will be drawn from the Mind-Qing period (14th -20th c) but modern and contemporary literature as well as visual or media culture that consciously continue or rewrite these narrative traditions will be considered as well. All readings and class discussions will be in English. Knowledge of Chinese or Chinese literature is not assumed or required. From year to year the content we cover might change, but this course will always explore:1) Major classical Chinese narrative traditions that are radically different from the Western-influenced narrative modes of the twentieth century.2) Pre-modern practices of literary reading and criticism and pre-modern notions of literacy, literature, and modes of circulation. Course Objectives include:1. Critically analyze major texts and genres of the classical Chinese novel.2. Understand pre-modern practices of story-telling, literary circulation, reading, and criticism.3. Think critically about pre-modern societies and their connections with the contemporary world.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "418", "credits": "3 Credits", "description": "This course familiarizes students with the critical texts and intellectual cultures of Warring States and early imperial China. CHNS 418 / ASIA 418 / HIST 482 Confucius and the Great Books of China (3) This course exposes students to the key texts, thinkers, and ideas that form the foundation of the Chinese classics and classical period, providing an integral foundation for the study of Chinese history, culture, or literature. While the emphasis is on the texts and their main themes, the course will encourage historical engagement with the texts by placing them into a context of competing cultural, social, political trends. Readings may be grouped around categories of teachings such as Confucianism, Buddhism, and Daoism, or around thinkers such as \"(Confucian) ritualists,\" \"statesmen,\" \"military strategists,\" \"rebels,\" \"recluses,\" and \"spiritual leaders.\" Students will learn how each of these types of teachings and thinkers related to each other, as well as how they responded to the emergent, centralized political order of the day. This will help students better understand many of the recurrent intellectual, political, and religious themes that arise in later Chinese history as well.", "prerequisite": "ASIA 3", "other": ["Cross-listed with: CHNS 418, HIST 482", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "419", "credits": "3 Credits/Maximum of 6", "description": "Study of the rhetorical works in ancient China as well as multiple facets of modern Chinese rhetoric. CHNS 419 The Chinese Rhetorical Tradition (3 per semester/maximum of 6) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course surveys the Chinese rhetorical tradition dating back two and a half millennia. Rhetoric is defined here as the study and practice of artful means of communication, including poetic, expository, and argumentative modes. The class will first delve into the works of competing intellectual schools in pre-imperial China (pre-221 BCE), which set a corner stone for thoughts and practice of communication in the imperial period (221 BCE - 1918). These schools, including the Daoist, the Confucian, and the Legalist, developed their rhetorical notions through engaging with the political, intellectual, and ethnic Other. From here the class will examine the multiple facets of modern Chinese rhetoric, which has undergone a continual contact and conflation with other rhetorical traditions in the global contact zone. The class will focus on topics such as feminist discourse, Chinese-American rhetoric, and the teaching of writing, which bear direct implications on our contemporary social life.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: CHNS 419", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "424", "credits": "3 Credits", "description": "Exploration of seminal Korean texts, including poetry, fiction, autobiography, and criticism, from the early twentieth century to the contemporary era. This course provides a comprehensive overview of modern Korean literature within a transnational context. As we learn how to critically analyze seminal Korean texts, we will locate them in the social, political, economic, and cultural conditions under which they were produced and received. In grappling with some of the fundamental issues they raise;including colonialism, migration, national division, war, gender relations, developmentalism, urbanization, democratization, and contemporary consumer culture;we will also seek to situate these writings in the Korean vernacular within the larger context of global modernity. Rather than take Korean literature and global modernity as given or apart from each other, we will attend to their intersections by raising such questions as: How did modern experiences, constructed through the interface with unfamiliar Others, change preexisting ways of writing and reading? How did foreign occupations affect the formation of a national literature? In what ways do Korean writers' representations of the inter/national events and phenomena on and beyond the Korean peninsula at once enrich and complicate empirical investigations into modern histories of Korea, East Asia, and the world? In an increasingly borderless world, can we draw a boundary around what is called \"Korean\" literature? In parallel with these questions, we will further discuss why and how to engage in literary practices in the current age of digital reproduction. Instruction and all materials will be in English. No preliminary knowledge of Korean history or language is required for taking this course.", "prerequisite": "KOR 120", "other": ["Cross-listed with: CMLIT 424, KOR 424", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "425", "credits": "3 Credits", "description": "Exploration of Korean cinema from the early twentieth century to the present, with an emphasis on its global/local dynamics. This course offers an introductory overview of Korean cinema. As we trace its history from the colonial period to the current \"Korean wave,\" we will also engage with film criticism, the trans/national contexts of film productions, the particular aesthetics of selected auteurs/genres, and local/global receptions of Korean cinema. Our discussion of formal elements and key issues featured in these films;modernity, colonialism, division, nation, class, gender, identity, tradition, ideology, desire, violence, and migration, among others;will be informed by readings of secondary sources and theoretical works, as well as literary materials produced during the same period. Throughout our analyses, we will seek to contextualize the cinematic texts within moments of major shifts not only in modern Korean history, but also in the transnational film industry and screen culture. In pursuing a broad and detailed perspective of Korean cinema, this course will ultimately enrich, and simultaneously complicate, our understanding of Korea, cinema, and the world. Instruction and all materials will be in English. No preliminary knowledge of Korean history or language is required for taking this course.", "prerequisite": "KOR 120", "other": ["Cross-listed with: CMLIT 425, KOR 425", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "430", "credits": "3 Credits", "description": "Study of Japan's foreign relations and position in the international community from the early 19th century to the present. ASIA (JAPNS) 430 Japan in the World (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine Japan's foreign relations and changing position in the international community, from the rethinking of relations with the Western world in the early nineteenth century to its emergence as a pop culture superpower in the present day. The course will explore the structures of international relations, such as imperialism and international organizations, with the Japanese experience providing a viewpoint that differs from the standard Western-centric narrative in important ways. We will also consider the development of alternative methods of diplomacy, including cultural exchange and economic and technical assistance.", "prerequisite": "JAPNS 120", "other": ["Cross-listed with: JAPNS 430", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "431", "credits": "3 Credits", "description": "Focused study of aristocratic society and culture of Heian period Japan. JAPNS 431 (ASIA 431) Courtly Japan (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. The Heian period of Japanese history saw the apex of a refined court culture. Through readings of primary and secondary sources, this seminar-style course will explore the activities, norms, and structures of courtly society in Japan, from the centralization of imperial power in the 8th century through the court's political marginalization in the late 12th century. We will pay particular attention to religion, the arts, politics and governances, gender, and the gradual rise of samurai power in the shadows of the court. This course is intended to provide an introduction to the political, social, economic, and cultural life of the Heian court of ancient Japan. The goals of the class are not only to gain an understanding of a time and place far removed from our own, but also to develop the skill of building such an understanding through primary and secondary sources, both written and visual. Students in this class will take on the role of historian or literary critic themselves, thinking critically about assigned texts and making their own interpretations of their meanings. Through reading, discussions, and writing, students will enhance their ability to think critically and to express their ideas clearly in both speech and writing. The course is intended to deepen student's appreciation of the cultural production of ancient Japan, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytic and expressive abilities. The course is designed to be suitable for all students generally interested in Japan or in various fields of humanistic study.", "other": ["Cross-listed with: JAPNS 431", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "432", "credits": "3 Credits", "description": "Survey of the role of warfare and the warrior in Japan, with attention to changing cultural settngs. Taught in English. JAPNS 432 (ASIA 432) War and the Warrior in Japan (3) (IL) This course is intended to provide an introduction to the social and historical roles of warfare, and the changing cultural figure of the warrior, in Japan. Some prior study of Japan (JAPNS 120 or JAPNS 121 or HIST 172) is required. All materials will be available in English. Students will learn about subjects like the causes of violence, culturally acceptable ways of resolving conflict, obligations of victor toward vanquished, expectations regarding the memory of the war dead, the ideal of the warrior as a cultural figure, and historical roles that Japanese warriors have played in ages of peace. Readings and screenings will cover several genres, such as film, historiography, history, documentary, classical epic, modern novel, and excerpts from Japanese history textbooks (in translation). The course, or individual units within the course, will be structured so that students develop an historical perspective, allowing them to understand the cultural contexts that have generated attitudes toward war and the warrior in Japan. In addition, students will learn to think critically about various media's techniques and aesthetics of representation, and will become more engaged, critical investigators of literature and related media. Readings and in-class discussion will focus on the image of the warrior as a cultural icon, exploring the many ways in which popular understandings of the warrior have changed over time, for instance, as popularized dramatics began to idealize warriors as moral exemplars in the late medieval period, and then as historical realties made the position of the warrior itself redundant in the early modern era.Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. This participatory approach is intended to deepen students' appreciation of the works, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytical and expressive abilities. Through critical reading, group discussion and interpretive writing, students will hone skills for evaluating modes of cultural production and consumption in premodern and modern Japan. Evaluation will be through means such as in-class presentations, short writing assignments, midterms or quizzes, one analytic paper (3-7 pages), and in-class/on-line participation and discussion. The course is designed to be suitable for all students generally interested in Japan, or interested in various fields of humanistic study.", "prerequisite": "ASIA 4", "other": ["Cross-listed with: JAPNS 432", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "433", "credits": "3 Credits", "description": "Transnational Writings of Japan: from Modern to Contemporary Eras . JAPNS 433 (ASIA 433) Traveling Voices (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. Through literary and visual texts from modern to contemporary eras, this seminar-style course will explore a wide range of narrative voices of Japan, created by writers who are physically or figuratively dispersed in many directions within, towards, and away from Japan, and who therefore problematize \"Japanese-ness\" by dealing with cultural situations (e.g. identities, marginality) in their writings. Some Prior Study of Japan (JAPNS 120, JAPNS 121, or HIST 172) is required. Students will explore the rich cultural diversity in Japan and the Japan diaspora, and develop a further understanding of historical border crossers between Japan/East Asia and Americas/the West.They will become more aware of the reciprocal and transformative cross-cultural interactions in languages, literature, religions, economics, ideas, or political formations.They will learn how to think critically, in speech and writing, and develop writing analytic skills appropriate to their final paper project. Evaluation will depend on specific instructor practice, but will certainly emphasize guided discussions, some student presentations (alone or/and group), and writing exercises (especially final research project). A sample guideline might look like this: Class Participation/discussion, Response papers, Informal Presentation (pair or group up to three), Mid-term exam, Final paper presentation, Final Project", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "434", "credits": "3 Credits", "description": "The visual, tactile, and literary arts play key roles in how modern nation-states make sense of themselves and how they make sense of other nations. Japan provides one key example through which to observe the use and function of art to create not only the image and identity of a nation and national culture, but also the image and identity of other national cultures. In recent years, Japanese popular culture has been reborn around the world. A global generation has grown up watching anime and reading manga in Spanish, Chinese, Russian, and English. Beyond Anime is designed to contextualize the recent appropriation and dissemination of Japanese popular culture through the cyclical history of such appropriations through the modern period. In this way, the course will explore the precursors, antecedents, and contexts to our present cultural moment. Through film, photography, posters, matchbook-labels, textiles, industrial design, novels, and myriad other popular media, this seminar-style study of Japanese popular visual culture will help students see Japanese visual arts in terms that are local to Japanese aesthetics and through those that transcend local cultures. Drawing on the long history of illustrated narrative from scrolls to chapbooks, through film and photo essay, this course confronts the exoticist notion that Japan's arts have always placed a disproportionately heavy emphasis on the visual. Through comparative readings of cultural and visual material from Japan, this course will raise questions of aesthetic, cultural, and national difference. Specific topics will vary with instructor, but may include: the rendering of three dimensional space through perspective, the use of pictures in the service of narrative versus the use of pictures as narrative, and how notions of negative space promise deep insight and risk crass stereotypes.", "prerequisite": "ASIA 4", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "440", "credits": "3-9 Credits/Maximum of 9", "description": "An exploration of major Asian sites and monuments through a focus on their historical and cultural significance.  ART H (ASIA) 440 Monuments of Asia(IL)(BA) This course meets the Bachelor of Arts degree requirements. In this course, major Asian monuments are introduced in their physical, historical and cultural contexts. Students are also exposed to various theoretical approaches through which these monuments will be studied. Some of the themes around which the course is structured include patronage, religious practice, cultural meaning, political relevance and the shifting meanings of monuments over time. Students will learn to understand and discuss ways of defining monuments, their formal character and lineage, historical and cultural contexts and their representation across space and time.Each semester monumental sites will be organized around a common theme such as, Hindu and Buddhist Sites across Asia: Historical Significance and Contemporary Relevance, Patronage and Religion, Islam across Asia: Global Ideas and Local Contexts, Political and Symbolic Centers in Asia: Between Early Modernity and the Nation State or Early Modern Asia: Empire and the Built Environment. Alternately, these topics will be incorporated within a multi-themed structure.The objective of the course is to expose students to the histories and cultures of Asia in a globalizing world. Another objective is to equip students with the methodological tools of art history as a discipline, even as they learn about specific monuments. The course will build on the foundation laid by survey courses in Art History, Architectural History and Asian Studies. Weekly readings will be assigned and discussed in class. The development of analytical and writing skills will be stressed, and grades will be based partly on essay exams and short response papers. In addition, students will write a research paper, to be completed by the end of semester.", "prerequisite": "ARTH 100", "other": ["Cross-listed with: ARTH 440", "Bachelor of Arts: Arts", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "457", "credits": "3 Credits", "description": "The history and memory of the Holocaust and Hiroshima and Nagasaki are often taught separately in different disciplines. This course will examine them together through the various ways different societies remembered, understood and commemorated these. Using the extensive literature on the history of memory, this course further suggests ways in which these memories and histories affected and were entangled by each other. Specific content will vary according to individual instructor, but topics may include victim cultures, cold war nuclear history, trauma, human rights, dark tourism, memorials, architecture as well as the general impact of these tragedies on the fraught politics of memory in East Asia and the Middle East, or the way the memories of the tragedies were entangled with the civil rights and other struggles in American and global history.", "prerequisite": "Three credits in JST, HIST, or ASIA", "other": ["Cross-listed with: HIST 457, JST 474", "International Cultures (IL)"]}, {"department": "ASIA", "number": "463", "credits": "3 Credits/Maximum of 3", "description": "This course will present an overview of modern Chinese politics since 1949.", "prerequisite": "ASIA 100", "other": ["Cross-listed with: PLSC 463", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "465Y", "credits": "3 Credits", "description": "A course which identifies components of democracy, such as definitions, measures, datasets, and the democratization process.  PL SC (ASIA) 465Y Democratization in Asia (3) (IL) This class is an upper-level seminar on democratization in Asia. How do countries move from having an authoritarian regime to a democratic government? Why are some democratic governments stable while others are not? In this class, we will focus on democratization theory and how it applies to countries in Asia. This course is organized into two parts. In the first part of the course, we will discuss democracy and democratization theory. We will cover such components as: definitions, measures, datasets, and the different stages of the democratization process. In the second part of the course, we will apply these concepts and measures to specific Asian countries. Course topics will be explored through readings from textbooks, articles, datasets, and media sources. By the end of the course, students will have a deep knowledge about a wide range of Asian countries. Students will develop the skills to compare countries, will understand the democratization process within Asia, and will be able to generalize from their knowledge to evaluate democratization events around the world. Finally, students will gain a deeper understanding of what is democracy and how easy or difficult it is to install and maintain. This course fulfills the distribution requirement for comparative politics, as well as the advanced and related course requirements for Political Science majors. In addition, the course fulfills the supporting course requirement for International Politics majors and the related areas requirement for Asian Studies majors. Finally, the course fulfills the requirements for writing across the curriculum and other cultures.", "other": ["Cross-listed with: PLSC 465Y", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "ASIA", "number": "469", "credits": "3 Credits", "description": "This course offers an overview of the politics of modern South Asia with specific focus on Afghanistan, India and Pakistan.  ASIA (PL SC) 469 Government and Politics of South Asia (3) (IL) This course provides an overview of the politics of modern South Asia with particular attention to the experiences of Afghanistan, India and Pakistan. It examines theories of political and economic development and ethnic politics, the impact of the British colonial experience on South Asia, the rise of nationalism, and the emergence of independent nation states in the region. Three important themes are explored throughout the course: (1) the state of economic development in the three countries; (2) the relationship between identity politics and violence; and (3 ) the international relations of these countries, with particular attention to terrorism and nuclear policy. Course topics will be explored through readings from textbooks and assigned articles, articles from current news sources and, documentary films from the three countries. By the end of the course, students will have knowledge of the politics of Afghanistan, India and Pakistan and the political factors that have shaped their development over the past century. Students will acquire the tools necessary to evaluate critically the impact of war, the legacy of colonialism, and the challenge in building durable democratic institutions. This course fulfills the distribution requirement for comparative politics, as well as the advanced and related course requirements for Political Science majors. The course also fulfills the supporting course requirement for International Politics majors and the related areas requirement for Asian Studies majors.", "prerequisite": "ASIA 100", "other": ["Cross-listed with: PLSC 469", "International Cultures (IL)"]}, {"department": "ASIA", "number": "474", "credits": "3 Credits", "description": "Japanese history from 1580-1880.  ASIA 474 (HIST 474, JAPNS 426) Early Modern Japan (3) Japan's Tokugawa period can be difficult to grasp. It resembles a modern society in many respects but operated according to a logic of social organization different from that of most modern states. There was a collective sense of national identity, but its characteristics differed significantly from modern forms of Japanese identity. Moreover, modern ideologies have contributed to the characterization of early modern Japan as a rigid society and of the country as a whole having been isolated from the rest of the world. The main purpose of this course is to afford students the opportunity to study early modern Japan in detail and, insofar as possible, on its own terms. Through readings in primary and secondary sources, and through the evaluation of visual images, this seminar-style course will deepen students' knowledge of Japan and serve as basis for comparative study of other early modern societies. Although the course investigates classic areas of historical study such as institutional development and foreign relations, the emphasis is on social and environmental history. The course encourages students to think about a range of approaches to the past and to think about the ways our contemporary biases influence the ways we understand the past.", "prerequisite": "HIST 172", "other": ["Cross-listed with: HIST 474, JAPNS 426"]}, {"department": "ASIA", "number": "475Y", "credits": "3 Credits", "description": "India's transition to social, economic, and political modernity through the experience of British colonial rule and the nationalist struggle.  ASIA (HIST) 475Y The Making and Emergence of Modern India (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course covers India's transition to social, economic, and political modernity through the experience of British colonial rule and the nationalist struggle. It begins during the early modern period, when European travelers encountered the flourishing Mughal Empire, and moves into the dynamic moment following, when the East India Company was one of various competing forces, both locally and globally. It then examines the rise of British power, and the various responses to it from collaboration to mutiny; the multiple development of nationalisms and anticolonialisms, including secular, socialist, Hindu and Muslim variations; the accompanying social reform visions, including caste abolition and feminism; the turbulent paths toward partition and independence, resulting in the postcolonial states of India, Pakistan, Bangladesh, Nepal, Sri Lanka, and Afghanistan. It then follows the continuing trajectories of these countries after independence, from the Nehruvian years to the neoliberal shift, with attention to emerging social movements and issues including caste and gender relations; religious and separatist politics; struggles around land and development; urbanization, and labor migration. This course raises important questions about the nature of modernity and its relationship to global interconnectedness, the rise of capitalism and colonialism, industry and technology; while emphasizing South Asian social and cultural contributions and responses to these global shifts. By filling in the context of this part of the world to that global story, the course enables students to grapple with some of the major economic and geopolitical trends of the early 21st century.", "prerequisite": "HIST 172", "other": ["Cross-listed with: HIST 475Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "ASIA", "number": "478", "credits": "3 Credits", "description": "This course examines China's economic reform and development and its engagement with the world since 1978. It pays close attention to the interplay of politics and economics. The course first examines the initiation and process of China's economic reform. This part of course covers topics including state-owned enterprise reform, township and village enterprises, fiscal decentralization, and tax reform. Then the course explores China's interactions with the world, paying special attention to trade, foreign investment,and development aid. Finally, the course addresses the issues and challenges that China faces for sustainable development, including corruption, income inequality, and environmental deterioration. The goal of this course is to give students a comprehensive view of the political economy of contemporary China and its relationship with the world and to develop students' understanding of ecconomic reform and development in the developing world.", "prerequisite": "PLSC 3", "other": ["Cross-listed with: GLIS 478, PLSC 478", "International Cultures (IL)"]}, {"department": "ASIA", "number": "480", "credits": "3 Credits", "description": "An overview of Japan from the 10th to 17th century, a period of political decentralization, cultural efflorescence, and social change.  ASIA (HIST) 480 Japan in the Age of Warriors (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. By the eighth century, Japan had become a centralized state centered on the reign of a sovereign, commonly known in English as an emperor. At the end of the ninth century, the emperor&rsquo;s court relocated to the city of Heian (Kyoto), and soon thereafter, an elegant court culture developed in the capital. The courtly culture was based on civilian values and civilian rule. In the countryside, however, Japan was gradually becoming militarized. Local warlords began rising to prominence and vying with each other for power. One of them, Taira-no-Masakado, rebelled against the central government during the years 939-940, declaring himself &ldquo;emperor&rdquo; of several provinces in eastern Japan centered on Hitachi. Although the central government in Kyoto enlisted other warrior groups to put down Taira-no-Masakado&rsquo;s rebellion, the process of militarization was underway. Buddhist temples also participated in this process, using their wealth and influence to assemble monastic armies on occasion. This course examines Japanese history beginning approximately in the 10th century, at time when civilian high culture in the capital was approaching the height of its development. At the same time, the process of militarization of the countryside was beginning to undermine that civilian court culture. The course ends in approximately the seventeenth century with the establishment of a military government under the Tokugawa shoguns. This development was ostensibly the peak of warrior influence, with the samurai (=warrior) class entrenched by law as the elite group within society. However, just as the warriors began their rise to power in the tenth century, by the end of the seventeenth century they were rapidly losing influence and prestige to wealthy merchants as the forces of the market economy spread throughout Japanese society. HIST 480 is a course in medieval Japanese history, broadly defined. Different instructors will emphasize different aspects of Japanese history and culture during this era. Approaches to teaching will also vary depending on the instructor. Class sessions can take the form of lectures or discussions. Assessment methods and learning activities may include debates, discussions, exams, research papers, book review papers, and other similar academic activities.", "other": ["Cross-listed with: HIST 480", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ASIA", "number": "481", "credits": "3 Credits", "description": "The transformation of Japan from a relatively isolated, agricultural nation into a highly industrialized world power.  ASIA (HIST) 481 Modern Japan Since 1800 (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. In the late 19th century, Japan emerged from relative seclusion and grew, within the period of a few decades, into one of the world's major powers. Japan's remarkable transformation into an imperialist power ended suddenly with defeat by the Allied powers in August 1945. But the history of prewar and wartime Japanese nation-building and economic growth set the stage for postwar rebuilding. This course examines Japan's development as a powerful modern state, imperialist aggressor, defeated nation, economic power-house, and pop culture super-power. Specific content will vary according to individual instructor, but may include the structures of state and society in the early 19th century, the creation of the Meiji state (1868-1912), the successes and costs of the Meiji government's program of rapid modernization and Westernization, imperialist expansion, the road to war and defeat in World War II, the postwar U.S. occupation of Japan (1945-1952), Japan's resurgence as a global power, and some of the major challenges facing the Japanese state and society today. The goals of the class are not only to gain an understanding of the history of another country, but also to develop the skill of building such an understanding through primary and secondary sources, both written and visual. Students in this class will take on the role of historian themselves, thinking critically about assigned texts and making their own interpretations of their meanings. Through readings, discussions, and written work, students will enhance their ability to think critically and to express their ideas clearly in both speech and writing.", "prerequisite": "HIST 172", "other": ["Cross-listed with: HIST 481", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ASIA", "number": "483", "credits": "3 Credits", "description": "The social, political, and cultural issues and developments from the 8th to 16th century.  ASIA (HIST) 483 Middle China (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This advanced discussion-based course covers the social, political, and cultural issues and developments in Chinese history from roughly the eighth century through the sixteenth century. Specific content will vary according to instructor. Students will gain a strong foundation in Chinese history and culture and experience analyzing historical texts.", "prerequisite": "HIST 174", "other": ["Cross-listed with: HIST 483", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "484Y", "credits": "3 Credits", "description": "A study of the dynamic historical development of Chinese thought with its diverse expressions from antiquity to the present.  ASIA (HIST) 484Y History of Chinese Thought (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the historical developments of Chinese thought and its multifarious expressions from ancient times to the eighteenth century. It explores the unique Chinese ways and means of making sense of the world and the human condition by probing China&rsquo;s philosophical and religious traditions. It reveals the conscious life of the Chinese in matters moral, ethical, aesthetic and metaphysical. Moreover, by showing the unity, diversity, continuity and discontinuity in Chinese thought throughout the ages, this course debunks the popular &ldquo;Orientalist&rdquo; myth that Chinese culture had been a hermetically sealed and stagnant monolith until the modern era when Western influences became dominant.", "prerequisite": "HIST 174", "other": ["Cross-listed with: HIST 484Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "ASIA", "number": "485Y", "credits": "3 Credits", "description": "China from 1644 founding of Qing dynasty to 1911 fall; Chinese society and institutions, imperialism and China's internal diversity.  ASIA (HIST) 485Y China's Last Empire: The Qing Dynasty, 1644-1911 (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine the Qing dynasty, the last imperial dynasty to rule China, from the seventeenth to early twentieth centuries. More than doubling the size of the previous Ming dynasty, the empire also included people such as Tibetans, Muslims and Mongols who had never before considered themselves as &ldquo;Chinese&rdquo; but were now Qing subjects. The course will examine how Manchu ruling family, a non-Chinese people, outnumbered by the Chinese by about three hundred and fifty to one managed to conquer and rule China for nearly three hundred years. Tracing the political, social and cultural development of china starting with the foundation and consolidation of the Qing in 1644 and concluding with the collapse of the dynastic system in 1911, this course examines the role of the imperial system, internal rebellions, and the impact of Western colonialism on China. Considerable time will also be focused on China&rsquo;s ethnic, religious and cultural differences in order to allow a deeper understanding of major issues and themes in late imperial Chinese history. Finally, the theme of China&rsquo;s international relations in Asia and the world and China's shifting place in the world will be a prominent thread of the course. Through a blend of primary and secondary sources, students in this class will need to think critically, read broadly and express their ideas clearly regarding the evolving challenges facing China&rsquo;s last empire.", "prerequisite": "HIST 175", "other": ["Cross-listed with: HIST 485Y", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "ASIA", "number": "486", "credits": "3 Credits", "description": "China from 1900 to the present; nationalism, cultural change; development of communism.  ASIA (HIST) 486 China in Revolution (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the social and cultural history of modern China from 1900 to the present. Major topics may include the formation of a modern national state, relationships between society and government, economic development and environmental crises, changes in kinship and family life, and changing relationships between elite and popular culture. The course uses excerpts from primary documents, fiction, and film to help students understand the modern Chinese historical experience.", "prerequisite": "HIST 175", "other": ["Cross-listed with: HIST 486", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "487", "credits": "3 Credits", "description": "The development and current state of Zen Buddhist thought and practice.", "other": ["Cross-listed with: RLST 483", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "ASIA", "number": "494", "credits": "1-12 Credits/Maximum of 999", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "ASIA", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ASIA", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "ASIA", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]