[{"department": "ASTRO", "number": "1", "credits": "3 Credits", "description": "ASTRO 1 Astronomical Universe (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Students who have passed ASTRO 5, ASTRO 6, ASTRO 7N or ASTRO 10 may not take this course for credit. Overview of modern understanding of the astronomical universe. ASTRO 1 is an introductory course for non-science majors. It provides a broad introduction to Astronomy with qualitative descriptions of the dazzling and varied contents of the universe including planets, the Sun and other stars, exoplanets, red giants, white dwarfs, neutron stars, black holes, supernovae, galaxies, dark matter, and more. The course will explore how these objects form and change and interact, how the whole whole universe formed and changes (cosmology), and where Earth fits in the vast scheme of things. Students will learn how our relative place, orientation, and motion in space dictate our changing view of the sky (daily and yearly sky motions, phases of the moon) and conditions on Earth (arctic, tropics, and seasonal changes). Descriptions will build upon the basic physics of gravity, light, and atoms, and will be discussed in the context of the process of science as a robust and self-correcting way of learning and knowing that relies on making and testing predictions by gathering evidence. The goal of this course is to cover most of the areas of modern astronomy at a level which requires only basic mathematics.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "1H", "credits": "3 Credits", "description": "ASTRO 1H Astronomical Universe (3) (GN)(BA) This Honors course meets the Bachelor of Arts degree requirements. Students who have passed ASTRO 5, ASTRO 6, ASTRO 7N or ASTRO 10 may not take this course for credit. Overview of modern understanding of the astronomical universe. ASTRO 1H is an introductory course for non-science majors. It provides a broad introduction to Astronomy with qualitative descriptions of the dazzling and varied contents of the universe including planets, the Sun and other stars, exoplanets, red giants, white dwarfs, neutron stars, black holes, supernovae, galaxies, dark matter, and more. The course will explore how these objects form and change and interact, how the whole whole universe formed and changes (cosmology), and where Earth fits in the vast scheme of things. Students will learn how our relative place, orientation, and motion in space dictate our changing view of the sky (daily and yearly sky motions, phases of the moon) and conditions on Earth (arctic, tropics, and seasonal changes). Descriptions will build upon the basic physics of gravity, light, and atoms, and will be discussed in the context of the process of science as a robust and self-correcting way of learning and knowing that relies on making and testing predictions by gathering evidence. The goal of this course is to cover most of the areas of modern astronomy at a level which requires only basic mathematics.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "5", "credits": "3 Credits", "description": "The development of our modern understanding of the visible sky and planetary systems. Students who have passed ASTRO 1, ASTRO 7N, or ASTRO 10 may not take this course for credit. ASTRO 5 The Sky and Planets (3) (GN) will introduce students to the wonders of the universe and help them to understand how the universe works through the laws of physics. During the semester, they will learn about the different observed motions of objects in our sky, how astronomical objects influence our concepts of time, the nature of light and spectra, how planetary systems are formed and comparative details about our solar system and other planetary systems. Many colorful images and movies of the solar system have been collected by robotic satellite missions like Voyagers I & II, the Magellan mission to Venus, Mars rovers and orbiters, the Galileo and Juno missions to Jupiter, the Cassini and Huygens missions to Saturn, and the New Horizons mission to Pluto and the Kuiper Belt. These and other images will be used to convey the excitement of discovery and nature of astronomical study of the Solar System to our students.", "prerequisite": "Students who have passed ASTRO 001 or ASTRO 010 may not take   this course.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "6", "credits": "3 Credits", "description": "ASTRO 6 Astronomical Universe (3) (GN) This course meets the Bachelor of Arts degree requirements. Students who have passed ASTRO 1, ASTRO 7N, or ASTRO 10 may not take this course for credit. Overview of modern understanding of stars, galaxies, and cosmology. ASTRO 6 is an introductory course for non-science majors. It provides a broad introduction to many areas of Astronomy with qualitative descriptions of the dazzling and varied contents of the universe including the Sun and other stars, red giants, white dwarfs, neutron stars, black holes, supernovae, galaxies, dark matter, and more. The course will explore how these objects form and change and interact, how the whole whole universe formed and changes (cosmology), and where Earth fits in the vast scheme of things. Descriptions will build upon the basic physics of gravity, light, and atoms, and will be discussed in the context of the process of science as a robust and self-correcting way of learning and knowing that relies on making and testing predictions by gathering evidence. The goal of this course is to cover most of the areas of modern astronomy at a level which requires only basic mathematics.", "prerequisite": "Students who have passed ASTRO 001 and ASTRO 010 may not take   this course.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "7N", "credits": "3 Credits", "description": "ASTRO 7N (GA/GN) is both an introductory course in astronomy for non-science majors and a creative space for those with science backgrounds interested in visual arts; it provides students the opportunity to demonstrate understanding and develop a personal connection to the subject by designing four art projects. Students will learn the broad concepts of astronomy by playing an immersive video game, which allows them to 1) explore seasons, phases of the Moon, light, gravity, and telescopes from a virtual colony on Mars; 2) fly from planet to planet in the Solar System and learn about their properties and formation; 3) visit the Sun and other stars, learn how they produce energy, and about their life cycles; 4) fly through the cosmos and construct their own universe, particle by particle. Students will also learn about the relationships and exchanges between arts and sciences, and explore inspiration and perspective on these topics by designing themed art projects using traditional and digital media. These projects include assembling a photo- journal of astronomically-relevant subjects, constructing their own video-game-like scene, interpreting data to inform a plausible depiction of an alien world, and producing three- color images using methods like those employed by astronomers to compose and display Hubble Space Telescope images. Students who have passed ASTRO 1, ASTRO 5, ASTRO 6  or ASTRO 10 may not take this course for credit.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASTRO", "number": "10", "credits": "2 Credits", "description": "ASTRO 10 Elementary Astronomy) (GN) (BA) This course meets the Bachelor of Arts degree requirements. Students who have passed ASTRO, 1, ASTRO 5, ASTRO 6, or ASTRO 7N may not take this course for credit. Students may not receive General Education credit for ASTRO 10 unless they also take ASTRO 11. Overview of modern understanding of the astronomical universe. ASTRO 10 is an introductory course for non-science majors. It provides a broad introduction to Astronomy with qualitative descriptions of the dazzling and varied contents of the universe including planets, the Sun and other stars, exoplanets, red giants, white dwarfs, neutron stars, black holes, supernovae, galaxies, dark matter, and more. The course will explore how these objects form and change and interact, how the whole whole universe formed and changes (cosmology), and where Earth fits in the vast scheme of things. Students will learn how our relative place, orientation, and motion in space dictate our changing view of the sky (daily and yearly sky motions, phases of the moon) and conditions on Earth (arctic, tropics, and seasonal changes). Descriptions will build upon the basic physics of gravity, light, and atoms, and will be discussed in the context of the process of science as a robust and self-correcting way of learning and knowing that relies on making and testing predictions by gathering evidence. The goal of this course is to cover most of the areas of modern astronomy at a level which requires only basic mathematics.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "11", "credits": "1 Credits", "description": "Selected experiments and explorations to illustrate major astronomical principles and techniques. Telescopic observations of planets, stars and nebulae. ASTRO 11 Elementary Astronomy Laboratory (1) (GN)(BA) This course meets the Bachelor of Arts degree requirements. ASTRO 11 is the 1 credit laboratory component of this overview of astronomy and is intended to be taken in conjuction with ASTRO 10. It covers material similar to the lecture component in ASTRO 10, but the selected topics are covered in more depth and are focused on active learning components. Weekly two-hour labs may include investigating the habitable zone of a variety of stars, investigating the phases of the moon, analysis of the properties of stars in a color-magnitude diagram, analysis of the colorful spectra of different chemical elements, and exploration of one of the deepest images of space ever obtained. In addition, students will complete a semester nighttime observing project that typically involves learning some constellations, tracing phases of the moon, and sketching images seen through telescopes or binoculars at the student observatory.", "prerequisite": "ASTRO 1", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ASTRO", "number": "19N", "credits": "3 Credits", "description": "\"Being in the Universe\" considers three fundamental questions of human existence from both humanistic and scientific perspectives: (1) What is the nature of our universe, and to what extent are creatures like ourselves a predictable consequence of it? (2) What is the nature of time, and what does it mean to be a conscious being living our lives through time? (3) What would it mean for humans to be alone in the Galaxy or the universe, or alternatively, not alone? \"Being in the Universe\" is an integrative GH+GN GenEd course. The course's three major units cover the following topics: (1) We discuss cosmology and religion as human enterprises, as well as the history of science; (2) We study the basic scientific theory of the Big Bang universe, and consider its implications for human life; (3) We address contemporary theories of the multiverse from scientific, philosophical, and literary perspectives; (4) We consider the thermodynamic and relativistic theories of time, and the basic philosophical approaches to time, and discuss the implications of these for our ordinary human experience of the past, present, and future; (5) We discuss the history of life in the universe, the possibility of life on other planets, and the social, religious, and imaginative reactions to those possibilities in literature and film.", "other": ["Cross-listed with: CMLIT 19N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "20", "credits": "2 Credits", "description": "Introduction to the study of modern astronomy through discussions, activities, and writing.", "other": ["First-Year Seminar"]}, {"department": "ASTRO", "number": "21", "credits": "2 Credits", "description": "The course is designed to provide first year undergraduate students in both the ASTRO and PASTR majors with necessary tools and techniques to perform research. Students will practice a variety of techniques on authentic astronomical data, which might include light curves from the Kepler mission, galaxy and stellar spectra from the Sloan Digital Sky Survey, or pulsar data from the Green Bank or Arecibo telescopes. An emphasis will be placed on using common tools for observational astronomy, such as viewing astronomical FITS images in SAOimage. Students will be introduced to the common programming languages and environments used by astronomers at the time the course is offered, which currently includes Python and IDL. Students will be given experience in calculating statistical information about a set of astronomical data using the R programming language and its built-in tools. Students will make plots to illustrate a pattern in their data using the tools in Python, IDL, or R, for example."}, {"department": "ASTRO", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ASTRO", "number": "116", "credits": "3 Credits", "description": "This course is designed to engage students with the big ideas of astronomy in ways that will help them understand both the content of astronomy, as well as the practices of science as carried out by astronomers. The course is designed for prospective elementary and middle school teachers (PK-4 and 4-8 majors), although it is available to other non-science majors. Throughout the course, students engage in a series of investigations that lead towards the development of evidence-based explanations for patterns observed in the current Solar System. Investigations will include computer-based simulations, night-sky observations, and use of simple laboratory equipment. These investigations lead students towards an understanding of how observations of the current Solar System can be explained by the model of its formation. The course is designed to build from students' own personal observations of the day and night sky towards developing increasingly sophisticated explanations for those phenomena and beyond. Conducting these astronomy investigations will help students understand fundamental aspects of physics, thus broadly preparing them for future science teaching in these domains. The course models evidence-based pedagogy, thus helping to prepare students for future teaching careers as they learn effective strategies for teaching science.", "other": ["Cross-listed with: SCIED 116"]}, {"department": "ASTRO", "number": "120", "credits": "3 Credits", "description": "Exploration of Cosmology, Birth, and Ultimate Fate of the Universe; Origin of Galaxies, Quasars, and Dark Matter. For non-science majors ASTRO 120 The Big Bang Universe (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Astronomical observations made during the last 70 years, combined with mathematical physical theory (Einstein's General Relativity), has led to a dramatic new view of the history of the Universe. Ten to twenty billion years ago, all the material that is now contained in stars, planets, and galaxies was then compressed into a region, smaller than a pinhead, and so hot that atoms could not survive. This fiery cauldron cooled and expanded, forming hydrogen and helium, and eventually all the materials and structures that we know today. This course will discuss the evidence, theories and controversies of this new scientific cosmology, commonly known as 'the Big Bang'. This class is designed for the non-science students who, after learning the fundamentals of astronomy in ASTRO 1(GN), ASTRO 5 (GN) or ASTRO 10 (GN), want to pursue further the questions of cosmology. The great success of the Big Bang theory in explaining the expansion of the Universe, the synthesis of the chemical elements, and the relic radiation leftover from the first moments are reviewed. Some of the questions discussed are still debated in the scientific community. For example: Why do some galaxies have stunning spiral structures, while others are relatively featureless ellipticals? What is the \"dark matter\" that may have emerged from the Big Bang, and seems to make a larger contribution to the mass of the universe than all of the material we are familiar with? What can the most distant and oldest objects we know of, the quasars, tell us about how galaxies formed? In presenting the development of this subject, the empirical and conceptual methods of modern physical science are conveyed. Students are assigned problems that exercise the use of elementary mathematics and physics to address real issues, and will confront discussions of interpretation and meaning in essays. A final project allows them to explore individual interests.", "prerequisite": "ASTRO 1", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "130", "credits": "3 Credits", "description": "The predicted properties of black holes and the astronomical evidence for their existence are investigated in the context of modern ideas about space, time, and gravity. ASTRO 130 Black Holes in the Universe (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Black Holes in the Universe introduces students to the predicted properties of black holes and the astronomical evidence for their existence. Modern ideas about the nature of space, time, and gravity are also covered. The key topics discussed in the course include Newton's and Einstein's theories of gravity, predicted properties of black holes, stars and their fates, how to detect a black hole, gamma-ray bursts, supermassive black holes in galactic nuclei, active galaxies, black hole spin, gravitational waves, Hawking radiation, singularities, and black hole child universes. The course is intended to be an attractive choice for students who are interested in enriching and broadening their understanding of modern physical science.The course is intended for students who have completed and enjoyed the one-semester survey of modern astronomy, ASTRO 1, 6, or 10. It has an interdisciplinary flavor, combining basic physical concepts, astronomical observations, and philosophical ideas to present a complete picture of the current understanding of black holes. Time is also devoted to provide historical insight into the development of our ideas about gravity from Kepler and Newton through Einstein and modern ideas about quantum gravity. Students use mathematics at the level of high school algebra.", "prerequisite": "ASTRO 1", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "140", "credits": "3 Credits", "description": "The problem of the existence of life beyond Earth is investigated, drawing from recent research in astronomy and other fields. ASTRO 140 Life in the Universe (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. The possibility of life beyond Earth is one of the great unsolved puzzles of human thought and has been debated for millennia. An answer would fundamentally change the relationship between the human race to the rest of the Universe. Advances in modern physics and astrophysics have dramatically changed and enriched the understanding of our cosmic surroundings, but have not yet produced an unambiguous evidence concerning the extraterrestrial life. Yet, significant progress has been made on certain aspects of the problem. Recent observations of protoplanetary disks around young stars, planets around solar-type stars and a rapidly spinning pulsar (a Penn State discovery), and pervasive organic molecules throughout the Galaxy give tantalizing, albeit indirect, hints in favor of the existence of nonterrestrial life. \"Life in the Universe\" is envisioned to be an attractive choice for students who are interested in enriching and broadening their understanding of modern science. The course is highly interdisciplinary, combining evidence from several fields of science to describe our chances to encounter life beyond Earth and the Solar System. Selecting this course would be a logical choice for students who completed and enjoyed ASTRO 1 (GN), ASTRO 5 (GN), or ASTRO 10 (GN). The students are expected to reach the following goals from this course: - learn to appreciate limitations of human experience and a role of the interdisciplinary approach in solving scientific problems - gain understanding of a relationship between the physical Earth, its biosphere, and the rest of the observable Universe - examine in some detail a contemporary problem of scientific investigation: the astrophysical evidence for planets around stars other than the Sun - assess the scientific significance of searches for extraterrestrial life including technological civilizations. Lectures systematically cover the topics listed in the course outline at a level appropriate for non-science students, although students from the Planetary Science & Astronomy major, as well as other science and engineering majors, can take the course. While general understanding of astronomy from the prerequisite course is expected, the necessary physical and astrophysical concepts are reintroduced to assure a logical and coherent flow of information throughout the course. Videos are used to illustrate a number of topics, such as the search for extraterrestrial intelligence, physical conditions on planets of the Solar System, the detection of planets around a neutron star, and to evaluate the scientific content of science fiction movies.", "prerequisite": "ASTRO 1", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "141N", "credits": "3 Credits", "description": "The search for life beyond planet Earth has been the subject of much interdisciplinary scientific search and has stimulated human imagination. Scientific discoveries of exoplanets (outside of our solar system), of extremophiles (life which can survive in extreme conditions) and the discoveries of conditions on other bodies in our solar system which might be able to support life, has provided progress in answering the question of the existence of extraterrestrial life. Not only have a plethora of fictional work appeared in the film media to depict scenarios of life beyond Earth, but there has also been an abundance of video media created to present the scientific ideas to the wider audience beyond the scientific community. This course intends a critical evaluation of both nonfiction and fictional media works in the educational dissemination of scientific ideas and the effective presentation of concepts. We will analyze techniques in photography, mise en scene, editing, sound, dramatization and writing as they are applied to topics in astrobiology.", "other": ["Cross-listed with: COMM 151N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ASTRO", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ASTRO", "number": "291", "credits": "3 Credits", "description": "Physical processes and observational techniques in astronomical systems, characteristics of the sun, planets, and moons. ASTRO 291 Astronomical Methods and the Solar System (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. ASTRO 291 / ASTRO 292 is a two-semester overview of our current knowledge of astronomy. They are designed for students with a solid grounding in math and physics who wish to obtain a more quantitative understanding of the universe than that presented in ASTRO 1 or the 100-level ASTRO series. These courses are required for students majoring in astronomy, generally taken in the sophomore year. ASTRO 291 starts with the appearance of the sky to the naked eye and the historical development of astronomy. It then turns to an introduction to physical processes relevant to the interpretation of astronomical findings: Newtonian gravity and its applications in celestial mechanics, electromagnetic radiation, and a simplified understanding of atoms. The principal tools of astronomy, telescopes and their instrumentation are described. The course proceeds with the survey of astronomy with the constituents of the solar system: sun, planets, natural satellites, planetary rings, asteroids, and comets. Physical processes are integrated with empirical findings to provide a profound and quantitative understanding of the phenomena; e.g. the role of angular momentum and tidal forces in establishing the orbits and spins of solar system bodies. After the development of these concepts, a survey of the properties of the constituents of the Solar System (planets, moons, rings, asteroids, comets, meteors, and the Sun) is conducted.", "prerequisite": "PHYS 211", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ASTRO", "number": "292", "credits": "3 Credits", "description": "Observed properties and astrophysical understanding of stars, stellar evolution, galaxies, the large-scale universe, and cosmology.  ASTRO 292ASTRO 292 Astronomy of the Distant Universe (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. ASTRO 291/292 is a two-semester overview of our current knowledge of astronomy. They are designed for students with a solid grounding in math and physics who wish to obtain a more quantitative understanding of the universe than that presented in ASTRO 001 or the 100-level ASTRO series. These courses are required for students majoring in astronomy, generally taken in the sophomore year.ASTRO 292 continues the survey started in ASTRO 291. The first half of the course is devoted to stellar astronomy and astrophysics. The class follows the successful application of physics to astronomical data in the 19th -20th centuries to understand distances, masses and energy sources of stars. The formation, structure and evolution of stars is treated in the context of physical processes developed in ASTRO 291. The class studies the death of stars, including spectacular phenomena such as supernova explosions, pulsars and black holes, solutions to difficult problem of establishing distance scales (stellar, galactic, intergalactic) are presented. In the second half of the course, the students examine the Universe on progressive larger scales: our Milky Way galaxy, other galaxies, and massive black holes in galactic cores (e.g. quasars). Exotic phenomena such as gravitational lenses, gamma-ray bursts and cosmic rays are investigated. Finally, the class delves into the remarkable findings of modern cosmology: Hubble's discovery of the expansion of the Universe, the discovery of the cosmic microwave background and consequent dominance of Big Bang cosmology in the context of Newtonian and Einsteinian theories of gravity. Cosmological evolution is studied; e.g. formation of light elements during the first few minutes, and the growth of large-scale structure that continues to the present. Unsolved problems faced by today's scientists are emphasized.", "prerequisite": "ASTRO 291", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "ASTRO", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ASTRO", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ASTRO", "number": "320", "credits": "3 Credits", "description": "Basic observational astronomy techniques introduced through observational exercises, lab experiments, and lectures on relevant statistical techniques. ASTRO 320 Observational Astronomy Laboratory (3) (GN) ASTRO 320 will provide students with practical experience in basic observational and laboratory aspects of astronomical data collection and analysis, including an introduction to associated statistical concepts. Observational techniques will be introduced through an observing project using a telescope with a CCS imaging camera. Lectures will introduce fundamental principles including Poisson and Gaussian statistics, measurement precision, propagation of errors, and systematic uncertainties. These principles will be put into practice in the observing project and with laboratory experiments investigating the properties of light and cosmic rays. Experiments include: a cosmic ray telescope; a Michelson interferometer; a photodiode and monochromator; laser interference, diffraction and refraction; fluorescent gases; and a diffraction grating spectrometer.", "prerequisite": "ASTRO 291", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ASTRO", "number": "401", "credits": "4 Credits", "description": "Overview of the techniques used and results from studies of the Solar System, stars, and galaxies.  ASTRO 401 Fundamentals of Planetary Science and Astronomy (3) This course will focus in core content areas in planetary science and astronomy. Students will explore the fundamentals in robotic exploration of the Solar System, how astronomers map and navigate the night sky, our understanding of the nature and evolution of stars, and the nature and evolution of galaxies. Students will engage with real data from Solar System missions as well as ground-based and space-based telescopes. Through the use of many databases and data archives from missions and observatories, the students will become familiar with the census of astronomical objects in various categories. A particular emphasis will be placed on examples of qualitative and quantitative problem solving in these content areas. In addition, students will explore how scientists communicate their results to the public, and they will get hands-on experience, such as planning and executing a planetarium show.", "prerequisite": "ASTRO 1"}, {"department": "ASTRO", "number": "402W", "credits": "3 Credits", "description": "Properties and use of optical telescopes, imaging and spectroscopy, multi-wavelength techniques, data analysis and statistics, practical research methods.  ASTRO 402 Astronomical Telescopes, Techniques, and Data Analysis (3) This course will provide practical experience and understanding of the telescopes and techniques by which astronomers obtain data and conduct research. The study of telescopes will include optical, infrared, radio, ultraviolet, X-ray, and gamma ray observations, and students will learn to set up and use optical telescopes. In-depth coverage of the instruments used for imaging and spectroscopic observations of a variety of astronomical objects will be provided. Applications will include topics in planets, stars, galaxies, and cosmology. Detailed examples of data analysis will be given, including the relevant statistical techniques. Finally, the process by which research in astronomy is conducted will be reviewed, from proposing observations, to obtaining them, to analyzing and interpreting them, to writing up the results. This course is a requirement for students in the Planetary Science and Astronomy major and minor. It may be taken by any students with the needed pre-requisites, but cannot be counted towards the required 400 level courses for the Astronomy and Astrophysics major or minor.", "other": ["Writing Across the Curriculum"]}, {"department": "ASTRO", "number": "410", "credits": "3 Credits", "description": "Applications of numerical methods and computer programming to astrophysics, including stellar physics and cosmology.", "prerequisite": "CMPSC 201"}, {"department": "ASTRO", "number": "414", "credits": "3 Credits", "description": "Theory of Stellar structure and evolution including energy generation and transport and an examination of stellar models.  ASTRO 414 Stellar Structure and Evolution (3) ASTRO 414 covers the theory of stellar structure and evolution at an introductory level. It includes the basic physical processes that influence the structure of a star, such as energy generation in stellar cores, the transport of energy to the surface via photon diffusion and convection, equilibrium conditions, etc. It examines realistic stellar models as they apply to stars of different masses, for example, polytropes and other approximations. The treatment of stellar evolution includes gravitational collapse, stable stellar configurations on the main sequence, and the fast-paced late stages of evolution, leading up to the formation of compact objects. Realistic stellar models will be employed to illustrate the structures of different types of stars and the influence of various physical processes on these models.", "prerequisite": "ASTRO 292"}, {"department": "ASTRO", "number": "415", "credits": "3 Credits", "description": "Astronomical data are being produced at an unprecedented rate with large-scale telescopes, and thus data analytic skills to extract meaningful information from such massive astronomical datasets are important skills for astronomers. This course is designed to provide juniors or seniors in astronomy, who have no or little background in statistics, both theoretical background and practical experience on astronomical data analyses. For this purpose, the first half of the course will cover fundamental underpinnings of probability and statistical inference, and for the other half of the class, various statistical and machine learning tools will be introduced with hands-on coding experiences using a modern programming language, such as R.", "prerequisite": "MATH 230"}, {"department": "ASTRO", "number": "420W", "credits": "3 Credits", "description": "Solar system properties, star formation, protoplanetary disks and planet formation, solar system model, extrasolar planets, and astrobiology.  ASTRO 420W Planets and Planetary System Formation (3) The course explores the wide variety of physical and chemical processes that govern the motions and properties of planets. Observations of the planets, moons, asteroids, comets and planetary rings in our Solar System are described. The properties of extrasolar planets are also emphasized. The process of planetary formation is discussed in the context of the solar system and in the context of extrasolar planets. The prospects of life and the effect of life on such planets will also be discussed.It will be taken by roughly half of the juniors and seniors majoring in Astronomy and Astrophysics (about 10 people). The course will include writing papers on current issues of debate in the areas of solar system and extrasolar planets and will satisfy the \"Writing Across the Curriculum\" requirement.", "prerequisite": "ASTRO 292", "other": ["Writing Across the Curriculum"]}, {"department": "ASTRO", "number": "440", "credits": "3 Credits", "description": "Theoretical investigation of physical processes in astronomical objects and systems; modern physical interpretation of astronomical phenomena.", "prerequisite": "MATH 230"}, {"department": "ASTRO", "number": "451", "credits": "3 Credits", "description": "Practical methods of modern observational astronomy, detectors, filters, instrumentation for both ground-based and space observations, and data analysis.  ASTRO 451 Astronomical Techniques (3)ASTRO 451 will introduce students to the techniques and technologies for modern observational astronomy, emphasizing the development of practical skills as well as understanding through computer-based investigations integrated with traditional lecture content. Beginning with a summary of probability theory, the students will be introduced to standard techniques of statistical analysis including hypothesis testing and the characterization of uncertainties. Subsequent lectures and computer exercises will discuss the physics and design of astronomical detectors, the principles of telescope and spectroscope design, and the data analysis methods used in processing astronomical datasets. Significant emphasis will be placed on estimation of signal-to-noise ratios for various observing scenarios. The effects of the Earth's atmosphere, interstellar matter, and the expanding Universe on the propagation of astronomical signals will also be discussed.", "prerequisite": "PHYS 212"}, {"department": "ASTRO", "number": "475W", "credits": "3 Credits", "description": "Astronomical studies concerning the distribution and evolution of stars and gas in our and other galaxies.", "prerequisite": "ASTRO 292", "other": ["Writing Across the Curriculum"]}, {"department": "ASTRO", "number": "476", "credits": "3 Credits", "description": "The Search for Extraterrestrial Intelligence is the hunt for technosignatures: signs of non-human technology beyond Earth. The search has many forms, with its targets spanning scales from small objects in the Solar System to galaxy-spanning industry, and is conducted in many ways, from the use of radio telescopes searching for communicative signals to infrared space telescopes searching for Dyson spheres. This course will offer a survey of the field as a subfield of astrobiology, and as an interdisciplinary endeavor that includes biology, astrophysics, game theory, anthropology, law, and many other fields. It begins with a history of the field and its jargon, then continues with a study of the theory of the field, including the Drake Equation and Fermi Paradox, and then the practice of the field, including a survey of the kinds of technosignatures we might search for. It concludes with a study of the social and ethical aspects of the field, and special topics that will vary by semester. The course includes a field trip to Green Bank Observatory to conduct real radio SETI observations and learn the history of SETI at NRAO.", "prerequisite": "ASTRO 291"}, {"department": "ASTRO", "number": "480", "credits": "3 Credits", "description": "Fundamental issues in extragalactic astronomy and modern cosmology, including the contents of the Universe, its origin and fate, and formation and evolution of cosmic structures. Topics covered include the basic properties of spiral, elliptical, and irregular galaxies and their quantitative classification, the extragalactic distance scale, the photometric and chemical evolution of galaxies, the physics and evolution of galaxy clusters, active galactic nuclei, the formation of large-scale structure, the physics of the early universe, and the basic equations of cosmology.", "prerequisite": "ASTRO 292"}, {"department": "ASTRO", "number": "485", "credits": "3 Credits", "description": "The study of black holes, neutron stars, white dwarfs, supernova remnants, and extragalactic objects through x-ray and gamma ray observations.", "prerequisite": "PHYS 237"}, {"department": "ASTRO", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Investigation of an original research problem, including a literature search. Preparation of a formal thesis is optional", "other": ["Honors"]}, {"department": "ASTRO", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ASTRO", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ASTRO", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]