[{"department": "AYFCE", "number": "211N", "credits": "3 Credits", "description": "Through readings, discussion, deliberation, listening, and individual as well as collaborative action, this course gives students the opportunity to learn about and practice theories and habits of civic and community engagement and public scholarship with the goal of helping to build democratic capacity and sustain participatory democracy. This course emphasizes concepts and case studies that focus on the people's role in shared governance. The course also provides a foundation for understanding how a wide range of other individual and collective practices have an equally important role to play in building and sustaining community. The course draws from studies in demography, political science, sociology, psychology of racial identity formation and education to help students communicate better about and in shared governance. Among the core concepts are the role of students and other citizens in sustaining and transforming their communities, the historical and contemporary mission of Land Grant universities, the centrality of rhetoric and communication to collaborative judgment, and the relationship among media, cultures, and politics as they affect civic and community engagement. Students also learn together about the range of ways that citizens do, can, and might participate in democratic decision-making and will observe and practice these forms in several communication media and across a range of differences. Finally, learn about models of and opportunities for engaging other citizens across and beyond Penn State, including in global environments.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: CAS 222N, CIVCM 211N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AYFCE", "number": "211S", "credits": "3 Credits", "description": "Conceptual foundations of public scholarship and orientation to contemporary themes and issues in civic and community engagement.", "other": ["International Cultures (IL)", "United States Cultures (US)", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)"]}, {"department": "AYFCE", "number": "270", "credits": "3 Credits", "description": "AYFCE 270 Consumer and Financial Skill (3) (GS) This course covers essential consumer and financial skills young adults need to successfully manage resources and personal finances. It is also designed to satisfy social and behavioral general education requirements. Major themes addressed include goals and decision-making, spending sensibly, borrowing wisely, maximizing earnings /income, protecting assets, making money work, and life events that have financial implications. Some of the information has immediate application, while the remainder will become applicable to all students after graduating and living independently. Regardless of students&rsquo; major or profession, the course content applies to them and can play a critical role in their professional and personal success. Course topics are related to current economic events from an individual perspective, consumers&rsquo; behavior in the market, and their impact on communities and society in general. Strategies are discussed which outlines how course topics can be extended to others. For instance, future formal educators (teachers) will learn strategies for incorporating consumer and financial skills into existing curricula regardless of the subject they teach. Students who plan to work in non-formal settings (e.g., human service agencies, community agencies, youth groups or organizations) will acquire useful tools and techniques that may be used to improve the life skills and financial security of their clients. Future parents will learn easy ways to incorporate desired financial skills and behaviors in their children using daily living. The course addresses critical consumer and financial topics from the individual or household level only and with emphasis on key decisions from a social and behavioral perspective.", "prerequisite": "semester standing of 3rd or higher", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "AYFCE", "number": "295", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"department": "AYFCE", "number": "295B", "credits": "3 Credits/Maximum of 3", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"department": "AYFCE", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "AYFCE", "number": "438", "credits": "1-3 Credits/Maximum of 3", "description": "Students in this course will explore selected dimensions of diversity through lecture, discussion, speakers, active participation, and experiential learning.", "other": ["United States Cultures (US)"]}, {"department": "AYFCE", "number": "455", "credits": "3 Credits", "description": "A study of 4-H/Extension youth programs and the variety of roles played by volunteer leaders.", "prerequisite": "6 credits of social or behavioral sciences"}, {"department": "AYFCE", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practicums, or internships.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"department": "AYFCE", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "AYFCE", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "AYFCE", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]