[{"department": "BA", "number": "100", "credits": "3 Credits", "description": "A comprehensive view of the contemporary environment of business. This course provides a broad overview of the study of business and its environment, organization, operation, and interrelationships with government and society. Topic areas include; economic systems, forms of business ownership, information, accounting, finance, management, marketing and supply chain principles, legal and regulatory environments, business ethics and international business. A student majoring in business will develop a broad basis for further study in a specific area in business, while other majors will become familiar with the American enterprise system and the functions and issues facing business today.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BA", "number": "100S", "credits": "3 Credits", "description": "BA 100S is a broad overview of American business practices and policies. The course introduces the functions of business and how each interacts and shapes the legal, political, social, cultural and economic environments. Students who successfully complete this course will understand how a) the American free enterprise system operates b) businesses operate in our modern political, social, and economic environment c) how to analyze the methods and procedures used by people in business to arrive at effective decisions d) ethics and corporate social responsibility affect business decisions e) globalization has transformed American businesses.", "other": ["First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BA", "number": "195", "credits": "3-6 Credits/Maximum of 6", "description": "Cooperative practical work with business offices under the supervision of the instructor."}, {"department": "BA", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "BA", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BA", "number": "241", "credits": "2 Credits/Maximum of 2", "description": "Examines the legal system's role and impact regarding business transactions, liability issues, and ownership of intellectual property. Students earning credit for B A 241 may not earn credit toward Smeal College baccalaureate degree for B Law 243 and/or B A 243.  B A 241B A 241 Legal Environment of Business (2)As an integral part of planning and management responsibilities, a business decision-maker must be able to identify risks and opportunities from many sources. The legal environment represents a significant segment of the decision-maker's landscape. This survey course is designed to develop the student's awareness and recognition skills with respect to the major inputs in the increasingly complex commercial legal environment. Students in this course will examine the design and function of the U.S. legal system in its roles as protector of property interests and facilitator of business transactions. Alternatives to judicial resolution and enforcement will also be examined. In addition, students will learn about the legal issues affecting the formation and enforcement of business agreements. This will include studying the impact of our economy's continued shift to digital technology for communication and documentation. Finally, tort liability and intellectual property issues from a business perspective will be examined with a special emphasis upon issues created by the Internet's rapid growth. Students earning credit for B A 241 may not earn credit toward a Smeal College baccalaureate degree for B LAW 243 and/or B A 243."}, {"department": "BA", "number": "242", "credits": "2 Credits", "description": "Explores the social and ethical environment of business and ethical decision making in a business context.  B A 242 Social and Ethical Environment of Business (2) Modern businesses operate in an increasingly interdependent environment. The actions of businesses have major impacts on society. Conversely, society influences a wide range of corporate actions through laws and regulations as well as via public opinion and the media. With changes in information technology, corporate decisions that were once considered private are now subject to public scrutiny. Therefore, more than ever, these decisions must take into account the larger social environment. In this course, students will learn about a broad range of stakeholders and societal issues that affect corporate decision-making and they will consider the corporation's responsibility to society. They will also learn to apply ethical decision-making frameworks to a variety of ethical decisions faced by corporate managers. This course is taught in the sophomore year and therefore lays a broad foundation for other core business courses. For example, other courses tend to focus on a single stakeholder group such as customers (marketing), employees (management), or stockholders (finance). This course teaches students to think broadly about how a business fits into a more complex web of relationships within society."}, {"department": "BA", "number": "243", "credits": "4 Credits", "description": "Explores the ethical, political, social, legal and regulatory, technological, and demographic diversity environment of business. A student may not receive credit toward graduation for both B LAW 243 and B A 243.", "other": ["United States Cultures (US)"]}, {"department": "BA", "number": "250", "credits": "3 Credits", "description": "Analysis of problems of the small firm, particularly for the student who wishes to venture into business.", "prerequisite": "3 credits in ECON"}, {"department": "BA", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "BA", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "BA", "number": "299", "credits": "1-12 Credits", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BA", "number": "301", "credits": "3 Credits", "description": "The goal of BA 301 is to provide insight into the thinking of both the financial manager and the functional manager that is needed to effectively lead and manage not only their business organization but also their personal financial lives. The course will enable the student to learn the key financial concepts, constructs, and models that are used by financial managers every day around the world. Understanding of the mathematics of finance, the use of financial calculators, and development of Excel financial model problem solving will be emphasized. Ethical financial decision-making will be a common theme that is integrated throughout the course. Using a survey overview approach, the first third of the course will cover concepts such as financial statements and analysis, financial ratios and analysis, long-term financial planning and budgeting, time value of money, discounted cash flow analysis, capital budgeting, break-even analysis, and systematic/unsystematic risk. The second third of the course will provide an overview of financial topics that are normally covered in detail in financial markets courses. These topics include financial systems, money markets, the Federal Reserve and monetary policy, derivatives and speculative markets, and legal and operational issues in financial markets. The final third of the course will cover general personal finance topics of interest such as money management strategies, insurance and risk management, consumer credit, tax strategies, investing in stocks, bonds, and Exchange-Traded Funds, and retirement and estate planning. A student may receive credit toward graduation for only one of the following; BA 301, FIN 100, or FIN 301.", "prerequisite": "ECON 102"}, {"department": "BA", "number": "301H", "credits": "3 Credits", "description": "Overview of financial manager's role within the organization; investment, financing, and restructuring activities.", "other": ["Honors"]}, {"department": "BA", "number": "302", "credits": "3 Credits", "description": "BA 302 provides non-business students with an introduction to the issues and decisions routinely faced by supply chain managers and the impact of effective supply chains on today's business environment. Using the Supply Chain Operations Reference model as a framework, this course considers how successful firms plan, integrate and execute sourcing, manufacturing, customer fulfillment, reverse logistics and sustainment processes across a complex marketplace to provide value to the customer. The course looks at the interplay and coordination of product, financial and information flows through a supply chain resulting in value creation for the customer and competitive advantage for the firm. Students will consider the roles of drivers such as cost, quality, time, flexibility, innovation and information sharing in designing supply chain strategies in support of overarching business strategies. Through detailed exploration of models, case studies and real world events, coupled with the application of operations management tools and techniques, the course provides the opportunity to identify and dissect issues, and develop solutions to supply chain challenges not only faced by today's business managers, but also impact the customer. The course examines supply chain organization, implementation and management planning, the evaluation and control of manufacturing processes, and the execution of supplier and customer management activities. Students will use basic information technologies and programs to leverage tools like business process mapping, value indexing, and total cost analysis to aid in the identification and mitigation of supply chain issues in a global business environment. Students will also be exposed to current supply chain issues such as sustainability and the impact of boundary-spanning information technologies as relevant keys to competitive advantage. The course provides the basic supply chain knowledge and skills necessary for the non-business major to be an effective member of a cross functional team in a professional business environment while providing a level of understanding to benefit the student in navigating the complex customer fulfillment issues present as a consumer of goods and services in today's globally connected marketplace.  A student may not receive credit towards graduation for both BA 302 and and SCM 301.", "prerequisite": "ECON 102"}, {"department": "BA", "number": "303", "credits": "3 Credits", "description": "BA 303 provides broad-based exposure and understanding of marketing and its processes. The course is a stand-alone marketing course for those interested in the role of marketing within the business context. It covers a range of topics from the basic (what is marketing), to the processes (market segmentation, marketing strategy, development of product, price, place and promotion), to the broader societal questions (why marketing exists, ethics, the future of marketing). There is also the opportunity to examine marketing from the perspective of various industries for non-business students. Assessment will test factual knowledge of marketing and the marketing process. Written assignments will ask students to work both individually and in teams to apply course concepts. These can include assignments developing one's skill set in consumer psychology, target market selection, writing a positioning statement, developing a marketing plan, new product development concepts, promotional campaign ideas, and ethical questions to discuss and debate. Students may also be asked to form small groups for discussion and/or make presentations to the class based on set marketing topics specific to one's area of interest. Students will also be expected to participate in class discussions. A student may not receive credit towards graduation for both B A 303 and MKTG 221 or MKTG 221W. Furthermore, a student may not receive credit towards graduation for both B A 303 and MKTG 301 or MKTG 301W.", "prerequisite": "ECON 102"}, {"department": "BA", "number": "303H", "credits": "2 Credits", "description": "Junior Core Marketing - Honors Section.  B A 303H Honors Core Marketing (2)This course is an exploration of fundamental concepts and issues in marketing. In this course, we will discuss what marketing is and learn to analyze the marketing environment and our potential customers. Based on these insights, we will then discuss strategy alternatives and the key functions of marketing. A project is a major component of the course. &lt;p&gt;", "other": ["Honors"]}, {"department": "BA", "number": "304", "credits": "3 Credits", "description": "BA 304 is an overview of a body of knowledge that exists concerning the management of modern organizations. Management is critical to business success no matter the industry, the field or the arena. Eight key functions for any manager will be covered - organizational structure, operations, staffing, recruitment, leadership, culture and ethics, planning, and innovative and responsible practices. A key take away for BA 304 is the difference between leadership and management and what do these terms mean. In recent years the focus has been on leadership as the preferred ability to strive for with management skills losing favor. In general, it has been said that leaders focus on \"doing the right things\" and managers focus on \"doing things right\". This will be a theme for review and discussion throughout the course as each subject area is covered. A student may not receive credit towards graduation for both B A 304 and MGMT 100 or MGMT 100W. Furthermore, a student may not receive credit towards graduation for both B A 304 and MGMT 301 or MGMT 301W.", "prerequisite": "ECON 102"}, {"department": "BA", "number": "304H", "credits": "2 Credits", "description": "Junior Core Business Management - Honors Section.  B A 304H Honors Core Management (2)The course will familiarize the student with basic concepts, theories and approaches that can lead to a more nuance understanding of management practices. A learning objective is to experience and to relate the concepts in a \"real\" world context. The experiential exercises, video discussions and supplementary readings will help students accomplish this objective. Another objective is to synthesize and integrate seemingly unrelated management topics. Case discussions are particularly useful in accomplishing this type of learning. An additional type of learning is critical inquiry where students feel empowered to create and critique thought. The group project is aimed at accomplishing this type of learning. There are several other skills required to become effective managers. Foremost among them are communication and inter-personal skills. The assignments and the course teaching style will make students aware of the importance of developing these skills. Students are required to read assigned articles and/or cases for each class. They are asked to summarize the main themes underlying the readings and keep journals on what they have learned as well as what they would like to learn. Students in teams are also asked to choose a topic for research and presentation. Possible research topics are: *Structure: Networks, virtual teams * Skills: Skill obsolescence, recruiting for talent, employee churning*Style: Transformation leadership *Staff: Stock options, altruistic reasons for contribution* System: Six-sigma, management information system * Super-ordinate goals: Ethics and aesthetics, social responsibility *Strategy: Stakeholder wealth maximization, triple bottom line. Group projects will also be required. Topics will be approved based on proposals submitted early in the semester. Examples of projects are:1. Understanding the functioning of organizations (e.g. Fraternities, McDonalds, student organizations) by observing/interviewing people to identify interesting facets about how organizations work and don't work. 2. Tracking the genesis of breakthroughs in organizations. 3. Desktop research on emerging organizational forms. 4. Designing and administering a team-building exercise to sensitize a group of freshmen on the virtues and challenges of work-force diversity. 5. Mapping the informal and formal organizational dynamics using \"Organigraphs\" 6. Interviewing faculty to identify emerging issues on management.Projects will require a written report, oral presentation, and classroom discussion. The purpose of oral presentations is to give students a \"feel\" for what will be expected of them, as managers, in the real world. Students will be required to present their group papers as they would in a business environment. Appropriate visuals, etc. should be used, and the presentations should be polished and professional.", "prerequisite": "ACCTG 211", "other": ["Honors"]}, {"department": "BA", "number": "321", "credits": "3 Credits", "description": "Emphasizes the development of individual, group, critical thinking, and presentation skills, through the application of modern method and business technology.  B A 321 B A 321 Contemporary Skills for Business Professionals (3) This course is designed to provide fundamental skills necessary for success in the business environment. BA 321 is one of a series of courses that collectively develop the skills and competencies required of a successful business administration student. As a foundational course in the degree program BA 321 emphasizes the following: -An introduction to student-centered learning, especially with opportunities for active and collaborative learning utilizing state of the art elements of technological business environment. -An introduction to inquiry-based processes necessary for understanding and addressing issues and opportunities in current and emerging business environment relevant subsequent course work in the student's chosen option and professional practice. -Development of basic communications skills, including oral, written, and multimedia, relevant to individual and group effectiveness. -Team building and participation while completing projects that focus on understanding individual and cultural diversity and respecting the views of others. Additionally, students develop an understanding of and competence in the multiple roles that define successful teamwork. -Establishing and respecting the roles within a team. -Awareness of the importance of the needs and opportunities of the community with which the individual contributes as a business professional. -Application of the hardware and software skills necessary for transferring knowledge of business topics in both face-to-face and virtual settings academic and professional.", "prerequisite": "ACCTG 211"}, {"department": "BA", "number": "322", "credits": "3 Credits", "description": "Emphasizes the preparation and conduct of business negotiations in a range of situations.  B A 322 Negotiation Skills for Business Professionals (3) This course integrates the experiential and intellectual components of negotiation. Course instruction and learning activities emphasize the preparation for and conduct of business negotiations in a range of situations. These situations include integrative and distributive scenarios, development of negotiation relationships, and negotiation in multi-organization, multi-industry, multi-cultural, and multi-national environments. Basic negotiation theories will be addressed and applied through the recognition and the resolution of conflict by applying various bargaining strategies. Students will learn how to prepare for a negotiation event. Students will learn to select the appropriate negotiation strategies in order to match the needs of the situation. Students will develop the negotiation skills needed to meet the challenges facing today's executives. Students will develop the sophistication to analyze bargaining and conflict relationships, and an awareness of their individual bargaining style. Students will apply various techniques in order to: understand the basic elements of negotiation; make informed decisions about continuing a negotiation or walking away; participate or lead in team-based negotiations; and effectively manage international negotiations. A primary component of this course is application of negotiation theories through exercises in which the student assumes various roles within a negotiation scenario. Through practice and role playing, students will develop effective personal and professional negotiation skills.", "prerequisite": "ACCTG 211"}, {"department": "BA", "number": "342", "credits": "3 Credits", "description": "Course examines actions taken by corporations that impact global citizenship, environmental sustainability, and the economic stability of international societies.  It further looks at relationships, rights, and responsibilities between businesses, business decision-makers and their stakeholders.  B A 342 Socially Responsible, Sustainable and Ethical Business Practice (3) Businesses and other large organizations have come to influence nearly all aspects of life in contemporary industrialized societies. The actions taken by businesspeople have major impacts on individuals and on society as a whole. Conversely, the expectations of citizens and their representative bodies (e.g., governments, communities, unions, interest groups) influence a wide range of corporate actions. Students of B A 342 will examine these relationships, rights, and responsibilities between businesses, business decision-makers and their stakeholders. As students enter their field of study, this course will introduced them to current ethical, social responsibility and sustainability issues that face business practitioners within their field and across related disciplines. Each business function &ndash; accounting, finance, marketing, risk, supply chain, human resource policies, etc. &ndash; has relationships and responsibilities within the larger social environment. This course considers commonalities across the business functions and teaches students to think broadly about how a business fits into a more complex web of relationships within society. The course begins with an overview of the corporation&rsquo;s place and role in society as well as key concepts in understanding why knowledge related to corporate governance, ethics, sustainability and social responsibility issues is critical to professional managers&rsquo; responsibility and long-term career success. The stakeholder model is reviewed along with the study and application of ethical decision-making frameworks to current ethical dilemmas. Sustainability and global responsibility are introduced within the context of government regulation versus responsible stewardship. The closing section of the course provides thought and discussion on issues facing business practitioners across key business functions.", "prerequisite": "MGMT 301"}, {"department": "BA", "number": "364Y", "credits": "3 Credits", "description": "Business organizations and the sociocultural environment; current issues; corporate responsibility; international and multinational business environments.  B A 364YtB A 364Y International Business and Society (3) (US;IL) This writing-intensive course will provide an overview of the relationship between business organizations and the sociocultural environment. Current issues in the media and the scholarly literature will be used to discuss and analyze this relationship. Special attention will be given to the topics of business and government relationships, corporate responsibility, environmental issues, and topics related to international and multinational business environments.", "prerequisite": "ENGL 202D", "other": ["International Cultures (IL)", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"department": "BA", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor."}, {"department": "BA", "number": "395A", "credits": "1 Credits/Maximum of 1", "description": "Professional and guided work experience in business administration with private or public organizations.  May be taken only as an elective.", "prerequisite": "fifth-semester standing", "other": ["Full-Time Equivalent Course"]}, {"department": "BA", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "BA", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BA", "number": "411", "credits": "3 Credits", "description": "Prepares students to obtain an enterprise-wide view of business and industry by integrating operational and financial decisions in a team and learning environment.  B A 411B A 411 Analyzing Business and Industry (3) The course provides the students with a methodology for analyzing the business, introduces the students to sources of financial information available from private and public sources and trains the student to prepare and professionally present business analysis reports. The course, which adopts a user perspective, extends the students' basic knowledge of financial reporting and provides them with a broader context for understanding business that includes economic and social forces, the regulatory environment of businesses and their financial reporting, capital market operations and corporate governance. It applies concepts and decision tools that are studied throughout the curriculum such as present value, financial ratio analysis, break-even point analysis and statistical analysis.", "prerequisite": "ACCTG 211"}, {"department": "BA", "number": "412", "credits": "2-3 Credits", "description": "The integration of the business core into a detailed financial, strategy and market analysis of actual companies selected by student teams. BA 412H Honors Integration and Research (2-3 credits)The purpose of this course is to assist students in developing their Schreyer Honors Thesis. It proceeds by exposing students to research conducted within the various business majors; the research conducted by prior honors students; and having student teams conduct research or contemporary businesses and industries. Typical readings include materials related to evaluating an actual company, prior Schreyer Honors theses, contemporary business articles, prior course projects and supporting academic literature. Written company analyses and oral presentations are made by the teams.", "prerequisite": "ACCTG 211", "other": ["Honors"]}, {"department": "BA", "number": "420", "credits": "1 Credits", "description": "This course emphasizes effective career planning by closely examining oneself, the business world, communication styles and strategies.  B A 420 Preparation for Career Management (1) BA 420 develops students' career preparation and management skills through the close examination of self, the world of work and communication styles and strategies. This course is one of a series in the program which collectively develop the skills and competencies necessary for the business administration student. The course is designed on the belief that (1) career decision-making is greatly enhanced by considering personal traits such as one's interests, values, goals, and approach to making decisions; and (2) through the exploration of self and world through out-of-classroom learning experiences. The student becomes empowered to apply prior classroom learning outside of the academic environment. These skills are utilized throughout a person's career Students who successfully complete the course will be able to: -Prepare resumes targeted to a range of industries and positions. -Write effectively to prospective employers. -Identify personal traits and qualities in the context of career management. -Demonstrate effective interview techniques.", "prerequisite": "BA 321"}, {"department": "BA", "number": "421", "credits": "3 Credits", "description": "Introduction to Project Management covering all phases of a project including proposal development, planning, execution, and closing. BA 421 Project Management (3) BA 421 is designed to provide the fundamental skills necessary for success in the business environment. BA 421 is one of a series of courses that collectively develop the the skills and competencies necessary for business administration students. BA 421 is designed to provide students with the fundamental understanding of the Project Management Book of Knowledge that defines the standards of the Project Management Institute (PMI) which is the professional credentialing body of the discipline. This introductory course in project management covers all phases of a project, including; proposal development, planning, execution and closing. The course will also explore the application of the Theory of Constraints to project management, and will use project management software to demonstrate and reinforce class concepts. The software will also be instrumental in the execution of a business project. By the end of the proposed new course, students should be able to:&bull; Identify the role of the project manager within organizations and projects. * Understand the Processes and Procedures needed to Plan and Control a Project. * Recognize the options available as well as the inherent strengths and weaknesses of different approaches. * Define the project scope and priorities. * Create Work Breakdown Structure (WBS) and integrate it with the organization. * Estimate and interpret project times and costs. * Construct project networks and find critical paths. * Understand and Implement Activity Precedence Logic * Identify, assess and respond to project risks. * Schedule project resources and evaluate resource constrained projects. * Differentiate between the options to accelerate project completion. * Use Microsoft Project Management Software as a skilled tool for Project Management.", "prerequisite": "BA 321"}, {"department": "BA", "number": "422W", "credits": "3 Credits", "description": "Study of strategic planning and implementation in multi-industry, multi- cultural, and multi-national settings with emphasis on sustaining competitive advantages. BA 422W Strategic Business Planning is the capstone of the series of business administration courses in the BSB degree. These courses collectively develop the the skills and competencies necessary for the business administration student. BA 422W is designed for students to examine the discipline of strategic management and to develop an appreciation of the criticality of strategic management in guiding a business entity through a changing and challenging environment. The course requires students to build upon their knowledge of business structure, internal and external environments, and functional design as each relates to strategy development and implementation. Students explore methods and techniques to identify strategies best suited to accomplish an entity's mission and its business objectives. As a writing intensive (W) course, there is a strong emphasis on development and reinforcement of effective writing skills. Students prepare well reasoned, organized, and constructed bodies of work. Upon successful completion of the course, students will be able to: 1. Identify environmental threats and opportunities impacting a firm. 2. Identify strengths, weaknesses and competencies of a firm. 3.Effectively apply critical thinking skills to design strategic alternatives and then the best Alternative. 4. Critique and evaluate strategic actions taken by firms. 5. Explain the profound effects that a strategic move (either at the corporate level or at the business level) can have on the entire organization. 6. Demonstrate exceptional skills in presenting complex business information and issues. 7. Efficiently research a firm or industry using a variety of sources. 8. Demonstrate proficiency in analyzing business cases and formulating well reasoned recommendations when no \"right\" answer exists. 9. Demonstrate effective leadership skills in a group environment.", "prerequisite": "BA 321", "other": ["Writing Across the Curriculum"]}, {"department": "BA", "number": "441", "credits": "3 Credits", "description": "An understanding and analysis of how environmental and sustainability issues are impacting business strategies and ultimately profits.  B A 441 Strategies for Enterprise Sustainability (3) Enterprise globalization warrants a greater level of awareness and responsibility in seeing that products and services maintain a high level of integrity, quality, and reliability; products need to be produced and moved throughout the supply chain in a manner that does not cause unacceptable environmental or social burdens, but that also allows for acceptable profits. We will examine both external and internal forces, such as environmental groups, policy-makers, and consumers that impact business strategies. This will be put into the context of the \"triple bottom line\" with an understanding of its challenges and opportunities. Business students will benefit by a better understanding of environmental/sustainability issues that impact operations and strategies. Students will learn via analyses of cases studies and by working in teams to solve real-world problems faced by chosen organizations. Focus will include all key aspects of an enterprise, from procurement to product development, and from human resources to supply chain solutions.", "prerequisite": "BA 342"}, {"department": "BA", "number": "442", "credits": "3 Credits", "description": "Sustainability is a broad domain concerning the extent to which environmental, economic, and social practices are viable for current and future generations. Consumer awareness of sustainability issues has evolved from an emerging social movement to mainstream values, but increasing sustainable behavior remains a challenge. This course is designed to provide students with the knowledge to enhance sustainable behaviors in firms, among consumers, and in society at large. In doing so, this course will include frameworks for understanding how to influence sustainable practices, consumer response to sustainability, and marketing communication issues as well as real-world examples of sustainable practices and issues, offering both a theoretical and applied approach. The course may also include a project which will entail student teams working on a real-world sustainable behavior problem in collaboration with a business or segment of the university campus when available or other course project addressing a relevant sustainability issue. Students should leave the course with an understanding of sustainability issues in the current marketplace and the knowledge and ability to influence sustainable behaviors. Students will enter their career with the knowledge and skills to be a sustainable business decision-maker and foster sustainable behavior.", "prerequisite": "BA 342", "other": ["Cross-listed with: MKTG 442"]}, {"department": "BA", "number": "462", "credits": "3 Credits", "description": "Interpretation of business concept in the analysis of problems related to the successful management of a company, institution, or organization. Business Strategy is the study of managerial decision­making in a firm's competitive space. As such, the course focuses on the formulation and implementation of corporate strategy sets as if the student was on the top management team (TMT) inside a for­profit organization. The course covers topics such as decision­making under uncertainty, environmental scanning and sequential updating, industry structure, the firm's regulatory constraints, relative bargaining power, Porters Five Forces, industry barriers to entry, industry value chain analysis, firm­level resources and capabilities, competitive advantage, corporate­level strategy, business­level strategy, and collaborative strategies such as franchising, licensing and joint ventures. The overarching goal of the strategic manager is to ensure that the firm survives and thrives and, with these goals in mind, Business Strategy addresses the actions and outcomes to corporate decisionmaking.  The course has a number of objectives in addition to learning and retaining information on the aforementioned topics. These include (i) obtaining critical thinking skills necessary to function as a strategic manager or to perform the tasks comprising the strategic management process, (ii) integrate and apply the knowledge accumulated in various functional areas, such as marketing, human resource management, operations, accounting and finance, (iii) prepare you for management careers by providing in­class opportunities for you to enhance your ability to communicate orally and in written formats, (iv) to lead and to work with others in realistic work settings, (v) expose you to the ethical and societal issues raised in operating an enterprise, and (vi) to provide you with experience in dealing with real strategic decision issues facing managers in all types of organizations. This is accomplished through a number of pedagogical mechanisms that include news articles, case studies, academic articles, documentaries, simulations and written assignments.", "prerequisite": "FIN 301"}, {"department": "BA", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "BA", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "BA", "number": "495", "credits": "3-9 Credits/Maximum of 9"}, {"department": "BA", "number": "495A", "credits": "3-6 Credits/Maximum of 6", "description": "B A 495A Business Internship (3-6 per semester/maximum of 6) B A 495A facilitates the application of students' prior classroom learning in a field setting. This course is one of a series in the business program which collectively develop the skills and competencies necessary for success as a business administration student. The course is designed to provide students with a firsthand opportunity to experience the challenges and rewards of the business professional. Essentially, an internship bridges the gap between the academic environment and the professional environment. Internships provide an opportunity for students to link theory with practice in a nonacademic setting. Internships provide practical, real-world experiences which cannot be simulated in the classroom. Upon successful completion of an internship, students will: -Have a better understanding of employer expectations related to career advancement. -Have an enhanced strategic view of the industry/business segment in which they worked. -Have experience integrating and using their knowledge and skills from the classroom. -Have increased awareness of professional and technical areas of strengths and weakness.", "prerequisite": "BA 321"}, {"department": "BA", "number": "495B", "credits": "3-6 Credits/Maximum of 6", "description": "B A 495B Undergraduate Research in Business (3-6 per semester/maximum of 6) BA 495B provides students an opportunity to apply prior coursework to address a business problem or research question in far greater depth than a traditional research paper. This course is one of a series in the business program which collectively develop the skills and competencies necessary for success as a business administration student. The course provides the students with an opportunity to work intensively on a research project of extended duration and depth of analysis with a supervising faculty member. This course introduces the students to conducting business research on a more advanced level. Students will have the opportunity to develop the research question(s), read extensively in the academic literature, gather and analyze data, and thereby extend learning from prior coursework in a research setting.", "prerequisite": "BA 321"}, {"department": "BA", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "BA", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "BA", "number": "499", "credits": "1-18 Credits/Maximum of 18", "description": "Study in selected countries of business institutions, functions, and current business problems.", "prerequisite": "ACCTG 211", "other": ["International Cultures (IL)"]}]