[{"department": "BIOET", "number": "100", "credits": "3 Credits", "description": "This course surveys core topics in recent bioethics - the study of ethical problems issuing from the use and treatment of human and non-human animals in the research and practice of medicine and biotechnology. It aims to help students think more critically and argue from specific moral theories when evaluating issues concerning human body and its enhancement, the value of life and death, abortion and euthanasia, the distinction between biological and moral conceptions of human, the nature of health, illness and disabilities, the allocation of resources for health-care, doctor-patient relationships, and our moral conduct toward animals in medical and industrial contexts.", "other": ["Cross-listed with: PHIL 132", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "BIOET", "number": "110N", "credits": "3 Credits", "description": "This survey course explores the human experience of health and illness from a combined social/behavioral science and humanities perspective. Topics may include the following: the body in art, science, and history; models of normality and disease; family, patient, and practitioner stories; adaptation to illness; health care relationships; principles and psychology of health care ethics; cultural aspects of end-of-life; identity, meaning, and mental health in health care professionals. Reading, writing, and discussion will give students in all majors a set of skills and knowledge for understanding individuals and groups in the context of health and illness. Texts include fiction; poetry; graphic memoir; film; essays; and social science research and theory. Students will experiment with various writing genres to understand and challenge disciplinary boundaries, and creative projects will provide experience with diverse methods and types of knowledge. The arena of health and illness presents a valuable opportunity for integrating social/behavioral science and humanities in analyzing and solving real world problems. Despite technological advances, health care is essentially a human-to-human endeavor, so the humanities and social sciences are necessary to complement biomedical perspectives. This course provides transferable skills and a framework for addressing similar challenges and opportunities in a range of fields that students may encounter in the future. This is an Inter-Domain course containing two general education domains (GH/GS). Successful completion of the course fulfills 3 credits of Integrative Studies in General Education. Prerequisite: ENGL 15", "prerequisite": "ENGL 015.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "BIOET", "number": "322", "credits": "3 Credits", "description": "The course explores how emerging technologies impact beliefs, practices, research, and communication regarding the nature of knowledge, learning, teaching, remix culture, visuality, materiality, self, and art. Engage with emerging technologies to learn about media arts and pedagogies that address bioethical issues of injustice, equity, diversity, and inclusion in which the borders of self are questioned. Course content considers the premise that humans are not discreet entities but connected through technologies in ways that are socio-cultural, geopolitical, and techno-biological. Through course experiential activities, gamification pedagogies, and a virtual fieldwork component in building and piloting ethical and accessible educational practices in online teaching, students explore identity formation encoded in social-technological practices. The Transcultural Dialogue project builds international relationships creating collaborative art and generating dialogue. The transcultural dialogue theme weaves, throughout the course, issues of contemporary visual culture, cultural practices in relation to particular places, and pedagogical approaches designed to erode assumptions, ignorance, and misunderstandings. Through media arts pedagogies, the course raises bioethical concerns such as systemic injustice and approaches creativity as a social process in developing curriculum and teaching with emergent technologies.", "prerequisite": "5th semester-standing", "other": ["Cross-listed with: AED 322", "International Cultures (IL)"]}, {"department": "BIOET", "number": "401Q", "credits": "3 Credits", "description": "This course explores the ethical, policy, and legal implications of science, and the implications of science for ethics, policy, and law. The course provides an introduction to scientific norms and practice; an introduction to the theories and methods employed in ethical analysis; an overview of ethics for scientists (including, but not limited, to falsification, fabrication, and plagiarism, and the protection of human and non-human animal participants); and an introduction to law and policy. In addition, the course will explore the use of science in the courts; the role of scientists in policy debates (whether they should be advocates or \"honest brokers\"); science education policy; science communication and scientific hype; the roles and responsibilities of professional scientists and citizen scientists; science in regulatory and policy processes; the assessment and management of risk; policymaking in the face of scientific uncertainty; and what ethics, policy, and law might learn from recent developments in social and behavioral science. In its examination of law and policy, the course will explore international and comparative perspectives. The course will also explore a variety of special topics (that may vary according to the expertise of the instructor and the interests of the students). These topics may be drawn from a variety of spheres: medicine and public health, food and nutrition science, neuroscience, agricultural science, climate science, and the social sciences. Special topics may include the ethical and policy implications of \"big data\"; the ethics of science in war and as a instrument of harm; climate science, climate change denial, and ethical decision-making in the face of scientific uncertainty; the promises and perils of forensic science; the role of food science in nutrition policy; the regulation of environmental toxins; the use of behavioral science and \"nudging\" in public health policy; gun violence and gun control policy; contemporary challenges related to transparency, reproducibility and replication in science; the commercialization of science, and an ethical and policy assessment of the so-called \"Triple Helix\" of government-academy-industry relations; and the neuroscience of moral and criminal responsibility.", "prerequisite": "5th Semester standing", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "BIOET", "number": "496", "credits": "1-9 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "BIOET", "number": "497", "credits": "1-9 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}]