[{"department": "BIOL", "number": "1", "credits": "1 Credits", "description": "A foundation course that emphasizes study skills and reviews basic biological, chemistry and mathematical principles.  BIOL 1 Biology of Success (1) This course is designed to facilitate success in the required science courses for allied health majors. Many students are challenged by their lack of basic skills and knowledge in one or more of the following areas: biology, chemistry, mathematics, and study skills. Thus, this course addresses these issues and positions the student for success. During the semester equal time is given to the following topics: study skills, which includes learning styles, goals, test taking strategies and organizational skills; terminology, which includes practice with prefixes, roots, and suffixes; basic math skills, which includes the metric system and practice with work problems; chemistry, which covers atoms, ions, and basic anabolic and catabolic reactions; cell structure and functioning; and body basics, which is an overview of the anatomy and functioning of body systems. Students are given a diversity of assignments and projects relevant to the various topics that will allow them to review and develop a basic level of competency in these areas in preparation for required science courses."}, {"department": "BIOL", "number": "3", "credits": "1 Credits", "description": "Group and learning skills to facilitate the understanding of complex biological processes. BIOL 3 Peer Learning in Biology (1) The study of Biology is complicated by the myriad pathways and processes that must be mastered in a way that interrelationship become apparent. A major stumbling block in a student's progress is learning how best to organize one's study so that both the details of these processes can be learned, along with how these processes fit together (i.e. integration). The second hurdle is learning how to use this information in a way that can solve real life problems and to communicate this process to others. This course is designed for students who would like to improve their ability to organize their learning strategies in order to maximize their understanding of the complexities of life's process.The course will be organized using peer learning groups which are posited on the assertion that every student can improve their performance with the proper environment and direction. Group leaders (enrolled in BIOL 251) will play an integral role in the program in that they are the connection between participant and course instructors. The group leaders will learn how to pass their skills on to other students in such a way as to encourage ownership of their education. Through regular meetings, the students enrolled in BIOL 003 will learn about time management and study skills, test taking strategies, exam writing, working with others that have divergent learning styles, and how to be multiculturally competent such that they are able to work with a diverse population."}, {"department": "BIOL", "number": "11", "credits": "3 Credits", "description": "The twelve primary topic areas within BIOL 11 are: An introduction to major themes within the course, defining life, and how natural selection operates through differential reproduction. All organisms are composed of matter and must obey the laws of chemistry - a review of basic chemical principles, the study of water and carbon-based macromolecules, the building blocks of organisms. The cell is the fundamental unit of life - a detailed study of the structure and function of eukaryotic cells. Organisms require energy to maintain organization - an exploration of the processes of photosynthesis, the conversion of light energy into chemical bond energy, and cellular respiration, the production of ATP. All cells arise from previously existing cells - a discussion of mitosis and meiosis. Genes carry information between generations - an examination of the principles of Mendelian genetics and their application to human disorders. The structure of DNA, how it codes for information in proteins, and the effect of mutations are explored. This history of life on earth, a discussion of the role of natural selection in populations and speciation. Plants are the only multicellular eukaryotes that photosynthesize - an inquiry into their evolution, function, structure, reproduction and response to the environment. Animals are multicellular eukaryotes that must acquire their energy/nutrients from other organisms - an exploration of the basics of the animal body plan and two human organ systems. Organisms must interact with their environment - a discussion of energy flows and nutrient cycling in ecosystems, as well as ecosystem distributions. Interactions among communities of species can be complex and these relationships will be investigated. Humans have an increasing impact on the environment, affecting all aspects of the world in which we live - an examination of human activities and solutions to environmental damage we have caused.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "12", "credits": "1 Credits", "description": "Laboratory exercises demonstrating principles of biology.", "prerequisite": "BIOL 11", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "BIOL", "number": "110", "credits": "4 Credits", "description": "A study of the fundamental concepts of biology including the evolution of the major groups of organisms. BIOL 110 Biology: Basic Concepts and Biodiversity (GN)(BA) This course meets the Bachelor of Arts degree requirements. This is the first biology course taken by students who intend to major in biology. It provides a foundation in the basic concepts that govern life, including the evolutionary processes that have led to the biodiversity seen today. The course provides students with a fundamental understanding of: 1) the features of life from the cellular through organismal levels; 2) how cell division and genetic processes provide continuity between generations; 3) how genetic variation arises and leads to evolution ; 4) how organisms acquire and use energy; 5) how structure relates to function at all levels; 6) the evolution and diversity of life.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "110H", "credits": "4 Credits", "description": "Honors study of the evolution of the major groups of organisms including the fundamental concepts of biology. BIOL 110H Honors Biology: Basic Concepts and Biodiversity (4) (GN)(BA) This course meets the Bachelor of Arts degree requirements. This is the first biology course taken by students who intend to major in biology. It provides a foundation for the basic concepts that govern life. In addition, these concepts are used to explain the processes of evolution that contribute to the biodiversity that we observe today.The course objectives seek to provide students with a fundamental understanding of: 1) features of life; 2) how basic genetic processes provide continuity between generations; 3) how genetic variation arises and contributes to evolutionary processes; 4) how structure relates to function; 5) how the diversity life is studied and explained by evolution.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "BIOL", "number": "110S", "credits": "4 Credits", "description": "A study of the evolution of the major groups of organisms including the fundamental concepts of biology. This course also fulfills the First-Year Seminar requirements.  BIOL 110S Biology: Basic Concepts and Biodiversity (3) (GN;FYS)(BA) This course meets the Bachelor of Arts degree requirements. This is the first biology course taken by students who intend to major in biology. It provides a foundation for the basic concepts that govern life. In addition, these concepts are used to explain the processes of evolution which contribute to the biodiversity that we observe today. The course objectives have remained unchanged and seek to provide students with a fundamental understanding of: 1) features of life; 2) how basic genetic processes provide continuity between generations; 3) how genetic variation arises and contributes to evolutionary processes; 4) how structure relates to function; 5) how the diversity life is studied and explained by evolution.", "other": ["Bachelor of Arts: Natural Sciences", "First-Year Seminar", "General Education:  Natural Sciences (GN)"]}, {"department": "BIOL", "number": "127", "credits": "3 Credits", "description": "Cellular structure, organization, and metabolism; plant anatomy and physiological processes; plant reproduction and development; genetics and evolution; relationships and features of plant groups. Students who have passed BIOL 240W may not schedule this course.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "BIOL", "number": "128", "credits": "1 Credits", "description": "This course provides students with an introduction to the science of anatomy and uses human cadavers for some activities. No previous experience in anatomy is required. Classroom discussions include the fundamentals of embalming and the details of body donation as it currently exists in the state of Pennsylvania. A personal perspective on the impact of working with donated human bodies is also included. In the lab students engage in a series of investigatory activities that help to clarify the nature of anatomic inquiry. These activities begin with free-form and directed dissections/explorations of preserved and fresh non-human specimens. Selected explorations and assessments of dissected human donor bodies follow. Assigned activities allow students to sharpen their powers of observation, familiarize themselves with the basic mammalian body plan, and recognize the inter-relatedness between structure and function as a fundamental tenet in biological science."}, {"department": "BIOL", "number": "129", "credits": "4 Credits", "description": "Anatomy of a mammal, with special reference to that of man. Students who have passed BIOL 421 may not schedule this course.  BIOL 129 Mammalian Anatomy (4) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Biology 129 is a 4 credit lecture and laboratory course specifically designed to cover the fundamentals of mammalian anatomy, with emphasis on human systems, for students in a variety of life science related majors including Nursing, Kinesiology, Athletic Training, and Science. Successful completion of this course will give the student working knowledge of mammalian anatomy body plan, systems, and nomenclature with the intent on applying this information to future clinical situations they may encounter in nursing, physical therapy, athletic training, dentistry, and medical settings. The course utilizes lecture descriptions and discussions, along with laboratory specimen dissection, identification and nomenclature to give a thorough overview of anatomy. Small group collaboration is emphasized in laboratory.Course Objectives: The principle objective of the course is for every student to obtain a working knowledge and understanding of basic mammalian anatomy, emphasizing a body system approach, and where possible, relate this to the human anatomical body plan. The lecture portion of the course will stress the construction, function, and relationships between anatomical systems. The laboratory portion of the course will emphasize structure identification and nomenclature of anatomical systems and will utilize human skeletal samples, cat specimen dissections, and anatomical models. Where possible, anatomical relationships that are important in clinical situations and common medical conditions will be emphasized. The end point of both objectives is to obtain a practical understanding of anatomy that demonstrates the relationships between anatomical form and function. Students will leave the course being able to relate this knowledge and nomenclature to future clinical or personal health situations.Relationship to Courses and Programs of Study: This majority of students enrolled in this course are from the College of Health and Human Development in Nursing, Biobehavioral Health, Kinesiology, and Nutrition majors, although some students are from other colleges including the Eberly College of Science, Liberal Arts, and Agriculture. Because the majority of these students will utilize course information in future clinical settings, anatomy and its nomenclature as it relates to humans is emphasized and important clinical considerations are discussed.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "BIOL", "number": "133", "credits": "3 Credits", "description": "Human heredity and evolution, individual and social implications. The course is for non-majors; students who have passed BIOL 222, 230W, B M B 251 or any upper-division biology course may not schedule this course.  BIOL 133 BIOL 133 Genetics and Evolution of the Human Species (3) (GN) BIOL 133 is a 3 credit non-majors course designed as an overview of our current knowledge of human genetics and genetic issues, with special attention to issues that are relevant to non-scientists. We discuss background information that is necessary for understanding these issues, including the structure and function of DNA and chromosomes, Mendelian inheritance, gene expression, gene mutations and chromosomal aberrations, population genetics, evolution, cancer, and genetic and reproductive technologies. This course includes multimedia presentations, textbook readings, classroom activities and problem solving. The goal for this course is to provide students with sufficient scientific knowledge to make informed decisions about genetic issues and the ability to discuss these issues intelligently.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "141", "credits": "3 Credits", "description": "BIOL141 is a 3-credit course focused on the function of the human body. Students that complete this course will develop both a foundational understanding of key terms and processes related to physiology, as well as a deeper understanding of how the key terms relate to real-world situations. The major processes examined focus on homeostasis and the feedback loops used to maintain homeostasis in the body. Additional content examines how disruptions of homeostatic mechanisms result in disease states. Students will analyze different health-related scenarios to draw connections between vocabulary, processes and resultant diseases. Students will also practice discussing complex physiological processes with peers and interpreting figures used in the field to represent and communicate these concepts, providing skills needed to excel in a physiology-related field. This course utilizes both descriptive and problem-solving techniques and, as a result, may require some review of basic science and math principles developed in previous high school courses. This is a stand-alone physiology lecture course and is not part of the 100-level 8-credit Anatomy and Physiology sequence.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "BIOL", "number": "142", "credits": "1 Credits", "description": "Experiments demonstrating basic physiological principles, with special reference to man.", "prerequisite": "BIOL 141"}, {"department": "BIOL", "number": "144", "credits": "3 Credits", "description": "A study of the interactions of organisms with their environment through exploration of the biological impacts of climate change on individuals, populations, ecological communities, and ecosystems. Students will develop skills to make informed judgments about the implications of climate change using scientific information and expand their understanding of how and why science works to generate knowledge to address biological issues relative to climate change. Students will construct evidence-based explanations of the impacts of climate change on biological processes such as disease transmission, population dynamics, and ecosystem functioning. Because of duplication of subject matter a student may receive credit for only one of the following courses: BIOL 144, BIOL 144Z, BIOL 220W", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "144Z", "credits": "3 Credits", "description": "A study of the interactions of organisms with their environment through exploration of the biological impacts of climate change on individuals, populations, ecological communities, and ecosystems. Students will develop skills to make informed judgments about the implications of climate change using scientific information and expand their understanding of how and why science works to generate knowledge to address biological issues relative to climate change. Students will construct evidence-based explanations of the impacts of climate change on biological processes such as disease transmission, population dynamics, and ecosystem functioning. In addition, students will develop skills to integrate biological knowledge with the psychological factors that influence peoples' views of climate change and the use of artistic expression to increase awareness of environmental issues. BIOL 144Z fulfills 3 credits of the GN Domain General Education requirements. BIOL 144Z may also be used in combination with either ART 144Z or PSYCH 144Z as linked courses to fulfill 6-credits of Integrative Studies. Because of duplication of subject matter a student may receive credit for only one of the following courses: BIOL 144, BIOL 144Z, BIOL 220W.", "other": ["General Education:  Natural Sciences (GN)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "155", "credits": "3 Credits", "description": "Biology 155 is a 3 credit General Education Science course designed to give both science and non-science majors a basic understanding of the aging process, with special emphasis on aging as it relates to the human body and health. The course reviews the aging terminology, major theories of the aging process, demography of aging examining both US and World Populations, and the general aging of the major body systems. The course will emphasize common clinical ailments associated with aging including Alzheimer's disease, diabetes, atherosclerosis, osteoporosis, arthritis, and cancer.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "BIOL", "number": "160N", "credits": "3 Credits/Maximum of 3", "description": "Biology of Exercise is an integrative exercise physiology course that combines performing physical activity (Kinesiology) and applying biological principles (Biology). This course will explain the benefits, changes, and processes the body exhibits while exercising. Students will gain knowledge and comprehension through both a lecture (or online) setting (approximately half of the class meetings) as well as an activity component (approximately half of the class meetings) in which students will demonstrate their health related components of fitness. This includes, but is not limited to, muscular strength, muscular endurance, flexibility, power, cardiorespiratory endurance, and body composition. In the lecture component, students will describe biological principles including homeostasis, nutrition, the structure and function of musculoskeletal, cardiovascular, and respiratory systems. At the completion of this course, students will be able to argue for the lifelong significance of exercise including why it is important, benefits related to organ systems, and disease prevention.", "other": ["Bachelor of Arts: Natural Sciences", "General Education: Health and Wellness (GHW)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "161", "credits": "3 Credits", "description": "This is the first lecture course of a two semester sequence introducing human anatomy and physiology, which is the branch of biology that focuses on the structure and function of the human body. Lectures will take a \"systemic\" approach to anatomy and physiology, focusing on one body system at a time. Topics covered in the Human Anatomy & Physiology I Lecture include: basic anatomical and directional terminology; fundamental concepts and principles of cell biology; histology; the integumentary, skeletal, muscular, and nervous systems; special senses, and the endocrine system. Each unit will build on previous knowledge to establish a cohesive picture of the human body. Throughout the course, students will build a strong foundation in the form and function of the human body from the cellular to the gross anatomical level. This knowledge will be contextualized by incorporating information about clinical cases, personal health and lifestyle choices, and human development.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "BIOL", "number": "162", "credits": "1 Credits", "description": "This is the first laboratory course of a two-semester sequence introducing human anatomy and physiology. The A&P I laboratory complements the A&P I lecture by providing students with hands-on experiences such as examination of preserved specimens and anatomical models, and performing physiological experiments. Topics covered in the Human Anatomy & Physiology I Laboratory include: anatomic orientation and terminology; the anatomy and physiology of the nervous system; special senses; skeletal system and muscular system.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "163", "credits": "3 Credits", "description": "This is the second lecture course of a two semester sequence introducing human anatomy and physiology, which is the branch of biology that focuses on the structure and function of the human body. Lectures will take a \"systemic\" approach to anatomy and physiology, focusing on one body system at a time. Topics covered in the Human Anatomy & Physiology II Lecture include: the cardiovascular system, lymphatic and immune systems, respiratory system, digestive system, metabolism, urinary system, and reproductive system. Each unit will build on previous knowledge to establish a cohesive picture of the human body. Throughout the course, students will build a strong foundation in the form and function of the human body from the cellular to the gross anatomical level. This knowledge will be contextualized by incorporating information about clinical cases, personal health and lifestyle choices, and human development.", "prerequisite": "BIOL 161", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "BIOL", "number": "164", "credits": "1 Credits", "description": "This is the second laboratory course of a two-semester sequence introducing human anatomy and physiology. The A&P II laboratory complements the A&P II lecture by providing students with hands-on experiences such as examination of preserved specimens and anatomical models, and performing physiological experiments. Topics covered in the Human Anatomy & Physiology II Laboratory include: the anatomy and physiology of the cardiovascular system, respiratory system, digestive system, urinary system, and reproductive system.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "169N", "credits": "3 Credits", "description": "This course will investigate the distinctiveness of Homo sapiens, using fossil and non-human animal comparisons to highlight how modern humans are both similar to and different from other species. Basic elements from the fields of biology, genetics, anatomy, physiology, ecology, cognition, neuroscience, social psychology, and anthropology will be integrated for a complete and robust picture of humans and their place in the animal world. Furthermore, students will expand upon this integration of fields to make inferences about how an individual's or society's perspective on human uniqueness, or the lack thereof, impacts decisions and behaviors relevant to research ethics, environmental policy, educational policy, religion, and/or social issues.", "other": ["Cross-listed with: PSYCH 169N", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "BIOL", "number": "177", "credits": "3 Credits", "description": "Basic structure and function of the human reproductive system. Physiology of gametogenesis, fertilization, contraception, gestation, parturition, lactation, and sexual behavior. BIOL 177 Biology of Sex (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. This course presents a thorough background on the basic structure and function of the human reproductive system, to provide the student with sufficient scientific knowledge to understand and discuss sex-related topics and make informed personal decisions. Through lecture format presentations, multimedia presentations, small group activities, and guest presentation, students will be exposed to information that will clarify their understanding of the ways that their own body functions in sexual behavior and reproduction. In-class demonstrations and activities will be used to illustrate practical aspects of anatomical, health and contraception issues.  Large class discussions, facilitated small group activities, and written assignments will encourage students to think critically and practically about the application of biological information to personal decision-making and to reducing their own risk of disease. Importantly, students will examine the roles of reproductive physiology and sexuality in a historical, cultural and social context, with particular emphasis on cultural and gender differences in anatomical forms, sexual expression, and disease susceptibility. Guest presentations from community groups will present current information about local reproductive and sex-related concerns and services. The course will present ongoing research on human sex and reproduction, and explore the biology behind current issues in human sexuality and medicine. Student evaluation is based on participation in activities, written assignments, and performance on four examinations. The course is divided into four units: Reproductive Anatomy and Physiology provides students with a thorough background in human reproductive anatomy and function. This unit sets the tone for the course, providing students with correct terminology and creating a nonjudgmental atmosphere that encourages active exploration of topics. Cross-cultural and gender comparisons are incorporated, and anatomical models provide clear, 3-dimensional interactive illustrations. Reproduction explains the biological issues surrounding fertilization, pregnancy, childbirth, and abortion. Following these topics are several class sessions focused on contraception, using anatomical models. Small-group activities and guest presentations to allow students to practice appropriate communication skills. Sexual Identity addresses issues of variations in anatomy, sexual identity, and sexual orientation both within and between cultures. The biological causes and physiological consequences of various physical and lifestyle manifestations are explored. Sexual Behavior examines the physiological basis of sexual response, and explores the variations and problems that are associated with human sexual behavior. Sexually transmissible infections are discussed, emphasizing their mode of transmission, identification, and treatment. Students are encouraged to apply the knowledge and skills they acquired through the semester to their decision-making and communication needs.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "BIOL", "number": "197E", "credits": "3 Credits", "description": "*Special Topics Inter-Domain*", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain"]}, {"department": "BIOL", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BIOL", "number": "200", "credits": "3 Credits", "description": "Presents basic concepts of pharmacology; includes major drug classifications, pharmaceutical preparations, and biological implications relevant to these therapeutic agents."}, {"department": "BIOL", "number": "220M", "credits": "4 Credits", "description": "Honors study of the major physical, chemical, and biological factors constituting environment and their dynamic interaction with organisms forming ecosystems. A study of the structures and functions of organismic interactions from simple populations to complex ecosystems. (BIOL 220W, BIOL 230W, and BIOL 240W each carry only 1 credit of \"writing\"; all three courses must be taken to meet the writing requirement.) BIOL 22OM is an introductory course in ecology. It introduces students to the fundamental ecological principles, concepts, patterns, and processes regarding populations, communities, and ecosystems. This course provides students with a foundation of ecological science, as well demonstrating linkages between ecology, population genetics, and evolution. The course objectives are the same as those described in the original course proposal and are to provide students with a fundamental understanding of: l) genetic processes within populations of living things, 2) evolutionary processes involved in speciation, 3) dynamic interactions of organisms within and among populations, especially pertaining to energy cycles, various biogeochemical cycles, predator-prey interactions, and the like, and 4) distribution patterns of living organisms and the need to conserve the resources of the earth.", "prerequisite": "BIOL 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "Writing Across the Curriculum"]}, {"department": "BIOL", "number": "220W", "credits": "4 Credits", "description": "A study of the structures and functions of organismic interactions from simple populations to complex ecosystems. (BIOL 220W, BIOL 230W, and BIOL 240W each carry only 1 credit of \"writing\"; all three courses must be taken to meet the writing requirement.) BIOL 22OW is an introductory course in ecology. It introduces students to the fundamental ecological principles, concepts, patterns, and processes regarding populations, communities, and ecosystems. This course provides students with a foundation of ecological science, as well demonstrating linkages between ecology, population genetics, and evolution. The course objectives are the same as those described in the original course proposal and are to provide students with a fundamental understanding of: l) genetic processes within populations of living things, 2) evolutionary processes involved in speciation, 3) dynamic interactions of organisms within and among populations, especially pertaining to energy cycles, various biogeochemical cycles, predator-prey interactions, and the like, and 4) distribution patterns of living organisms and the need to conserve the resources of the earth.", "prerequisite": "BIOL 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Writing Across the Curriculum"]}, {"department": "BIOL", "number": "222", "credits": "3 Credits", "description": "Variation and heredity in bacteria, plants, and animals; relationships of genetic knowledge to evolution and breeding practices. This course is for students in life sciences majors that are not Biology, Genetics and Development and Biochemistry and Molecular Biology. Students should have at least 3 credits of biological sciences before scheduling this course. In this course, we will discuss chromosome structure; mitosis and meiosis, in particular their application of the transmission of DNA; principles of Mendelian inheritance; structure and function of DNA, RNA, and proteins; gene expression; DNA mutations and chromosome changes; genomics; population genetics and the intersection of genetics and society. The course will include multimedia presentations, textbook readings, problem-solving and homework, in-class activities and discussions of science and society.", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "230M", "credits": "4 Credits", "description": "This four credit course with lecture and laboratory components provides an understanding of the major unifying principles of life as they apply to the study of the molecular mechanisms underpinning the function of living organisms. Through the lab, students are expected to become proficient in the interpretation and presentation of experimental results through written and oral reports. Taken together with the other honors core courses in the biology curriculum (BIOL 110H, BIOL 220M, BIOL 240M), BIOL 230M will help students to integrate concepts ranging from molecular and cellular events through principles governing entire populations and ecosystems. Further, BIOL 230M provides the foundation on which students further their study of molecular genetics - a discipline integral to a number of the biological sciences. Through this class, and the other core course, students will develop a number of the skills outlined in the General Education mission. BIOL 230M serves a number of majors and colleges. The laboratory portion of the course requires a fully equipped laboratory room, as well as a classroom for recitation meetings. The Honor's version of the course will differ in a number of ways from the parent BIOL 230W course. First, there are more opportunities to discuss current applications of the information. In addition, a unique project (either in lab and/or in lecture) will allow students to explore a specific area of the course in more detail (e.g., take a paper from the primary literature and present the data, and its significance, to the class). Where appropriate, students will be exposed to current research in specific areas. In addition, the laboratory component will have opportunities for students to do more in depth exercises where, to some degree, they could pose their own questions.", "prerequisite": "BIOL 110H", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "Writing Across the Curriculum"]}, {"department": "BIOL", "number": "230W", "credits": "4 Credits", "description": "BIOL 23OW is a four credit course with lecture and laboratory components. (BIOL 220W, BIOL 230W, and BIOL 240W each carry only 1 credit of \"writing\"; all three courses must be taken to meet the writing requirement.) The goal of this course is to provide an understanding of the major unifying principles of life as they apply to the study of the molecular mechanisms underpinning the function of living organisms. Through the lab, students are expected to become proficient in the interpretation and presentation of experimental results through written and oral reports. Taken together with the other core courses in the biology curriculum (BIOL 110, BIOL 22OW, BIOL 24OW), BIOL 23OW will help students to integrate concepts ranging from molecular and cellular events through principles governing entire populations and ecosystems. Further, BIOL 23OW provides the foundation on which students further their study of molecular genetics - a discipline integral to a number of the biological sciences.", "prerequisite": "BIOL 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Writing Across the Curriculum"]}, {"department": "BIOL", "number": "240M", "credits": "4 Credits", "description": "Honors study of development and physiological processes at the organismic level. ( BIOL 220W , BIOL 230W , and BIOL 240W each carry only 1 credit of \"writing\"; all three courses must be taken to meet the writing requirement.) This course provides an understanding of the major unifying principles as they apply to the study of the development and physiological mechanisms utilized by organisms from both animals and plants. In lecture a comparative approach will be taken in the examination of reproduction, development, and physiology primarily at the organismal level. In laboratory, experimental investigations of both animal and plant systems will reinforce the concepts covered in lecture. Through the lab, students are expected to become proficient in the interpretation and presentation of experimental results through written and oral reports.Taken together with the other core courses in the biology curriculum ( BIOL 110 , BIOL 220 , BIOL 230W ) , BIOL 240M will help students to integrate concepts ranging from molecular and cellular events through principles governing entire populations and ecosystems. Further, BIOL 240M provides the foundation on which students further their study of animal physiology and development - two of the largest options in the biology majors curriculum. Through this class, and the other core course, students will develop skills integral to the General Education mission.Evaluation methods in the lecture part of the course include two to three \"mid-term\" exams and a comprehensive final exam. Evaluation methods in the lab portion of the course include in-class quizzes, one or more formal lab reports on experiments or data analysis conducted in lab sessions, and short write-ups of existing data sets or relevant ecological issues. The Honor's version of the course will differ in a number of ways from the parent BIOL 240W course. First, there are more opportunities to discuss current applications of the information. In addition, a unique project (either in lab and/or in lecture) will allow students to explore a specific area of the course in more detail (e.g., students choose a topic in the current literature and present a paper along with its significance to the class). Where appropriate, students will be exposed to current research in specific areas. The evaluation for the course will be modified from that of the parent course in accordance with the changes in assignments.", "prerequisite": "BIOL 110H", "other": ["General Education:  Natural Sciences (GN)", "Honors", "Writing Across the Curriculum"]}, {"department": "BIOL", "number": "240W", "credits": "4 Credits", "description": "A study of development and physiological processes at the organismic level. (BIOL 220W, BIOL 230W, and BIOL 240W each carry only 1 credit of \"writing\"; all three courses must be taken to meet the writing requirement.) This course provides an understanding of the major unifying principles as they apply to the study of the development and physiological mechanisms utilized by organisms from both animals and plants. In lecture a comparative approach will be taken in the examination of reproduction, development, and physiology primarily at the organismal level. In laboratory, experimental, investigations of both animal and plant systems will reinforce the concepts covered in lecture. Through the lab, students are expected to become proficient in the interpretation and presentation of experimental results through written and oral reports. Taken together with the other core courses in the biology curriculum (BIOL 110, BIOL 22OW, BIOL 23OW), BIOL 24OW will help students to integrate concepts ranging from molecular and cellular events through principles governing entire populations and ecosystems. Further, BIOL 24OW provides the foundation on which students further their study of animal physiology and development.", "prerequisite": "BIOL 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Writing Across the Curriculum"]}, {"department": "BIOL", "number": "251", "credits": "1 Credits", "description": "Leadership training in guiding others to learn, communicate, and apply biological principles. BIOL 251 Peer Leadership in Biology (1) The study of Biology is complicated by the myriad pathways and processes that must be mastered in a way that interrelationship become apparent. A major stumbling block in a student's progress is learning how best to organize one's study so that both the details of these processes can be learned, along with how these processes fit together (i.e. integration). The second hurdle is learning how to use this information in a way that can solve real life problems and to communicate this process to others. This course is designed for students who have already mastered basic concepts in biology and who want to learn how to communicate their understanding to others who are learning these first principles.This course is unusual in that it has divergent goals. The students enrolled in this course will be trained to be more effective communicators. In the 21st century, it is critical that we train our students to be better at relating to the general population by using effective communication skills. In addition, the course will train the students to act as effective group leaders in peer learning programs so they become competent, comfortable, and confident in working with students of diverse background, learning styles and skill levels. The philosophy behind peer learning programs is that every student can improve their performance and with the help of a group leader, this goal can be realized. The group leaders play an integral role in the program that in that they are the connection between participant and course instructors. The group leaders will learn how to pass their skills on to other students in such a way as to encourage ownership of their education. Through workshops and biweekly meetings, the group leaders will learn about time management and study skills, test taking strategies, exam writing, working with students with divergent learning styles, and how to be multiculturally competent such that they are able to work with a diverse student population. They will facilitate learning through group activities and practice their leadership skills in a small group setting. Group leaders will be monitored through review of their weekly journals as well as observation of their groups by supervising faculty. The student developed exercises will be implemented and reviewed for effectiveness."}, {"department": "BIOL", "number": "261", "credits": "1 Credits/Maximum of 2", "description": "Students will read and discuss 3 to 4 books of creative nonfiction that address issues in the health professions. These may include collections of reflective essays from health professionals, historical narratives of diseases or conditions, biographies, collections of case studies, exposé, memoirs,or other formats. Topics may include disease transmission, ethics, patience care, health care, diseases, historical events, or other relevant topics. In addition, students will read and discuss primary scientific literature and news articles on topics related to their book readings. Students must attend and participate in weekly discussion and complete online writing assignments."}, {"department": "BIOL", "number": "294", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "BIOL", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "BIOL", "number": "296G", "credits": "1 Credits"}, {"department": "BIOL", "number": "296H", "credits": "1 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"department": "BIOL", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "BIOL", "number": "322", "credits": "3 Credits", "description": "Recommended Preparations: At least one life science course.  A discussion of the mechanisms of heredity in prokaryotes and eukaryotes with emphasis on analysis and modes of inference."}, {"department": "BIOL", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BIOL", "number": "400", "credits": "1-6 Credits/Maximum of 6", "description": "This course will train biology teaching assistants to teach in the laboratory/ recitation setting with emphasis on critical thinking skills.   BIOL 400 BIOL 400 Teaching in Biology (1-3) This course provides teaching assistants with the fundamentals they will need to be effective in the laboratory and/or recitation classroom. Students will learn the fundamental skills needed to; design lesson plans; facilitate class discussions; write effective quizzes; communicate learning expectations; grade fairly; and in the case of the laboratory setting, maintain a safe learning environment. Students enrolled in this course will also be serving as teaching assistants and consequently faculty who serve as course instructors and/or lab coordinators in the relevant course will provide the instruction. Through regular meetings the course instructors will help teaching assistants adjust to their duties and solve common problems that arise in the laboratory/recitation environment. Emphasis will be placed on how teaching assistants can facilitate active learning and help their students develop sound study skills. Students enrolled in this course will be evaluated on regular attendance, organization in and preparation for their teaching, and clarity in how they communicate with their students.", "prerequisite": "5th semester standing"}, {"department": "BIOL", "number": "402W", "credits": "3 Credits", "description": "Discussion of experimental design, analysis and presentation, with a practicum providing for student design, analysis and presentation of biological experiments. Students may not take this course if they have taken BIOBD 350W.  BIOL 402W Biological Experimental Design (3) This course emphasizes written and oral communication of scientific ideas. Students discuss papers from the literature, preparing written critiques of two. Critiques are reviewed in writing by the instructor and peers and may be revised twice. Peer reviews are graded in writing and may be revised once. Written proposals for biological research are required. Students must build arguments for methodological rationales, justify statistical approaches, and place their proposed research into a larger societal context. Proposals are reviewed by the instructor and three peer reviewers. Peer reviewers must prepare written critiques and present proposals to the class during an \"NSF\"-style panel review. Prior to the presentation, the instructor provides written and oral feedback to the author and the peer reviewer in a meeting at which strategies for presenting the proposal are discussed. Subsequent to the presentation, peer reviewers write summaries of the discussion and provide explicit guidance to authors. Proposals may be revised twice. Peer reviews and summaries are graded in writing and may be revised once. Thus, each student writes 2 critiques, 1 proposal, 2 peer reviews of critiques, 1 peer review of a proposal, and 1 summary of the panel discussion. Each assignment is graded in writing and is subject to revision. Students also are graded on their proposal presentations and on participation in panel discussions. These activities constitute 75% of the final grade.Students must demonstrate competence in the use of SAS, a statistics package. Students must choose and apply appropriate statistical techniques to biological data. In addition to the program and its output, students write interpretations of the results. This activity constitutes 25% of the final grade.Lectures are used to review statistics and \"how tos\" (e.g., proposal preparation). Case histories are used to address ethics, statistical decision-making, and design. Students are expected to challenge what they learn, and the notion that scientists must acknowledge and guard against bias in their work is emphasized. Intellectual honesty and the ability to give and receive constructive criticism are demanded.This course is required in two of the six options in biology (ecology and general), and it can be taken by students in the other options. The course is required of students who have not fulfilled the WAC requirement at the 200-level (transfer students).", "prerequisite": "STAT 250", "other": ["Writing Across the Curriculum"]}, {"department": "BIOL", "number": "403", "credits": "3 Credits", "description": "Each student will pose and address their own research question with support from the scientific research literature. Each student will share their own research findings in written and oral formats, both for scientific and general public audiences. Data to address each student's research question can come from their own undergraduate research or from queries with publicly-available data sets. Students should expect to give and receive regular peer feedback on writing assignments relating to their research project and incorporate that feedback from peers and from their teacher in synthesis projects. Synthesis projects, where students are expected to integrate and make revisions to writing from the semester, include a short research manuscript, a research poster and oral presentation, and a blog post geared toward the general public. Weekly workshops paired with readings on scientific theory about writing and communication will help students practice technical science writing in general.", "prerequisite": "BIOL 110", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BIOL", "number": "404", "credits": "3 Credits", "description": "This course is focused on cellular and molecular mechanisms governing physiological aspects of vertebrate cell signaling, and will consider how these mechanisms are adapted to particular organismal functions. To illustrate general principles, specific examples from different organ systems are discussed. For each example, some background on the relevant organismal physiology is provided and thus no physiology course is required as a pre-requisite. The main course objective is to help students better understand the scientific basis of Biology through consideration of experimental findings and student-led discussions of primary research in the field.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "405", "credits": "3 Credits", "description": "This course is designed to introduce the concepts of evolution from a molecular point of view and the basic techniques of analysis of molecular sequence data. The class will include a mixture of lecture-based and student activity-based instruction that addresses various topics in molecular evolution, as well as in-class and extracurricular work on the computer to learn how to use online bioinformatics tools for sequence analysis. As a result of this course, students will be able to analyze DNA and protein data with a purpose of addressing specific scientific questions of interest. The course embraces applications of computing and statistics to the life sciences.)", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "406", "credits": "3 Credits", "description": "Mutualisms (interactions between two species that benefit both of them) occur in every habitat on Earth, and nearly every species on the planet is involved directly or indirectly in one or more of these interactions. The influence of mutualisms transcends levels of biological organization from cells to populations, communities and ecosystems. Mutualistic associations, such as our microbiome and agricultural symbioses, are critical for human health and welfare. Mutualistic symbioses played a fundamental role on the origin of the eukaryotic cells and the evolution of multicellularity. In addition to the key role played by mutualism in the evolution of complex lifeforms on earth, mutualistic association are instrumental to understand how some important ecosystems such coral reefs and hydrothermal vents function. Mutualistic symbioses are critical for nutrient cycling in the environment and the reproduction and dispersal of numerous plant and animal species. This course will focus on unifying concepts that cut across different forms of mutualism. We will explain and tests these concepts analyzing classic examples of mutualisms. We will define and categorize the diverse array of symbiosis occurring in nature. We will explore the evolutionary origins and implications of mutualistic symbiosis, investigate the population, community and ecosystem ecology of mutualisms and we will assess current anthropogenic threats to mutualisms, their potential for resilience and the role of mutualisms in conservation. Finally, we will explore in detail the metabolic linkages using selected nutritional symbiotic mutualisms examples. The course combines in-class and online teaching, as well as a weekly discussion session, in which the students are responsible for selecting one primary scientific article, prepare a brief presentation and lead a critical discussion session in front of the class. The course takes advantage of the technology-rich Bluebox experimental classroom. This learning space has been designed to support active, collaborative learning experiences increasing student engagement.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "407", "credits": "3 Credits", "description": "The course will provide students with an understanding of the developmental anatomy of plant organs, tissues and cells throughout the plant life cycle. When appropriate, the course will discuss genes involved in the formation and function of these organs and how organ development is affected by environmental inputs. In laboratory sections, observational skills will be trained and knowledge gained in lectures will be applied to the analysis of plant anatomical structures. Plant developmental adjustments to environmental stresses will be studied using light microscopy and digital image acquisition. Primary scientific literature related to the lecture topics will be assigned as reading material to be discussed in class. Students will learn how to formulate research hypotheses and, in a written assignment, research a global challenge to food security and discuss strategies to improve agricultural productivity by manipulating the biology of plants.", "prerequisite": "BIOL 240W"}, {"department": "BIOL", "number": "409", "credits": "3 Credits", "description": "This course focuses on the molecular, cellular and physiological changes that are associated with the aging process. Diseases that are associated with aging will also be addressed. Continual emphasis will be placed on interventions that may prolong the \"health span\" of an organism. Original research articles will be the primary sources of information in this course. By the end of the semester, students will have a firm understanding of the theories of aging and the age-related changes that take place on several levels of inquiry. Additionally, students will develop their abilities to critically evaluate scientific literature.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "411", "credits": "3 Credits", "description": "This course offers an overview of Human Embryology, including reproductive physiology, infertility, the events and timeframes characterizing human embryological development, the structure and function of developing human body systems, and relevant clinical correlations associated with disease and congenital malformations. This course features discussions and explanations of topics in developmental biology that some students might view as controversial including comparative anatomy and evolution, contraception, assisted reproductive techniques, cloning, potential medical applications of stem cells, abortion with respect to developmental time frames, and gender development. The goal of such discussions will be to educate and give perspectives on these issues, but not to indoctrinate a particular viewpoint or philosophy.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "412", "credits": "3 Credits", "description": "This course will take an ecological approach to the study and control of infectious diseases. The course examines the dynamics of disease, how parasites (worms, bacteria and viruses) spread through a host population, the consequences for the hosts and the consequences for the parasite from both an ecological and evolutionary viewpoint. Ecological insights will be used to discuss and identify effective means of controlling the parasites. Students will learn how to develop basic mathematical models to describe the dynamics of a parasitic infection and discuss how these models can be applied to make predictions and optimize control-strategies for infections. This will be illustrated with numerous work examples of human, veterinary and wildlife diseases. Students will also examine the role of parasites in the ecosystem and how environmental changes affect parasite transmission. At the finer level the course will investigate how host-parasite interactions and multi-parasite species infections are modulated by host features (e.g. age, sex, immunity) and what may cause rapid changes in infectiousness and transmission. The course will touch on a range of current issues that include pandemic outbreaks, emerging infectious diseases and the role of parasites in ecosystem functioning. The ecological approach involves applying the principles of population biology to understand infectious diseases and develop new perspectives on epidemiology, thus the title \"Ecology of Infectious Diseases\". This course is designed for ecology, biology and animal science majors to obtain insights into the ecology of parasitism, and for pre-meds to provide biological foundation to the study of epidemiology.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "413", "credits": "3 Credits", "description": "Introduction to the molecular mechanisms by which cells send, receive, regulate, and respond to signals. Through review of primary literature, students will explore the variety of mechanism by which endocrine, paracrine, and juxtacrine signal molecules exert their effects on target cells. Subject matter will include ligand/receptor families, second messenger systems, G-proteins, kinase cascades, and effector proteins that regulate cytoskeleton dynamics, metabolism, and gene expression.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "414", "credits": "3 Credits", "description": "This course provides an introduction to modern plant systematics as exemplified by the wide diversity of living plants growing in central PA. By the end of the course, students will be able to: 1) use the technical vocabulary that describes plant structures necessary for their identification, 2) characterize the major groups and families of flowering plants and gymnosperms, 3) recognize on sight 60 of the most important plant families in our region and be able to describe and contrast their major features, 4) use and write identification keys to identify and study living plants as represented in the local flora, and 5) discuss current concepts of plant systematics and phylogenetics and their applications to plant classification and the study of the evolution of and relationships among families of flowering plants.", "prerequisite": "BIOL 240W"}, {"department": "BIOL", "number": "415", "credits": "3 Credits", "description": "Ecotoxicology is an interdisciplinary field that involves the study of chemicals and radiation on organisms and their environment. The goal of this course is to introduce the science of ecotoxicology, including a survey of classes of contaminants as well as the impacts of various toxins. The emphasis will be on organism and ecosystem effects of toxins, as well as some toxicity testing methods and pertinent government regulations. Additionally, we will undertake a research project as well as critical readings of current literature. One of the biggest challenges students face in this course is dealing with potentially conflicting data and applying scientific thinking in the process of making decisions about these controversies. These challenges will underscore the political, economic, and scientific constraints that U.S. regulatory agencies work under to protect public health. The goals of this course are to: - introduce the science and history of ecotoxicology - look at classes of contaminants and their modes of action - understand the impacts of various toxins on organisms and ecosystems - introduce some of the various U.S. agencies that evaluate and regulate contaminants in the environment - critically review scientific papers, data, and arguments - learn to communicate like a scientist with an emphasis on communicating complex topics to a lay audience - demonstrate understanding of the scientific method and apply that understanding to the development of a research project", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "416", "credits": "3 Credits", "description": "Biology of Cancer introduces basic biological aspects of cancer development with an emphasis on molecular and cellular mechanisms of tumorigenesis. It discusses how molecular genetic approaches can be used to reveal fundamental processes of carcinogenesis. Through this course, students will learn genetic, cellular and biochemical basis of cancer development and understand how such information can be instrumental in devising strategies for prevention, detection, and treatment of cancer. As a 400 level class, students are expected to have a background in molecular biology and genetics.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "417", "credits": "4 Credits", "description": "Function and form of major invertebrate phyla.", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "418", "credits": "3 Credits", "description": "In this class, students look carefully at diseases that impact human populations and the successes and failures in disease management. This class includes case studies of diseases and disease control in recent history as well as current outbreaks. Course materials will highlight the integration of different aspects of biology and additional complexities that drive disease dynamics and determine the efficacy of disease management strategies. Students will read assigned primary literature paired with popular science texts and educational multimedia resources to learn about course topics, which will complement classroom discussions and lectures. Each student will conduct an independent research project on a relevant topic of their choice, which will require them to search and identify primary literature that is relevant to their topic and apply the broad concepts discussed in the class to their unique research project. Each student will produce a written paper and deliver a presentation to the class. Research topics are often, but not limited to, a case study of a disease that is not covered in class by the professor.", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "419", "credits": "3 Credits", "description": "The course will provide a general overview of the process involved in studying a variety of ecological and environmental problems. It will provide a toolbox of techniques for understanding ecological and environmental problems, and discuss how they can be used to address questions and generate testable predictions. It will examine connections between individuals and populations and communities as well as between theory and data. The focus will be on theoretical and computer modeling approaches, while maintaining a strong link to data and real systems. After an introduction to modeling, students will learn to develop and use simple and stochastic optimization models for individual organisms, as well as applying basic game theory to interactions between individuals. They will explore a sequence of population demographic models of increasing complexity, ranging from unlimited, unstructured population growth to density-dependent, structured population growth, in non-spatial and spatial contexts, culminating in individual-based models for population dynamics. The students will then apply these models to interacting species, learning about mutualistic, competitive and host-natural enemy interactions. Finally, we will explore theory for communities of species in space and time. Applied problems will be drawn from all areas of conservation, harvesting, pest control and epidemiology throughout the semester. No modeling experience is necessary as the course will start from basic principles.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "419H", "credits": "3 Credits", "description": "Overview of processes involved in solving environmental problems.  Provides students with toolkit for understanding ecological and environmental problems.  BIOL 419 Ecological and Environmental Problem Solving (3) The course will provide a general overview of the process involved in studying a variety of ecological and environmental problems. It will provide a toolbox of techniques for understanding ecological and environmental problems, and discuss how they can be used to address questions and generate testable predictions. It will examine connections between individuals and populations and communities as well as between theory and data. The focus will be on theoretical and computer modeling approaches, while maintaining a strong link to data and real systems.After an introduction to modeling, students will learn to develop and use simple and stochastic optimization models for individual organisms, as well as applying basic game theory to interactions between individuals. Many of the class meetings will be held in computer laboratories where they will be actively engaged in working on applying these models. They will explore a sequence of population demographic models of increasing complexity, ranging from unlimited, unstructured population growth to density-dependent, structured population growth, in non-spatial and spatial contexts, culminating in individual-based models for population dynamics. The students will then apply these models to interacting species, learning about mutualistic, competitive and host-natural enemy interactions. Finally, we will explore theory for communities of species in space and time. Applied problems will be drawn from all areas of conservation, harvesting, pest control and epidemiology. This course will be one of several ecology courses that are available to students in the ecology and general option in the biology program along with the biology minor.", "other": ["Honors"]}, {"department": "BIOL", "number": "420", "credits": "3 Credits", "description": "Classification, morphology, phylogeny, and stratigraphic occurrence of fossil plants; practicum includes field trips and study of paleobotanical techniques and specimens.  GEOSC 420 BIOL (GEOSC) 420 Paleobotany (3) Land plants provide the oxygen, food, and forest structure that make our lives on land possible. They are sensitive indicators of global change in the past as well as today. This course will examine the history of green plants on the dynamic Earth from their beginnings in the Proterozoic oceans to today, with emphasis on central topics such as the colonization of land, the histories and relationships of major plant groups, the evolution of seeds and flowers, the evolution of plant-animal interactions, extinction and diversification, paleoclimates, and the origins of modern biomes such as rainforests and grasslands.This course is strongly recommended to graduate students and advanced undergraduates with interests in paleobiology and/or plant biology. Specimen observation and field trips will be important course components. Exams, assignments, and class participation will be the primary bases of evaluation.", "prerequisite": "any 3 credit introductory course in historical geology or plant   biology", "other": ["Cross-listed with: GEOSC 420"]}, {"department": "BIOL", "number": "421", "credits": "4 Credits", "description": "BIOL 421 / VBSC 421 Comparative Anatomy of Vertebrates Students will study vertebrate anatomy from an evolutionary and developmental perspective. They will become familiar with important structures, terminology and function; a basic requirement of the biomedical sciences. Comparisons between representative vertebrate groups (including fish, amphibians, reptiles, birds and mammals) will be used to illustrate structural adaptations of each organ system from an evolutionary perspective. Specific examples comparing ancestral and descendant species will demonstrate the relationships between the lifestyle of an organism and the morphology of homologous structures. A study of early embryonic development, differentiation of primary germ layers and organ formation will provide a basis for understanding organ structure and function. Laboratory activities will involve work with preserved specimens and will focus heavily on anatomic structure identification and function. Topics include anatomic directional terminology, vertebrate classification systems, early embryonic development and a detailed examination of the various organ systems. Specimens are selected to illustrate the anatomy of ancestral vertebrate species, the evolutionary changes observed in descendant species and the association of morphology with lifestyle. Although students will invest the majority of their time becoming familiar with the anatomy of a representative mammal (the cat), multiple species will be examined, and students will be expected to recognize selected anatomic structures in each species studied.", "prerequisite": "BIOL 129", "other": ["Cross-listed with: VBSC 421"]}, {"department": "BIOL", "number": "422", "credits": "3 Credits", "description": "Now is an exciting time for evolutionary, quantitative, and disease genetics. Increasingly sophisticated technologies are making it possible to obtain dense genomic data from large numbers of individuals from a variety of taxa. Such data permits the evaluation of processes that have generated genetic variation, providing a rich resource to make inferences about natural selection and population history that have affected the current distribution of genetic diversity. In addition, when correlated with phenotypic traits, such data enables researchers to identify genomic regions underlying trait variation which is of particular importance for identifying genes involved in disease. By the end of the course, students will be able to understand how the genome is organized, learn how to find and assay genetic variation across the genome, and will know how such variation is inherited. They will learn how pedigree analysis, linkage mapping, and autozygosity mapping can be used to identify loci underlying Mendelian traits, and will be exposed to a number of examples from human disease. The students will also learn about the neutral and adaptive processes that shape genetic diversity within and across species, and will understand the basics of sequence alignment, phylogenetic reconstruction, and testing for natural selection from within and between species data. Moreover, students will acquire the fundamentals of quantitative genetics, will understand the essentials of polygenic adaptation, and will learn how to use genome-wide association studies to identify loci underlying complex traits. Finally, students will become familiar with recent advances in individual identification from genetic data, and its relationship to privacy.", "prerequisite": "BIOL 222"}, {"department": "BIOL", "number": "424", "credits": "3 Credits", "description": "It is not possible to conceive of civilization, or life on earth for that matter, without plants. Through photosynthesis and oxygen production, plants are the major producers of biomass and constitute the base of the food pyramid. Plants also have evolved astounding diversity of forms, sizes, shapes, colors, smells and chemical compounds. This structural, nutritional and chemical flexibility has been put to innumerable uses by people, from hunter gatherers to the scientists in search of a cure for AIDS. Plants are at the core of our everyday necessities (food, clothing, shelter, medicines, beverages), simple pleasures (flower, fragrances) and pervasive problems (energy supply, drug addition, famine). Plants have changed civilization in dramatic ways in the past. Witness, for example, the spectacular alterations in diet and the increased population growth catalyzed by the Columbian Exchange. In the future we expect that plants will continue to affect people through an increasingly complex interplay between new technologies such as genetic engineering, the pressure on natural resources, and the search for new crops, medicines and biomaterials.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "425", "credits": "4 Credits", "description": "BIOL 425 / PPEM 425 (4 cr.) is a lecture and laboratory survey of the diversity of Fungi, consisting of two 75-minute lecture and two 180-minute laboratory/field activity periods per week. The course moves from branch to branch in the Fungal tree of life, covering aspects of ecology, morphology, physiology and life history, as well as current and historical importance to human affairs in medicine, agriculture and industry. Topics covered as students move through the Fungal tree include: 1) Macrofungi seen in the field; 2) Fungal evolution; 3) Fungal reproduction and dispersal; 4) Fungal growth, development and structure; 5) Fungal genetics and genomics; 6) Fungi as mutualistic symbionts of plants, animals and other organisms; 7) Fungal diseases of plants, animals and humans; 8) Fungi as toxin producers; 9) Fungi as sources of food, pharmaceuticals and enzymes; and 10) Fungi as research organisms used to understand basic biological processes. Some laboratory sessions consist of field trips to local forests to observe and collect Fungi for observation in the laboratory.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: PPEM 425"]}, {"department": "BIOL", "number": "426", "credits": "3 Credits", "description": "This course will provide a general overview of developmental processes as they apply to the central nervous systems. From initial differentiation of neuronal tissue to the aging of human brain, this course will expose students to many hot topics in the current neuroscience research field, including synaptogenesis, axon guidance, neural stem cells, apoptosis, learning and memory, and Alzheimer's disease. Although one textbook will be assigned as the major reference book, many current research results will be integrated into the lectures so that students can grasp the most recent advancement related to each topic.The course will be divided into four parts. Part I introduces the induction of neural tissue, the polarity and regionalization of the neural tissue, and the generation and function of neural stem cells. Cutting-edge research on neural stem cells will be discussed. Part II deals with various interactions within neuronal system, including neuron-glial interaction, cell adhesion and migration, axon growth and guidance, and target selection. Part III teaches synapse formation and maturation, neurotrophic factors and their distinct functions, and neuronal cell death. Part IV talks about learning and memory from a developmental view, and also neurodegenerative diseases. Current disease research will be discussed. The lectures will be given in PowerPoint presentations. Classical models and front line research will be integrated to stimulate students' imaginative thinking. Students will be encouraged to read some current research paper and offer their own view on some particular subject, such as neural stem cells and learning and memory.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "427", "credits": "3 Credits", "description": "This course will study the theory of evolution and the different levels at which biological evolution can be examined ranging from macroevolution and the fossil record to microevolutionary processes at the population level. It will look at how genomes evolve from bacteria to multicellular organisms as well as the evolution of body plans in plants and animals and the molecular underpinnings of these developmental transitions. These concepts will be used to understand human evolution and learn how the genome revolution has shed light on evolutionary medicine.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "428", "credits": "3 Credits", "description": "This is an exciting time for population genetics research. Increasingly sophisticated technologies are making it possible to obtain dense genomic data from large numbers of individuals. Further, advances in population genetics theory are improving our ability to make inferences about the evolutionary forces acting on populations. However, to effectively apply these new techniques to data being generated across populations, it is important to understand how evolutionary processes shape patterns of genetic variation. In this course, students will learn about the mathematical models employed in population genetics, and how these models can be used to make inferences from data. Specifically, this course emphasizes modern population genetic theory through the coalescent process, which provides a direct application to the analysis and understanding of empirical data.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "429", "credits": "3 Credits", "description": "Physiological mechanisms, ecological relevance, and adaptive significance of animal behavior.", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "430", "credits": "3 Credits", "description": "Developmental Biology introduces students to one of the most complex and exciting areas of modern biology. This course will cover basic concepts using a comparative embryology approach and focus on molecular and genetic analysis of mechanisms involved in cell differentiation and organ development. Students will learn how studies of development in different model organisms including invertebrate and vertebrate species have identified a network of evolutionarily conserved genes and signaling pathways that regulate embryonic development and morphogenesis.", "prerequisite": "BMB 252", "other": ["Cross-listed with: BMB 430"]}, {"department": "BIOL", "number": "431", "credits": "3 Credits", "description": "Reproductive Biology is an upper-level undergraduate course. The course will discuss topics in reproductive development and physiology, which can include development of gonads and the germline, sex determination, meiosis, development of gametes, plant reproductive development, effects of environmental factors on reproductive development, cloning and asexual reproduction, infertility and birth defects. In addition to morphological and cellular description of reproductive organs and tissues, there will also be discussion of genetic basis of diseases and molecular analysis of gene functions crucial for reproductive development in human and model organisms. Students will be ask to read original research articles on various aspects of reproductive biology, and work in two-person teams on a powerpoint presentation, which they use to report their understanding of a selected article in class to other students. The lectures and exams focus upon concepts integral to reproductive biology. Exams will be a combination of multiple choice, filling blanks, and true/false questions.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "432", "credits": "3 Credits", "description": "An advanced course in developmental biology, focusing on the use of genetics techniques to study fundamental questions of animal development. Topics taught in this course include an introduction of popular model organisms, various mutagenesis approaches, complex signaling mechanisms and cellular reprogramming. The goals for this course are 1. To acquire knowledge in advanced genetic tools commonly used to study animal development. 2. To acquire skills in reading and understanding scientific literature in the field of developmental genetics. 3. To acquire skills in applying knowledge and tools to solve basic problems in developmental genetics. 4. To gain an appreciation for the relevance of developmental genetics research to human health and other global issues.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "433", "credits": "3 Credits", "description": "This course focuses on the evolution of vertebrate animals, beginning with an overview of vertebrate classification and a consideration of early vertebrate evolution. Each group of vertebrates (fishes, amphibians, reptiles, birds and mammals) will be explored, with an emphasis on the history of each group, adaptations (physiological, morphological, behavioral) seen within the group, and relationships among members of the group, including insights from molecular data. Consideration of extant (living) vertebrates will be emphasized, specifically convergent adaptations across taxa (including flight, swimming, and specialization for similar environments, such as arctic or desert). The student will develop a perspective on vertebrate evolution, representative groups, vertebrate classification systems, and different vertebrate body plans and special adaptations. Additionally, a course project will reinforce broader skills of scholarly paper writing, oral presentation techniques, and collaboration. There is a single short field trip associated with this course. Over one weekend, the students will be driven to one of several sites, typically a zoo and a natural history museum. This experience provides students with an opportunity think deeply about how the principles presented in the class shape the diversity of past and current vertebrates. The biology major strives to develop an overall perspective on evolution for our undergraduates, and this course uses an important group, the vertebrates, to fully exemplify and develop that goal. Students in other majors outside our college, including Geology/Paleontology and Wildlife Science may also find interest in this course offering, and could graduate students.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "434", "credits": "3 Credits", "description": "This course examines the biology of emerging and reemerging infectious diseases. The course includes viral, bacterial, and eukaryotic pathogens causing serious mortality and morbidity. Major course topics include a historical perspective on diseases; microbiology and immunology of each class of pathogen; processes of evolutionary change in pathogens; public health efforts to detect, monitor, respond to, and/or eliminate diseases from local to international scales; zoonotic disease and host jumps; and the One Health integration of human, animal and environmental health. Students will complete quizzes, discussions, and a research project based in primary literature reporting on a current or classical infectious disease. Case studies will include, but are not limited to, influenza, HIV/AIDS, smallpox, West Nile virus, polio, dengue, tuberculosis, and malaria. Depending on class size, students may complete additional research projects or scenarios. Students with interests in disease and health from majors in many colleges may wish to take this course.", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "435", "credits": "3-4 Credits", "description": "Physical, chemical, and biological characteristics of freshwater environments, with special emphasis on factors regulating productivity in freshwater ecosystems.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "436", "credits": "3 Credits", "description": "Ecological responses of individuals, populations, and communities to environmental variation, with emphasis on climate change.  BIOL 436 BIOL 436 Population Ecology and Global Climate Change (3)In this course, students will be presented with a close look at the factors shaping the characteristics of populations and their dynamics in time and space, with emphasis on the responses of populations to climatic fluctuation and global climate change. The course begins with an introduction to the basic concepts necessary for understanding the responses of individuals, populations, and communities to climate change in the recent past (the past 2 centuries), present, and future. These concepts include: the science of climate change, how temperature trends are estimated, the data used in assessment reports by the Intergovernmental Panel on Climate Change, large-scale climate systems such as the North Atlantic Oscillation and the El Ni�o Southern Oscillation, the basic characteristics of populations, how population densities are estimated, and the types of population data used in studies of population responses to climate change. In this first section of the course, students are also introduced to natural selection and the concepts of adaptation and vulnerability, which sets the stage for distinguishing between adaptive ecological responses to climate change vs. susceptibilities to climate change.After presenting these basic concepts, the course then moves on to examine single-species population dynamics. This section of the course teaches students about the different types of population growth, including unlimited growth, density-dependent population dynamics, and density-independent population dynamics. Here, we take a close look at case studies documenting population responses to large-scale climatic fluctuation, and case studies that demonstrate interactions between the opposing influences of density dependence and climate on population dynamics. This section of the course also introduces students to some of the analytical difficulties inherent in quantifying the contribution of climatic fluctuation to local population dynamics. This section finishes with lectures on the phenomenon of spatial synchrony in population dynamics and the implications of global climate change for widespread population decline and extinction risk.The final section of the course focuses on multi-species dynamics. Lectures in this section introduce students to inter-specific competition through examination of case studies involving desert rodents and ants; then move on to predation, with case studies of wolf predation illustrating the different types of functional and numerical responses, predator-prey cycles, and cascading effects of predators on population dynamics at lower trophic levels including herbivores and plants; and parasite-host dynamics, including discussion of the role of parasites as specialized predators in host population dynamics. This section also includes discBIOL 436 Population Ecology and Global Climate Change (3)", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "437", "credits": "4 Credits", "description": "This course develops a visual, conceptual, and functional understanding of histology, the microanatomy of body cells, tissues, and organs. The lecture portion of this course will use diagrams, digital images, and didactic explanations to build a conceptual understanding of histology, stressing form, function, and clinical applications. The laboratory portion of the course emphasizes form, identification, and naming of cells, tissues, and organs at a microscopic level. As such, the lab will use microscopes and digital images to investigate actual histology slides of body tissue, with the goal of visual identification, classification, and naming of body tissues.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "438", "credits": "3 Credits", "description": "This course a highly quantitative second ecology course. It emphasizes mathematical and theoretical approaches to ecological questions. The course builds on concepts from introductory ecology and requires students to use tools acquired in biostatistics and calculus to solve ecological problems. It can act as an introduction to or as an extension of experimental design. Although it is not a writing-intensive course, students are required to use standard technical writing and public speaking skills throughout the course. The course covers topics that are relevant to, but not addressed in, evolution and evolutionary genetics. In addition, it offers an opportunity for mathematics students interested in application of mathematics to biological problems to apply models covered in mathematical modelling to real situations. Throughout the semester analytical and theoretical thinking will be emphasized, starting with simple descriptions of population phenomena and ending with development of mathematical models and the critical experiments needed to test those models. The emphasis lies on empirical tests of ecological theory and applications of ecological theory to real-world problems. Students will be evaluated by means of essay exams covering theory, mathematical models, and the design of hypothetical experiments, in-class presentations of the primary ecological literature and applications of ecological theory to current environmental problems.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "439", "credits": "3 Credits", "description": "Practical aspects of retrieving and analyzing biological information residing in common databases.  BIOL 439 Practical Bioinformatics (3) This course focuses on practical aspects of biological databases and analyses of molecular data. Students will learn about vast resources available, how to access them, and retrieve only the desired information. Sequence comparison and alignment methods will be presented. We will discuss practical aspects of such algorithms as dot matrix plots, dynamic programming, BLAST, and FASTA. Different strategies of multiple alignments will be discussed as well. We will cover computational genomics and computational analysis of gene expression. Students will learn how to assemble short sequences into long contigs and how to infer biological information from raw sequence data. They will learn how to analyze protein sequences including secondary structure prediction, protein function prediction (based on motifs and functional domains), and structural modeling. The whole course will be well balanced between theoretical description of computational biology methods and practical aspects of bioinformatics (some sessions will meet in computer classrooms)Upon completion of this course, students will have sufficient knowledge to retrieve a desired information from biological databases based on both text and sequence data. They will learn what public resources are available in term of databases and a software. They will know how to interpret results in biological context and how to adjust different parameters in the software to get exact desired results.This course will be one of several courses that are available to students in the genetics and developmental biology and general options in the biology program along with the biology minor.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "441", "credits": "3 Credits", "description": "Classical and current concepts in plant constituents, mineral nutrition, water relations, respiration, photosynthesis, photoperiodism, plant growth regulators, growth and development, and responses to the environment. Using these concepts, students will be able to explain how specific processes in a plant integrate with other relevant processes to determine the overall response of the plant to a particular set of conditions; describe how multiple plant biochemical pathways intersect and influence each other; describe how energy affects processes at all levels of biological organization from the molecule and cell to organisms and ecosystems; and be able to explain how plants perceive and respond to their environment, including signal transduction, intercellular communication, and information processing. As part of their work in this course, students will demonstrate an ability to read and discuss the scientific literature on plants and critically analyze current issues in plant physiology including impacts on human health, agricultural biotechnology, and bioenergy.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "443", "credits": "3 Credits", "description": "Evolutionary Developmental Biology (Evo-Devo) is an interdisciplinary field that combines developmental biology, comparative genetics, and evolution to understand how organisms have attained their diversity in form. While the field of developmental biology aims to understand how a given organism develops, Evo-Devo focuses on how form evolves through alteration of these developmental mechanisms. Course instruction involves lectures, discussion, and student presentations/projects and features case studies from the scientific literature across the diversity of life, towards developing a predictive framework for the evolution of form.", "prerequisite": "BIOL 240W"}, {"department": "BIOL", "number": "444", "credits": "3 Credits/Maximum of 3", "description": "This field course will explore the flora and fauna of the mid-Atlantic area.  BIOL 444 Field Ecology of the Central Appalachian Highlands (3) This course is designed to take advantage of the teaching opportunities presented by the West Virginia highlands. The main advantage of using this area as an outdoor classroom derives from the fact that there are large changes in elevation and soils, and a tremendous variety of community types located in a small geographic area, In this area, students can observe ecological communities ranging from river, bottom forests at 1500 to 2000 feet in elevation to dry ridge slope forests at 3000 feet to the unique acid soil heath barrens community of the Dolly Sods Wilderness at 4000 feet. Since almost all of this area was extensively logged in the past, students will have the opportunity to observe the results of succession, and how the process of succession is affected by variation in topography, soil type and local climate. There are also several types of aquatic communities available for study, including large rivers, small high elevation streams and acidic wetlands. The course will use an integrated natural history approach to study the various ecological communities. This will include discussion of the effects of human activity and the topography and geology of the area in addition to study of terrestrial and aquatic flora and fauna. At terrestrial site, we will, in part, follow the example of the US Forest Service's Forests of the Central Appalachians Projects (http://www.spies.com/~gus/forests/) which uses forest walk inventories to document biodiversity. Therefore, the course would have a significant plant identification and taxonomy component. Each community can be studied as a separate unit and then compared to the aqjacent communities at different elevations. By the end of the course, students should understand the relationship of geology, topography and soil type to the distribution of plant communities. They should also understand the relationship of plant communities and water chemistry to the distribution of aquatic insect and vertebrate and be able to use aquatic insects as water quality indicators. This course will be one of several field courses that are available to students in the ecology and general option in the biology program along with the biology minor.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "446", "credits": "3 Credits", "description": "This course introduces students to the study of interactions between physiological capabilities of organisms, their ecology and, more broadly, their environment. This course looks at how organisms work and what it is about their environment that has led them to work that way. Both abiotic and biotic components of the environment are considered as sources of important variation to which organisms must adapt. Plants and microbes are covered to some extent, but the primary focus will be on animals (both vertebrates and invertebrates). The primary goal is to gain an appreciation for the flexibility of physiological systems and the powers of evolutionary processes to shape the physiology of an organism in response to its environment.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "448", "credits": "3 Credits", "description": "Analysis of the ecology, evolution, and natural history of plant reproduction. We focus on angiosperms (flowering plants) but also touch on the broader reproductive diversity in plants. Our topics include pollination, fruit-set, dispersal, and relevant plant- animal interactions. This course is highly integrative and draws on basic concepts in ecology, evolutionary biology, and genetics. We also pay especial attention to the implications of global environmental change on plant reproduction and plant diversity.", "prerequisite": "BIOL 240W"}, {"department": "BIOL", "number": "450W", "credits": "3-5 Credits", "description": "This is a practical introduction to modern design of field studies and experiments in terrestrial and fresh water habitats. This is an outdoor course almost as much as a classroom one. Be prepared to go outside, develop the power of observation, and discover. Emphasis is given to learning scientific skills via active-learning methods. Students will learn to formulate research questions, and develop adequate hypotheses and study designs and experiments to test hypothesis using statistics. Students will be guided step-by-step to perform basic and advanced data analyses: from data tables and frames, to parametric, non-parametric, and multivariate statistical methods used in everyday biology and ecology research driven hypothesis-testing approaches. Each week the class meets in the classroom (Tuesdays) for discussion-format lectures, and on lab day (Thursdays) the class goes out into the field to collect data and perform experiments. Primary scientific literature will be read and discussed in the context of the lectures and field exercises. Specific Learning activities include the ecology of natural communities including terrestrial and aquatic, seed dispersal and seed ecology, predation, foraging ecology, pollination, fruit-eating mutualisms, and population census methods. Student evaluations are based on participation, engagement, oral presentations, and written reports (no exams given in this class). At least one field trip involves staying overnight in a natural area. Specific topics covered in this class are: asking questions in science, designs of studies and experiments, ecological data collection techniques, data storing methods, statistical analyses (univariate to multivariate), graphical representation of results, oral presentation skills, research ethics, and writing and publication skills and techniques.", "prerequisite": "BIOL 220W", "other": ["Writing Across the Curriculum"]}, {"department": "BIOL", "number": "451", "credits": "3 Credits", "description": "Ribonucleic acid (RNA) plays a central role in all organisms on earth, and was very likely the central molecule during the origin of terrestrial life. This course will explore the biological functions that RNA plays in diverse organisms, including transcription, translation, virology, and RNA-interference, and CRISPR-based genome editing. There will be a strong emphasis on the evolution of RNA functions and upon the relevance of RNA-based biological mechanisms to health, disease, and society. The course laboratory focuses on computational skills required for modern analysis of RNA, and emphasized genome-wide studies. This course requires knowledge on the basic mechanisms of molecular biology and genetics, and is designed for upper-level undergraduates and graduate students in the Biology or Biochemistry and Molecular Biology (BMB) departments. Reading materials will involve selections from textbooks, as well as from the scientific literature. Students will be evaluated on the basis of written examinations, homeworks, and a final laboratory project.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "455", "credits": "3 Credits", "description": "This course will give an overview of milestones in stem cell research and will expose students to current topics at the frontier of this field. It will introduce students to the different types of stem cells as well as factors and signals that are implicated in regulating stem cell fate. The course will highlight techniques for engineering of stem cells and their micro-environment. The course will also discuss gene editing and the application of gene editing in stem cell research. Furthermore, it will evaluate the use of stem cells for tissue engineering and therapies. Emphasis will be placed on discussions of current research areas and papers in this rapidly evolving field. The class is designed for upper undergraduates and graduate students with a strong interest in stem cell biology, and the desire to actively contribute to discussions in the class.", "prerequisite": "BIOL 230W", "other": ["Cross-listed with: BME 455"]}, {"department": "BIOL", "number": "459", "credits": "3 Credits", "description": "The overall goal of this course is to provide a strong overview of the techniques used in plant biotechnology and the applications made possible by those techniques. The lecture topics will be used to introduce the principles of tissue culture and molecular biology, including how they are used to produce transgenic plants. Furthermore, the course will give students a broader and deeper knowledge in the field of Plant Biotechnology and provide a foundation for understanding the field as it changes in the future. Topics include the safety, legal and ethical issues surrounding GMOs and the study of the anti-GMO arguments surrounding each issue. In the laboratory component of the course, students will be introduced to the underlying principles of molecular biology techniques and aseptic culture of plant cells as well as the tissues and organs used to produce transgenic plants. In summary, through this course students will be introduced to many of the most important tools of the biotechnologist.", "prerequisite": "BMB 252", "other": ["Cross-listed with: BIOTC 459, HORT 459"]}, {"department": "BIOL", "number": "460", "credits": "3 Credits", "description": "This course will cover the nature and contents of the human genome and the basic principles of evolution. We will also explore the future implications of personal genomics and how this information is being used to reconstruct our evolutionary history and to advance human medicine. We will carefully consider the processes by which we can identify how information contained within our genomes may affect physical and behavioral phenotypes, and what other factors may be involved (e.g., the environment). The points will be illustrated by a variety of examples of human evolution and important biomedical issues", "prerequisite": "ANTH 21", "other": ["Cross-listed with: ANTH 460"]}, {"department": "BIOL", "number": "460H", "credits": "4 Credits", "description": "This course will cover the nature and contents of the human genome and the basic principles of evolution. We will also explore the future implications of personal genomics and how this information is being used to reconstruct our evolutionary history and to advance human medicine..We will carefully consider the processes by which we can identify how information contained within our genomes may affect physical and behavioral phenotypes, and what other factors may be involved (e.g., the environment). The points will be illustrated by a variety of examples of human evolution and important biomedical issues.", "prerequisite": "ANTH 21", "other": ["Cross-listed with: ANTH 460H", "Honors"]}, {"department": "BIOL", "number": "461", "credits": "3 Credits/Maximum of 3", "description": "Current/classical issues relating to health, research, agriculture, environment, and biotechnology.  Active exploration of the impact of science on society.  BIOL 461 Contemporary Issues in Science and Medicine (3) The aim of this course is to provide students of the biological and biomedical sciences with a framework to recognize, examine, and resolve conflicts which may affect their professional conduct. Current and classical issues relating to human health, scientific and medical research, agriculture, the environment, and biotechnology will be explored. The history, controversies, and current issues related to each topic will be presented by the instructor through lecture, guest presentations, and multimedia presentations. Each topic will be explored by students through a variety of activities, including role playing, case studies (real and hypothetical), mock trials, small- and large-group discussions, writing exercises, and student research projects presented in oral and poster format. Some activities and discussions will involve the entire class simultaneously, while other activities will be structured for very small groups (2-3 students), small groups (5-6 students), or large groups (10-15 students). This course is especially relevant to any student majoring in Biology, as it allows and encourages them to relate information they have learned in other Biology courses to their own professional conduct. Although the course was specifically designed to cover issues that are relevant to students majoring in each of the Biology concentration areas (Genetics and Developmental Biology, Ecology, Plant Biology, and Vertebrate Physiology), it is also relevant to students in colleges other than Science, who may be enrolled in majors with some biological content or applications. This course is designed to be rigorous and very interactive.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "462", "credits": "3 Credits", "description": "History of Biology is an exploration of the history that led to our current biological knowledge. The course is organized chronologically from the Antiquity to the end of the 20th century, focusing on the development of ideas such as life, life functions (such as respiration), structure (animal and plant anatomy), diversity (species), generation (reproduction and inheritance), embryological development, and evolution. The course involves commenting on original writings by the most influential life scientists, such as Hippocrates, Aristotle, Galen, Vesalius, Harvey, Linnaeus, Lamarck, Darwin, Mendel, Morgan, and Watson & Crick, spanning more than 2,500 years. Students are required to read those original writings prior to every lecture. A special emphasis is laid on the development of theories which are the foundations of our current biological knowledge (such as macromolecules, the cell, and the evolutionary theory). The history of biology is placed within a broader historical and cultural context: a great deal of time is dedicated to explain what was happening in each historical period beyond life sciences (e.g., the rise of the first universities in the early 1200s in the Latin West, the impact of the scientific revolution in the early modern period, and the characteristics of the Enlightenment); scientists and institutions from many different periods and countries are studied. A first course objective is the review of the historical development of the most important foundations of biology, such as macromolecules, the cell, inheritance, evolution, metabolism, biodiversity, and ecosystems. This objective will directly help biology majors to gain a deeper appreciation for the history that led to our current knowledge. Starting with the Antiquity is essential because, up the 19th century, knowledge found in books was as important as knowledge obtained from actual observations, and thus many ideas have transcended the centuries. For instance, Harvey justifies his revolutionary discovery of blood circulation by the very old Aristotelian idea that a circular motion is perfect; hence the necessity of exploring in depth Aristotle's ideas; not to mention that Darwin (who had the deepest admiration for Aristotle) struggled for a long time with the notion of perfection in living organisms, and proposed an answer which is of the utmost importance to understand the depth of his evolutionary theory. A second objective is for students to understand the interplay between observations, theories, experiments, and techniques. So, this objective will help students understand science as a process, how scientific knowledge is built: for instance, the development of the cell theory has been dependent on the emergence of new microscopic techniques, and the development of the evolutionary theory has been dependent on the slow accumulation of observations in comparative anatomy, geology, species classification, and geographical distribution; and, obviously, theories play an absolute key role because only theories help make sense of observations. A third objective in this course is to appreciate and understand past theories and ideas with a humble, non-judgmental, and unbiased approach, keeping in mind that past scholars were not necessarily \"wrong.\" Indeed, it is more enriching to try to understand why scientists believed in one particular theory instead of others, why they thought it was correct even though it is not. Hence the necessity of doing the most difficult thing there is in the history of science, i.e., putting ourselves in the mind of scientists of the past. The course explores many examples of theories that were once believed to be correct by everyone, or nearly everyone, and later abandoned. Overall, this course will remind students of the importance to always remain open-minded and creative in the sciences, as history shows that only those who did not fear being \"wrong\" occasionally ended up getting things right.", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "463", "credits": "3 Credits", "description": "Illustrates science of ecology, from individual, population, and community- level perspectives, discusses applications of this science to issues of conservation of biodiversity.", "prerequisite": "BIOL 220W"}, {"department": "BIOL", "number": "464", "credits": "3 Credits", "description": "Life is social. From quorum sensing bacteria blocking up urinary catheters to the seemingly poetic integration of millions of bodies during an army ant raid. And of course there are humans; that singularly unique species once described as the 'paragon of animals'. Whether the group is bacteria, worms, ants or humans selection has resulted in precise rules that govern interactions and maintain stability. Understanding these rules is the field of sociobiology and we can even see such rules at play among the inorganic realm as researchers select for social robots. In this course we explore sociobiology through stories of adaptation that will challenge you to pinpoint where and how selection is acting. We will deal with the well known topics of natural, sexual and artificial selection as well as less precisely understand topics of kin and group selection. Many of the stories in this course bring us to the exciting front line of research where acrimonious debates are waging. Because systems are often best understood when they are broken we will also tell stories of parasites and cheaters that destroy social cohesion. We will learn of such fascinating diseases as zombie ant fungi that manipulate ant behavior to the protozoans in your brain that affect your ability to drive. In societies the response to diseases is often collective and similar defenses can be seen across widely different groups so we will hear stories of how both social insects and humans have evolved adaptive architecture to reduce disease spread. We will also ask where we humans are going? To address this question the course will focus on our past and our many inventions from agriculture to cities. We will ask how our adaptations parallel those of other organisms and how they diverge. Finally, we will tie this back to Penn State's mission as a Land Grant School and how social behavior is important in practical and applied science delivered to the masses.", "prerequisite": "ANTH 21"}, {"department": "BIOL", "number": "464H", "credits": "3 Credits", "description": "Biological basis of social behavior. Comparative evaluation and adaptive value of social structures, mating systems, ecological correlates of social behavior.", "other": ["Honors"]}, {"department": "BIOL", "number": "465", "credits": "3 Credits/Maximum of 3", "description": "The survival of a cell, organism or population in a variable environment depends on mounting specific responses to external stimuli. Each of these responses is governed by the coordinated action of multiple (potentially numerous) individual functional components. Understanding the collective behavior of such a complex interacting system is enabled by representing the system as a network, where we denote the components of the system with nodes and their interactions by edges. The properties of these interaction networks can then be analyzed by computational methods. This analysis can lead to important conclusions and predictions about the possible collective, dynamical behaviors of the system. The course will cover examples of network analysis and modeling in biology and medicine, focusing on systems at the molecular and cellular level. After taking this course students will be able to integrate information to construct a network model corresponding to a biological system, to use graph theoretical measures to describe this network, and to use mathematical or computational methods to model the dynamic processes that take place in this system. These skills are important for careers in life science and medical research, in bioengineering and biotechnology.", "prerequisite": "MATH 140"}, {"department": "BIOL", "number": "467", "credits": "3 Credits", "description": "This course provides up-to date knowledge of and insight into the molecular/cellular/genetic basis of the neurological diseases. The focus will be on neurodegenerative and cognitive disorders with a relative high prevalence as listed below: Neurodegenerative disorders: Alzheimer's disease, Parkinson's disease, Huntington's disease, Ataxia, ALS  Cognitive and emotional disorder: Autism spectrum disorders, Mental Retardation, Depression, Bipolar disorder, Schizophrenia, Addiction, Posttraumatic disorder", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "469", "credits": "3 Credits", "description": "Students will acquire an understanding of basic neurobiology, the terminology of neuronal structures and functions, as well as experimental approaches designed to integrate the principles of neural cell biology, neurophysiology, neurochemistry, neuroendocrinology, neuropharmacology, genetics and molecular biology. The LEARNING OBJECTIVES of this course are to establish a working knowledge and understanding of: (I) the cellular structures, organelles and passive and active membrane properties important for neural function, (II) the neurotransmitters, receptors, ion channels and 2nd messenger systems underlying synaptic transmission and other forms of neural signaling, (III) the development of the nervous system including neurogenesis, neural maturation, apoptosis, synaptogenesis in both the developing and adult CNS, and (IV) the molecular mechanisms underlying synaptic plasticity and learning and memory. Lastly, (V) the course will demonstrate applications of above knowledge to select complex diseases of the central nervous system", "prerequisite": "BIOL 230W", "other": ["Cross-listed with: BBH 469"]}, {"department": "BIOL", "number": "470", "credits": "3 Credits", "description": "Neurobiological function in motivated behaviors, motor and sensory function, learning and memory, development, sexual differentiation, and pathology.", "prerequisite": "BIOL 469", "other": ["Cross-listed with: BBH 470"]}, {"department": "BIOL", "number": "472", "credits": "3 Credits", "description": "Physiology is the science explaining body function at system, organ, cellular, and biochemical levels. This course explores the fundamentals of mammalian physiology with an emphasis on human physiology and its clinical applications. The target audience is advanced undergraduate and graduate students studying in the life sciences, many of whom plan to study clinical medicine disciplines in the future. Physiology is an integrative science discipline and thus will apply principles developed in previous biology, chemistry, mathematics, and physics courses to problem solving situations. Core elements of this course include integrating science knowledge and applying science principles to develop a broad understanding of physiology systems and solve physiology problems.", "prerequisite": "BIOL 230W"}, {"department": "BIOL", "number": "473", "credits": "2 Credits", "description": "Laboratory experiments demonstrating fundamentals in physiology.", "prerequisite": "BIOL 472"}, {"department": "BIOL", "number": "474", "credits": "3 Credits", "description": "Astrobiology is the study of life in the universe. Astrobiology has become a major focus of scientific research in the United States and a topic often discussed in popular science literature. The recent interest in astrobiology has resulted in the formation of an Astrobiology Institute at Penn State University. This advanced undergraduate course in astrobiology will cover many topics in the field including, biochemical evolution, the origin and evolution of life on Earth, microbial diversity, protein evolution, and the distribution of life in the universe. This course is intended to provide students of the natural sciences with the opportunity to prepare for a research career in the rapidly expanding field of astrobiology. The course will also present astrobiology as a cross-disciplinary framework that ties together the diverse courses the students have already taken. The students will learn new concepts while having, to draw on their previous knowledge of chemistry, biology, and the geosciences. In summary, this course has the following objectives: (1) to develop the student's literacy in astrobiology so that they can critically evaluate claims that they encounter well after the course has ended; (2) to present a scientific question that requires the sum of the student's previous education to solve; (3) to provide a deep background to some of the astrobiological concepts that are often only briefly mentioned in other classes or in the media; (4) to develop research and communication skills required for a young scientist through a class term paper and short oral presentation; and (5) to prepare the students for graduate research in astrobiology by giving them a broad background of the field and by demonstrating many of the outstanding problems yet to be solved.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: GEOSC 474"]}, {"department": "BIOL", "number": "475", "credits": "3 Credits", "description": "This course focuses on manifestations of human diseases and the changes that occur at the molecular, cellular, tissue, organ, and system levels to cause disease states. Topics covered include mechanisms of disease, inflammation and repair, features of selected diseases for each body system, diagnostic testing, and pharmacotherapy. The primary goal of the course is to reinforce student knowledge of normal human physiology by studying how it is altered by disease. The course will feature traditional didactics, case studies, group problem-based activities, and analysis of primary literature in pathophysiology.", "prerequisite": "BIOL 141"}, {"department": "BIOL", "number": "476", "credits": "3 Credits", "description": "Advanced Human Anatomy is an in-depth human anatomy course with both a lecture and lab component. Lecture meets twice per week for 50 minutes, and lab meets once per week for 2 hours in the cadaver lab. In lecture, there is a focus on understanding anatomy in the context of development, histology, evolution, and clinical scenarios. Lectures also include clinical correlations, where students will apply their anatomical knowledge to understand general and specific clinical cases. Learning how to identify structures in various imaging modalities (including X-ray, CT, and MRI) is an important component of this aspect of the course. A typical lecture session often includes group-work on clinical application worksheets, completed with the help of the instructor and lecture assistants. Lab activities are conducted in the cadaver lab, and mostly focus on learning to identify structures on the cadavers. Students will also learn to identify anatomy on isolated skeletal elements, plastinated cross-sections and models, and occasionally on animal organs. In both lecture and lab, there will be an emphasis on understanding the 3-dimensional relationships between structures in the body. Examination of cadavers and real human cross-sections will greatly aid in this goal. Each week's lab activities are linked with that week's lecture topic. The course is organized regionally, meaning that each region of the body is studied in turn. This promotes a focus on understanding the interrelationships between body structures and systems. The course is divided into three blocks, each capped by an exam. The first block is Thorax, Abdomen, and Pelvis, the second block is Back and Limbs, and the third block is Head and Neck. Exams consist of written lecture exams and lab-practical examinations.", "prerequisite": "BIOL 129"}, {"department": "BIOL", "number": "477", "credits": "3 Credits", "description": "This course is an advanced exploration of human anatomy, based around cadaveric dissection. We will take a \"regional\" approach to learning anatomy, meaning that we will focus on each region of the body in turn. There will therefore be an emphasis on understanding the 3-D relationships between structures, and how all body systems are interrelated. Lab activities will center around the dissection of cadavers. You will work in groups to complete the dissections. Lecture activities will focus largely around small group work on hands-on activities and worksheets.", "prerequisite": "BIOL 161"}, {"department": "BIOL", "number": "478", "credits": "3 Credits", "description": "This course provides instruction on the functional and structural organization of the vertebrate nervous system. In addition to lectures, students attend laboratory sessions devoted to human brain dissections, histologic sections of various vertebrate brains, neuroanatomical methods for analyzing brain and spinal cord organization, and non-invasive magnetic resonance imaging. The structural organization of the brain is described at both the gross and microscopic levels. A major aim of the course is to instill students with an understanding of the three-dimensional structure of the brain. To achieve this goal, students are taught how to recognize specific structures in different planes of sections along the major axes of the brain. Structural-functional relationships in the nervous system are explained, and particular emphasis is placed on understanding the functional impact of brain trauma and a variety of neurological diseases. While the course emphasizes the mammalian nervous system, many aspects of brain organization in non-mammalian vertebrates are also presented. As part of this, a major section of the course is devoted to understanding neurocladistics and the biological principles that have guided brain evolution across different phylogenetic lineages."}, {"department": "BIOL", "number": "479", "credits": "3 Credits", "description": "Endocrine mechanisms regulating the morphogenesis, homeostasis, and functional integration of animals.", "prerequisite": "BIOL 141", "other": ["Cross-listed with: ANSC 479"]}, {"department": "BIOL", "number": "482", "credits": "3 Credits", "description": "BIOL 482 is a lecture course designed to introduce participants to the Caribbean coral reef biome and other near-shore environments such as rocky shores, mangroves and seagrass beds. Students will learn through theoretical and practical exercises how environmental and biological factors interact to sustain near-shore ecosystems. We will discover and describe the amazing diversity of coral reef systems, explore the physiological and behavioral adaptations that enable organisms to live in this environment and deduct the basic ecological principles that underlie the function of near-shore ecosystems. We will be reading primary literature throughout the course. Students may choose to focus on current issues in marine conservation science as part of their class projects/proposal. Topics may include but are not limited to connectivity among marine populations, metapopulations-dynamics, adaptation to climate change, and conservation genetics. BIOL 482 counts towards the Marine Science Minor", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "483", "credits": "2 Credits", "description": "BIOL 483 is the optional intensive field travel experience for BIOL 482: Coastal Biology to the beautiful island of Curacao, part of the Netherland Antilles in the southern Caribbean. The course reinforces content from BIOL 482, introducing students to the Caribbean coral reef biome and other near-shore environments such as rocky shores, mangroves, and seagrass beds. Students will learn through theoretical and practical exercises how environmental and biological factors interact to sustain near-shore ecosystems. We will discover and describe the amazing diversity of coral reef systems, explore the physiological and behavioral adaptations that enable organisms to live in this environment, and deduct the basic ecological principles that underlie the function of near-shore ecosystems. Topics may include but are not limited to connectivity among marine populations, metapopulations-dynamics, adaptation to climate change, and conservation genetics. While in Curacao, we will study these topics through snorkeling and other field experiences. The colonial past and economic realities in Curacao provide an instructive backdrop to understand the complexity of marine conservation issues today. Students will accordingly interact with local researchers as well as local residents throughout their time in Curacao, exploring the local populations' differing cultural backgrounds and current concerns. This course requires strong participation and thus is most suited for highly motivated students. All participants must pass a swimming test before leaving for Curacao. Participants will be charged a fee to cover the trip costs to Curacao and have to bring their own snorkel gear. Field trip limited to 10 students.", "other": ["International Cultures (IL)"]}, {"department": "BIOL", "number": "484", "credits": "4 Credits", "description": "In this course, students will study the species diversity of Pennsylvania. To understand the biodiversity that we see in Pennsylvania today, we will discuss the evolutionary, ecological, environmental, and historical factors that have shaped it. The course will also present the ecosystems of Pennsylvania, the major threats to biodiversity as well as the laws and programs in place for its protection. Students will explore the interconnections of all human activities (urbanization, industry, natural resources, agriculture, etc.) and biodiversity. Most weeks incorporate a field trip to allow students to explore local natural areas, and to study some of the species of organisms mentioned in lectures. This course satisfies the Evolutionary Biology category in the Biology major or the Practicum requirement as the course will incorporate 9-13 field trips throughout the semester.", "prerequisite": "BIOL 110"}, {"department": "BIOL", "number": "489", "credits": "3 Credits", "description": "EcoHealth is an emerging field that examines the complex relationships among humans, animals, plants, and the environment, and how these relationships affect overall health of ecosystems. The ecohealth approach has been applied in a variety of landscapes where humans, domestic animals, and wildlife coexist in close proximity with few boundaries. This course introduces students to dry savannah ecosystems in northern Tanzania and examines how ecohealth is used as a theoretical approach to understand complex systems where zoonotic and infectious diseases have emerged into human populations and been applied practically to design interventions and improve health outcomes. A major focus of the course is to understand how cultural differences among the different ethnic groups in Tanzania impact ecohealth and solutions. The course is approximately three-weeks long and taught entirely in Tanzania during the summer session at Penn State. Students examine topics related to disease dynamics, human and veterinary health, socio-ecological systems, wildlife behavior, and conservation of natural resources. They will also learn the basics of East Africa's socio-political and historical context. Content will be delivered via lectures, readings, and student-led discussions among others. Students are given class pack containing ~20 articles related to zoonotic and vector borne diseases and dry savannah ecology. Examples of zoonotic and vector borne diseases that are currently or previously important in Tanzania include bovine tuberculosis, rabies, brucellosis, anthrax, Rift Valley Fever, Z fever, East African Sleep Sickness, malaria, and rinderpest (an infectious disease of bovids). Daily discussions about these readings are lead by students and they are encouraged to integrate what they have observed with the readings. This exceptional opportunity allows students to design and implement a basic animal behavior field experiment as well as to participate in qualitative research via guided focus groups and interviews with both pastoral and hunter-gatherer communities in the Serengeti-Mara ecosystem. The course will include guest lectures by local experts in biology, conservation, and health as well as visits to a regional hospital and to the Nelson Mandela African Institute of Science and Technology in Arusha, where Penn State researchers are engaged in collaboration to study zoonotic diseases.", "prerequisite": "BIOL 110", "other": ["International Cultures (IL)"]}, {"department": "BIOL", "number": "492", "credits": "1 Credits", "description": "Discussion of selected topics from recent biological literature; reports on current research or internship experiences.", "prerequisite": "7th Semester standing"}, {"department": "BIOL", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "BIOL", "number": "495", "credits": "1-12 Credits/Maximum of 12", "description": "Practical off-campus experience in Biology under the supervision of a professional and a faculty member.", "other": ["Full-Time Equivalent Course"]}, {"department": "BIOL", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "BIOL", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "BIOL", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "BIOL", "number": "498A", "credits": "0.5-5 Credits"}, {"department": "BIOL", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BIOL", "number": "499A", "credits": "3 Credits/Maximum of 999", "description": "A research-intensive, active learning course taught entirely in Costa Rica during the winter break. Students depart from wherever they are and rendezvous in Costa Rica, with detailed plans and contingencies in the event of problems with flights. We work at rustic but comfortable (beds, meals, indoor plumbing) field stations where we have immediate access to pristine habitats where we perform faculty and student-designed research projects. These research projects involve collaborative design, data collection of data to test specific hypotheses, data analyses, oral presentation, and writing formal journal-style reports. Faculty present evening lectures comprising background and examples that connect finished work to these nascent projects. Main field sites comprise a pre-montane moist forest on the Atlantic slope and a lowland rainforest on the Pacific coast of the Osa Peninsula. Course objectives are diverse, including i) provide an opportunity for students to gain confidence traveling to a non-english speaking country, independently of family but supported by faculty, peers, and our in-country partners; ii) learn how to perform research in a setting where learning methodology is deemphasized while intellectual engagement and ownership are maximized, iii) experience and learn about a broad sweep of natural history and ecology of the neotropics.", "other": ["International Cultures (IL)"]}]