[{"department": "BMB", "number": "1", "credits": "3 Credits", "description": "During this course, students will learn about the scientific process and how science has contributed to the knowledge used in the medical field to diagnose, treat, and prevent disease. The course will include a broad survey of the molecular and cellular factors that contribute to an understanding of select human diseases. By the end of the course, students will appreciate how various cellular, metabolic or genetic problems can give rise to a variety of diseases and disorders. The specific diseases covered each semester may vary based on student and instructor interest. Students will analyze the influence of molecular, genetic and environmental factors as well as lifestyle choices in regards to disease prevalence and severity. The knowledge gained about molecular processes will also be used in order for students to discuss the scientific basis of and ethical dilemmas related to controversial and cutting-edge diagnostic, treatment and prevention strategies such as drug development, clinical trials, genetic testing, genetic engineering or stem cell therapy. Lastly, students will gain knowledge necessary to analyze statements made in the popular press about disease or disease treatments and determine if those statements are grounded in scientific research. As a course that meets general education (GN) requirements, students will increase their scientific literacy, their critical and analytical thinking, and ethical reasoning skills. Students will ultimately be able to use the knowledge gained in this course to better understand disease processes, and will be able to make better informed decisions regarding their health and well-being or that of a loved one.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "BMB", "number": "1Z", "credits": "3 Credits", "description": "During this course, students will learn about the scientific process and how science has contributed to the knowledge used in the medical field to diagnose, treat, and prevent disease. The course will include a broad survey of the molecular and cellular factors that contribute to an understanding of select human diseases. By the end of the course, students will appreciate how various cellular, metabolic or genetic problems can give rise to a variety of diseases and disorders. The knowledge gained about molecular processes will also be used in order for students to discuss the scientific basis of and ethical dilemmas related to controversial and cutting-edge diagnostic, treatment and prevention strategies such as drug development, clinical trials, genetic testing, genetic engineering, and stem cell therapy. Lastly, students will gain knowledge necessary to analyze statements made in the popular press about disease or disease treatments and determine if those statements are grounded in scientific research. The specific diseases covered each semester may vary based on student and instructor interest, but will include a discussion of diseases that have a well understood scientific basis as well as a lifestyle component such as certain types of cancer, as well as diabetes/metabolic syndrome. Students will analyze the influence of molecular, genetic and environmental factors as well as lifestyle choices in regards to disease prevalence and severity. Diseases that have fitness related treatment options will also be discussed in order to provide further opportunities for students to integrate material with the linked course, KINES 84Z. As a course that meets general education (GN) requirements, students will increase their scientific literacy, their critical and analytical thinking, and ethical reasoning skills. As a linked course, BMB 1Z can satisfy the Integrative Studies requirement in General Education as long as students successfully complete both BMB 1Z and KINES 84Z. Students will ultimately be able to use the knowledge gained in this course to better understand disease processes, and will be able to make better informed decisions regarding their health and well-being or that of a loved one.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "BMB", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BMB", "number": "205", "credits": "2 Credits", "description": "In this research course, students will participate in a course-based undergraduate research experience while learning key foundational skills in the process, comprehension, and communication of science. Students will learn how to use critical thinking and metacognitive strategies to approach scientific problems, and will contribute to the scientific body of knowledge through the discoveries made in the research component."}, {"department": "BMB", "number": "205S", "credits": "3 Credits", "description": "In this integrated research and seminar course, students will participate in a course-based undergraduate research experience while learning key foundational skills in the process, comprehension, and communication of science. Students will learn how to use critical thinking and metacognitive strategies to approach scientific problems, and will contribute to the scientific body of knowledge through the discoveries made in the research component. This course will also contain a freshman seminar component that will help students adjust to the high expectations, academic rigors, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "BMB", "number": "210", "credits": "2 Credits", "description": "A course-based undergraduate research experience centered on analysis of bacteriophage (viruses that infect bacteria) genomics and writing a research proposal. Students will be introduced to various aspects of bacteriophage biology and various computational programs used to analyze bacteriophage genomic data. They will then use this knowledge to perform bacteriophage genomic analyses. Analyses conducted will be used to add to the current scientific knowledge through various routes, such as entries into scientific databases. Students will also learn to formulate a scientific question and write a hypothesis-based research proposal similar to those written for scientific funding agencies. In this way, students will be introduced to the process of scientific inquiry."}, {"department": "BMB", "number": "211", "credits": "3 Credits", "description": "An overview of biochemistry that includes properties of biomolecules, bioenergetics, metabolism, nutrition, genetics, and molecular biology. Elementary Biochemistry (3) BMB 211 is an overview of biochemistry that includes: basic properties and biosynthesis of proteins and nucleic acids, chemistry, and metabolism of major carbohydrate, lipid, and amino acid classes, energy production pathways including photosynthesis, biological transport, and principles of enzyme action. The course provides the student with a sufficient knowledge of biochemical processes, cellular molecules and their metabolism to serve as a basis for advanced study of nutrition, genetics, biotechnology, agricultural sciences, or related biological areas that depend on a biochemical foundation. Achievement of course objectives is assessed through multiple written examinations designed to evaluate understanding of biochemical concepts and their applications to biological problems. BMB 211 is related to and a prerequisite for the companion laboratory course BMB 212 (1 credit).", "prerequisite": "CHEM 202"}, {"department": "BMB", "number": "212", "credits": "1 Credits/Maximum of 1", "description": "Selected experiments to illustrate major biochemical principles and techniques.  B M B 212 B M B 212 Elementary Biochemistry Laboratory (1)B M B 212 exposes students to techniques typically used in industrial and academic laboratories to isolate proteins, perform enzyme kinetics, characterize carbohydrates and lipids, and study molecular biology. Data interpretation and conceptual understanding are emphasized.Specifically, students determine a weak acid's buffer range with a pH meter; quantify protein concentrations using a spectrophotometer; partially purify acid phosphatase from wheat germ, using ammonium sulfate precipitation, centrifugation and dialysis; characterize acid phosphatase kinetics; subject glycogen to acid and salivary amylase hydrolysis, then compare products using thin layer chromatography; isolate plasmid DNA from E.coli, then digest the plasmid DNA with restriction enzymes and analyze the products using agarose gel electrophoresis; make soap from commercial oils and fats; and lastly, identify fatty acids using a gas chromatograph.Students write laboratory reports to present their findings and correlate theory with actual experimental results. Written quizzes assess conceptual understanding of experiments. Teaching assistant evaluations judge the student's level of laboratory skill achievement, preparation, and ability to work with others in a professional manner.A solid chemistry knowledge base (CHEM 012 and either CHEM 034 or 038), previous laboratory experience, and the ability to work with mathematical word problems are expected of all students enrolled in the course. Biochemistry focuses on the chemistry of living organisms. This course provides basic biochemistry laboratory skills and exposure to widely-used methodology to develop a fundamental understanding of biochemistry needed for advanced courses in the student's major and compatible with the student's career interests. Outside resources for the student include reserved books and a course web site: www.bmb.psu.edu/courses/daniel/BMB212/default.htm.", "prerequisite": "BMB 211"}, {"department": "BMB", "number": "221", "credits": "2 Credits", "description": "Application and correlation of biochemical events to physiological-nutritional processes in specialized cells, fluids, and whole animals.  Students may not receive credit for both B M B 221 and 401.  B M B 221 B M B 221 Applied Biochemistry (2)In B M B 221, students will build on their knowledge from Elementary Biochemistry (B M B 211). Emphasis is on the application of biochemical principles to specific problems in medicine, agriculture, pharmaceuticals and biotechnology. Students review fundamental principles and learn how biochemical methods, techniques and theory are applied. Class presentations are computer based in some cases. The course may also include class discussions. Evaluation and grading varies with the instructor, but possible methods of evaluation include multiple choice examinations, essay-short answer questions, and in-class contributions.Students will have completed at least three semesters of chemistry before B M B 221, because Elementary Biochemistry (B M B 211) is a prerequisite, and inorganic (CHEM 012) and organic chemistry (CHEM 034 or CHEM 038) are prerequisites for B M B 211. Knowledge of organic chemistry and basic biochemistry is essential so that the course can focus on applications rather than introductory material.B M B 221 is a requirement for those Biotechnology majors who choose not to take the 400-level series of introductory biochemistry courses. It is also required of students enrolled in the science option of the Dairy and Animal Science major. It serves as an elective for all other majors. It is not approved as a general education course.", "prerequisite": "BMB 211"}, {"department": "BMB", "number": "251", "credits": "3 Credits", "description": "BMB 251 Molecular and Cell Biology I (3) is an introduction to the fundamental principles of molecular and cellular biology, with a primary focus on eukaryotic cells. Topics covered will include elementary biochemistry; structure and function of biological macromolecules, the cell and its organelles; the role of biological membranes in bioenergetics and sub-cellular compartments. There will be a particular emphasis on the molecular mechanism of heredity; the organization and expression of genetic information; experimental methods used in the analysis of gene expression and the relationship between gene/protein structure and function.", "prerequisite": "CHEM 112", "other": ["Cross-listed with: MICRB 251"]}, {"department": "BMB", "number": "251H", "credits": "3 Credits", "description": "Biomolecules, genetic mechanisms, organization of cells and their organelles, DNA replication, protein synthesis, membranes, the cell nucleus, energy conversion. BMB 251H Molecular and Cell Biology I (3) This course is an introduction to the fundamental principles of molecular and cellular biology, with a primary focus on eukaryotic cells. Topics covered will include elementary biochemistry; structure and function of biological macromolecules, the cell and its organelles; the role of biological membranes in bioenergetics and sub-cellular compartments. There will be a particular emphasis on the molecular mechanism of heredity; the organization and expression of genetic information; experimental methods used in the analysis of gene expression and the relationship between gene/protein structure and function.A key feature of the Honors course is the use of review papers and peer-reviewed journal articles as integral components of the course. The objectives of this component of the Honors course are to: 1) introduce students to the scientific method (the formulation of hypotheses based on observation and the processes underpinning the rigorous test of such hypotheses); and 2) provide the intellectual framework for a critical evaluation of the literature. Students are expected to engage in classroom discussion and will be evaluated by a combination of classroom presentations, multiple choice and short essay exams. Students are expected to develop a \"big picture\" view of how the various cellular processes are related to each other and also attain a thorough understanding of the molecular details of the individual processes (e.g. the order and molecular details of events leading from transcription to protein localization within a cell).", "prerequisite": "CHEM 112", "other": ["Honors"]}, {"department": "BMB", "number": "252", "credits": "3 Credits", "description": "Continuation of BMB 251 / MICRB 251 ; cytoskeleton, cell growth, division, adhesion, signalling, germ cells, differentiation, immune system, nervous system, plant cells. BMB 252 / MICRB 252 Molecular and Cell Biology II (3) focuses on the internal organization on eukaryotic cells and their organization in multi-cellular organisms. Topics covered include cell communication, the cytoskeleton, cell cycle, fertilization and development of multi-cellular organisms, genesis of tissues, and the molecular mechanisms of cancer and immunity.", "prerequisite": "BMB 251", "other": ["Cross-listed with: MICRB 252"]}, {"department": "BMB", "number": "252H", "credits": "3 Credits", "description": "Continuation of BMB 251H ; cytoskeleton, cell growth, division, adhesion, signaling, germ cells, differentiation, immune system, nervous system, plant cells.  BMB 252H Molecular and Cell Biology II (3) This course is the second part of BMB 251H . This section focuses on the internal organization on eukaryotic cells and their organization in multi-cellular organisms. Topics covered include cell communication, the cytoskeleton, cell cycle, fertilization and development of multi-cellular organisms, genesis of tissues, and the molecular mechanisms of cancer and immunity. There will be a particular emphasis on how the basic principles and experimental approaches presented in BMB 251H are employed to address questions related to the topics that will be covered in BMB 252H . As in BMB 251H, a key feature of the Honors section will be the use of review papers and peer-reviewed journal articles as integral components of the course. The objectives of this component of the Honors section are to: 1) introduce students to the scientific method (the formulation of hypotheses based on observation and the processes underpinning the rigorous test of such hypotheses); and 2) provide the intellectual framework for a critical evaluation of the literature.Students are expected to engage in classroom discussion and will be evaluated by a combination of classroom presentations, multiple choice and short essay exams.", "prerequisite": "BMB 251", "other": ["Honors"]}, {"department": "BMB", "number": "294", "credits": "1-6 Credits/Maximum of 8", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "BMB", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "N/A - just activating a common course number"}, {"department": "BMB", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction."}, {"department": "BMB", "number": "398", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "BMB", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "BMB", "number": "400", "credits": "2-3 Credits", "description": "Biochemistry of genetic phenomena, including the structure, replication and dynamics of genes and chromosomes, their expression and regulation. BMB 400 Molecular Biology of the Gene (2-3)Molecular Biology of the Gene examines the flow of information in living things at the molecular level. Topics such as the following are included: 1) DNA replication, repair and recombination, 2) RNA transcription and modification, and 3) protein translation, folding and modification. This class is designed as a one-semester course having the objectives of understanding concepts in molecular biology and gene regulation, and exploring research materials and methods used in the laboratory. Course materials are prepared not only from the textbook but also from the primary literature. Therefore, students who want to take this course should have some familiarity with reading research articles. BMB 400 is for advanced undergraduates who have already taken introductory molecular biology and biochemistry. Knowledge of molecular biology is essential background for pursuit of a career in the life sciences, including academia, medicine, industry, forensic science and science policy.", "prerequisite": "BMB 251"}, {"department": "BMB", "number": "401", "credits": "3 Credits", "description": "Principles of the structure and function of biological molecules, including carbohydrates, lipids, membranes, proteins, and enzymes. BMB 401 is the first course of the general biochemistry series, a sequence designed to prepare students for careers and graduate study in the life sciences. Overall, biochemistry describes, in chemical and molecular terms, the structures, mechanisms, and chemical processes at work in all living things, and abstracts organizing principles that underlie life in all its diverse forms. Building upon concepts introduced in molecular and cellular biology and in organic chemistry, students in BMB 401 synthesize and apply this knowledge toward understanding the structure and function of the major classes of cellular constituents: water, and the various macromolecules -- amino acids and proteins, sugars, and polysaccharides, nucleotides and nucleic acids, fatty acids and lipids, and membranes and various membrane proteins. These molecules interact to comprise the next level of multi-and mixed molecular structures and organelles that enable a cell to carry out its many metabolic functions. Students also learn about the technologies used to study cellular components and processes, and current advances in biotechnology that have accelerated the pace of discovery in the field. Having gained familiarity with the molecules found in a cell, students are well-equipped to take on more advanced topics in the exciting, rapidly-evolving fields of the life sciences. An overriding theme in biochemistry is that polymers of living systems, though structurally large and functionally complex, are highly ordered chemical entities, with specific sequences of monomeric subunits giving rise to discrete structures and functions. The course includes all of the following topics: 1) an introduction to protein structure function relationships, covering the structural basis of protein functions; 2) enzyme kinetics and mechanisms; 3) simple and complex carbohydrates and topics in glycobiology that include energy storage, framework skeleton, and specific molecular recognition; 4) various classes of lipids, including phospholipids, complex lipids, membrane biology and transport systems, and 5) an analysis of the biochemical basis of signal transduction describing how specific signals regulate biomolecular activity both within a cell and between cells to keep an organism in homeostasis. Lastly, as a transition to intermediary metabolism in BMB 402, an introduction to bioenergetic principles is included to provide a framework for understanding pathways of carbon and nitrogen metabolism, using glycolytic reactions as an example. Students may not receive credit for both BMB 401 and CHEM 476 or BMB 401 and BMB 221", "prerequisite": "CHEM 210"}, {"department": "BMB", "number": "401H", "credits": "3 Credits", "description": "Principles of the structure and function of biological molecules, including carbohydrates, lipids, membranes, proteins, and enzymes. BMB 401H General Biochemistry (3) is the first course of the honors general biochemistry series, a sequence designed to prepare students for careers and graduate study in the life sciences. Overall, biochemistry describes, in chemical and molecular terms, the structures, mechanisms, and chemical processes at work in all living things, and abstracts organizing principles that underlie life in all its diverse forms. Building upon concepts introduced in molecular and cellular biology and in organic chemistry, students in BMB 401H synthesize and apply this knowledge toward understanding the structure and function of the major classes of cellular constituents: water, and the various macromolecules -- amino acids and proteins, sugars, and polysaccharides, nucleotides and nucleic acids, fatty acids and lipids, and membranes and various membrane proteins. These molecules interact to comprise the next level of multi-and mixed molecular structures and organelles that enable a cell to carry out its many metabolic functions. Students also learn about the technologies used to study cellular components and processes, and current advances in biotechnology that have accelerated the pace of discovery in the field. Having gained familiarity with the molecules found in a cell, students are well-equipped to take on more advanced topics in the exciting, rapidly-evolving fields of the life sciences. An overriding theme in biochemistry is that polymers of living systems, though structurally large and functionally complex, are highly ordered chemical entities, with specific sequences of monomeric subunits giving rise to discrete structures and functions. The course begins with an introduction to proteins, covering the structural basis of protein functions and then moves on to enzyme kinetics and mechanisms. Next, students explore simple and complex carbohydrates and topics in glycobiology that include energy storage, framework skeleton, and specific molecular recognition. Various classes of lipids, including phospholipids, complex lipids, membrane biology and transport systems, are covered next. Following is an analysis of the biochemical basis of signal transduction describing how specific signals regulate biomolecular activity-within a cell, and between cells-to keep an organism in homeostasis. Lastly, as a transition to intermediary metabolism in BMB 402H, an introduction to bioenergetic principles is included to provide a framework for understanding pathways of carbon and nitrogen metabolism, using glycolytic reactions as an example. Students may not receive credit for both CHEM 476 and BMB 401H.", "prerequisite": "CHEM 212", "other": ["Honors"]}, {"department": "BMB", "number": "402", "credits": "3 Credits", "description": "BMB 402 General Biochemistry (3) is a comprehensive survey of the pathways and regulation of intermediary metabolism. Most, if not all, of the students taking BMB 402 intend to pursue a Ph.D., M.D. or M.D./Ph.D. degree after graduation. Since biochemistry is an important discipline for advanced studies in life and medical sciences, a major goal of BMB 402 is to prepare students well for their future challenges in graduate or medical school. The major topics covered include glycolysis, TCA cycle, metabolism of fatty acids, lipids (phospholipids, cholesterol and sphingolipids), amino acids and nucleotides, signal transduction, and human genetic diseases. Since biochemistry is a very rapidly progressing discipline, any new developments not covered by the textbook are introduced in the lectures or via discussion of current scientific papers at an appropriate level. In addition, students must be able to integrate information learned from different but related material.", "prerequisite": "BMB 401"}, {"department": "BMB", "number": "402H", "credits": "3 Credits", "description": "Comprehensive survey of the pathways and regulation of intermediary metabolism. BMB 402H General Biochemistry (3) provides a more intimate and interactive class environment than does BMB 402. Most, if not all, of the students taking BMB 402H intend to pursue a Ph.D., M.D. or M.D./Ph.D. degree after graduation. Since biochemistry is an important discipline for advanced studies in life and medical sciences, a major goal of BMB 402H is to prepare students well for their future challenges in graduate or medical school. The textbook used is more advanced than that used in BMB 402, and it is what is typically used in biochemistry courses taught at premier medical schools and graduate schools. The class is conducted at a challenging level to provide students with the opportunity to treat topics in greater depth and to explore current development more fully than is possible in BMB 402.The major topics covered include glycolysis, TCA cycle, metabolism of fatty acids, lipids (phospholipids, cholesterol and sphingolipids), amino acids and nucleotides, signal transduction, and human genetic diseases. Since biochemistry is a very rapidly progressing discipline, any new developments not covered by the textbook are introduced in the lectures or via discussion of current scientific papers at an appropriate level. BMB 402H exams require that students understand all aspects of a particular metabolic pathway under study, including the sequential steps of the pathway, chemical structures of all intermediates, the mechanisms of all key reactions, regulation of the pathway, and the relationships with other pathways. In addition, students must be able to integrate information learned from different but related material.", "prerequisite": "BMB 401", "other": ["Honors"]}, {"department": "BMB", "number": "403", "credits": "1 Credits", "description": "An introduction to techniques of experimental biochemistry, illustrating principles covered in B M B 402."}, {"department": "BMB", "number": "406", "credits": "3 Credits", "description": "A discussion of current aspects of cell molecular biology with a laboratory emphasizing current biotechnology techniques.", "prerequisite": "BIOL 222"}, {"department": "BMB", "number": "408", "credits": "1-2 Credits/Maximum of 2", "description": "Participation in the instruction of undergraduate laboratory and lecture courses, including classroom preparation; discussion of principles and objectives of each exercise.  B M B 408 Instructional Practice (1-2) Students in this course will gain experience in science teaching by participating in either lecture courses (as Learning Assistants) or laboratory courses (as Teaching Assistants) with the goal of making students in this course more effective as teachers and communicators in their future careers in science. Participation in instruction of selected departmental lecture and laboratory courses will include preparation of class materials, and facilitating discussion and presentation of course principles and learning objectives of each topic or exercise.", "prerequisite": "10 credits in biochemistry and molecular biology and permission   of the department"}, {"department": "BMB", "number": "411", "credits": "1 Credits", "description": "An introduction to readings and oral presentations in biochemistry and molecular biology.", "prerequisite": "BMB 401"}, {"department": "BMB", "number": "428", "credits": "3 Credits", "description": "This course uses the study of physical chemistry to develop quantitative and analytical skills in biological and chemical systems. The course covers thermodynamics, solution chemistry and kinetics. The study of thermodynamics includes the three laws of thermodynamics, and the concepts of energy, entropy and enthalpy. Solution chemistry includes the study of colligative properties, ligand binding and energetics in biological systems. Kinetics covers the study of both chemical and enzyme kinetics, as well as enzyme inhibition.", "prerequisite": "MATH 141"}, {"department": "BMB", "number": "428H", "credits": "3 Credits", "description": "Chemical thermodynamics and kinetics with applications to biological problems.", "other": ["Honors"]}, {"department": "BMB", "number": "430", "credits": "3 Credits", "description": "Developmental Biology introduces students to one of the most complex and exciting areas of modern biology. This course will cover basic concepts using a comparative embryology approach and focus on molecular and genetic analysis of mechanisms involved in cell differentiation and organ development. Students will learn how studies of development in different model organisms including invertebrate and vertebrate species have identified a network of evolutionarily conserved genes and signaling pathways that regulate embryonic development and morphogenesis.", "prerequisite": "BMB 252", "other": ["Cross-listed with: BIOL 430"]}, {"department": "BMB", "number": "432", "credits": "3 Credits", "description": "The study of signaling pathways that regulate the immune response. BMB 432 / MICRB 432 / VBSC 432 Advanced Immunology: Signaling in the Immune System (3)This course will use the immune system as a model in which to study how cells communicate in order to coordinate an immune response. We will focus on signaling mechanisms that regulate such immune responses as T cell activation, Thl/Th2 differentiation, macrophage activation, and migration of immune cells to sites of inflammation. All lectures are based on recent reviews by key investigators in each field, as well as primary articles to present students with the most recent advances, techniques, and approaches used. The goal of the course will be to convey a basis understanding of intracellular signaling mechanisms that will pertain to all areas of biology, an appreciation for current questions and future directions in the field, and an in depth understanding of the signals that govern immune responses. The material presented will build on the basic concepts learned in BMB 400 and MICRB 410, and will lay the foundation for more advanced courses at the graduate level.", "prerequisite": "BMB 251", "other": ["Cross-listed with: MICRB 432, VBSC 432"]}, {"department": "BMB", "number": "433", "credits": "3 Credits", "description": "In-depth coverage of processes by which drugs/chemicals interact with biological systems and the experimental approaches used to study these interactions.", "prerequisite": "BMB 401", "other": ["Cross-listed with: VBSC 433"]}, {"department": "BMB", "number": "435", "credits": "3 Credits", "description": "Viral Pathogenesis provides students with a general knowledge of medically relevant viruses, with a specific focus on important human viral pathogens. The course is meant to help students understand how viruses cause diseases in humans and animals. Lectures and in-class discussions will focus both on the fundamentals of viral infection and disease mechanisms, and on contemporary virology-related topics in the scientific literature. Topics discussed can be divided into two main areas: (1) general concepts related to viral pathogenesis and the control of viral infections; and (2) specific viruses that cause human disease including HIV-1, herpes viruses, papillomaviruses, influenza virus, West Nile virus, Ebola virus, and SARS virus. Although prior knowledge of virology is not required for taking this course, a working knowledge of molecular biology, cell biology, immunology, and some microbiology is helpful.", "prerequisite": "MICRB 201", "other": ["Cross-listed with: MICRB 435, VBSC 435"]}, {"department": "BMB", "number": "442", "credits": "3 Credits", "description": "Laboratory in enzyme purifications and assay techniques; nucleic acid isolation and characterization, including plasmid preparation. BMB 442 / MICRB 442 Laboratory in Proteins, Nucleic Acids, and Molecular Cloning (3)The DNA portion of B M B/MICRB 442 serves as an introduction to fundamental techniques of recombinant DNA technology and as a reinforcement of principles of Molecular Genetics from lecture courses. The central experiment entails all basic procedures necessary to clone a gene, i.e. to make a recombinant molecule comprised of DNA from two sources. Students use restriction enzymes to cut two distinct DNA molecules into smaller fragments. The fragments are mixed and treated with the enzyme Ligase, which randomly combines small fragments into large recombinant DNA molecules in new combinations different in composition from either original molecule. The recombinant molecules, which include genes that confer drug resistance, are transformed intoE. coli cells that initially have no drug resistance. Cells that acquire recombinant DNA molecules are identified by selective plating on growth media containing drugs. From the transformed cells, recombinant DNA is isolated and analyzed by agarose gel electrophoresis, completing the array of basic gene cloning techniques. In addition to this central, multi-session experiment, students also do PCR and an investigation of the lac operon, a classic molecular genetic model system. The proteins portion of BMB 442 / MICRB 442 is designed to introduce students to protein biochemistry topics and laboratory techniques typically encountered in academic and commercial settings. Students will learn about buffers, spectroscopy, enzyme purification and characterization methods. Specifically, the experiments include preparation of buffers and performing kinetic studies to determine Km and Vmax values. Separation of a mixture of phycobiliproteins using ion-exchange column chromatography is a major experiment that the students will perform to learn protein purification methods. In this experiment they will learn how to pour a column, apply sample, elute it with salt gradient and collect fractions using automated fraction collector. Ammonium sulfate precipitation and dialysis will be part of protein purification procedures. Characterization of the separated proteins will be performed by determining the absorption spectra with spectrophotometer and by determining the molecular weights of the subunits of the phycobiliproteins by SDS-polyacrylamide gel electrophoresis.", "prerequisite": "CHEM 202"}, {"department": "BMB", "number": "443W", "credits": "3 Credits", "description": "This course is intended to provide advanced Biochemistry & Molecular Biology students with in class instruction on various laboratory methods used to explore the physical & chemical properties of proteins and other topics relevant to enzymes such as protein purification techniques and enzyme kinetic assays. In addition students will have hands-on laboratory experience conducting experiments related to 1) enzyme kinetics and product inhibition pattern to determine the order of product release, 2) purification of proteins such as rabbit muscle aldolase using a variety of protein purification methods including salt precipitation, dialysis, and ion-exchange/affinity chromatography using phosphocellulose resin, 3) determination of specific activity and purity of a student purified protein, 4) determination of molecular weight of native enzymes using gel-filtration-HPLC and subunit molecular weight by SDS-PAGE, 5) determination of isoelectric point and identification of C-terminal amino acid of a purified protein, and 6) determination of optimal conditions for protein crystal growth. Student performance is evaluated through a variety of assessments, including lab reports organized in accordance to the biochemistry journal articles and through written examinations that assess the understanding of principles and methodology.", "prerequisite": "BMB 442", "other": ["Writing Across the Curriculum"]}, {"department": "BMB", "number": "445W", "credits": "2 Credits", "description": "Laboratory in molecular techniques in gene analysis and microbial genetics, emphasizing in vitro methodologies. BMB 445W Laboratory in Molecular Genetics I (2) The objectives of BMB 445W are to provide advanced Biochemistry and Microbiology students with instruction in (1) techniques commonly used in modern research and clinical laboratories in this field, (2) evaluation of the quality of experimental data, including appropriate analysis, and (3) presentation of results of laboratory work in written form. Experiments are focused on key techniques and procedures such as DNA isolation, polymerase chain reaction, Southern hybridization analysis, cloning, and DNA sequencing. Students are evaluated via written lab reports and written examinations that assess the understanding of principles and methodology. BMB 445W is an extension of the nucleic acid section of BMB 442, which is a prerequisite for BMB 445W.", "prerequisite": "BMB 442", "other": ["Writing Across the Curriculum"]}, {"department": "BMB", "number": "448", "credits": "2 Credits", "description": "Advanced laboratory that uses inquiry-based approaches to analyze organelles, genetic mechanisms, and metabolic processes in eukaryotic organisms.", "prerequisite": "BMB 251"}, {"department": "BMB", "number": "450", "credits": "3 Credits", "description": "Emphasis will be on the role of mutations in the analysis of gene function; a detailed analysis of replication, transcription, translation, recombination and DNA repair. The course will also delve into the mechanisms involved in the regulation of gene expression both at the individual gene level as well as on a \"global\" scale. The course will examine the structure, replication and utilization of plasmids, transposons and bacteriophages, particularly focusing on their roles in the horizontal transfer of DNA between bacteria. The course will include both formal lecture presentations by the instructor as well as presentations of published research related to the field of bacterial genetics whenever possible.", "prerequisite": "BMB 251", "other": ["Cross-listed with: MICRB 450"]}, {"department": "BMB", "number": "460", "credits": "3 Credits", "description": "Mechanisms and regulation of protein trafficking, organelle biosynthesis, cell development, signaling and cell cycle control. Emphasizes experimental design and analysis. BMB 460  / MICRB 460 Cell Growth and Differentiation (3) is a unique course that uses the primary literature to teach significant content in advanced cell biology while simultaneously exposing students to the scientific craft of experimental design and analysis. In addition to exploring historical and current cell biology research articles, students will develop two vital scientific skills; critical thinking as applied to experimental data and creative thinking about solving unresolved questions in cell biology. In this course students will read from journals to explore questions about cell biology and how cell biologists decipher cell functions. Instead of a general survey of cell biology, we delve into specific issues, often looking at \"classic\" papers describing how a specific phenomenon was first investigated to place current questions in context before progressing to the latest publications exploring how innovative techniques have been applied to deciphering cell function. The course is divided into units, each of which emphasizes content in a different area. Actual content may vary from year to year as the course is updated to reflect progress in a field of research. We have previously explored the general areas of cell membrane dynamics, intracellular protein trafficking, cell cycle regulation, cell signaling pathways and cancer cell biology. Finally, the course ends with a unit on stem cells and therapeutic cloning technology. A portion of the final unit is also devoted to discussing the ethical implications of stem cell research with an emphasis on how to make personal decisions about how our society should approach these issues. Reading guides are provided for each assignment to help students find and understand important points in reading assignments. Class periods are devoted to explanations and instructor-led discussions about the readings with an emphasis on understanding the questions, the methods used to approach the questions, the experimental results and the interpretations of the results. Furthermore, periodic class periods are dedicated to experimental approach exercises where students work in groups to practice posing new questions as suggested by our readings and proposing experiments to answer these questions. These skills are vital part of what cell biologists do daily, and these exercises provide practice in thinking like a scientist. Students have previously reported that by taking this course they acquired the ability to read and understand the primary literature and have gained an in-depth understanding about how to use various experimental techniques.", "prerequisite": "BMB 252", "other": ["Cross-listed with: MICRB 460"]}, {"department": "BMB", "number": "464", "credits": "3 Credits", "description": "An exploration of the impact of advances in molecular biology on understanding disease mechanisms, medical diagnosis, and therapeutics.", "prerequisite": "BMB 251"}, {"department": "BMB", "number": "465", "credits": "3 Credits", "description": "A study of the relationships among protein sequence, structure, and function. Course topics include description of protein structure, molecular viewing, forces that govern protein folding, macromolecular recognition, enzyme catalysis, experimental determination of protein structure, computational methods for structure prediction, and protein engineering and design.", "prerequisite": "BMB 251"}, {"department": "BMB", "number": "474", "credits": "3 Credits", "description": "Physical/chemical theory and techniques that emphasize purification and characterization of biological macromolecules, including proteins, lipids and nucleic acids.  B M B 474 Analytical Biochemistry (3)This three-credit course deals with acquiring knowledge of laboratory skills required for success in experimental biochemistry and molecular biology. It is particularly suited for students intending a career as a research scientist in the areas of biochemistry, biotechnology, bioengineering, microbiology, or molecular biology. Course content focuses on the detection, purification and identification of biological macromolecules such as practice of separation science with emphasis on diffusion, gel permeation chromatography, ion-exchange chromatography, affinity chromatography, sedimentation velocity ultracentrifugation, sedimentation equilibrium ultracentrifugation, density gradient ultracentrifugation, agarose gel electrophoresis, SDS gel electrophoresis, isoelectrofocusing, membrane filtration and dialysis (including Donan equilibrium), ligand binding, high performance gas chromatography, high performance liquid chromatography, mass spectrometry, and immunological methods of macromolecules. The second unit includes the theory and practice of biological spectroscopy with emphasis on visible, infrared, circular dichroism, optical rotary dispersion, Raman, resonance Raman, nuclear magnetic resonance, electron paramagnetic resonance, Mossbauer, surface plasmon resonance, electron-nuclear double resonance, and electron spin echo spectroscopy of macromolecules. The lectures are designed to introduce a particular topic, to derive relevant equations, to supplement reading material with practical examples, and to clarify points in assigned problem sets. Two guest lectures by experts in the field will provide up-to-date information on mass spectroscopy and Mossbauer spectroscopy, and two site-visits, one to the mass spectrometry core facility and the other to the magnetic resonance core facility, will provide hands-on experience. Problem sets are not collected or graded; rather, answers are handed out in the following class period. This method provides the ability to collaborate with others on solving problems and to self-check work.", "prerequisite": "BMB 428"}, {"department": "BMB", "number": "480", "credits": "3 Credits", "description": "BMB 480 / MICRB 480 Cancer Development and Progression (3) explores how cancer initiates and progresses with a focus on the interactions between tumor cells and normal tissues in the body. The goal of the course is to build fundamental knowledge of the mechanisms that drive cancer, and the current advances and challenges in cancer treatment. Genetic, biochemical, mechanical, and metabolic aspects of cancer will all be discussed along with relevant experimental techniques. RNA and DNA viruses that cause cancer will be highlighted as agents leading to the discovery of oncogene and tumor suppressor signaling pathways, and as ongoing contributors to cancer-related death. Significant attention will be given to the role of the immune system in cancer development, prevention, and treatment. By understanding mechanisms leading to the disruption of signaling pathways in cancer, students will develop a framework of how hallmark features of cancer arise and what corresponding therapeutic strategies have been developed to target them. Students are expected to participate in lectures and take part in discussion and analysis of scientific literature. This course applies core concepts from genetics, biochemistry, and cell biology to the study of cancer and provides a useful foundation for students interested in pursuing related graduate research or medical studie", "prerequisite": "BMB 252", "other": ["Cross-listed with: MICRB 480"]}, {"department": "BMB", "number": "482", "credits": "3 Credits", "description": "Modern DNA sequencing technologies have transformed molecular biology into a data science. Sequencing machines can now read hundreds of millions of DNA sequence fragments in a few hours and at low cost. These technologies not only enable affordable sequencing of individual genomes (human or any other species); they also allow us to investigate numerous ways in which the genome performs its biological functions in different cell types and how mutations in genomes give rise to various phenotypes. However, given the volume of data and the noisy nature of biological measurements and signals, we require intelligent and efficient computational algorithms to make sense of genomic datasets. The discipline of bioinformatics and computational biology aims to meet this need. This course focuses on understanding and applying the computational methods and algorithms that are used to analyze genomic data, in particular the large datasets arising from high-throughput DNA sequencing technologies. During the course, we will focus on several application areas in genomics that require computational analyses. These topics will be organized around three main themes: - Genomes: comparing DNA and protein sequences; locating sequences on the genome; assembling genomes. - Evolution: reconstructing evolutionary relationships; personal genomics; detecting disease-associated genome variations. - Function: understanding biochemical activities using functional genomics; discovering functional elements in genome sequences; characterizing regulatory relationships between genes. For each of the genomics topics listed above, we will focus on understanding the computational algorithms that are used to analyze data. Such algorithms may include dynamic programming (sequence alignment), graph algorithms (assembly), clustering methods (phylogenetics & metagenomics), and machine-learning approaches such as Expectation Maximization, Gibbs sampling, and Hidden Markov Models (various applications in discovering functional genomic elements). Students will also develop practical bioinformatics analysis skills throughout the course. Each bioinformatics topic will be accompanied by practical exercises. Students will also work in teams to research and develop a project that applies computational methods to a genomics-related problem.", "prerequisite": "BMB 251"}, {"department": "BMB", "number": "484", "credits": "3 Credits", "description": "Biochemical, genetic and evolutionary approaches to comprehensive discovery of functional DNA segments in genomes, including genes and regulatory sequences. BMB 484 Functional Genomics (3) What in your genomic DNA makes you different from chimpanzees, mice or flies? What sequences in your DNA make it more or less likely that you will develop diabetes or cancer? These are questions of widespread interest, answers to which could play major roles in personalized medicine and in understanding our place in the biosphere. Modern genomic analysis uses powerful technologies and generates massive amounts of data, which are yielding exciting insights into answering these questions. One hallmark of genomic research is that data are released rapidly along with tools for browsing and analyzing it. Thus not only can you learn the major results by reading papers, but you can examine the underlying data and do your own analyses. Discovery is no longer the exclusive domain of the data producers - you can join in!This course will introduce students to ongoing research aimed at identifying functional regions in genomes and encourage them to use web-based bioinformatics tools for exploring the genomic and epigenetic data. Students will develop creative projects that address issues in functional genomics of high interest to them.The course has two phases, the first on the basics of genomics (sequencing, alignment, assembly, resources), and the second on the search for functional elements in genomes. The course will explore ways to find:- Protein-coding genes within genomes- Transcribed regions: How much of the genome is transcribed? Which transcribed regions do not code for proteins? What roles do they play in the cell (regulatory and enzymatic)?- Evolutionary signatures of function: How can you use genome comparisons between species to estimate the amount of functional sequence - and to identify it?- Non-genic functional sequences: How do you map epigenetic features associated with gene regulation, such as histone modifications, DNase hypersensitive sites, and transcription factor occupancy?- Function by phenotype: Given the ability of genetic association to find loci that contribute to complex traits, such as disease susceptibility, how does functional genomics aid in finding basis of these traits?", "prerequisite": "BMB 251"}, {"department": "BMB", "number": "485", "credits": "3 Credits", "description": "The purpose of this course is to introduce students to the field of Human Genomics and Biomedical Informatics, in particular in the context of genetic architecture of complex human diseases and traits. The field of Human Genomics has experienced a massive explosion in data generation technologies, new discoveries, and increasing popularity in many scientific fields. This course will cover the molecular, statistical, population, and analytical aspects of modern human genomics and translational aspects of this field in biomedical informatics. Current methods to uncover the complex underpinnings of disease including methods to explore gene-gene and gene-environment interactions and data integration will also be covered.", "prerequisite": "BIOL 322", "other": ["Cross-listed with: VBSC 485"]}, {"department": "BMB", "number": "488", "credits": "2 Credits/Maximum of 16", "description": "The course combines laboratory research in a community of practice and a seminar on topics in science, ethics, and society.", "prerequisite": "MICRB 202"}, {"department": "BMB", "number": "490", "credits": "3 Credits", "description": "In BMB 490, students will form a collaborative team to explore a research topic in cell and molecular biology. Students will learn about experimental design, laboratory techniques, data analysis, and interpretation of data. By the end of the fall semester, students will have conducted and analyzed 2-3 experiments and gained background knowledge and hands-on experience in various techniques in cell and molecular biology. BMB 490 students may choose to continue their research in BMB 491, allowing students to complete a fast-tracked start-to-finish research project that goes from designing experiments all the way through to writing up and presenting findings.", "prerequisite": "BMB 251"}, {"department": "BMB", "number": "491", "credits": "3 Credits", "description": "BMB 491 is designed to be a continuation of BMB 490. Through BMB 490/491, students will complete a fast-tracked start-to-finish research project and in doing so will learn to perform, explain, apply, and interpret good science. In BMB 491, students focus on effectively communicating scientific findings and preparing their data for publication. Students will use a variety of media to communicate science across different audiences. They will prepare written, oral, and visual presentations while learning to adapt content and style for different contexts. Students will complete major projects in stages, guided by weekly exercises and lectures on content, structure, and formatting for different types of scientific writing. Students will also learn how to assemble figures and visual aids to communicate their approaches and findings. Readings and figures from the scientific literature will provide opportunities to evaluate methods of visual and written communication, while continuing to promote a deeper understanding of cell structure and function. Building expertise across BMB490/491 in an area of cell and molecular biology allows students to critically evaluate the content and style of published articles, and to build conclusions about their own research results. Students will also engage in extensive peer review and will be expected to incorporate feedback into improving their writing and presentation skills. Throughout this course, students will gain an appreciation for the importance of effective communication in science, and will build the skills necessary to logically, accurately, ethically, and persuasively communicate. These skills will be extremely valuable in research-related careers, but also apply to any position where students act as consumers, producers, advocates, or interpreters of science.", "prerequisite": "BMB 490", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "BMB", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "BMB", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "BMB", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]