[{"department": "CC", "number": "200", "credits": "3 Credits", "description": "As a field, Corporate Communication involves taking organizational goals and translating them into communication strategies and tactics inside and outside the organization as well as managing communication processes on an ongoing basis. Corporate Communication is complex, dynamic, and involves navigating various communication channels. As a lower-level introduction to Corporate Communication, this course introduces fundamental concepts, theories, and practices in Corporate Communication by providing a basic overview for students within the major/minor, as well as those who may not necessarily go on to major in the field. The course emphasizes the application of Corporate Communication concepts for any contemporary professional.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CC", "number": "401", "credits": "3 Credits", "description": "Explores the various ways organizations communicate with internal stakeholders, including senior leaders, managers, and frontline employees. CC 401 focuses on strategic communication processes between the organization and internal stakeholders such as senior leaders, managers, and frontline workers. The course explores the effective use of internal media, including intranet content, emails, social media content (strongly directed at internal audiences), memos, reports, newsletters, brochures, training content, and speeches. Considerable attention will be given to how to write effectively for each channel. Emphasis will also be placed on the importance of strategically coordinating internal communication and sustaining the overall function. CC 401 provides a thorough grounding in one of the two major subdivisions of the Corporate Communication field (with external communication as the other major subdivision). As an advanced course in the major, CC 401 provides considerable depth in terms of concepts, theories, and practices. Students will mainly need to apply, analyze, evaluate, and synthesize/create in this course. Students will primarily explore internal communication in terms of present day practices and future trends.", "prerequisite": "CC 200"}, {"department": "CC", "number": "402", "credits": "3 Credits", "description": "Explores the various ways organizations communicate with external stakeholders. CC 402 focuses on the process of communication with external stakeholders. An integral part of Corporate Communication, external communication is an integrated function that includes building relationships and writing for the traditional media, creating materials such as advertisements and brochures, writing for the web, and creating credible spokespeople. As such, this course focuses on identifying and defining methods of external communication, as well as, how to write effectively for each communication channel. Students will gain experience in core Corporate Communication competencies, including writing media releases, integrating content and design, and evaluating communication effectiveness.", "prerequisite": "CC 200"}, {"department": "CC", "number": "404", "credits": "3 Credits", "description": "Explores crisis communication theory and practice as related to internal and external processes. Every organization will encounter crisis. Understanding how to communicate before, during, and after a crisis can dramatically alter the trajectory of an organization. This course approaches the topic of crisis holistically, as part of the organizational lifecycle, with a focus on internal and external organizing, and ultimately positions crisis as an organizational learning opportunity. The course is broken into four sections: key concepts, and pre-, during, and post-crisis organizing and communicating. The first section will cover foundation concepts such as crisis, risk, and uncertainty, as well as provide an overview of crisis types and stages. The second section of the course will explore pre-crisis issues such as risk assessment, crisis management teams and plans, and contingencies for crisis eventualities. The third section will focus on the acute stage of crisis, including activating the crisis management plan and exogenous variables that affect crisis communication. The final section of the course will focus on the post-crisis stage, including organizational learning, evaluation, and preparing for future crises.", "prerequisite": "CC 200"}, {"department": "CC", "number": "405", "credits": "3 Credits", "description": "This course addresses the design and delivery of strategic spoken word communications with stakeholders inside and outside organizations. CC 405 concentrates on strategic spoken word communications used to advance overall Corporate Communication goals inside and/or outside the organization. The course specifically addresses group-based speaking and/or speaking potentially shared with a large number of individuals through electronic means. For each of various contemporary modes of strategic spoken expression, students will learn standard elements, examine industry examples, create an original design, and deliver an original performance. CC 405 will be an additional elective course in the Corporate Communication major. It is designed to integrate with the internal-external conceptual model used throughout the Corporate Communication major. As an advanced course in the major, CC 405 provides considerable depth in terms of concepts, theories, and practices. Students will mainly need to apply, analyze, evaluate, and synthesize/create in this course. Students will primarily explore strategic speaking in terms of present day practices and future trends.", "prerequisite": "CC 200"}, {"department": "CC", "number": "406", "credits": "3 Credits", "description": "Explores the internal and external functions of social media in organizations, with a focus on organizational-stakeholder relationships. Social media allows organizations to connect and build dialogic relationships with stakeholders, and is therefore an integral part of the Corporate Communication field. This course discusses the role of social media in Corporate Communication, the communicative and social functions that social media technology enables, issues of appropriate and effective use, social media use from both the organizational and stakeholder point of view, and the ethical considerations of using social media. Emphasis will be placed on theoretical understanding and practical application in the context of organizations seeking to advance internal and external communication goals. This course integrates the internal/external communication focus that shapes the Corporate Communication major by focusing on the different types of messages, platforms, and issues that are unique to each audience, while also emphasizing how to create synergistic organizational messages that resonate with both internal and external audiences.", "prerequisite": "CC 200"}, {"department": "CC", "number": "490W", "credits": "3 Credits", "description": "Explores and applies concepts and theories to various cases, emphasizing written development of strategies relevant to the internal and external organization. This course explores Corporate Communication as it encompasses both the internal and external organization. It takes a comprehensive approach to exploring theory and application in the context of specific cases. Course content builds on and unifies other required courses in the major. Coursework will primarily involve students developing major strategies and related tactics for existing or newly emerging organizations. Coursework may also involve students applying Corporate Communication concepts and theories to the development of their own career plans. This course emphasizes student synthesis and creativity in applying theory and research from Corporate Communication and allied fields to the total organization. The course will typically include analysis and evaluation of practitioner and scholarly readings, students' work, and case studies.", "prerequisite": "CC 401", "other": ["Writing Across the Curriculum"]}, {"department": "CC", "number": "495", "credits": "3 Credits", "description": "CC 495A Internship in Corporate Communication (3) Communications experience in businesses or agencies that may include activities in writing, media production, planning, public relations, advertising, employee relations, or training.", "prerequisite": "CC 401"}, {"department": "CC", "number": "495A", "credits": "3 Credits/Maximum of 3", "description": "CC 495A Internship in Corporate Communication (3) Communications experience in businesses or agencies that may include activities in writing, media production, planning, public relations, advertising, employee relations, or training.", "prerequisite": "CC 200"}]