[{"department": "CHE", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CHE", "number": "99", "credits": "1-3 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction."}, {"department": "CHE", "number": "100", "credits": "1 Credits", "description": "The exploration of Chemical Engineering and available career opportunities.", "other": ["First-Year Seminar"]}, {"department": "CHE", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "CHE", "number": "210", "credits": "3 Credits", "description": "An integrated approach to the study of material balances and industrial chemical processes important in chemical engineering. The objective of this course is to present an introduction to chemical engineering calculations, establish mathematical methodologies for the computation of material balances and to present an overview of industrial chemical processes. It is the introductory course in the chemical engineering curriculum and is normally taken in the sophomore year. It is prerequisite for several junior-level courses in the curriculum, including courses in process fluid dynamics, heat transfer and phase equilibrium.", "prerequisite": "MATH 141"}, {"department": "CHE", "number": "210H", "credits": "3 Credits", "description": "An integrated approach to the study of material balances and industrial chemical processes important in chemical engineering. The objective of this course is to present an introduction to chemical engineering calculations, establish mathematical methodologies for the computation of material balances and to present an overview of industrial chemical processes. It is the introductory course in the chemical engineering curriculum and is normally taken in the sophomore year. It is prerequisite for several junior-level courses in the curriculum, including courses in process fluid dynamics, heat transfer and phase equilibrium.", "prerequisite": "MATH 141", "other": ["Honors"]}, {"department": "CHE", "number": "220", "credits": "3 Credits", "description": "This is the introductory course in chemical engineering thermodynamics and is normally scheduled in the sophomore year. It places emphasis in the development of the theory of thermodynamics of pure fluids with applications to small- and large-scale processes with multiple streams and energy exchanges, computation heat and work loads, and assessment of efficiency with respect to energy utilization. Starting from small units, such as pumps, compressors, turbines, and heat exchangers, examples grow to include large systems such as power plants and refrigeration cycle, that may involve many interconnected units and recycle streams. A parallel focus of the course is in the computation of thermodynamic properties through the use of charts, tables, and equations of state with emphasis on non-ideal systems.", "prerequisite": "MATH 141"}, {"department": "CHE", "number": "220H", "credits": "3 Credits", "description": "This is the introductory course in chemical engineering thermodynamics and is normally scheduled in the sophomore year. It places emphasis in the development of the theory of thermodynamics of pure fluids with applications to small- and large-scale processes with multiple streams and energy exchanges, computation heat and work loads, and assessment of efficiency with respect to energy utilization. Starting from small units, such as pumps, compressors, turbines, and heat exchangers, examples grow to include large systems such as power plants and refrigeration cycle, that may involve many interconnected units and recycle streams. A parallel focus of the course is in the computation of thermodynamic properties through the use of charts, tables, and equations of state with emphasis on non-ideal systems.", "prerequisite": "MATH 141", "other": ["Honors"]}, {"department": "CHE", "number": "230", "credits": "1 Credits", "description": "This 1-credit course will cover the key computational tools needed by Chemical Engineering students.  CH E 230 Computational Tools for Chemical Engineering (1) This 1-credit course will cover the key computational tools needed by Chemical Engineering students. Specific topics of interest include: constructing high quality graphs, statistics and linear regression, solving coupled algebraic equations, solving ordinary and partial differential equations, and matrices.", "prerequisite": "MATH 251"}, {"department": "CHE", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"department": "CHE", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "CHE", "number": "296H", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses.", "other": ["Honors"]}, {"department": "CHE", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CHE", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "CHE", "number": "300", "credits": "1 Credits", "description": "Lectures and discussion by visiting engineers and faculty on chemical engineering, job selection, patents, licensing, ethics, and other professional problems.  CH E 300 Professional Development Seminar (1) The course objective is to offer an orientation to the chemical engineering profession and to promote professional attributes such as professional ethics, lifelong learning, and awareness of environmental and societal factors and to highlight their importance in the career lives of chemical engineers. The course consists of a one-hour lecture each week by visiting speakers and Penn State faculty. For some lectures, reading material is distributed a week before the lecture and in some cases, the students must turn in the questionnaire in which they have to answer various questions related to the topic of that week. The topics vary from year to year, but several key topics are included each time the course is taught: ethics, environmental issues, process safety, patent law and intellectual property, graduate school, and job opportunities in various industries.", "prerequisite": "Fifth semester standing"}, {"department": "CHE", "number": "320", "credits": "3 Credits", "description": "The course covers the fundamentals of phase and chemical equilibrium with emphasis on vapor/liquid systems and their applications to separation processes. It is the second course in chemical engineering thermodynamics and leads to the study of separations and reacting systems. Computational methodologies are presented for the calculation of the properties of mixtures and the construction of phase diagrams (P-x-y, T-x-y) using activity coefficients or equations of state. The theory is applied to the analysis of equilibrium stage separation such as distillation and extraction, including the construction of McCabe-Thiele diagrams. In the last portion of the course the principles of equilibrium are further applied to chemically reacting systems.", "prerequisite": "CHE 210"}, {"department": "CHE", "number": "330", "credits": "3 Credits", "description": "This course introduces the principles of fluid mechanics that are of fundamental importance to chemical engineers. Students learn to perform scaling and dimensional analysis in physical systems. Student learn to apply microscopic and macroscopic mass, energy, and momentum balances in flowing systems, and apply them to determine flow patterns for Newtonian fluids in simple geometries. These principles are applied to design flow equipment.", "prerequisite": "MATH 251"}, {"department": "CHE", "number": "330H", "credits": "3 Credits", "description": "This course introduces the principles of fluid mechanics that are of fundamental importance to chemical engineers. Students learn to perform scaling and dimensional analysis in physical systems. Student learn to apply microscopic and macroscopic mass, energy, and momentum balances in flowing systems, and apply them to determine flow patterns for Newtonian fluids in simple geometries. These principles are applied to design flow equipment.", "prerequisite": "MATH 251", "other": ["Honors"]}, {"department": "CHE", "number": "340", "credits": "3 Credits", "description": "This course introduces students to the concepts and principles needed to apply chemical engineering principles to the design, modification, and analysis of biological systems for biotechnology applications. Students will learn to use appropriate search engines to find genes and proteins with desired regulatory or biocatalytic properties. The course will cover: the similarities and differences between biological and chemical processes; statistical analyses of measurements and data; and estimation of enzymatic and growth kinetic parameters.", "prerequisite": "BMB 251"}, {"department": "CHE", "number": "350", "credits": "3 Credits", "description": "The objective of the course is to introduce to students heat transfer mechanisms in solids and fluids and their chemical process applications. At the conclusion of the course, the student should possess the ability to model steady and unsteady heat transfer in simple systems, and design heat exchangers and heat exchanger networks. The development of the material of this course requires use of thermodynamics and fluid mechanics, and sets the basis for the design of reactors and separation processes.", "prerequisite": "MATH 251"}, {"department": "CHE", "number": "360", "credits": "3 Credits", "description": "Mathematical model formulation for chemical and physical processes, including applications of ordinary differential equations and numerical methods.  CH E 360 Mathematical Modeling in Chemical Engineering (3) This course covers the applied mathematical techniques necessary for the simulation of physical and chemical processes such as mass transfer and reacting systems, and the analysis of process dynamics. In the former area, the formulation of ordinary differential equations for a variety of situations of interest to chemical engineers is considered. Numerical methods and mathematical packages that form the basis for computer simulations are emphasized. In the latter area, the notions of steady-state, stability and controllability are introduced. The tools discussed in this course are used in subsequent courses on the analysis and design of chemical reactors and mass transfer processes.", "prerequisite": "MATH 230"}, {"department": "CHE", "number": "396", "credits": "1-6 Credits/Maximum of 12", "description": "CHE 396 is for creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses. CHE 396 is an \"Independent Studies\" course."}, {"department": "CHE", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "CHE", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "CHE", "number": "410", "credits": "3 Credits", "description": "The objective of this course is to present the principles of mass transfer and their application to separation and purification processes. The course develops rate expressions for mass transfer in multiphase, multicomponent systems based on diffusion and convective processes. Starting with Fick's law and macroscopic balances the course moves to the design of large scale separation processes including equilibrium stage and continuous separations for the separation and purification of chemical compounds. Specific separation operations analyzed include distillation, absorption, extraction, membrane units, adsorption. The course also introduces the use of modern software tools in the design of such processes.", "prerequisite": "CHE 230"}, {"department": "CHE", "number": "412", "credits": "3 Credits", "description": "In this course students will apply chemical engineering principles to important environmental problems. These chemical engineering principles include: Material balances, Thermodynamics, phase and chemical equilibrium, transport and chemical kinetics. These principles are critical to solve current environmental challenges such as access to safe drinking water, remediation of contaminated sites and sustainability of chemical processes in the field. In addition to the application of these principles, students will learn the history of the environmental field such as the first use of chlorine as a disinfection, the advent of an activated sludge tank and the development of the first environmental laws. Combining these will allow students to design solutions for current challenges such as emissions of carbon dioxide and excess waste.", "prerequisite": "CHE 210"}, {"department": "CHE", "number": "423", "credits": "3 Credits", "description": "This course provides an overview of current and prospective chemical energy storage and conversion technologies.  CHE 423 Chemical Energy Technology (3) This course provides an overview of chemical energy storage and conversion technologies. Current fossil fuel based conversion processes in power plants and transportation applications will be surveyed. The course will emphasize critical evaluation of alternative conversion technologies, with the goal of providing the skills for quantitative assessment of the potential of various storage and conversion technologies. Current conversion technologies surveyed will include coal power plants, petroleum refineries, and internal combustion engines. Alternative technologies will consider unconventional fossil fuel processing, electrochemical energy conversion, solar energy conversion, and agricultural/biological fuel conversion. A semester long student project will involve generation of a future energy scenario 25-50 years in the future. The class structure is interactive, with readings motivating class period discussions.", "prerequisite": "CHE 210"}, {"department": "CHE", "number": "430", "credits": "3 Credits", "description": "This course teaches the principles of reaction engineering and reactor design. It is one of the core subjects in the chemical engineering curriculum and it is normally scheduled in the senior year. Students learn how to apply stoichiometry in combination with a rate law to design a chemical reactor that produces the desired conversion of reactants and selectivity to products. Students will formulate rate laws from various sources, including experimental data and sequences of elementary reaction steps. The design of various types of chemical reactors is discussed at length, including continuous stirred-tank (CSTR), plug-flow (PFR), continuous-operation and batch-operation reactors, and isothermal vs non-isothermal reactors. Additional topics include heterogeneous reactors, catalytic systems, and the design and optimization of reactor networks. It leads to the capstone design course in which chemical reactors are integrated into a chemical plant.", "prerequisite": "CHE 320"}, {"department": "CHE", "number": "432", "credits": "3 Credits", "description": "Transportation of people and goods in many parts of the world depend almost completely on petroleum fuels, such as gasoline, jet fuel, diesel fuel, and marine fuel. Apart from the fuels, materials that are necessary for operating the combustion engines of cars, trucks, planes, and trains also come from petroleum. These materials include lubricating oils (motor oils), greases, tires on the wheels of the vehicles, and asphalt to pave the roads for smooth rides in transportation vehicles. All petroleum fuels and many materials are produced by processing of crude oil in petroleum refineries. Petroleum refineries also supply feedstock to the petrochemicals and chemical industry for producing all consumer goods from rubber and plastics (polymers) to cosmetics and medicine. This course explains how physical processes and chemical reactions that take place in separate petroleum refinery units are integrated to convert crude oil into desired fuels and materials. Refinery processes are divided into four types that include separation, conversion, finishing, and support. The overall objective of petroleum refining is to convert crude oil into fuels and materials that comply with commercial specifications and environmental regulations. All refining processes and refinery operations are also subjected to the applicable environmental regulations. A historical evolution of process concepts is introduced to demonstrate how the refining efficiency has increased with significant reduction of pollutant emissions from individual refinery processes. The principal objectives of this course are to enable students to: 1. explain the market drivers for the refining industry (ABET student outcome 2). 2. indicate what crude oils consist of and how crude oils are characterized based on their physical properties (ABET 1, 2); 3. express the objectives of petroleum refining and classify the processes used in petroleum refining (ABET 1, 2, 7); 4. demonstrate how a petroleum refinery works and sketch a flow diagram that integrates all refining processes and the resulting refinery products (ABET 2); 5. examine how each refinery process works and how physical and chemical principles are applied to achieve the objectives of each refinery process (ABET 1, 2, 7); 6. assess implications of changing crude oil feedstocks on refinery configuration and propose strategies to resolve conflicts with degrading crude oil quality and increasingly stringent environmental regulations on petroleum fuels (ABET outcome 4, 7); 7. discuss different sources of natural gas and explain how natural gas is processed at well sites and in processing plants with application of selected refinery processes and other physical operations (ABET 1, 2).", "prerequisite": "CHEM 202", "other": ["Cross-listed with: FSC 432"]}, {"department": "CHE", "number": "438", "credits": "3 Credits", "description": "Introduction to the biotechnology field including consideration of upstream and downstream processing of biochemicals.", "prerequisite": "CHEM 212"}, {"department": "CHE", "number": "442", "credits": "3 Credits", "description": "Basic principles of polymer melt processing are reviewed and subsequently applied to the most important industrial processing operations.  MATSE 448 (CH E 442) Polymer Processing Technology (3) MATSE 448 involves both lectures and laboratory experiments illustrating the interrelations between structure, processing conditions, and physical properties of industrial polymer products. Students apply engineering fundamentals and principles of polymer melt rheology to analyze industrial processing operations. Unlike typical polymer processing courses offered at most U.S. universities, MATSE 448 covers detailed analyses of individual processing operations, rather than dwelling on underlying polymer science fundamentals that are covered elsewhere in our curriculum. Students learn to optimize processing variables, given a particular set of materials and conditions, establishing how processing conditions impact the physical properties of finished polymer products. We explore the physics governing processing operations including extrusion, mixing, calendering, blow molding, thermoforming fiber spinning compression molding, injection molding, and nanolithography.", "prerequisite": "MATSE 447", "other": ["Cross-listed with: MATSE 448"]}, {"department": "CHE", "number": "443", "credits": "3 Credits", "description": "Introduction to synthesis, structure, characterization and processing of polymers. Single molecule properties, polymer solutions, glasses, crystals and blends.  CH E 443 Introduction to Polymer Science (3) The objective of this course is to introduce students to the synthesis, structure, characterization and processing of polymers. Emphasis is placed on the molecular origins of polymer properties. The course will provide an overview of single molecule properties and polymeric solutions, glasses, crystals and mixtures from a Chemical Engineering perspective. The course builds on CH E 320, Chemical and Phase Equilibria, to develop a more in-depth description of the thermodynamics of polymers. This course will also build on CHEM 210, Organic Chemistry, to analyze more in-depth strategies for the synthesis of polymers. At the end of the course, the students will be able to evaluate the viability of synthetic pathways for various polymers, estimate the size of polymer chains in solution and in the melt, calculate thermodynamics phase diagrams of polymer blends and solutions, and compare and contrast different approaches to describe the physical properties of polymers.", "prerequisite": "CHE 320"}, {"department": "CHE", "number": "444", "credits": "3 Credits", "description": "\"Chemical Game Theory\" (CGT), uses well-known, rigorous principles from Chemistry and Chemical Engineering to solve strategic decision problems that could be analyzed using Traditional Game Theory (TGT). In strategic decisions, players each can choose from among two or more alternative possibilities, and the outcome depends upon the collective choices from all players. In this course we will analyze some of the premises of TGT as compared with CGT. In CGT, the players' choices are treated as metaphorical molecules, and outcomes are calculated according to chemical reaction methods. The important concept of entropic choices is introduced, and pre-bias effects are included naturally as initial concentrations of reactants. CGT is not a generalization of TGT; rather, it represents contested decision problems differently, and gives different solutions. In this article we use the formalism of Chemistry to provide a \"knowlecular approach\" to analyzing contested decisions. This approach has a rich capacity to represent decision-making scenarios and serve as a decision-making algorithm for contested decisions, where leadership power plays an important role.", "prerequisite": "CHE 210"}, {"department": "CHE", "number": "445", "credits": "3 Credits", "description": "Man has polluted his environment but biotechnology holds great promise for cleansing it and for synthesizing the chemicals that we all need in a modern society in a manner that limits generating new pollution. The course focuses on the application of biological and engineering principles toward the remediation of hazardous wastes and for the synthesis of chemicals in a sustainable manner; i.e., in a manner that limits the production of unwanted compounds. The tools that will be explained for accomplishing this are metabolic engineering, systems biology, and protein engineering. Students will also gain knowledge related to the design of biological contacting devices for waste remediation and green chemistry. Emphasis will also be placed on the evolution of bacterial pathways for accomplishing engineering goals. Discussion will also ensue on societal issues such as the wisdom of the release of genetically-engineered microorganisms and the limitations of biotechnological approaches.", "prerequisite": "CHE 340"}, {"department": "CHE", "number": "446", "credits": "3 Credits", "description": "Fundamental treatment of mass, heat, and momentum transfer; emphasis on transport properties and mathematical models of chemical engineering transport processes. CHE 446 Transport Phenomena (3) This is an intermediate course in transport phenomena intended to expand on the materials introduced in the required undergraduate courses on momentum, heat and mass transfer. It builds on the prerequisite material with a rigorous formulation of transport problems using the conservation principles and flux expressions, and identifies the similarities and differences among the transport processes for momentum, heat, and mass. The main focus of the course is on microscopic treatment of transport problems, with particular emphasis on proper use of dimensional analysis and scaling arguments. Transport phenomena is a rather mathematical subject and the student is assumed to be familiar with ordinary and partial differential equations, elementary vector analysis, and elementary numerical techniques. This course is intended to prepare the student for a graduate-level course in transport phenomena.", "prerequisite": "CHE 330"}, {"department": "CHE", "number": "449", "credits": "3 Credits", "description": "Analysis and design of separation processes for the purification of biological molecules.  CH E 449 Bioseparations (3) This course introduces students to the principles and applications of separation processes used for the purification of biological molecules, including fine chemicals, pharmaceuticals, and therapeutic proteins. By the end of the course students will be able to perform preliminary design calculations and scale-up of specific separation systems including centrifugation, filtration, chromatography, and membrane processes. Students will also be able to develop outlines of overall separation schemes appropriate for the purification of different biological products. This course is required for the Bioprocessing and Biomolecular Engineering Option in Chemical Engineering.", "prerequisite": "CHE 410"}, {"department": "CHE", "number": "450", "credits": "3 Credits", "description": "Analysis of time-dependent variables in chemical process plants; reactor design and control; computer applications. CHE 450 Process Dynamics and Control (3) The course is an introduction to chemical process dynamics and control and is offered as a technical elective. The first part of the course is devoted on the dynamical behavior of systems and the mathematical tools (differential equations, Laplace transforms) used in their analysis. The second part of the course covers the design and operation of various types of controllers, including proportional, integral and differential and their combinations. The theoretical principles are demonstrated with applications to chemical engineering processes such as storage tanks, chemical reactors and separation processes.", "prerequisite": "MATH 251"}, {"department": "CHE", "number": "452", "credits": "3 Credits", "description": "This course provides an overview of Process Safety in the Chemical Industry, focusing on the nature of chemical plant accidents. CHE 452 Chemical Process Safety (3) The course will provide an overview of Process Safety in the Chemical Industry, focusing on the nature of chemical plant accidents, their causes, and steps to eliminate them, with emphasis on inherently safe designs. Chemical Plant accidents deal most often with Flammability and Toxicity issues and these are dealt with in great detail. The role of Human Error in accidents is also examined Actual case studies (including Bhopal, BP Texas City, Piper Alpha) will be examined to show the relevance in today's workplace. The course requires active student participation via discussions of system designs, their weakness and improvements. Guest lecturers will also be invited to supplement the material. This is offered as a senior elective in Chemical Engineering.", "prerequisite": "CHE 320"}, {"department": "CHE", "number": "455", "credits": "3 Credits", "description": "CHE 455 is an elective course that examines the application of chemical engineering principles (thermodynamics, transport, and kinetics) to the analysis of a number of medically related phenomena and devices. Specific topics include drug delivery systems, pharmacokinetics, artificial organs, biological transport phenomena, and temperature regulation. One of the important goals of the course is to understand how chemical engineers go about developing appropriate physical models for complex biological systems. Emphasis will be placed on identifying the key physical / biological phenomena governing the system behavior. Where appropriate, the course will also examine some of the social, political, and economic implications of medical technology in our society, e.g., the artificial kidney program. Students do not need a background in biology or physiology -- the key biological phenomena will be covered at appropriate places throughout the semester.", "prerequisite": "CHE 350"}, {"department": "CHE", "number": "470", "credits": "3 Credits", "description": "The chemical engineering capstone design course introduces the principles of process design and economic evaluation utilizing various industry computer tools, with special emphasis on process simulators. The student will develop critical design logic to evaluate a process, starting with block flow diagrams and simple material balances utilizing practical heuristics and then build the process flowsheet through computer simulation, flowsheet optimization, and detailed equipment design.", "prerequisite": "CHE 350"}, {"department": "CHE", "number": "480M", "credits": "3 Credits", "description": "Data interpretation and analysis from student-operated experiments on pilot-plant equipment. Individual written and oral technical reports. CHE 480M CHE 480M Chemical Engineering Laboratory (Honors) (3) CHE 480M is the laboratory course in chemical engineering. The objectives of CHE 480M is to provide hands-on experience with chemical engineering equipment and consists of a series of experiments that cover the major subjects in chemical engineering, namely, fluid flow, heat transfer, separations and reactions. The subject matter on which these experiments are based is taught in various junior-senior-level classes. This course does not introduce new material but focuses instead on planning, execution and interpretation of experiments. The special aspect of the honors section is that students will be given an open-ended experimental research project.", "prerequisite": "CHE 230", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "CHE", "number": "480W", "credits": "3 Credits", "description": "Data interpretation and correlation from student-operated experiments on pilot-plant equipment. Individual written and oral technical reports. CHE 480W Chemical Engineering Laboratory (3) This is the laboratory course in Chemical Engineering. Its objective is to provide hands-on experience with chemical engineering equipment and consists of a series of experiments that cover the major subjects in chemical engineering, namely, fluid flow, heat transfer, separations and reactions. The subject matter on which these experiments are based is taught in various junior- and senior-level classes. CHE 480W does not introduce new material but focuses instead on planning, execution and interpretation of experiments.The course is team-based and includes laboratory sessions as well as lectures. Evaluation is based on the written and oral reports given based on experiments performed. These reports undergo several drafts, in which at different times students or faculty evaluate the report, suggesting corrections. Course evaluation may also include a \"pre-exam\" to assure that the students understand technical material coming into the course. Peers assess each others' performance (contributing to the grade), as does the faculty.", "prerequisite": "CHE 230", "other": ["Writing Across the Curriculum"]}, {"department": "CHE", "number": "494", "credits": "1-6 Credits/Maximum of 6", "description": "An original problem, including a search of the literature, experimental investigation, and preparation in formal thesis form.", "prerequisite": "Permission of program"}, {"department": "CHE", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "An original problem, including a search of the literature, experimental investigation, and preparation in formal thesis form.  CH E 494H CH E 494H Research Projects in Chemical Engineering (1-6) Undergraduate research projects for honors students leading to the generation of a thesis for the Schreyer Honors College. The content of this course typically falls within the research interests of the chemical engineering faculty. The work can be computational, theoretical or experimental in nature and culminates with the writing of an honors thesis. Students should select a thesis advisor prior to enrolling in this course and file an honors thesis proposal report form with the Schreyer honors College. A student outside of chemical engineering can take the course if they are working towards an honors thesis in chemical engineering. A student in chemical engineering can take this course with a co-advisor outside of chemical engineering: however, the CH E", "prerequisite": "Permission of program", "other": ["Honors"]}, {"department": "CHE", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "CHE", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CHE", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]