[{"department": "CHEM", "number": "1", "credits": "3 Credits", "description": "Selected concepts and topics designed to give non-science majors an appreciation for how chemistry impacts everyday life. Students who have received credit for CHEM 3, 101, 130, or 110 may not schedule this course. CHEM 1 is designed for students who want to gain a better appreciation of chemistry and how it applies to everyone's everyday life. You are expected to have an interest in understanding the nature of science, but not necessarily to have any formal training in the sciences. During the course, you will explore important societal issues that can be better understood knowing some concepts in chemistry. The course is largely descriptive, though occasionally a few simple calculations will be done to illuminate specific information. The course does rely on your ability to think systematically, and to relate things to each other.From year to year and instructor to instructor, the course may cover any number of a large variety of topics related to current events, including, but not limited to: air and water pollution, ozone depletion, global warming, acid rain, new and old methods of energy generation and energy use in modern society, examples of production and use of modern polymers, examples of production and use of modern drugs, examples of the chemistry of nutrition, examples of advances in biochemistry and how they affect us.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "3", "credits": "3 Credits", "description": "CHEM 3 is a course that includes both lecture and laboratory. It is designed for students who want to gain a better appreciation of chemistry and how it applies to everyone's everyday life. The student is expected to have an interest in understanding the nature of science, but not necessarily to have any formal training in the sciences. The course explores important societal issues that can be better understood knowing some concepts in chemistry. The course is largely descriptive, though occasionally a few simple calculations will be done to illuminate specific information. The course does rely on an ability to think systematically, and to relate things to each other. From year to year and instructor to instructor, the course may cover any number of a large variety of topics related to current events, including but not limited to: air and water pollution, ozone depletion, global warming, acid rain, new and old methods of energy generation and energy use in modern society, examples of production and use of modern polymers, examples of production and use of modern drugs, examples of the chemistry of nutrition, examples of advances in biochemistry and how they affect us. In the laboratory component, students will conduct experiments that are related to the lecture material being covered.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "5", "credits": "3 Credits", "description": "CHEM 5 Kitchen Chemistry (3) (GN)(BA) CHEM 5 focuses on an elementary discussion of the chemistry associated with foods and cooking. It incorporates lectures and videos, reading, problem-solving, and \"edible\"; home experiments to facilitate students' understanding of chemical concepts and scientific inquiry within the context of food and cooking. Please note that this is a chemistry class presented in a real world interactive way, not a cooking class! The course will start from a primer on food groups and cooking, proceed to the structures of foods, and end with studies of the physical and chemical changes observed in foods. Students will develop an enhanced understanding of the chemical principles involved in food products and common cooking techniques.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "20", "credits": "3 Credits", "description": "Applications of chemistry to environmental problems, including air, water, thermal pollution; pesticides; drugs and birth control agents; food additives; etc. For non-chemistry majors; chemistry majors will not receive credit.  CHEM 020 Environmental Chemistry (3) Topics include the study of air, air quality, and the effects of various substances that create air pollution. Significant detail is given to ozone and its interactions in various layers of the atmosphere. The study of fossil fuels and hydrocarbon chemistry leads to an extensive discussion of global warming. Water contamination due to acid rain and acid mine drainage is studied in conjunction with acid-base chemistry. The concept of pH is discussed in detail. Newer sources of energy including fuel cells, photovoltaic cells, biomass fuels, and nuclear energy are investigated with much consideration given to the economics of fuels. These energy topics require a study of electrochemistry, nuclear chemistry, radioactivity and organic chemistry. Biological topics of drug design, toxic substances, pesticides, genetic engineering and food safety complete the course by covering numerous aspects of organic chemistry and biochemistry. Most topics also deal with the associated analytical chemistry of the substances discussed and the challenge of sample procurement, sample preparation, chemical analysis, and result interpretation considering analytical error. Methods of chemistry data presentation to the general public are investigated and ctiticized."}, {"department": "CHEM", "number": "21", "credits": "1 Credits", "description": "Introduction of basic laboratory techniques and data analysis used in environmental chemistry.  CHEM 021 CHEM 021 Environmental Chemistry Laboratory (1) This course will provide an introduction of basic laboratory techniques and data analysis used in environmental chemistry. The suggested laboratory experiments will consist of a broad range of scientific inquiry that will enhance the lecture material covered in CHEM 020. The course will provide laboratory experience in the chemistry of air, water, and solids. Experiments have been chosen that have a strong biology component such as Stream Ecology, Toxicity, Testing, and Dissolved Oxygen experiments. These experiments should relate to the BIOL 110 and 220 courses. The Chi-Square and Probability experiments will relate to STAT 250 course. The course will be an integral part of the Environmental Studies major providing an experimental chemistry background and experience."}, {"department": "CHEM", "number": "101", "credits": "2-3 Credits", "description": "Selected principles and applications of chemistry. Prior study of chemistry is not assumed. Students may take only one course for General Education credit from CHEM 101 or CHEM 110.  CHEM 101 CHEM 101 Introductory Chemistry (2-3) CHEM 101 is an introductory chemistry course designed to prepare students for college level chemistry courses, such as CHEM 110 or CHEM 202. Prior study of chemistry is not assumed, so the course introduces the vocabulary along with some basic principles of chemical problem solving.The course covers the following topics: matter and measurement, molecules and molecular compounds, ions and ionic compounds, chemical reaction types, stoichiometry, atomic and molecular weights, the mole, simple quantitative calculations with chemical reactions, the periodic table, nomenclature, electronic structure of atoms, simple periodic properties of the elements, chemical bonding, molecular geometry, and properties of various states of matter, acids and bases, and the basics of chemical equilibrium.There are 2 and 3 credit versions of this course offered at different locations. The 3-credit version usually involves a laboratory component.", "prerequisite": "MATH 21", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "106", "credits": "5 Credits", "description": "Introductory chemistry and chemical principles for students who are required to take additional chemistry, e.g., CHEM 112, but are unprepared for CHEM 110.  CHEM 106 Introductory and General Chemistry (5) (GN)(BA) This course meets the Bachelor of Arts degree requirements. CHEM 106 is an extended version of the first-semester comprehensive general chemistry course. It includes more class time for preparing students so that they learn introductory chemistry and general college level chemistry in one semester. As in CHEM 110, CHEM 106 introduces students to the basic principles of chemistry with an emphasis on the relationships between the microscopic structure and macroscopic properties of matter. Principles are illustrated with a wide variety of examples from the sciences, from engineering and technology, and from everyday life.The course covers the following topics: matter and measurement, molecules and molecular compounds, ions and ionic compounds, chemical reaction types, atomic and molecular weights, the mole, quantitative calculations with chemical reactions, the periodic table, nomenclature, aqueous reactions and solution stoichiometry, thermochemistry, electronic structure of atoms, periodic properties of the elements, chemical bonding, molecular geometry, the gaseous, liquid, and solid states of matter, properties of solutions, some basic aspects of chemical equilibrium, and applications to the real world including environmental chemistry. GN credit for CHEM 106 requires that CHEM 111 also be completed.", "prerequisite": "MATH 22", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "CHEM", "number": "108", "credits": "1 Credits", "description": "Techniques, strategies, and skills for solving problems in general chemistry for students potentially at risk in CHEM 110.  CHEM 108 CHEM 108 Problem Solving in Chemistry (1) The purpose of CHEM 108 is to facilitate success in the first semester general chemistry course (CHEM 110). Students who need extra help in CHEM 110 are strongly encouraged to take CHEM 108 with CHEM 110. The course covers the same topics in the same sequence as the concurrent CHEM 110 course. It provides an opportunity for students to develop stronger problem solving skills through active and collaborative learning activities and skill building. CHEM 108 does not satisfy the General Education requirement and will not count toward graduation in some majors."}, {"department": "CHEM", "number": "110", "credits": "3 Credits", "description": "CHEM 110 is the first semester of a two-semester, comprehensive general chemistry course which introduces students to the basic principles of chemistry with an emphasis on the relationships between the microscopic structure and macroscopic properties of matter. Principles are illustrated with examples from the sciences, engineering and technology, and from everyday life. Topics covered are atomic structure and periodic properties, molecular compounds and chemical bonding, molecular structure, intermolecular forces, the properties of gases, liquids, and solutions, chemical reactions, stoichiometry and thermochemistry. Students may only receive credit for one of CHEM 110 or CHEM 106 (4 credits) or CHEM 130.", "prerequisite": "MATH 22", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "110H", "credits": "3 Credits", "description": "CHEM 110H is the first in a two-semester comprehensive course in general chemistry for majors in science, engineering, and related disciplines. Chemistry impacts virtually every area of our lives, from how our bodies work, to the environment, to new materials, to how we live and work. The goals of this course are to teach students to recognize that what happens at the molecular level directly shapes the macroscopic world. Students will gain an understanding of (1) how atoms combine to form molecules; (2) how molecules interact and react with each other; and (3) how molecular-level structure and interactions affects a material's macroscopic properties. Students will also learn the problem-solving skills necessary to apply and interpret simple mathematical models and graphical representations of chemical and physical phenomena. The honors version of CHEM 110 covers the same topics as the regular offering but at a level appropriate for students with advanced backgrounds and talents.", "prerequisite": "MATH 22", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "111", "credits": "1 Credits", "description": "CHEM 111 is a one-credit introductory general chemistry laboratory course. It is designed to complement the lecture course CHEM 110. Students are introduced to laboratory safety and good experimental technique, how to keep a proper laboratory notebook, and interpret experimental data. The course introduces laboratory experimentation in the context of a variety of specific topics, such as reactions in solutions, spectroscopy, acids and bases, and the synthesis and analysis of chemical compounds.", "prerequisite": "CHEM 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "112", "credits": "3 Credits", "description": "CHEM 112 builds upon the subject matter of CHEM 110, covering the following topics: reaction rates and chemical kinetics, nuclear applications, catalysis, gas phase and aqueous equilibrium, chemical thermodynamics, entropy, free energy, acid-base equilibria, the pH scale, the common-ion effect, buffers, acid-base titrations, factors that affect aqueous solubility, electrochemistry, oxidation-reduction reactions, oxidation states, voltaic cells, batteries, corrosion, electrolysis, transition metals, crystal field theory, molecular orbital theory, bonding in solids, and properties of modern materials.", "prerequisite": "CHEM 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "112H", "credits": "3 Credits", "description": "CHEM 112H uses the same text as CHEM 110H and builds upon the subject matter of that course. The course covers the following topics: introduction to organic reactions, polymers and their properties, chemical thermodynamics, entropy, free energy, reaction rates and chemical kinetics, catalysis, acid-base equilibria, the pH scale, the common-ion effect, buffers, acid-base titrations, factors that affect aqueous solubility, the role of the solvent in reaction chemistry, electrochemistry, oxidation-reduction reactions, oxidation states, voltaic cells, batteries, corrosion, electrolysis, transition metals, crystal field theory, molecular orbital theory, and properties of modern materials.", "prerequisite": "CHEM 110", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "CHEM", "number": "113", "credits": "1 Credits", "description": "CHEM 113, Experimental Chemistry II, is the second introductory general chemistry laboratory course in the CHEM 111/113 sequence. CHEM 113 is meant to complement the lecture course, CHEM 112. The course builds on the material learned in CHEM 111, emphasizing quantitative and analytical procedures. Essential material covered includes proper use of a laboratory notebook, writing a formal laboratory report, use of the chemical literature, experimental design, laboratory safety, introduction into chemical instrumentation, and interpretation of data, including basic statistics.", "prerequisite": "CHEM 111", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "113B", "credits": "1 Credits", "description": "CHEM 113B, Experimental Chemistry II, is the second introductory general chemistry laboratory course in the CHEM 111/113 sequence. CHEM 113B is meant to complement the lecture course, CHEM 112, but using experiments with biological relevance. The course builds on the material learned in CHEM 111, emphasizing quantitative and analytical procedures. Essential material covered includes proper use of a laboratory notebook, writing a formal laboratory report, use of the chemical literature, experimental design, laboratory safety, introduction into chemical instrumentation, and interpretation of data, including basic statistics.", "prerequisite": "CHEM 111", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "130", "credits": "3 Credits", "description": "This course is a one-semester, rigorous college level introductory Chemistry course covering the fundamental principles of general, organic, and biochemistry. One year of high school chemistry is strongly recommended, and students should have math placement beyond the level of Math 021. 3 Credits, fulfills the General Education requirements. Course topics include dimensional analysis, atomic structure and periodicity, chemical bonding, molecular structure, states of matter and intermolecular forces, basic gas laws, solutions and solubility, acids, bases and equilibria, reaction stoichiometry and thermodynamics. In addition, fundamentals of organic nomenclature, properties of main organic functional groups, structure and function of biological macromolecules, as well as metabolism will be discussed. The course will emphasize chemistry in environmental and health-related contexts. This course is primarily designed for students in a program that does not require the more theoretical and mathematically oriented general chemistry courses (CHEM 110/112), such as some majors in the colleges of Nursing, Agriculture Sciences, and Health & Human Development. It is a suitable prerequisite for the organic chemistry course sequence CHEM 202/203. This course is not appropriate for medical school preparation and will not serve as a prerequisite for the organic chemistry CHEM 210/212 course sequence. Students majoring in chemistry, other natural sciences, or engineering will normally register in the CHEM 110/112 sequence. Consult your advisor and the instructor if you have questions about CHEM 130 vs. CHEM 110/112.", "prerequisite": "MATH 21", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "197", "credits": "1-9 Credits"}, {"department": "CHEM", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "CHEM", "number": "202", "credits": "3 Credits", "description": "Introduction to organic chemistry, with emphasis on the properties of organic compounds of biochemical importance. Because of duplication of subject matter, students may not receive credit for both CHEM 202 and CHEM 210.  CHEM 202 CHEM 202 Fundamentals of Organic Chemistry I (3) CHEM 202 is a one-semester, comprehensive course that introduces the students to the fundamental principles of organic chemistry including relationships between the molecular structure of organic compounds and their macroscopic properties. Some of the principles are illustrated with a variety of examples from nature and everyday life. The course covers the following topics: alkanes; alkenes, including polymers; alkynes; benzene and aromaticity; alcohols and phenols; ethers; aldehydes; ketones; carboxylic acids and their acyl derivatives; amines; alkyl halides; nomenclature; stereochemistry, including conformational analysis and chirality. Chemical reactions of the functional groups will be discussed along with the mechanistic details, including stereospecificity, of some of these processes. Biological molecules such as carbohydrates, lipids, steroids, peptides/proteins and nucleic acids, along with their importance in living systems, will be surveyed.", "prerequisite": "CHEM 101"}, {"department": "CHEM", "number": "203", "credits": "3 Credits", "description": "Introduction to organic chemistry, with emphasis on the identification of organic compounds by characteristic chemical reactions and by spectroscopy. The course involves both lecture and laboratory.  Because of duplication of subject matter, students may not receive credit for both CHEM 203 and CHEM 213.  CHEM 203 CHEM 203 Fundamentals of Organic Chemistry II (3) CHEM 203 is a one-semester organic chemistry course that has both lecture and laboratory components. The lecture introduces students to the basic theory and application (structure determination) of different types of spectroscopy (nuclear magnetic resonance spectroscopy, infrared spectroscopy, and ultraviolet-visible spectroscopy) and mass spectrometry. Certain chemical reactions learned in CHEM 202 will be reviewed along with the mechanistic details of some of these processes. Special topics such as drug discovery, natural product isolation, and synthesis will be surveyed. The laboratory teaches students the fundamental techniques used by organic chemists such as recrystallization, melting point determination, distillation, extraction, thin-layer chromatography, and column chromatography. Mastery of these basic techniques lays the foundation for carrying out organic syntheses and/or natural product isolations. Students are given hands-on access to instrumentation for the characterization of synthetic products or organic unknowns using standard analysis methods such as IR, NMR, UV/V is spectroscopy, mass spectrometry, polarimetry, HPLC, GC and GC-MS. Students are responsible for writing laboratory reports for all experiments.", "prerequisite": "CHEM 202"}, {"department": "CHEM", "number": "210", "credits": "3 Credits", "description": "Bonding theories for organic molecules; stereochemistry and conformational analysis; reactions (and mechanisms) of alkyl halides, alkenes, alkynes, aromatics, and alcohols.  CHEM 210 Organic Chemistry I (3) Organic chemistry is an essential subject for many scientific disciplines, particularly those in the life, materials, and chemical sciences, as well as chemical engineering. The fundamentals of organic chemistry, as developed in CHEM 210, the first part of a two-semester organic chemistry sequence, are required for scientists to understand the electronic structure and reactivity of simple and complex molecules. Concepts taught in CHEM 210 include hierarchical bonding models (Lewis dot, valence bond, molecular orbital), Lewis acids and bases, conformational analysis and stereochemistry, functional groups and their reactivity (alkenes, alkynes, alkyl halides, dienes, aromatics, alcohols, and ethers), organic reaction mechanisms focusing on electrophiles and nucleophiles, and aromaticity. Successful students will understand and be able to apply various structural and reactivity models to solving problems in organic chemistry.", "prerequisite": "CHEM 112"}, {"department": "CHEM", "number": "210H", "credits": "4 Credits", "description": "Principles and theories; nomenclature; chemistry of the functional groups; applications of spectroscopy. Because of duplication of material, students may not receive credit for both CHEM 210 and 202.  CHEM 210H Organic Chemistry I - Honors (4) Chemistry 210H is the first semester of an in-depth two semester survey of organic chemistry. It should be followed by Chemistry 212H. The concentrated and fast-moving pace of this course is facilitated by four class periods/week, seven (biweekly) hour exams and an evening recitation dedicated to the informal discussion of the subject material covered in previous or pending hour exams. This course will emphasize the mechanistic underpinning of organic chemistry. That is, students will not only learn what happens in organic chemistry but also, and more importantly, why and how. It is hoped that students will develop an intuition for the structure, function and reactivity properties of organic compounds which is of fundamental importance for subsequent studies in the life, material and chemical sciences. The course begins with an introduction to the structural aspects of organic compounds and an appreciation of the three-dimensionality of the subject based upon the important concepts of molecular orbital theory, valence bond theory, hybridization and conformational analysis. Reaction mechanisms and organic synthesis, two important topics that are emphasized throughout the course, are introduced early in the context of addition reactions of alkenes and alkynes. Perhaps the most abstract/vexing topic in organic chemistry is next encountered, namely, stereochemistry. These fundamentals are then used to explore the reactivity properties of various classes of compounds including substitutions and eliminations of alkyl halides, free radical reactions of alkenes, isomerization and cycloadditions of conjugated pi systems, and electrophilic substitution reactions of aromatic compounds.", "prerequisite": "CHEM 112", "other": ["Honors"]}, {"department": "CHEM", "number": "212", "credits": "3 Credits", "description": "Continuation of CHEM 210.  Emphasis is placed on the role of organic reactions in biological chemistry.  CHEM 212 CHEM 212 Organic Chemistry II (3) This course will continue to build upon the important concepts learned in the prerequisite course, CHEM 210, with an emphasis on reactions mechanisms and organic synthesis. The course will begin with conceptually new material that will be applied in the laboratory course, namely, the elucidation of the structures of organic compounds using mass spectrometry, infrared spectroscopy and nuclear magnetic resonance spectroscopy. The majority of the new material is concerned with the chemistry of carbonyl compounds and includes: 1) the nucleophilic addition reactions of ketones and aldehydes; 2) nucleophilic acyl substitution reactions of acid chlorides, anhydrides, esters and amides; 3) carbonyl alpha-substitution reactions and 4) carbonyl condensation reactions. The latter part of the course will be concerned with biologically relevant compounds such as amines, amino acids/peptides/proteins and carbohydrates.", "prerequisite": "CHEM 210"}, {"department": "CHEM", "number": "212H", "credits": "3 Credits", "description": "Continuation of CHEM 210(H). Emphasis is on the chemistry of carbonyl compounds, spectroscopic analysis and pericyclic reactions.  CHEM 212H Organic Chemistry II - Honors (3) CHEM 212H is the second semester of a comprehensive year-long treatment of introductory organic chemistry at an advanced level. CHEM 210H is recommended but not required. This honors course focuses more on depth than breadth, and will delve into some of the more modern approaches/theories to key topics. Most of the material derives from the chemistry of carbonyl compounds. The classic topics -- carbonyls as as electrophiles and as nucleophile (enolate) precursors -- will be covered. In addition, discussions of stereochemical selectivity issues will provide the framework to introduce contemporary concepts of stereoelectronic and steric effects into these topics. For example, Cram, Felkin-Ahn and chelation-based models for stereoselective addition of nucleophiles to aldehydes/ketones will be developed, as will chiral auxiliary chemistry for stereoselective enolate addition reactions. In addition to carbonyl chemistry, an introduction to spectroscopic techniques for compound characterization will be included. These techniques include mass spectrometry, infrared spectroscopy, and nuclear magnetic resonance spectroscopy. Finally, a survey of pericyclic reactions, along with the molecular orbital (stereoelectronic) underpinnings of chemical selectivity observed in these processes, will be pursued. Class grades will be based on 5 exams, 5 (out of 6) homework assignments, and a final exam.", "prerequisite": "CHEM 210", "other": ["Honors"]}, {"department": "CHEM", "number": "213", "credits": "2 Credits/Maximum of 2", "description": "Basic laboratory operations; synthesis and chemical or instrumental analysis. Because of duplication of subject matter, students may not receive credit for both CHEM 203 and CHEM 213.  CHEM 213 CHEM 213 Laboratory Organic Chemistry (1-2) A strong foundation in organic laboratory skills is provided by this laboratory course. Laboratory work includes learning the basic techniques and recrystallization/melting point determination, distillation, liquid/liquid extraction, thin layer, chromatography and column chromatography. Mastery of these basic techniques lays the foundation for carrying out a number of organic syntheses or natural product isolations. Students are often provided with hands-on access to instrumentation for the characterization of synthetic products or organic unknowns using standard analysis methods such as IR, NMR, UV/V is spectroscopy, mass spectrometry, polarimetry, HPLC, GC and GC-MS. Chemistry 210 is a prerequisite and CHEM 212 may be* a co-requisite for this course, because they provide the theoretical background for the reaction chemistry as well as the spectroscopic characterization of organic molecules.*Note: The number of credits and meeting times vary from location to location. Some locations offer CHEM 213 as two one-credit courses to be taken in sequential semesters, whereas other locations offer CHEM 213 as a single-semester two-credit course. Normally, the latter format involves two 3-hour labs per week in addition to extensive written work outside of the laboratory. The prerequisite / concurrent requirement for CHEM 212 does not apply when CHEM 213 is taken as a 1 credit course.", "prerequisite": "CHEM 210"}, {"department": "CHEM", "number": "213H", "credits": "2 Credits", "description": "Basic laboratory techniques learned in context via theme-based modules, spectral analysis, multi-step synthesis, and professional scientific writing. Because of similarity of subject matter, students may not receive credit for both CHEM 203 and CHEM 213.  CHEM 213H Laboratory in Organic Chemistry - Honors (2) A strong foundation in organic laboratory skills is provided by this laboratory course. Laboratory work includes learning the basic techniques and recrystallization/melting point determination, distillation, liquid/liquid extraction, thin layer, chromatography and column chromatography in a specific context via theme-based modules. Mastery of these basic techniques lays the foundation for carrying out a multi-step synthesis for the Team Project assignment, which may require the use of more advanced laboratory techniques. Students are required to write professional final reports (ACS-style) for each experiment. Students are often provided with hands-on access to instrumentation for the characterization of synthetic products or organic unknowns using standard analysis methods such as IR, NMR, UV/V is spectroscopy, mass spectrometry, polarimetry, HPLC, GC and GC-MS. CHEM 210 is a prerequisite and CHEM 212 a co-requisite for this course, because they provide the theoretical background for the reaction chemistry as well as the spectroscopic characterization of organic molecules.", "prerequisite": "CHEM 210", "other": ["Honors"]}, {"department": "CHEM", "number": "213M", "credits": "2 Credits", "description": "Basic laboratory techniques learned in context via theme-based modules, spectral analysis, multi-step synthesis, and professional scientific writing. Because of similarity of subject matter, students may not receive credit for both CHEM 203 and CHEM 213.", "prerequisite": "CHEM 210", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "CHEM", "number": "213W", "credits": "2 Credits", "description": "Basic laboratory techniques learned in context via theme-based modules, spectral analysis, multi-step synthesis, and professional scientific writing. Because of similarity of subject matter, students may not receive credit for both CHEM 203 and CHEM 213.", "prerequisite": "CHEM 210", "other": ["Writing Across the Curriculum"]}, {"department": "CHEM", "number": "227", "credits": "4 Credits", "description": "The purpose of this course is to provide students with a rigorous and comprehensive exposure to the techniques and methods used in biotech, environmental, forensic, and pharmaceutical industrial and research laboratories. The principles, methodology and practical aspects of both traditional and modern chemical analysis will be discussed. Laboratory and lecture are fully integrated, emphasizing the importance of the laboratory component to achieving mastery of overall course content. Concepts will include acid-base, precipitation, chelation, electrochemistry, UV/Vis spectroscopy, and introductory chromatography, as well as some more advanced topics at the instructor's discretion. Students will be expected to develop both their chemical problem solving and laboratory skills, and will be evaluated on their ability to speak and write clearly, solve context-based chemical problems, maintain a research style laboratory notebook, and carry out reliable chemical analysis individually as well as part of a team. This course is relevant to any student majoring or minoring in Chemistry or Forensic Science.", "prerequisite": "CHEM 112"}, {"department": "CHEM", "number": "233N", "credits": "3 Credits", "description": "This pedagogically innovative course will be team taught by an instructor from the English department and one from the Chemistry department. Both instructors will be present in the classroom throughout the semester, providing joint presentations and leading discussions. The integration of humanities and natural sciences domain content will encourage students from humanities and natural science backgrounds, as well as other interested students, to take the course and learn how to integrate these two domains of knowledge in their education and their lives after leaving Penn State. This course teaches both basic concepts of chemistry and their cultural elaboration in literature, and it models a critical assessment of the implications of chemistry and literature emerging from a shared cultural field, rather than autonomously from two separate cultures. The course seeks to provide students with a nuanced understanding of how literature and science inform each other and negotiate cultural, religious, and political tensions. Understanding the origin and development of these ideas, perspectives, and discoveries is an essential component of science and scientific achievement, but too often our methods of teaching science focus almost exclusively on   teaching facts and theories at the expense of the historical discovery, creation, and development of those facts and theories. This courses teaches both the scientific facts and theories and the contexts of their production in order to sharpen students' abilities at critical evaluation of facts. The literary and scientific focus will vary from class to class, but may include writings by literary authors such as Mary Shelley, Edward Bulwer-Lytton, Bram Stoker, H. G. Wells, Garrett Serviss, Aldous Huxley, Roald Hoffmann, Carl Djerassi, Don DeLillo, William Butler Yeats, Arthur Machen, D.H. Lawrence, A. E. Waite, Aleister Crowley, Arthur Conan Doyle, Camille Flammarion, and Rachel Carson, and scientific texts by scientists such as T.H. Huxley, William Crookes, William Ramsay, Frederick Soddy, Ernest Rutherford, Wilhelm Conrad Roentgen, Henri Bequerel, J.J. Thomson, Niels Bohr, and Marie  Curie. Key concepts of environmental chemistry. The specific focus of this class will vary from class to class, but all sections will spend approximately 40% of the class on units specifically devoted to key concepts in basic chemistry, 40% of the class on literary interpretations of and influences upon concepts in chemistry in specific historical periods, and 20% of the class on significant methods of theorizing the boundaries between and interrelationships of science and culture., and on the concept of the \"culture of science.\" However, these subjects will be interwoven throughout the semester. Indeed, the pedagogy of the course depends upon the literature and the science not being neatly separated from each other. Instead, students will learn up-to-date science while exploring the origins, development, and cultural dimensions of that science, and will learn to integrate their understanding of the domains of science and the humanities through the course. The course will be offered once every year with approximately 20-35 seats per offering.", "other": ["Cross-listed with: ENGL 233N", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "CHEM", "number": "294", "credits": "1-4 Credits/Maximum of 12", "description": "Designed for freshman or sophomore students who are prepared to undertake special problems and research by arrangement with a faculty member."}, {"department": "CHEM", "number": "294H", "credits": "1-4 Credits/Maximum of 12", "description": "Designed for freshman or sophomore students who are prepared to undertake special problems and research by arrangement with a faculty member.", "prerequisite": "Permission of instructor", "other": ["Honors"]}, {"department": "CHEM", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "CHEM", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "CHEM", "number": "301", "credits": "3 Credits", "description": "Chemical principles, interpretation, and methods of analysis for groundwater, water supply, wastewater treatment, stream pollution.  CHEM 301 CHEM 301 Environmental Chemistry and Analysis (3) The objective of the course is to introduce students to water quality chemistry and the associated laboratory analytical techniques commonly used in groundwater, water supply, wastewater treatment, stream pollution control. This course will be instructed with classroom lectures, laboratory exercises, and a project. These laboratory exercises include pH, solids, turbidity, alkalinity, acidity, dissolved oxygen, biochemical oxygen demand, chemical oxygen demand, total organic carbon, chlorine residual, chlorine demand, nitrogen, phosphorus, nitrate, sulfate, chloride, hardness, and metals. This course involves two lecture periods and one laboratory period each week. The students will be evaluated with quizzes, midterm examination, final examination, laboratory reports, and a project report.The course has a prerequisites of a two-semester General Chemistry course and the associated laboratory courses. This course is a prerequisite for Water Supply and Pollution Control which is one of core courses for Environmental Engineering Program.", "prerequisite": "CHEM 112"}, {"department": "CHEM", "number": "310", "credits": "3 Credits", "description": "Conceptual and descriptive aspects of inorganic chemistry, focusing on structures, bonding, and properties.  CHEM 310 Introductory Inorganic Chemistry (3)CHEM 310 covers the structure, bonding, and properties of inorganic molecules and solids. Theories and models of chemical bonding, includingvalence bond theory, crystal field theory, and molecular orbital theoryare applied to inorganic molecules, coordination compounds, and solids.Aspects of structural inorganic chemistry are presented, including molecular geometry and structures of metallic, ionic, and covalent solids. Transition metal chemistry is discussed, including key aspects of bonding, properties, and reactions. The course also covers acids and bases, oxidation and reduction, and coordination chemistry. Special topics such as solid-state inorganic materials, inorganic nanoscience, and bioinorganic chemistry may also be included.", "prerequisite": "CHEM 112"}, {"department": "CHEM", "number": "316", "credits": "1 Credits", "description": "Industrial employment opportunities and challenges; graduate and professional school opportunities; tailoring the chemistry curriculum to career goals.  CHEM 316 CHEM 316 The Professional Chemist (1) This junior-level seminar course is designed to help prepare chemistry majors to take advantage of opportunities provided by the Department and community of professional chemists in choosing, attaining, and furthering their career goals. A number of guest lectures cover a variety of career-related topics. Careers in the pharmaceutical, chemical production, biotechnology, and analytical sectors and other specialty companies will be discussed. Also, various academic careers paths are presented and compared. Preparing for chemistry graduate school and other post graduate training will be an important element of this seminar. Most of the meetings of the course will be primarily informational. A graded short presentation on a chemistry related topic is also required.", "prerequisite": "4th semester standing or higher in Chemistry"}, {"department": "CHEM", "number": "358", "credits": "3 Credits", "description": "CHEM 358 is designed to prepare a student majoring in chemistry to interact with the scientific community as a professional. The course will be divided into three major units. The first unit will focus on communicating scientific information and research results. This will include searching, reading and interpreting peer-reviewed scientific literature, preparation of formal reports suitable for publication, and presenting research orally. Students may be asked to attend public events related to science outside the normal meeting hours for the course. The second unit will focus on developing career skills needed to become a successful professional in the field. This will include examining various career paths related to chemistry, professional networking, resume and job seeking skills, and instruction on effective interview strategies. Outside speakers will be invited to help reinforce particular topics. Additionally, scientific integrity will be discussed. The third unit will focus on an introduction to chemical hygiene in order to promote advanced safety practices above what students have learned in previous laboratory courses. This will include complying with safety regulations, understanding when and how to use proper personal protective equipment, understanding the categories of hazards associated with chemicals and how to read chemical labels, and interpreting Safety Data Sheets (SDS).", "prerequisite": "CHEM 213"}, {"department": "CHEM", "number": "395", "credits": "1-2 Credits/Maximum of 2", "description": "Instruction and practice in the role of the teaching assistant in the undergraduate chemistry laboratory."}, {"department": "CHEM", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "CHEM", "number": "400", "credits": "1 Credits", "description": "Instruction in use of the library and of the literature of chemistry.  CHEM 400 Chemical Literature (1) CHEM 400 covers an orientation to use the library; sources of organic and inorganic synthesis information; use of relevant indexing and abstracting services; spectral data sources; patent literature; sources related to general chemical information, and properties data. Additional topics may be included as time permits.", "prerequisite": "CHEM 210"}, {"department": "CHEM", "number": "402", "credits": "3 Credits", "description": "Chemistry of the atmosphere, natural waters, and the land surface with particular focus on human influence on processes occurring therein.  CHEM 402 CHEM 402 Chemistry in the Environment (3) Fundamental and descriptive aspects of the sources, reactions, transport, and effects of chemical species, both natural and synthetic, in water, air, soil, and living systems, and the influence of human activities on these processes. The goal of the course is to gain an understanding of the theory and application of the fundamental processes that determine the distribution and transport of inorganic and organic substances in the environment; the techniques for determining important physicochemical properties that influence environmental fate; and the major sources of important classes of environmental chemicals. Rapid increases in technological sophistication have led to startling innovations in our everyday lives almost unthinkable a century ago. However, at the same time, advances in science and engineering have complicated how we live and react to the new technologies and, at times, force consideration of complex issues before our need for reflection. Approaching problems from different directions and perspectives is fundamental to our understanding of Earth processes. New and continued emphasis in global warming, loss of biodiversity, ozone layer depletion, acid mine drainage, sustainable development and energy use are only a few of the major environmental threats which require an intelligent and informed response. As such, the course provides a balanced discussion of the hard science and social sciences aspects of environmental issues.", "prerequisite": "CHEM 212"}, {"department": "CHEM", "number": "404", "credits": "3 Credits", "description": "Environmental Chemistry: Water and Soil is an upper-level elective chemistry class focusing on environmental issues and their intersection with chemistry. Specifically, the course will focus on the ways in which environmental processes can be understood in terms of their underlying chemistry as well as the impact of chemicals on the environment. Topics will include water and soil chemistry, water treatment, heavy metals, organic pollutants, and remediation strategies. Chem 404 is the second semester of a two semester sequence in environmental chemistry. Chem 402 focuses on the atmosphere and Chem 404 covers topics relevant to water and soil chemistry. These courses are independent of each other. Students can take one or both in any order.", "prerequisite": "CHEM 212"}, {"department": "CHEM", "number": "406", "credits": "3 Credits", "description": "Theory of radioactive decay processes, nuclear properties and structure, nuclear reactions, interactions of radiation with matter, biological effects of radiation. CHEM 406 Nuclear and Radiochemistry (3) CHEM 406 provides a basic introduction to many of the important physical phenomena in nuclear and radiochemistry and the theories that describe them. The exposition of both experimental phenomena and theory complements the content of other upper-level courses in physical chemistry such as CHEM 450 and 452.Specifically, the types of radioactive decay are described, and, using this information, the equations that relate the growth and decay, i. e., the kinetics, of radioactive nuclei are derived. In parallel, a variety of types of nuclear reactions, such as neutron capture are introduced and used to develop the equations that governing the kinetics of nuclear reactions, including the concept of cross section. To describe the nature of nuclear matter, the relationships between energy, binding energy, and mass, are developed and augmented with the introduction of related quantities including the nuclear magnetic-dipole moment, total angular momentum of the nucleus, and Fermi-Dirac and Bose-Einstein statistics. A basic introduction to quantum mechanics, including several problems of increasing complexity, namely, the one-dimensional particle-in-a-box, the three-dimensional particle-in-a-cubic-box, and the particle-in-a-spherical box is then provided. The latter problem forms the basis for developing the single-particle shell-model of the nucleus, which is compared to the single-particle shell-model of the atom, namely, the hydrogen-atom problem. The barrier-penetration theory of alpha-decay, Fermi's phase-space theory of beta-decay, and the selection rules for gamma-ray decay are then presented. Final topics include the interactions of radiation with matter and the biological effects of radiation.", "prerequisite": "CHEM 452", "other": ["Cross-listed with: NUCE 405"]}, {"department": "CHEM", "number": "408", "credits": "3 Credits", "description": "Introduction to numerical and nonnumerical computer uses in physical science.  CHEM 408 CHEM 408 Computational Chemistry (3) CHEM 408 introduces some of the many ways in which computers are used in modern chemical research. The main emphasis is on \"molecular modeling\" including such topics as electronic structure calculation, molecular mechanics, molecular dynamics and Monte Carlo simulation methods. In lesser detail, chemical informatics will also be considered, time permitting. Discussion of the theoretical underpinnings of these various methods and their range of applicability will be combined with exercises illustrating the use of several current chemical software packages and with assignments based on critical reading of illustrative literature papers.", "prerequisite": "CHEM 452"}, {"department": "CHEM", "number": "410", "credits": "3 Credits", "description": "Conceptual and descriptive aspects of nontransition elements, covering structural, thermodynamic, and kinetic features. CHEM 410 Inorganic Chemistry (3) CHEM 410 covers structure and bonding in inorganic chemistry, including the chemistry of main group elements and selected topics in transition metal chemistry. Theories and models of chemical bonding (valence bond theory, crystal field theory, and molecular orbital theory) are applied to inorganic molecules, coordination compounds, and solids. The course also covers the following topics: periodic trends in the chemistry of the d- and p-block elements, structural solid state chemistry, magnetism of transition metal complexes and inorganic solids, ionic and covalent bonding in solids, electronic properties of metals, alloys, superconductors, and semiconductors, synthesis of inorganic materials, and properties of nanoscale inorganic solids.", "prerequisite": "CHEM 112"}, {"department": "CHEM", "number": "412", "credits": "3 Credits", "description": "Structure and bonding of compounds containing transition metals.  CHEM 412 Transition Metal Chemistry (3) CHEM 412 covers the chemistry of the transition metals, and in particular the d-block elements. Major areas of emphasis include coordination chemistry, organometallics, and the role(s) of transition metals in biology. The course covers the following topics: molecular symmetry with applications to bonding and vibrational spectroscopy, coordination chemistry, structural and optical isomers, crystal and ligand field theories, electronic structure and electronic transitions, spectroscopic methods for probing transition metal complexes, kinetics and thermodynamics of ligand substitution reactions, oxidation-reduction reactions, organometallic complexes and their basic reaction types, homogeneous and heterogeneous organometallic catalysts and their reaction cycles, the interactions of metal ions with biological molecules, the function of transition metal ions in metalloproteins, and medically-important transition metal complexes.", "prerequisite": "CHEM 202"}, {"department": "CHEM", "number": "413", "credits": "4 Credits", "description": "Theoretical and descriptive chemistry of the elements; laboratory synthesis and measurements in inorganic, coordination, and transition metal chemistry.", "prerequisite": "CHEM 213"}, {"department": "CHEM", "number": "423W", "credits": "4 Credits", "description": "Modern methods and instruments of spectroscopy and their applications to problems of chemical structure and analysis.  CHEM 423W Chemical Spectroscopy (4) This course reviews modern methods and instruments of spectroscopy and their applications to problems of chemical structure and analysis. Topics include electronics, optics, and atomic and molecular spectroscopy (UV-VIS, Fluorescence, FTIR, Raman, liquid- and solid-state NMR). The course thoroughly integrates lecture and laboratory activities. The laboratory component incorporates skill-building exercises with open-ended guided-inquiry laboratory exercises and a semester-long laboratory- and literature-based research project. Students work in small groups (2-3 students) to complete each assignment. Students are required to write research papers during the semester. The reports are linked to the core course topics and the fifth is associated with the semester-long research project. All reports require students to search for and read the relevant published literature. The course is designed to be rigorous and comprehensive in scope. The writing component for this course includes: maintaining a proper laboratory notebook; reports; and an oral poster presentation. All writing elements are reviewed and graded by the instructor and teaching assistants.", "prerequisite": "CHEM 227", "other": ["Writing Across the Curriculum"]}, {"department": "CHEM", "number": "425W", "credits": "4 Credits", "description": "Gas, liquid, and other forms of chromatography; important techniques of electrochemistry.", "prerequisite": "CHEM 227", "other": ["Writing Across the Curriculum"]}, {"department": "CHEM", "number": "430", "credits": "3 Credits", "description": "Spectroscopic methods as tools in gross and detailed structural analysis and interpretation within the framework of modern theory.  CHEM 430 CHEM 430 Structural Analysis of Organic Compounds (3) This course is designed to introduce students to the spectroscopic techniques that are used to elucidate the structures of organic molecules of various molecular weights. Some theoretical background will be provided and is necessary, but the emphasis is on solving problems. The course starts with fundamental concepts and techniques learned in sophomore organic chemistry and builds toward state-of-the-art methods used by modern organic and bioorganic chemists. Topics to be covered include: UV spectroscopy, 1D- 1H and 13C NMR, spin-spin (scalar) coupling and chemical shifts, IR spectroscopy, simple and advanced mass spectroscopic techniques, stereochemistry, advanced NMR topics including advanced 1D and2D NMR and correlation spectroscopies. Some consideration will also be given to the challenges associated with structure determination in biomolecules.", "prerequisite": "CHEM 210"}, {"department": "CHEM", "number": "431W", "credits": "4 Credits", "description": "Preparation, purification, and characterization of both organic and inorganic compounds by modern methods.  CHEM 431W CHEM 431W Organic and Inorganic Preparations (3) CHEM 431W is a one-semester, writing-intensive advanced laboratory course that focuses on the preparation, isolation, purification, and characterization of organic, organometallic, and inorganic compounds. Students are expected to use the techniques learned in the introductory organic chemistry laboratory and will learn more advanced techniques such as the use of air-free and anhydrous reaction conditions, glove bags, vacuum manifolds, vacuum distillations, flash chromatography, solvent stills, and gas-tight syringes. Molecular modeling techniques are also introduced. Students are given hands-on access to instrumentation for the characterization of synthetic products or organic unknowns using standard analysis methods such as IR, NMR, UV/V is spectroscopy, mass spectrometry, polarimetry, HPLC, GC and GC-MS. Students are expected to search the chemical literature using databases and online journals and to write formal lab reports in ACS style. The lab assignments include syntheses, separating an unknown mixture, and a team project, which includes a written proposal, synthetic work, a final report, and a poster presentation.", "prerequisite": "CHEM 213", "other": ["Writing Across the Curriculum"]}, {"department": "CHEM", "number": "432", "credits": "3 Credits", "description": "The study, evaluation, and discussion of the mechanisms of selected organic reactions.", "prerequisite": "CHEM 212"}, {"department": "CHEM", "number": "433", "credits": "3 Credits", "description": "This course is designed to build upon synthetic organic chemistry lab skills in the context of medicinal chemistry, specifically drug development. Students will learn how the pharmaceutical industry approaches the design, synthesis, and testing of drug targets. This knowledge will be applied as students propose and design novel drug targets. The syntheses of these drug targets will be carried out and optimized. The targets will be tested via the appropriate studies and assays to study the targets¿ properties and bioactivities. Students will have regular interactions with an industrial medicinal chemist to report on their work progress. An electronic notebook will allow for collaborative work and remote feedback from the industrial chemist. The semester culminates with a tour to a pharmaceutical company where students present their semester work in a poster session to scientists at the company.", "prerequisite": "CHEM 431"}, {"department": "CHEM", "number": "440", "credits": "3 Credits", "description": "This course presents analytical methods used in chemistry in a way that extends and complements the treatment in CHEM 227. Preliminary discussions will entail sample preparation for organic and inorganic samples, quantitative and qualitative measurements, sensitivity and limit of detection. Techniques addressed will cover the areas of separation, optical spectroscopy, mass spectrometry, electroanalytical techniques and surface analysis. Students are expected to learn how instruments produce signals and how to choose the appropriate technique for a particular analysis.", "prerequisite": "CHEM 227"}, {"department": "CHEM", "number": "441", "credits": "1 Credits", "description": "This laboratory course presents analytical methods used in the chemistry field in a way that extends and compliments the treatment in CHEM 440. Techniques addressed will cover the areas of separation, optical spectroscopy, mass spectrometry, electroanalytical techniques and surface analysis. Students are expected to learn how instruments produce signals and how to choose the appropriate technique for a particular analysis.", "prerequisite": "CHEM 227"}, {"department": "CHEM", "number": "446", "credits": "3 Credits", "description": "Theoretical and practical aspects of structure determination using x-ray diffraction, from crystal growth to structure solution.  CHEM 446 CHEM 446 X-Ray Crystallography (3) CHEM 446 introduces the student to the basic principles of molecular structure determination through the diffraction of X-rays by single crystals. The emphasis is on small organic, coordination and organometallic compounds. However the principles can provide the basis for extensions into disciplines ranging across geology, materials, molecular biology, and nanoscience. The course is organized in the same way that an actual crystal structure determination might proceed, with theoretical considerations introduced as needed. Techniques of crystal growth and selection are summarized. X-ray sources and instrumentation are described briefly. Unit cells, Miller planes, unit cell geometry and Bragg's law give rationale to the diffraction experiment. Space group symmetry is connected with data collection and the contents of the unit cell. Practical considerations of data collection and instrumentation are covered next. The theoretical description of structure factors and Fourier synthesis leads to consideration of solutions to the phase problem. The remainder of the course illustrates the process of structure solution using real data and software readily available to the students. All the details of publication of a crystal structure; the CIF, ORTEP figures and the format of the experimental section of most journals is described using actual student selected publications. Related structural techniques such as protein crystallography and molecular modeling may be reviewed time permitting.", "prerequisite": "CHEM 210"}, {"department": "CHEM", "number": "448", "credits": "3 Credits", "description": "Surface chemistry, emphasizing the physical and chemical aspects of surfaces important for applications in colloids, catalysis, microelectronics and biocompatibility. CHEM 448 Surface Chemistry (3) introduces the student to the basic principles of the chemical behavior of surfaces with an emphasis on the fundamental aspects, including surface structure, bonding, thermochemistry and dynamical behavior. The course is intended to provide the basis for extensions into disciplines ranging across geology, materials, environmental engineering, biology, agriculture, physics and nanoscience. Fundamental concepts and relationships of the chemical behavior of organic and inorganic substances that the student has already learned in previous courses will be assembled, correlated and directed towards understanding the behavior of the special case of the surfaces and interfaces of liquids and solids. Starting from the basic principles the student will be guided to evolve a fundamental understanding and predictive ability for important man made and natural applications and phenomena of practical interest, including colloids, surface coatings, lubrication, heterogeneous catalysis, weather, geology, chemical sensing, microelectronics and biocompatibility.", "prerequisite": "CHEM 212"}, {"department": "CHEM", "number": "450", "credits": "3 Credits", "description": "Introduction to physical chemistry with primary emphasis on chemical thermodynamics and its molecular interpretation.(Graduate credit not allowed for students majoring in Biochemistry and Molecular Biology, Chemistry, or Chemical Engineering.) CHEM 450 Physical Chemistry - Thermodynamics is a physical chemistry course that introduces students to chemical properties of matter and the fundamentals of chemical thermodynamics. The theoretical foundations of thermodynamic principles are covered and illustrated with a wide variety of examples from the sciences, engineering and technology fields. The course covers the following topics: gas laws, equations of state, the First Law of Thermodynamics, work and heat, internal energy, enthalpy changes, heat capacity, the Second Law of Thermodynamics, entropy and entropy changes, the Third Law of Thermodynamics, Helmholtz and Gibbs energies, phase stability and phase boundaries, phase diagrams, phase equilibrium, surface tension, capillary action, partial molar quantities, thermodynamics of mixing, chemical potential, solvent and solute activities, colligative properties, the phase rule, thermodynamics of two-component systems, chemical equilibrium, spontaneity of chemical reactions, the response of equilibria to experimental conditions, and equilibrium electrochemistry. Note: Students cannot receive credit for both CHEM 450 and CH E 320.", "prerequisite": "CHEM 112"}, {"department": "CHEM", "number": "451", "credits": "1 Credits", "description": "CHEM 451 is a laboratory course designed to illustrate several of the principles of chemical thermodynamics presented in CHEM 450 and to demonstrate proper treatment and presentation of quantitative data. The experimental topics for this course include heat capacity ratio of gases, diffusion of gases, Joule-Thomson coefficients for gases, enthalpies of combustion, freezing point depression, and vapor pressures of liquids. Students will learn how to write quantitative laboratory reports complete with analysis of the uncertainties of the measurements they make. They will also learn how these uncertainties are propagated through each calculation that make use of the initial measurements. Students will become more aware of the importance of experimental design, proper use of instrumentation, and careful data collection.", "prerequisite": "CHEM 450"}, {"department": "CHEM", "number": "452", "credits": "3 Credits", "description": "Introduction to physical chemistry with primary emphasis on molecular structure, spectroscopy, and chemical kinetics. (Graduate credit not allowed for students majoring in Biochemistry and Molecular Biology, Chemistry, or Chemical Engineering.) CHEM 452 Physical Chemistry - Quantum Chemistry (3) is an introductory physical chemistry course that covers quantum chemistry and atomic and molecular spectroscopy. If time permits other topics may include chemical kinetics, statistical thermodynamics, nuclear magnetic resonance, and electron spin resonance spectroscopy. Quantum chemistry topic covered are Schrodinger's equation, the particle in a box, in a ring, on a spherical surface, the free particle, barrier penetration, the harmonic oscillator, the hydrogen atom, electron spin and multi-electron atoms, molecular structure and symmetry will be covered. Spectroscopy topics are atomic spectra, and the microwave, infrared, and visible spectra of molecules. Chemical kinetics may include rate laws, mechanisms, chain reactions, polymerization reactions, catalysis, molecular reaction dynamics (collision theory and activated complex theory), and nature of potential energy surfaces for reactions.", "prerequisite": "CHEM 112"}, {"department": "CHEM", "number": "453", "credits": "1 Credits", "description": "CHEM 453 is a laboratory course designed to illustrate several of the principles of chemical kinetics and quantum mechanics presented in CHEM 452, and to demonstrate proper treatment and presentation of quantitative data. The experimental topics for this course include kinetics of decomposition and hydrolysis reactions, and different spectroscopic techniques such as ultra violet-visible, infrared, emission and nuclear magnetic resonance spectroscopies. Students will learn how to write quantitative laboratory reports complete with analysis of the uncertainties of the measurements they make. They will also learn how these uncertainties are propagated through each calculation that make use of the initial measurements. Students will become more aware of the importance of experimental design, proper use of instrumentation, and careful data collection.", "prerequisite": "CHEM 452"}, {"department": "CHEM", "number": "457", "credits": "1-2 Credits/Maximum of 2", "description": "Laboratory experiments designed to illustrate the principles of physical chemistry and teach techniques of error analysis and the presentation of quantitative data.  (Graduate credit not allowed for students majoring in Biochemistry and Molecular Biology, Chemistry, or Chemical Engineering.)  CHEM 457CHEM 457 Experimental Physical Chemistry (2) CHEM 457 is a laboratory course designed to illustrate some of the principles of physical chemistry presented in CHEM 450 and 452 and to teach proper treatment and presentation of quantitative data. In this course, students will learn how to write quantitative laboratory reports complete with analysis of the uncertainties of the measurements they make. They will also learn how these uncertainties are propagated through each calculation that make use of the initial measurements. In doing so, students should become more aware of the importance of experimental design, proper use of instrumentation, and careful data collection.", "prerequisite": "CHEM 450"}, {"department": "CHEM", "number": "459W", "credits": "4 Credits", "description": "Laboratory experiments and projects for students interested in advanced study in physical chemistry.  CHEM 459W Advanced Experimental Physical Chemistry (4) CHEM 459W Advanced Experimental Physical Chemistry is a project-based course designed as a follow-up to CHEM 457. CHEM 459W provides students with further experience in laboratory techniques used for quantitative experimentation and with the processing and interpretation of quantitative data. Experiments and short research projects are designed to complement the theoretical knowledge acquired in lecture courses so as to enhance students' competence in problem solving in a research environment. Particular attention will be devoted to written communication of experimental results in an effective and concise manner according to American Chemical Society journal standards.", "prerequisite": "CHEM 450", "other": ["Writing Across the Curriculum"]}, {"department": "CHEM", "number": "464", "credits": "3 Credits", "description": "Introduction to chemical kinetics and molecular dynamics.  CHEM 464 CHEM 464 Chemical Kinetics and Dynamics (3) CHEM 464 is a one-semester course that introduces students to chemical kinetics and molecular dynamics, the branch of chemistry concerned with the rates of chemical reactions and the microscopic details of how reactions occur. The course covers old and new experimental, theoretical, and computational methods for kinetics and dynamics. Example systems are chosen from a variety of application including gas-phase reactions, reactions in solution, atmospheric chemistry, and reactions in biological systems. Topics covered are: basic concepts, phenomenological treatments, mechanisms, chain reactions, potential energy surfaces, collision theory, transition state theory, analysis, reactions of surfaces, photochemistry, molecular beams, Monte Carlo methods, molecular dynamics, energy requirements for reaction, and energy disposition.", "prerequisite": "CHEM 450"}, {"department": "CHEM", "number": "466", "credits": "3 Credits", "description": "Introduction to physical chemistry with a primary emphasis on the statistical and molecular interpretation of thermodynamics.  CHEM 466 CHEM 466 Molecular Thermodynamics (3) CHEM 466 is a physical chemistry course that emphasizes the statistical and molecular interpretation of thermodynamics. This focus enables the student to consider macroscopic properties based on the constituent molecular properties. After a very brief introduction to classical thermodynamics, the statistics of large systems is introduced, used to develop the Boltzmann distribution of energies and then combined with the quantum mechanical structure of energy levels to form a basis to predict and understand atomic and molecular properties such as heat capacity and chemical reaction equilibrium. Solution thermodynamics, interfacial phenomena and colligative properties are discussed in terms of lattice models. The course then turns to a molecular view of transport and chemical reaction rates. Molecular transport is described in terms of random molecular motion and intermolecular forces that tie together to give macroscopic behavior such as ionic conductivity and mass diffusion. Reaction rates are formulated in terms of the distributions of energies and statistical probabilities of the combined reactants in a transition state. Cooperativity in phase transitions is discussed, followed by adsorption and catalysis. Examples with proteins and other biomolecules, as well as polymers and various solutions, appear throughout the course.", "prerequisite": "CHE 220"}, {"department": "CHEM", "number": "468", "credits": "3 Credits", "description": "It is said that there are more than nine million organic chemical compounds. If you add to this list, inorganic complexes, composite materials such as alloys, minerals, and intermediate species like radicals and transition states, the list becomes truly monstrous. Also, the number of properties that interest scientists and engineers is vast (although modest compared to the above). A fascinating aspect of science is that it reveals a small number of general principles that govern the huge number of substances and their reactivities and properties. One powerful tool in the chemist's toolbox is Spectroscopy, which allows us to identify and monitor molecules at stages prior, during, and post reaction. Spectroscopy has allowed chemists to generalize many aspects of molecular behavior in a wide assortment of environments, ranging from vacuum to physiological conditions. In this course,  condensed-phase spectroscopy will be emphasized, and we will focus largely on how the tools of molecular spectroscopy can be used to describe interactions between molecules and their surroundings. These interactions can have broad chemical consequences, which include changing molecular polarizabilities and reaction energetics. Therefore, the outcomes of condensed-phase chemical processes are largely influenced by these molecule-surroundings interactions. In this context, we will address important questions of how solvents modify molecular spectroscopic signals, and how these changes can be used for understanding chemical processes. We will begin by describing the properties of electromagnetic radiation and the absorption and emission of light by molecules. In particular, we will introduce, discuss, and apply the concepts of eigenvalues, eigenfunctions, and superpositions of molecular electronic and vibrational states. We will demonstrate how these concepts can be used to predict spectra for isolated (i.e. gas-phase) molecules. We will then extend these concepts to understand how solvents and other environmental influences impact these spectra. Another focus of the course will include explanations of how specific experimental techniques, such as transient and photoluminescence pectroscopy, can be used to understand the efficiencies of specific chemical transformations (e.g. isomerization, electron and proton transfer, dissociation), which are central to reactions in chemical, biological, and materials environments. We will also discuss recent experimental advances that have expanded the spatial, temporal, and energy resolutions of spectroscopic measurements.", "prerequisite": "CHEM 452"}, {"department": "CHEM", "number": "472", "credits": "3 Credits", "description": "Basic structure and function of cellular components; principles of enzyme kinetics and regulation.  CHEM 472 General Biochemistry I (3) CHEM 472 will serve as an introductory course in biochemistry. The course will begin with a review a number of chemical concepts applicable to biochemistry including molecular interactions, acid-base reactions, buffers, titrations and basic thermodynamic and kinetic concepts. The focus will then shift to a discussion of the structures of the biomolecules that make up living matter including carbohydrates, lipids, membranes, proteins, and enzymes, emphasizing the relationship between chemical structure and biological function.", "prerequisite": "CHEM 212"}, {"department": "CHEM", "number": "474", "credits": "3 Credits", "description": "Theory and methodology of organic synthesis applied to complex organic molecules.  UCHEM 474 CHEM 474 Organic Synthesis (3) CHEM 474 will present the theory and methodology of organic synthesis. The course will initially focus on the methodology necessary to synthesize complex organic molecules. This will include an in-depth look at functional group transformations, carbon-carbon bond forming reactions, ring-forming reactions, aromatic chemistry and heterocyclic chemistry. We will then discuss the use of retrosynthetic analysis and the \"disconnection approach\" to logically guide total synthesis. Finally, a number of literature syntheses will be used to examine the strategies involved in formulating a total synthesis emphasizing the compatibility of functional groups, sequence of reactions, use of protecting groups and the impact of stereochemistry.", "prerequisite": "CHEM 212"}, {"department": "CHEM", "number": "476", "credits": "3 Credits", "description": "Fundamentals of Biochemistry for Chemists. Students cannot receive credit for both CHEM 476 and BMB 401.  CHEM 476 Biological Chemistry (3) This course is designed to be an introduction to biological chemistry from a chemistry student's perspective. The course will cover the basics of protein, nucleic acid, lipid and carbohydrate structure. The three-dimensional structural aspects of these biological macromolecules will be emphasized, showing their structure-function relationships. The course will also cover some of the chemical logic in enzymatic reactions, drawing from advanced organic and inorganic chemistry concepts, and include a focus on physical processes such as reaction kinetics and binding equilibria. More advanced topics of interest to chemistry students will also be covered, including the biochemical aspects of drug design and discovery. Throughout, the approach will be to introduce the analytical tools that have led to major advances in biochemistry as well as the physical and chemical principles underlying each topic. The course will follow a textbook designed for chemistry students. It will also include reading assignments of several types, including historical papers and current scientific literature dealing with recent advances in the field. The course also includes assignments that require students to familiarize themselves with modern biochemical databases such as those from the National Center for Biotechnology Information.", "prerequisite": "CHEM 212"}, {"department": "CHEM", "number": "480", "credits": "3 Credits", "description": "This course will be an introduction to the chemistry and properties of polymers. Topics will include in-depth focus on polymerization mechanisms and kinetics (radical, anionic, cationic; ring opening polymerization, coordination polymerization; copolymerization), methods for polymer characterization, structure-property relationships in polymers (especially how the chemical structure affects mechanical and thermal properties), and overview of key chemical processing methods for polymers. Some special topics will also be included, such as conducting polymers for electronics, polymers for biomedical applications, the chemistry/processing of photo resists for photolitography and multiphoton lithography, and 3D printing.", "prerequisite": "CHEM 210"}, {"department": "CHEM", "number": "494", "credits": "1-10 Credits/Maximum of 20", "description": "Experimental investigation of an original research problem. Preparation of a formal thesis is optional. (Credit not allowed for graduate students in Biochemistry, Chemistry or Chemical Engineering.)"}, {"department": "CHEM", "number": "494H", "credits": "1-10 Credits/Maximum of 20", "description": "Experimental investigation of an original research problem. Preparation of a formal thesis is optional. (Credit not allowed for graduate students in Biochemistry, Chemistry or Chemical Engineering.)", "other": ["Honors"]}, {"department": "CHEM", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor"}, {"department": "CHEM", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "CHEM", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CHEM", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]