[{"department": "CNED", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CNED", "number": "100", "credits": "3 Credits", "description": "Examination of internal and external factors that contribute to career development to assist students undecided about major or career.  CN ED 100CN ED 100 Effective Career Decision-Making (3) CN ED 100 teaches students career decision-making skills by closely examining internal factors, the world of work, and decision-making styles and strategies. The premise of this course is that career decisions are greatly enhanced by: (1) considering personal traits such as interests, values, abilities, decision-making styles and other factors; (2) gathering information about the world of work and education; and (3) integrating knowledge about the self and the world through an on-going process. Learning the career decision-making process is empowering and skills learned in the course can be valuable throughout life as individuals encounter crossroads that may prompt career changes. CN ED 100 is intended for students who are undecided about their major and career selection. The course format consists of lectures, discussions, and experiential learning activities designed to help students analyze their personal traits and to relate their traits to career theories, occupational fields and work settings. Self-assessment activities include reflective writing, use of established career assessment inventories, and completion of various activities. Diverse information is shared on majors and occupations as well as information gathering strategies. Students more closely discuss their career development and progress in formal small group sessions, facilitated by career counseling professionals. Five classes of the semester are devoted to these meetings."}, {"department": "CNED", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CNED", "number": "198", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CNED", "number": "200", "credits": "1 Credits", "description": "This course will prepare students for the roles and responsibilities of being a Peer Mentor.  CN ED 200 Peer Mentoring (1) \"Peer Mentoring\" is designed to present to the student the basic principles, characteristics, and benefits of a peer mentoring relationship. Peer Mentoring is a beneficial relationship to both the mentee and mentor and ultimately can aid in college retention rates. Once this knowledge is gained, students in the course will learn how to deal with the various situations that could occur during the transition process. This course offers the student the opportunity to develop intellectual relationships with faculty, current campus peer mentors, and fellow classmates who share similar academic interests in leadership, mentorship, and role modeling. In this course, students will be introduced and learn to apply active listening skills, the hidden rules of college, how to conduct mentee interactions both virtually and in person, intrinsic and extrinsic motivation, along with cultural and self-awareness. Once introduced to the multi-layer elements of the course, students will demonstrate their knowledge of these skills through their in class involvement. The course is delivered as an interactive learning environment where in class exercises and hands-on demonstrations help the student understand the principles and implications of peer mentoring. Additionally, students will work on a campus resource project outside of the classroom that will be presented to the entire campus community at the conclusion of the semester. The course is open to all students, however, students interested in taking the course must get course entry approval by the faculty member in charge to determine the student's true interest in peer mentoring."}, {"department": "CNED", "number": "280", "credits": "1 Credits", "description": "This course will teach students how to implement a career strategy to effectively secure a job/internship."}, {"department": "CNED", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "CNED", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CNED", "number": "298", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CNED", "number": "301", "credits": "2 Credits", "description": "Exploration and development of leadership and group process skills necessary for effectively managing student organizations in higher education settings."}, {"department": "CNED", "number": "303", "credits": "1 Credits", "description": "An aid in preparing students with information helpful for entry into education and alternative job markets."}, {"department": "CNED", "number": "304", "credits": "3 Credits", "description": "Student development theories: skill development in listening, informing, and referring culturally diverse peers in individual and group situations.", "prerequisite": "limited to students selected as peer assistants or similar   positions"}, {"department": "CNED", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CNED", "number": "401", "credits": "3 Credits", "description": "An overview of diagnosis and assessment, models for chemical dependency prevention, counseling, and recovery; contexts of chemical dependency treatment.", "prerequisite": "3 credits in general psychology"}, {"department": "CNED", "number": "404", "credits": "3 Credits", "description": "The nature and functioning of groups in educational and agency settings. Provides prospective counselors with experience in the group process.", "prerequisite": "6 credits in counselor education; 6 credits in psychology,   sociology, or individual and family studies"}, {"department": "CNED", "number": "416", "credits": "3 Credits", "description": "This course examines families with chemically dependent members, dynamics, appropriate interventions, and treatment.", "prerequisite": "CN ED401 or RHS  301"}, {"department": "CNED", "number": "420", "credits": "3 Credits", "description": "Study of youth who are at-risk of developing chemical dependency including the characteristics and factors related to chemical dependency.", "prerequisite": "CN ED401"}, {"department": "CNED", "number": "421", "credits": "3 Credits", "description": "Examines helping professional's role in primary and secondary prevention of substance abuse, and related problems like delinquency, suicide, and pregnancy.", "prerequisite": "CN ED401"}, {"department": "CNED", "number": "422", "credits": "3 Credits", "description": "Study of the fundamental principles of counseling individuals with a wide variety of addictions.  CN ED 422 Foundations of Addictions Counseling (3)Students explore the fundamental principles of addictions counseling from a wide range of perspectives. These include the psychopharmacological aspects of alcohol and abusable drugs, along with theories and assessments of addictive disorders. Many treatment models are considered, and are examined in the context of individual, group, and family therapy perspectives. The course also addresses the research literature on codependence, COA's AA and other 12-step programs, dual diagnosis, relapse, prevention, and multicultural and gender issues.", "prerequisite": "a minimum of 12 hours of coursework in sociology, psychology,   education, or family studies."}, {"department": "CNED", "number": "423", "credits": "3 Credits", "description": "Exploration of early stages of adolescent \"at-risk\" behavior and skills for student assessment and intervention within schools and communities.", "prerequisite": "CN ED401"}, {"department": "CNED", "number": "424", "credits": "3 Credits", "description": "This course provides individuals with relevant skills and knowledge to assist others in planning careers and obtaining meaningful work.  CN ED (WF ED) 424 Facilitating Career Development (3) This course provides individuals with relevant skills and knowledge to assist others in planning careers and obtaining meaningful work. This course addresses the following 12 Career Development Facilitator (CDF) competencies: 1) helping skills, 2) labor market information and resources, 3) assessment, 4) diverse populations, 5) ethical and legal issues, 6) career development models, 7) employability skills, 8) training clients and peers, 9) program management/implementation, 10) promotion and public relations, 11) technology, and 12) consultation. These 12 competencies are identified by the National Career Development Association (NCDA) for those who (will) deliver career development programs and services in a variety of settings. Potential job titles of CDFs include career group facilitator, job search trainer, career resource center coordinator, career coach, career development case manager, intake interviewer, occupational and labor market information resource person, human resource career development coordinator, employment/placement specialist, and workforce development staff. With certain years of work experience in career development, students who complete this course are eligible to apply for the Global Career Development Facilitator (GCDF) certification through the Center for Credentialing & Education (CCE), which is affiliated with the National Board for Certified Counselors (NBCC). A GCDF is a person who works in any career development setting or who incorporates career development information or skills in their work with students, adults, clients, employees, or the public. As of January 2011, about 18,000 individuals acquired the GCDF certification world-wide including Bulgaria, Canada, China, Germany, Japan, Romania, Turkey, South Korea, and New Zealand. The goal of the GCDF credential was to provide standards, training specifications, and credentialing for diverse career development practitioners. This GCDF credential differentiates two levels of career practice, which are 1) career counseling and 2) career facilitation that does not require a counseling degree. This differentiation reflected the reality where many individuals who are currently providing career assistance are not professional counselors. This course is taught by a nationally and internationally trained CDF Instructor (CDFI) who is certified by the NCDA. In addition, the CDF curriculum is updated every three years by the Career Development Leadership Alliance (CDLA) under the supervision of the NCDA CDF Advisory Council in order to keep up with recent changes in the field.", "prerequisite": "300-400 level Psychology, HD FS, or Education courses or   permission of the program", "other": ["Cross-listed with: WFED 424"]}, {"department": "CNED", "number": "430", "credits": "3 Credits", "description": "The theory and practice of counseling with couples and families emphasizing family development and major intervention approaches.  CN ED 430 Couples and Family Counseling (3)Students study the theory and practice of couples and family counseling with an emphasis on models of family development and major approaches to intervention with couples and families. Systemic models of family intervention are emphasized as well as the study of other historically important and contemporary approaches to couples and family therapy. The course blends didactic and experiential learning.", "prerequisite": "A minimum of 12 hours of coursework in sociology, psychology,   education, or family studies."}, {"department": "CNED", "number": "431", "credits": "3 Credits", "description": "This course is focused on how to counsel and/or teach youth at risk for a variety of social, emotions, and educational problems.  CN ED 431 Counseling and Teaching Youth at Risk (3)This course is designed to provide participants with an overview of information focused on counseling and teaching youth at-risk. Emphasis will be placed on identifying youth-at-risk for depression, suicide, eating disorders, pregnancy, AIDS, use and/or abuse of alcohol and drugs, homelessness, gang membership, difficulties related to sexual orientation, and several other at-risk behaviors. Ideas for primary, secondary and tertiary prevention from individual, family, school and community perspectives will also be presented. The course provides a varied format structured to include lecture/discussion, audio-visual presentations, participant self-evaluation of their own at-risk behaviors, role-plays and small group discussion.", "prerequisite": "A minimum of 12 hours of coursework in sociology, psychology,   education, or family studies."}, {"department": "CNED", "number": "432", "credits": "3 Credits", "description": "Examination of the current ethical and legal issues related to professional counselors and counseling.  CN ED 432 Ethical, Legal, and Professional Issues in Counseling (3)Participants explore an overview of ethical and legal issues related to the professional practice of counseling. Topics include responsibility, competence, public statements, confidentiality, professional relationships, licensing and other regulatory programs, and research. The course emphasizes clinical strategies relevant to legal and ethical issues.", "prerequisite": "A minimum of 12 hours of coursework in sociology, psychology,   education, or family studies."}, {"department": "CNED", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "CNED", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CNED", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]