[{"department": "COMM", "number": "1", "credits": "1-3 Credits/Maximum of 8", "description": "A newspaper/print media practicum.  Credits do not fulfill Communication major credits in all programs."}, {"department": "COMM", "number": "2", "credits": "1-3 Credits/Maximum of 8", "description": "A newspaper/print media practicum.  Credits do not fulfill Communication major credits in all programs.", "prerequisite": "COMM 1"}, {"department": "COMM", "number": "3", "credits": "1-3 Credits/Maximum of 8", "description": "A broadcast media practicum.  Credits do not fulfill Communication major credits in all programs."}, {"department": "COMM", "number": "4", "credits": "1-3 Credits/Maximum of 8", "description": "A broadcast media practicum designed to provide students experience with TV and video production in a variety of contexts."}, {"department": "COMM", "number": "20N", "credits": "3 Credits", "description": "We live in a world in which we are surrounded with media messages that influence how we think and act. Since we are so immersed in media culture, it is important that we know how to analyze media content, production and reception, so that media can become tools for liberation and creativity, not control. In this course, we will learn to critically analyze work produced in different forms of mass communication. The course focuses on power, ideology and social inequality, analyzing relationships between media producers and audiences, and between information, the politics of representation, and power, including a focus on the crucial areas of gender, sexuality, class, and race. The course takes a dialectical perspective that focuses on both theory and practice, providing students with the opportunity and knowledge necessary to produce their own short film using the resources of Penn State's media commons.", "other": ["Cross-listed with: SOC 20N", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "COMM", "number": "99", "credits": "1-6 Credits/Maximum of 6", "description": "Courses offered in foreign countries by individual or group instruction. This course may not be used to satisfy the basic minimum requirements for graduation in any baccalaureate degree program."}, {"department": "COMM", "number": "100N", "credits": "3 Credits", "description": "Mass communications in the United States: organization, role, content, and effects of newspapers, magazines, television, radio, books, and films. The Mass Media and Society is an overview of the interaction between mass media and society. By drawing from selected topics, the course pays particular attention to the social influences (e.g., economics, politics, technology, law and culture) that shape media messages. Among others, the course examines the nature of media controllers as well as the character of users and consumers of media products. By so doing, students are informed about the overall structure and scope of the mass media and led to understand the power and influences associated with media messages and practices. By the end of the semester, each student should have a better understanding of the dynamic nature of the mass media in an information society.", "other": ["Cross-listed with: AMST 106N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "COMM", "number": "101N", "credits": "3 Credits", "description": "Creative work challenges the existing ways of seeing and understanding the world and is at the heart of many disciplines. This course will be an integrated general education course (GA-GS) that encourages students to approach Creativity through the concepts, principles, and the methods of scientific inquiry. This course will begin with an overview of the various approaches and theoretical views of Creativity. This will be followed by a module applying these to analyze the role of creativity in several global and cross-cultural works in the fields of art (paintings, sculptures), writing (prose, poetry, comics),mass media (movies,recorded music, magazines), strategic communications (advertisements, public relations, digital/internet marketing) science, and organizations. Students will develop an understanding and appreciation of the comprehensive role of creativity in the creative works, literature, and history of arts. In the third module, students will be introduced to techniques and strategies for creativity enhancement. During this module, students will learn of empirical investigations of how creativity enhancement has been studied and apply those techniques to their own work. The course will conclude with students producing their own creative work. Over the journey of this course, students will be sensitized and introduced to the science of creativity. Students will develop a better understanding of what is creative and what is not. Students will learn to think in an integrative way across disciplines, improve their critical thinking and analytical skills, while creating their own creative work.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "COMM", "number": "110", "credits": "3 Credits", "description": "COMM 110 Media and Democracy (3) (GH) (BA) This course meets the Bachelor of Arts degree requirements. COMM 110 seeks to introduce students to the important role of the mass media in developing conceptions of democracy and democratic participation in contemporary societies. Utilizing current events, popular culture and the students' own relationship to media as the template, this course is designed to stimulate student thinking about the interrelationship between the dynamics of US culture, news, politics, and civil society in order to develop a greater understanding and appreciation of what civic engagement and global awareness can do towards nurturing democracy's principles and practices.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "118", "credits": "3 Credits", "description": "COMM 118 Introduction to Media Effects (3) (GS) Aside from working and sleeping, individuals in the United States spend more time consuming media than any other single activity. By the time the average person reaches the age of 65, he or she will have spent over six full years of life watching television - not to mention the additional time spent reading newspapers and magazines, listening to the radio, using the Internet, and playing videogames. Given the centrality of media in the lives of most people, it is imperative that we understand and critically explore the variety of ways in which we perceived and are influenced by media messages. The purpose of this course is to introduce students to the study of the effects of media on individuals and on society. This course will overview a broad range of media theories that have examined media as a social force, that have explored factors that affect individuals' selection of and perceptions of media messages, and that have studied how media affect viewers' attitudes, beliefs, and behaviors. These theories will be used to examine a variety of different types of content, including media violence, portrayals of race and gender, politics, advertising, and entertainment, among others. Students will be assessed by exams on these theories and topics, by group-based writing assignments, and by an assignment requiring students to locate, identify, and critically evaluate media content that illustrates the theories and issues covered in class.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "COMM", "number": "150N", "credits": "3 Credits", "description": "COMM 150 (The Art of Cinema): COMM 150 is an introduction to cinema studies which aims to provide students with media literacy for a world in which communication is increasingly visual and cinematic in its form. The course assumes that films tell stories and make arguments as communicative forms by drawing on a visual language that can be learned. As such, films can be interpreted and analyzed to reveal something about the cultural conditions that produced them. The course seeks to familiarize students with examples of films that speak to both the forms that they follow and the cultural context in which they were produced. Movies, from early silent films to contemporary blockbusters, are examined as formal constructs, market commodities, and cultural artifacts that aim to represent a world for the viewer. Topics include the emergence of the cinema as a communications technology, business industry and cultural institution; the global dominance of classical Hollywood cinema; American film industry organization (production, distribution, exhibition, vertical integration, the studio system, the star system); analysis of film styles (national cinemas, historical movements); analysis of film genres (e.g., silent film melodrama, film noir, comedy, the war film, the western); consideration of film audiences (reception, spectatorship, criticism); introduction to film aesthetics (film art and appreciation); and alternative cinemas (independent, documentary and experimental cinemas). COMM 150 emphasizes media literacy and seeks to help students develop critical thinking, reading and viewing skills while providing them with a historical context for the media that they consume on a regular basis. All sections integrate lectures and readings with viewing feature films during the weekly practicum period. Many sections also incorporate slides and film or video clips during the lecture periods to allow students to exercise their critical viewing skills regarding certain teaching points. Students prepare for film screenings by reading, listening to lectures, and analyzing examples of relevant works. Introductory lectures seek to provide a critical and historical context for each week's screening; follow-up lectures offer critical analysis and examinations reward close viewing. The core purpose of the course, therefore, is to make film viewing a conscious, critical and analytic activity.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "150Q", "credits": "3 Credits", "description": "COMM 150H The Art of the Cinema (3) (GA) This course takes a critical and historical approach to cinema, exploring relationships between classical and contemporary films and society and culture. It stresses critical thinking, analytical viewing, and essay writing (rather than memorization of facts or aesthetic evaluation of movies). COMM 150H assumes that the cinema reveals, both directly and indirectly, something about collective experience, identity, and culture, and that movies can be analyzed-even psychoanalyzed-to reveal something about the cultural conditions that produced them and attracted audiences to them. The course seeks both to familiarize students with works they probably haven't seen and to \"defamiliarize,\" through critical and historical analysis, works they very well may have seen. Students will examine movies as formal constructs, market commodities, and cultural artifacts-as reflections, however distorted, of society in the twentieth and twenty-first century.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "151N", "credits": "3 Credits", "description": "The search for life beyond planet Earth has been the subject of much interdisciplinary scientific search and has stimulated human imagination. Scientific discoveries of exoplanets (outside of our solar system), of extremophiles (life which can survive in extreme conditions) and the discoveries of conditions on other bodies in our solar system which might be able to support life, has provided progress in answering the question of the existence of extraterrestrial life. Not only have a plethora of fictional work appeared in the film media to depict scenarios of life beyond Earth, but there has also been an abundance of video media created to present the scientific ideas to the wider audience beyond the scientific community. This course intends a critical evaluation of both nonfiction and fictional media works in the educational dissemination of scientific ideas and the effective presentation of concepts. We will analyze techniques in photography, mise en scene, editing, sound, dramatization and writing as they are applied to topics in astrobiology.", "other": ["Cross-listed with: ASTRO 141N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "COMM", "number": "160", "credits": "1 Credits", "description": "COMM 160 Basic News Writing Skills (1) COMM 160 is a one-credit course that will provide instruction in the basic writing skills required of all journalists. The course will cover three main topics: (1) spelling and word usage, (2) grammar, and (3) punctuation. Students will be assessed by exams on each of the three course parts and a comprehensive final exam. Writing is the lynchpin of the journalism curriculum and it is essential that students possess the basic writing skills necessary to be successful in journalism classes. For that reason, COMM 160 will be a prerequisite to all writing courses in the journalism curriculum. Students will be advised to take the course in their freshman year."}, {"department": "COMM", "number": "165", "credits": "1 Credits", "description": "is course will explore and apply the concepts, tools, resources and techniques involved in building a strong digital brand as students start preparing for a career in the communications professions. Students conduct guided reflection on their strengths and goals; craft mission statements meant to inspire and focus their curricular and co-curricular activities and internships; learn how to interact professionally with members of the profession; create and use digital tools to network and display their best work; practice an \"elevator pitch\" to connect their experience and aspirations, learn about internship opportunities and best practices in media-related professions; and hone their interviewing skills."}, {"department": "COMM", "number": "168", "credits": "3 Credits", "description": "This course is designed to give students an overview of American journalism's traditions, principles and values. It examines the historic role of journalism in a democracy and how that is often under economic, legal and political pressure. Students learn the different forms of journalism (print, electronic, internet, and converged.) They gain an understanding of what the forms share in common and how they differ. They also learn to identify the practices of responsible, ethical journalism, and irresponsible, unethical journalism. The goal is to help students understand the nature of journalism ¿ why it is the way it is, how it got to be that way, and what changes are likely in store ¿ so that they can be to be sophisticated consumers of the news.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "COMM", "number": "170", "credits": "3 Credits", "description": "COMM 170 Introduction to the Sports Industry (3) Since 1987 the sports industry has grown from $50 billion to more than $200 billion. It has become one of the ten leading industries in the United States. It is also an industry that is unlike any other in its structure and operating principles. In traditional business, the participants compete vigorously with one another for revenue and profits. By contrast, in almost every sports venture, the competitors, while competing on the field of play, must cooperate off the field in order for the venture to be profitable.  Students in this course will study the unique aspects of the sports industry. They will begin to understand the workings through learning the history. Students will study the effect of the sports industry on the mass media and vice versa. The interrelationships of sports with the print, broadcast and electronic media will be considered. Students will learn how the basic principles of law, marketing, labor relations, profitability, finance and economics apply to the sports industry.  The effect of legislation and regulation on the sports industry will be covered.The subject of ethics in sports will also be examined.  The course will explore the formation and structure of leagues and governing agents in the sports industry. Professional, amateur, collegiate, international and Olympic sports will be included.  An emphasis will be placed on current events in the sports industry. Students will be required to read and discuss the contents of weekly editions of Sports Business Journal. They will apply the principles learned in class and through the readings to the business problems of the day as reported in the Journal.  Career opportunities in the sports industry and related fields will be explored. Students will be able to begin to evaluate their interest and ability to pursue careers in this area.  The course will explore the formation and structure of leagues and governing agents in the sports industry. Professional, amateur, collegiate, international and Olympic sports will be included.  An emphasis will be placed on current events in the sports industry. Students will be required to read and discuss the contents of weekly editions of Sports Business Journal. They will apply the principles learned in class and through the readings to the business problems of the day as reported in the Journal.  Career opportunities in the sports industry and related fields will be explored. Students will be able to begin to evaluate their interest and ability to pursue careers in this area."}, {"department": "COMM", "number": "175N", "credits": "3 Credits", "description": "This course serves as an introduction to the integration of psychology and film analysis, with a focus upon mental health. PSYCH 175N / COMM 175N seeks to help students understand the extent to which cinema can influence our perceptions of mental illness, and how the experience of mental illness can influence cinema. Students will be guided to critically analyze and discover how cinema can build or break the stigma and stereotypes regarding various types of mental illnesses and their treatments. The course is designed to familiarize students with various mental disorders (e.g., autism, schizophrenia, bipolar disorder, dissociative identity disorder, anxiety disorders, substance abuse, and dementia), aspects of their treatment (e.g., psychotherapy, medication, and ECT), and the creative ways in which filmmakers can choose to portray mental illness and its treatment (e.g., camera angles, lighting, music, costuming, casting, editing, method acting, and marketing) across cinema formats (e.g., in feature, independent, and documentary films). Students will be guided to consider how the cinema has shaped their own perceptions of mental illness, and how they could guide a filmmaker to generate a creative, compelling, and accurate portrayal of various types of mental illness and their treatments. PSYCH 175N / COMM 175N emphasizes integrative thinking, and seeks to help students develop critical reading, viewing, and thinking skills. The course incorporates lectures and assigned readings with the viewing of feature films during a weekly practicum period. Most lectures incorporate case examples and video clips to help students exercise their critical thinking skills. Introductory lectures provide a critical social and historical context for each week's film screening. Follow-up lectures and discussions offer critical and integrative analysis. Course assessment includes both objective measures and essay exams. PSYCH 175N / COMM 175N is an Interdomain General Education course that incorporates student learning criteria from both the arts (GA) and the social sciences (GS). It assumes to prior exposure to psychology or to film studies. As such, the course is designed to have broad accessibility, primarily for introductory level students.", "other": ["Cross-listed with: PSYCH 175N", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "COMM", "number": "180", "credits": "3 Credits", "description": "COMM 180 Survey of Electronic Media and Telecommunications (3) (GS)(BA) This course meets the Bachelor of Arts degree requirements. This course is an introduction to electronic communications (telecommunications) and their consequences for society and the economy. Until a few years ago, this primarily meant over-the-air television, radio and cable TV, and a dial-up telephone. Increasingly, however, the field has expanded to include a wide variety of broadcast, wire-based and wireless forms of video, data and voice communications. The rapid convergence of previously disparate industries and services, especially the melding of television, telephone and Internet systems, will be a dominant theme in the course. At the same time, a global system of electronic communications has been steadily evolving. This class is also about the dynamics of that changing system; it is about the origins of the telecommunications system, and its future. To better understand these developments, we will examine powerful interacting forces that are shaping the world of information by drawing on history, economics, technology studies, politics, and culture.While the course is intended primarily for Telecommunications majors planning careers in these fields, all students will benefit from the course by learning to critically analyze media structures and programming and to better appreciate the importance of ICTs (Information, Communication and Technology) in their lives. This course serves both as an introductory core course for students in the Telecommunications major and as a broad social science course for students in other departments across the university. For students within the Telecommunications major, the course introduces the key terminology, concepts and issues in the field as well as the range of career options within the telecommunications industries. For students outside the major, this course provides a grounding in the current shirt from an industrial society to an information society in which electronic media play a pervasive role in our personal, social, economic, and political lives.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "COMM", "number": "190", "credits": "3 Credits", "description": "COMM 190 (GAME 140) Gaming and Interactive Media (3) The course is an introduction to the digital interactive media industries for students who may consider seeking employment in that sector, which includes video games and simulations, products for education, training, medicine, business, government/military, and virtual environments for a range of applications. Students will learn about industry structures, basic economics, business models, work flow, types of enterprises, job descriptions, and opportunities. It examines both the national and global markets. It provides students with a factually and theoretically informed appreciation of these industries.  The course will build on the students' personal and social experiences of these media, but it is not a course about playing or designing games or mastering individual applications. No special knowledge or experience in playing video games, using \"serious games,\" or experiencing virtual worlds is required. It will provide students with the foundation to make a well-informed choice about careers in this sector and respond to their natural curiosity about this pervasive part of their lives.  The course is divided into five segments. The first provides general context: history, scale and scope of the field, information on industry structure, business models and operations, and types of skills required. The second focuses on the video game industry, including social, regulatory and ethical issues. Video games are now a major media industry, having surpassed in U.S. revenue both the movie and recorded music industries. The third section looks at \"serious games.\" A \"serious game\" is a game designed for a primary purpose other than pure entertainment, such as education, scientific exploration, health care, emergency management, city planning, military, engineering, religion, etc. The fourth segment looks at simulations and virtual worlds and their multiple models and uses (entertainment, learning, business, research, etc.), and the development of related online communities. The final section will examine the interrelationship of these industries with the other entertainment industries in terms of planning, marketing, finance, production, etc. It will conclude with a look ahead at new technologies, markets, business models, advancements in artificial intelligence and the convergence of virtual and material worlds.  The course will employ presentations, class discussions, outside readings, demonstrations, videos, class exercises, online explorations, guest experts (in person and via technology), and experiences in virtual worlds.", "other": ["Cross-listed with: GAME 140", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "COMM", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "COMM", "number": "205", "credits": "3 Credits", "description": "COMM (WMNST) 205 Gender, Diversity and the Media (3) (GS;US)(BA) This course meets the Bachelor of Arts degree requirements. This course examines diversity, equity and inclusion issues in media content, media business and media practice. Students examine communications scholarship, theory, media effects research and critical analysis of media content, policy and practice. Students learn about the media industry, its diverse distribution formats and representation patterns and the media role as public educator and social reality framer. Students research scholarship on human diversity issues in media representation and media effects and explore economic, political and social implications of media practice. Students critically analyze media content and media industry practice to build knowledge about ethical and responsible media practice. Course content is designed to help build deeper knowledge of how media interacts with identity formation, public knowledge and social understanding or misunderstanding of gender, race, ethnicity, ability, sexual orientation and class diversity, equity and inclusion. Students learn relevant communication theory to help explain how media interacts with our identity formation and our capability to navigate human difference in society. Students build critical thinking and media literacy skills, which are essential to navigate media and distinguish truth from fallacy. The course provides a foundation for further study of media in our diverse complex US democracy and global society and empowers students to interpret and pursue their interests, rights, and opportunities with ethics and integrity as media professionals.", "other": ["Cross-listed with: WMNST 205", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "208N", "credits": "3 Credits", "description": "This course is an introduction to the visual culture, the visual experience and sociological/historical context of images of the Middle East in the US mass media. The focus of the course will be on reading and interpreting visual images (painting, photography, film, illustration, digital media) and analyzing the larger social and cultural forces that shape the production, distribution and consumption of these media forms. We will explore these issues by focusing on a series of images/case studies located in a specific historical context, allowing us to introduce some of the major movements in visual culture, explore the social contexts of these images, and the ways in which the visual experience shapes our social lives and personal identities. Course evaluations will include exams, writing assignments, a class blog, and a final art project. The course examines visual representations of cultures over time, providing students with the artistic, historical, political and sociological context of their production. This integrative framework will enable students to understand how the creation of visual media and its interpretations both influence and are influenced by social context. It will introduce students to integrative thinking by providing them with interpretive techniques of the social sciences and the arts to increase their powers of visual analysis so that they can discuss an image's medium, composition, style and iconography. The course will examine the ways that the arts can be an expression of cultural values, helping students to comprehend the hegemonic aspects of image composition, production, exhibition and distribution. The course will explore the social milieus in which media is created, often depicting stereotypical images that poorly represent the complexity of the myriad cultural groups in the Middle East.", "prerequisite": "ENGL 15", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "COMM", "number": "215", "credits": "3 Credits/Maximum of 3", "description": "An introduction to digital photography, emphasizing camera skills, aesthetics and storytelling. COMM 215 Basic Photography (3) An introduction to photography as a means of visual communication in the digital age. Students will learn basic picture-taking principles, camera techniques, photographic aesthetics, and the use of digital imaging software. Students will be encouraged to explore photography as an aesthetic, expressive, and socially significant medium. This will be achieved through individual and group critique of each student's photographs, as well as through analysis of examples of the work of prominent photographers. Students will complete a series of assignments that help them learn to produce visual content for a digitally savvy audience. At the end of the semester, students will be able to produce story-telling images as well as write captions for their photographs. They will have a knowledge of the aesthetics of photography, will understand the importance of both form and content, and will have the ability to critically evaluate photographs."}, {"department": "COMM", "number": "222N", "credits": "3 Credits/Maximum of 3", "description": "How do we perceive injustice? What are the roles of images in our perceptions of justice? If justice lies in the eyes of the observer, as the saying goes, what are the eyes seeing? Creating an image does not only mean creating the strictly visual, but also words that capture the imagination. Where do those words lead us? Social Justice and the Image (GA/GH) prompts students to reflect upon image-making and the reception of images in a variety of social justice contexts, to study the public claims made upon these images, and to explore interdisciplinary texts on social justice that assist us in interpreting those claims. Students will be introduced to a variety of critical approaches to social justice, and reflect upon how these images are connected to social movements, visual rhetoric, poetic protest, and rights-building. Readings will generally be determined by the instructor, and may include the work of authors such as Confucius, Plato, Aristotle, Asho Zarathushtra, Mary Wollenstonecraft, Louis Althusser, Gordon Avery, Gloria Anzaldúa, John Rawls, Roland Barthes, Warren J. Blumenfeld, Judith Butler, Virginia Held, Patricia Hill Collins, Donna Haraway, bell hooks, and Seyla Benhabib, and Ximena Zúñiga. The subjects of study will be images, justice, and the categories ascribed to them, but also the possibility of challenging those categories. Rather than focus on how justice and images are treated by various disciplines separately, students will be asked to explain how various disciplines speak to (or perhaps ignore) one another, and what is missing from the analyses. \"Interdisciplinary work,\" Roland Barthes wrote, \"is not about confronting already constituted disciplines (none of which, in fact, is willing to let itself go) . . . Interdisciplinarity consists in creating a new object that belongs to no one.\" Social Justice and the Image invites students to \"let go\" with scholarly intensity, to explore what happens when disciplinary insights converge. ENGL 15 is recommended prior to COMM 222N", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "228", "credits": "3 Credits", "description": "Introduction to Science Writing and Science Communication (3) COMM 228 introduces students to the basics of science writing and communication. Through a combination of lecture, discussion, and writing assignments, students learn how to write science stories that are accurate, clear, and compelling. After completing COMM 228 are students will be able to: demonstrate an understanding of the importance of science communication; write interesting, clear science stories that grab the reader's attention and explain the science in terms that people with a non-scientific background can understand; gather information through the use of interviews, research documents, scientific conference papers, and events.; generate story ideas that reflect an understanding of important science stories; produce copy free of misspellings, grammatical errors, AP style errors, and factual errors; understand the legal, ethical, and historical principles underlying science communication, including the role of science in society; and communicate the latest scientific, technological, and medical findings to create an informed populace."}, {"department": "COMM", "number": "230W", "credits": "3 Credits", "description": "COMM 230 Writing for the Media (3)This course is an introduction to writing for various kinds of mass communication media. Students will practice writing public relations news releases, public information announcements, print, television and radio advertisements, as well as news stories and editorials. Students will be given weekly writing assignments, some of which will be re-writes of earlier submissions. In-class exercises will include various writing exercises designed to get students more comfortable with writing for media. Prerequisite: ENGL 015 and ENGL 202.", "prerequisite": "ENGL 15", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "234N", "credits": "3 Credits", "description": "This introductory course will combine theory and practice to help students develop a rich understanding of the constantly evolving US digital culture. We will survey a variety of information and communication technologies (ICTs), and their modes of production, distribution, and consumption by individuals and institutions including traditional media, business, and government. Specifically, we will examine the impact of social and mobile technologies on how we consume, share, resist, and participate in digital culture. Students will also develop basic technical and media creation skills. The general theme of the course is analyzing contemporary cases to understand the significance of new ICTs in shaping our identities, behaviors, language, imaginations, and society. Students will read texts authored by some of the most formative thinkers examining the impact ICTs on society, and apply these core concepts in our analysis of digital cultures. Students will actively use microblogging, RSS feeds, social networking and other Web 2.0 tools to produce and consume content, interact with peers, and reflect critically on this experience. This course will emphasize awareness of current events and technology trends, as well as critical thinking skills and the ability to frame and explore issues through written, visual and verbal communication. This is an introductory course in IST and COMM, and meets the requirements for a Social and Behavioral Sciences (GS) and Humanities (GH) Course. This course is delivered with significant student and instructor interaction with computers and digital media.", "other": ["Cross-listed with: IST 234N", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "COMM", "number": "235N", "credits": "3 Credits/Maximum of 3", "description": "This course introduces students to the ideas and skills that comprise \"public humanities,\" with a focus on digital media tools. It aims to develop student understanding of how public humanities work can address present-day problems, fostering empathy within and building bridges between persons, groups, and communities. It offers hands-on training in three forms of digital media: documentary film, podcasting, and web publishing. Through honest and respectful engagement with a diverse range of ideas, perspectives, and experiences, students will develop creative and critical thinking and problem-solving skills by locating, analyzing and applying information in project formation and production. This course is cross-listed as COMM 235N.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "COMM", "number": "241", "credits": "3 Credits", "description": "Introduction to basic design principles, critical analysis of visual material, and solving graphics problems utilizing traditional and digital production tools."}, {"department": "COMM", "number": "242", "credits": "3 Credits", "description": "COMM 242 Basic Video/Filmmaking (3) COMM 242 is an introductory course that emphasizes the development of creative expression and technical skills in digital film production. Students will explore modes of moving image representation through screenings, lectures, discussions, and especially through hands-on digital filmmaking. Students are required to construct projects that have both clear intentions and technically competent execution. The work of the course will facilitate the development of basic skills in image design, editing, and writing as they apply to single camera techniques for documentary, narrative, and experimental film modes. The course will also provide a basic cultural and historical context for the various production modes, and students will be encouraged to consider their own projects in relation to the work of other video and film artists. Creative collaboration and group critique are essential elements of the course. Students will be required to produce some collaborative projects, and to respond critically to the work of the other students in the course. Students will make projects using digital film cameras, microphones, portable lighting, and nonlinear editing stations.", "prerequisite": "COMM 150"}, {"department": "COMM", "number": "250", "credits": "3 Credits", "description": "This is an intermediate film studies course that teaches the student to consider various theoretical approaches to the analysis of film, and to the moving image in general. The course familiarizes the student with formal analysis as a foundation for these various approaches, which include authorship, feminism, cultural studies, realism/montage theory, genre theory, and cultural difference theory.", "prerequisite": "COMM 150", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "COMM", "number": "251", "credits": "3 Credits", "description": "A theoretical, cultural, and philosophical study of print and non-print media, including their histories, possibilities, limitations, and interrelationships.  COMM 251 The Nature of Media (3) An examination of the theory, history, practice, and meaning of media. Within the framework of various media theories, students examine how print media, broadcast media, film, telephones, the Internet, and other technological forms communicate. Executives and practitioners from various media outlets visit the class to discuss what happens in the real world and what career opportunities might be available. Emphasis is placed on a final creative project which should reflect each student's understanding of the nature of media and how it creates the culture we live in."}, {"department": "COMM", "number": "260W", "credits": "3 Credits", "description": "COMM 260W News Writing and Reporting (3) COMM 260W introduces students to the basics of news reporting and writing. Through a combination of lecture, discussion, and writing assignments, students learn how to write news stories that are accurate, fair, clear, and concise. The goals of COMM 260W are to produce students who can: * Demonstrate an understanding of the importance of accurate, thorough, and fair news writing * Write concise, well-organized stories with effective leads that get the reader's attention and tell the most important news * Gather information through the use of interviews, documents, and basic reference materials * Generate story ideas that reflect an understanding of the elements of newsworthiness (timeliness, prominence, proximity, conflict, novelty, and impact) * Produce copy free of misspellings, grammatical errors, AP style errors, and factual errors * Understand the legal, ethical, and historical principles underlying journalism, including the role of journalists in society * Appreciate the joy and importance of being well informed", "prerequisite": "COMM 160", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "261", "credits": "3 Credits", "description": "Representative nonfiction by writers such as Susan Sheehan, George Orwell, Joan Didion, Alice Walker, Truman Capote, C. D. B. Bryan, Russell Baker.  COMM 261 The Literature of Journalism (3) (GH) The Literature of Journalism introduces students to 20th century nonfiction by people who were/are considered journalists. Most of the work originally appeared in magazines or newspapers and in some cases was expanded on before being published as a book. This is not a course in literary journalism, although some of the books assigned might qualify as such. Instead, the course is designed to give students a greater appreciation for the journalistic enterprise and different styles of writing. Students will also see how different writers influenced other writers. Students will read works by Hunter Thompson, Alex Haley, Joan Didion, Truman Capote, George Orwell, and James McBride, among others.", "other": ["General Education: Humanities (GH)"]}, {"department": "COMM", "number": "268", "credits": "1 Credits", "description": "Over the 10 weeks of this Technology Skills/Tools course students will build a working competency with the industry standard graphics software (such as the Adobe Creative Suite) as used in many careers in the mass media. Specifically, the course will explore how common image editing and page layout graphics programs are utilized for advertising communications as well as for journalistic applications for public relations and news communications. Students will learn an overview of graphics file formats created from the design software, as well as other basic design terminology and how and when each software program could be used appropriately in the development of mass communication messages. By the end of the 10-week course students will understand the basics of image correction (journalistic use) and photo collaging/manipulation (advertising/design use) and how to save these corrected and manipulated images. As the development of communication materials is a cumulative process, students will then learn how these images can be incorporated into end result basic page layouts along with text elements in ads, brochures, posters, web pages & editorial articles."}, {"department": "COMM", "number": "269", "credits": "3 Credits", "description": "COMM 269 Photojournalism (3) Photography as a medium for communication; creating visual content for newspapers, magazines, and online publications; digital camera and editing techniques.  Students complete a series of assignments that help them learn to produce visual content for newspapers, magazines, and online publications. Major topics of the course include fundamentals of digital photography for multimedia and print, ethics, composition, caption writing, photo editing, and the use of electronic imaging software.  Through individual and class projects, students critically evaluate their own work and the work of others. Students use class assignments to create a portfolio", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "270", "credits": "3 Credits", "description": "Introduction to multimedia project activities to explore image editing, layout, the integration of texts and images and web architecture."}, {"department": "COMM", "number": "271", "credits": "3 Credits", "description": "The course introduces how journalists work with the tools of multimedia and how multimedia is changing journalism.  COMM 271 Principles of Journalism (3) Journalists have never had better tools to cover the news than they do today. Every news organization can now tell stories with text, video, sound and images. Reporters can interact with their audience while covering stories in real time. Audiences have unprecedented choice in when and where they can access information. These innovations are allowing the news industry to reinvent itself. But there are major challenges. What does it take to be competitive in a 24/7 news cycle? What is the best way to work with text, video, still images and sound? How much do reporters and editors need to know about these tools? What role do social media have in this mix? Are ethical standards and being lost in the scramble to gain audience and grow revenue? This course will introduce multimedia news and be a foundation for skills courses. It will examine the latest platforms and tools of the trade, adding value with multimedia, the roots and development of multimedia, working in a cross-platform environment, multimedia reporting and editing, data visualization, intellectual property rights, ethical issues, citizen journalism, social media and the news, business models for multimedia journalism, finding a job, and other subjects."}, {"department": "COMM", "number": "280", "credits": "3 Credits", "description": "Students will evaluate content creation and distribution methods and demonstrate proficiency across emerging digital products and services.  COMM 280 Introduction to Telecommunications Technologies (3) The media, communication and information industries of the 21st century are built upon the digitization of information. Professionals and consumers alike rely on digital technology for the creation and distribution of content. The technologies used for production, distribution and consumption of this content continue to evolve at a rapid pace. The proliferation of smartphone, tablet, and wearable devices has dramatically altered the way in which consumers interact with media. This course will introduce students to the basic technologies used in the creation of various types of digital content and examine the technologies used to distribute that content across wireless and wired networks. By the end of this course, students will understand the prevalent technologies utilized within the telecommunications industry. Through extensive project work, students will also develop an appreciation for the myriad of compatibility challenges that exist in a world with rapid technology advancements and multi-industry convergence. This course is especially appropriate for students in the Telecommunications major as it will familiarize them with the technologies they will encounter during their course of study and future careers."}, {"department": "COMM", "number": "282", "credits": "3 Credits", "description": "COMM 282 provides an introduction to the pre-production, production and post production techniques when creating video content. The course will explore the grammar and syntax of constructing and criticizing video messages in single camera productions. Students will apply shooting and editing concepts while doing a variety of projects typical of single camera shoots. Students will learn the particularities of single camera production from the textbook, the lectures, discussions and classmates' experiences. While learning the technical aspects of video production, the students will learn the managerial aspects of production. Students will practice and apply the processes of budgeting, topic and location research, script writing, production treatments, dealing with unions, releases, etc."}, {"department": "COMM", "number": "283", "credits": "3 Credits", "description": "Students will learn the technical aspects of multi-camera studio television production. COMM 283 Introduction to Multicamera Production (3) Communications 283W is an advanced video course. The course builds on the principles learned in Communications 282.The purpose of this course is two fold. The first goal is to learn the technical aspects of multi-camera (studio) television production. Students will learn how to brainstorm ideas, write program proposals, treatments and scripts for various formats of television studio production. Incorporated in the technical aspects of the class, the students will learn how to produce and direct a studio production. They will also learn all the crew positions in a television studio production including audio, teleprompter, technical director, assistant director, videotape, floor manager, character generator operator and camera crew. The second goal of this course is to apply the grammar and syntax of constructing and criticizing video messages to multi-camera television productions. Students will apply shooting, producing and directing concepts while doing a variety of projects typical of multiple-camera shoots. They will learn the particularities of multi-camera television production from lectures, discussions and their own experiences.", "prerequisite": "COMM 282"}, {"department": "COMM", "number": "290N", "credits": "3 Credits/Maximum of 3", "description": "This course explores how films reflect (and in some cases attempt to explain, promote and memorialize) the emergence and transformation of global social phenomena. Through course readings, students will become familiar with key texts on globalization produced by social scientists and cultural theorists, and will link those key texts to a diverse array of cinematic representations of various global actors, issues, institutions and processes, as well as historical and theoretical interpretations and debates on globalization. The course introduces students to the work of internationally recognized film directors (for example, Euzhan Palcy, Jia Zhangke, Stephen Frears, Rainer Werner Fassbinder, or Majid Majidi) and studies of globalization (by scholars such as Arjun Appadurai, Guy Standing, Saskia Sassen, John Tomlinson, Robbie Robertson), and asks students to link scholarly perspectives with the visual rhetoric of cinema artists.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: SOC 290N", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "COMM", "number": "292", "credits": "3 Credits", "description": "This course explores the intersection of media and politics, introducing students to the critical analysis of mediated political discourse.  COMM 292 Introduction to Media & Politics (3) (GH)COMM 292 examines how mass media and political institutions interact to shape public thinking and debates around social goals, priorities, and policies. The course explores how media structures, routines, and practices shape political decision making; how political forces influence mass media institutions; and how public opinion and media audiences are formed. Students will gain an understanding of these issues through in-depth case studies, class discussions, and written assignments, helping students to develop their own informed views and to learn to express them constructively. The course is designed for both Communications majors and other students with an interest in media and politics.", "other": ["General Education: Humanities (GH)"]}, {"department": "COMM", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "COMM", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "COMM", "number": "296A", "credits": "1-6 Credits"}, {"department": "COMM", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "COMM", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "COMM", "number": "300H", "credits": "1 Credits", "description": "This course is designed to introduce third-year honors students to research across the communications disciplines. Discussions and guest speaker presentations will cover research from media studies, journalism, advertising, public relations, film and telecommunications. Research opportunities within the college will be explored. Students will learn about the thesis writing process and will be encouraged to select an honors advisor and choose a topic for their honors thesis during the semester.", "other": ["Honors"]}, {"department": "COMM", "number": "301", "credits": "3 Credits", "description": "This course examines the creation of content in film and television from the genesis of an idea to the deals on the back end. It will explore the new business models that enable content creators to keep pace with newer and more mobile technologies, encompassing the various ways viewers consume media content today. The class will include discussions with industry professionals, including from the creative side (actors, writers, directors, showrunners) and the business side (network and studio executives, agents and producers)."}, {"department": "COMM", "number": "302", "credits": "3 Credits", "description": "Comedy is an art. Each and every day, we are touched by comedy, from a movie we love to a sitcom we binge-watch. With the advent of new media, we watch more comedy now than ever before. The artists of comedy are numerous and have dominated television and film from the inception of these media. Their craft is not happenstance, although great comedians may make it look that way. Comedy is crafted through writing and performance and delivered in a variety of forms: from stand-up to musical theater, from television and film to online video. The genesis of this course is the why and how of comedy. It is only by a thorough look back at the evolution of comedy can we understand comedy today. In this course, we will study some of the great comedic films and television programs to get an understanding of comedic timing, rhythm and material. We will also explore comedy writing and take a look at how television and movies are created. Lastly, we will take a look at the creation of a sitcom or film. What can sustain a show over many seasons or a film to be economically successful. Students will learn how to develop an idea into a comedy show, as well as how to pitch that idea to industry executives."}, {"department": "COMM", "number": "303", "credits": "3 Credits", "description": "Entertainment law is an overarching term that describes the interplay between several areas of law, including contracts, intellectual property, agency, constitutional law, federal and state administrative law, labor law and negotiation. This course explores the key components that comprise entertainment law, including defamation, privacy, the right of publicity, parody and satire, violent and sexual content in media, stalking and paparazzi laws, regulation of talent and literary agents, the role of managers, copyright and trademarks, contractual obligations (step deals and production overall deals, options, permissions, clearances and releases), employment law (unions and guilds, child actors, equal opportunity) and FCC broadcast content regulations."}, {"department": "COMM", "number": "304", "credits": "3 Credits", "description": "COMM 304 Mass Communication Research (3) This course provides an introduction to the logic and methods of social science research as it is employed to study topics in media. Students will be introduced to key principles of social scientific reasoning, including aspects of concept explication and effective measurement, evaluation and demonstration of causality, and reliance on empirical data. Core standards of evidence are presented for both quantitative and qualitative data, but a focus is placed on statistical evidence and reasoning. Topics include effective question wording, ethical treatment of research participants, experimental research designs, sampling and survey research, content analysis, and sound interviewing techniques. In addition, students address key ideas in statistical analysis, including principles of inference, common descriptive statistics, and widely used tests of both bivariate and multivariate relationships. Presentation of this material includes training in effective use of appropriate statistical software. Based on this training, students should be able to contribute to sound research on media-related topics in both the academic and professional environments.  In addition, significant attention is paid to evaluating research done by others. Students read and assess original research and consider the merits of such research as well as its applicability to novel studies. Based on this training, students should be prepared to better understand the results presented in social scientific research, particularly within the field of media studies, and apply this knowledge to future coursework. Beyond this, students learn how to critically evaluate quantitative research when presented in media content, such as public opinion polling, and when making professional judgments about sound organizational strategies as a response to research conducted by others. At the end of this course, students should be better prepared to engage with the increasingly complex array of statistical information available to modern companies and citizens.", "prerequisite": "STAT 200"}, {"department": "COMM", "number": "305", "credits": "3 Credits", "description": "The course will acquaint students with the key terms, concepts and research areas of critical media studies (e.g. key terms/concepts and topic areas) and prepare them more effectively for advanced material in media studies. The course will also integrate practical insights into professional opportunities for the media studies major concentrations as well as future careers in media industries and media research (including jobs for the public sector, private industry, and academia). In addition, by presenting a critical perspective on the cultural forces represented by media in a global context, students develop media literacy skills to better evaluate their own use of media and the political and social consequences of the modern media industry. The course provides an overview of a diverse set of domains in the study of media throughout the world as well as the underlying principles that drive research in these areas and the skills necessary to both understand and evaluate such research. Perspectives summarized include critical theory, cultural studies, and political economy approaches.", "prerequisite": "COMM 100N"}, {"department": "COMM", "number": "310", "credits": "3 Credits", "description": "Analysis of audience data for traditional and new media to create metrics for advertising, content marketing and audience analysis.  COMM (IST) 310 Digital Media Metrics (3) The emergence of a converged marketplace where all media are now digital, including broadcasting, websites and social media, has created enormous new opportunities for advertising, promotions and content distribution. The proliferation of media has made the marketplace much more competitive, but simultaneously the availability of data too has increased significantly making possible the much more precise and segmented distribution of messages and content. For media practitioners in this new environment, a familiarity with audience data, metrics and dimensions is essential.  This course is an introduction to the methods for collecting, analyzing and utilizing audience data for traditional and new media. The class will cover the fundamentals of traditional media audience analysis, web metrics, and social media metrics, specifically as they relate to audience measurement, advertising campaign evaluation and content distribution. Students will learn the methods of data collection, analysis and use for traditional broadcast media, and the transformation of these practices in the newly digitized and converged multiplatform, multiscreen environment. The course will also cover the basics of data capture for new media (at an appropriate technical level), and the use of this data for the design of metrics appropriate for various purposes such as monitoring traffic, conversions and revenue generation. The use of metrics in pricing models for advertising, sales generation and content distribution will also be covered. Students will be introduced to data sources for digital media audience analysis, with a special focus on Google Analytics. Students passing this class would be able to pass the Google Analytics Individual Qualification test.", "other": ["Cross-listed with: IST 310"]}, {"department": "COMM", "number": "315", "credits": "3 Credits", "description": "Tutorial and practice in various kinds or journalistic and commercial writing, emphasizing basic skills.", "prerequisite": "COMM 160"}, {"department": "COMM", "number": "320", "credits": "3 Credits", "description": "Advertising management in business, including communication theory; common industry practices; basics of copy, media, and budget decision; and environmental influences. A student may not receive credit for both COMM 320 and MKTG 422.  COMM 320 Introduction to Advertising (3) COMM 320 introduces students to the advertising industry and provides a foundation for understanding what advertising is and how it developed to its current state, what it tries to accomplish, how it works, and how it can affect society. The class includes numerous examples of advertising, from the 1880s to the 2010s, to illustrate the topics covered. The goal is have students think more clearly and critically about the commercial actors behind advertising, their strategic objectives, how advertising messages help achieve specific marketing goals, and the possible social impacts. This course provides the basis for all further courses students take in the advertising sequence. During the course students: learn the basic concepts and vocabulary essential to the fields of advertising and brand promotion; understand the process and effects of advertising and brand communications; are introduced to the strategic and conceptual decisions advertisers face when deciding the best way to both say and deliver a message within the public marketplace; learn the landscape of the advertising industry, including understanding how the industry works and how it is organized; understand current trends in the advertising and marketing industries, and examine their implications for both industry and society; are exposed to the history and role of professionals and institutions in shaping communications; gain an understanding of the diversity of groups in a global society in relationship to communications. Specific topics covered in the course include definitions of marketing, advertising, and integrated marketing communication (IMC). Students learn what it means to be a brand, as well as how brand equity is developed by marketers. The fundamentals of brand positioning are also explored, in the context of brand promotion and evolution. The psychological processes that underlie persuasive commercial messages are explored. The differences between subliminal and non-conscious routes to persuasion are presented and discussed. The course also includes a review of promotional activities outside of traditional advertising, including public relations, direct marketing, personal selling and sales promotions. The role of social media and other online communications in the promotional mix are explored. The legal and ethical dimensions of commercial communication are outlined. Students are asked to think critically about the implications of marketing harmful products, selling to susceptible target audiences, using controversial appeals and the perpetuation of negative stereotypes.", "prerequisite": "Third Semester Standing"}, {"department": "COMM", "number": "320H", "credits": "3 Credits", "description": "Advertising management in business, including communication theory; common industry practices; basics of copy, media, and budget decision; and environmental influences.  COMM 320H Introduction to Advertising (3) COMM 320 introduces students to the advertising industry and provides a foundation for understanding what advertising is and how it developed to its current state, what it tries to accomplish, how it works, and how it can affect society. The class includes numerous examples of advertising, from the 1880s to the 2010s, to illustrate the topics covered. The goal is to have students think more clearly and critically about the commercial actors behind advertising, their strategic objectives, how advertising messages help achieve specific marketing goals, and the possible social impacts. This course provides the basis for all further courses students take in the advertising sequence.During the course students: learn the basic concepts and vocabulary essential to the fields of advertising and brand promotion; understand the process and effects of advertising and brand communications; are introduced to the strategic and conceptual decisions advertisers face when deciding the best way to both say and deliver a message within the public marketplace; learn the landscape of the advertising industry, including understanding how the industry works and how it is organized; understand current trends in the advertising and marketing industries, and examine their implications for both industry and society; are exposed to the history and role of professionals and institutions in shaping communications; gain an understanding of the diversity of groups in a global society in relationship to communications. Specific topics covered in the course include definitions of marketing, advertising, and integrated marketing communication (IMC). Students learn what it means to be a brand, as well as how brand equity is developed by marketers. The fundamentals of brand positioning are also explored, in the context of brand promotion and evolution. The psychological processes that underlie persuasive commercial messages are explored. The differences between subliminal and non-conscious routes to persuasion are presented and discussed. The course also includes a review of promotional activities outside of traditional advertising, including public relations, direct marketing, personal selling and sales promotions. The role of social media and other online communications in the promotional mix are explored. The legal and ethical dimensions of commercial communication are outlined. Students are asked to think critically about the implications of marketing harmful products, selling to susceptible target audiences, using controversial appeals and the perpetuation of negative stereotypes.", "prerequisite": "COMM 320H", "other": ["Honors"]}, {"department": "COMM", "number": "325", "credits": "3 Credits", "description": "The course explores the influences of digital games on players and society. It helps students make sense of the complex and conflicting evidence from social science research about both positive and negative outcomes from playing games. Topics include violent and stereotypical content, enjoyment and immersion, addiction, learning, and persuasive applications such as games for health. In particular, the class considers prominent debates about the effects of games and how to understand the actual evidence and methodological controversies behind these debates. A significant focus is on the logic of media effects research and the strengths and weaknesses of this approach. Students emerge with greater familiarity with media effects scholarship as a process as well as the specific ways it can help them media literate players of games as well as thinking about how games might be used to promote positive outcomes.", "prerequisite": "COMM 100N"}, {"department": "COMM", "number": "326", "credits": "3 Credits", "description": "The course explores the effects of social media on individuals, organizations and society. It introduces students to social science research about both positive and negative outcomes of using social media. Topics include identity formation, self-esteem, social capital, relational maintenance, addiction, cyberbullying, enterprise social media, crisis management, political mobilization, online activism, philanthropy, online terrorist networks, effects of social media use for news, entertainment, advertising, public relations and other mass communications. Theoretical mechanisms governing the causes and consequences of social media will be explored, with a substantial discussion component. Applications to media practices and implications for design of future media will also be covered.", "prerequisite": "COMM 100N"}, {"department": "COMM", "number": "327", "credits": "3 Credits", "description": "This course examines the central role that entertainment plays in the lives of most people in contemporary media landscapes. Today we are almost constantly tied to media entertainment through a variety of mobile devices, second screens, and streaming content. We see and listen to the world though entertainment media, and we construct, share, and post our lives on entertaining platforms. This course will examine the variety of ways that we use, experience, and are affected by entertainment, including its benefits and its harms. Topics include specific types of media content such as music, sports, and humor, as well as outcomes on our self-images, our stereotypes of others, and our feelings of connection with friends, family, and with society at large.", "prerequisite": "COMM 100N"}, {"department": "COMM", "number": "328", "credits": "3 Credits", "description": "This course provides students with a conceptual and applied overview of the effects of media representations of science, the environment, and health topics on different audiences. This course is appropriate for students interested in media effects as well as for students interested in science-related topics who want to gain a deeper understanding as to how messages about science (broadly defined) impact individuals and society. Class readings and discussions will encourage students to draw connections between theory, research, and message effects related to science, the environment, and health. In addition to learning and applying theories of media effects to the context of messages about science, students will also learn about the history of science, environmental, and health communication efforts and develop skills to critically interpret media messages related to these topics. This is one of multiple 300-level courses in the Media Effects sequences of the Media Studies major that focus on the effects of various types or genres of media on audiences.", "prerequisite": "COMM 118"}, {"department": "COMM", "number": "332", "credits": "3 Credits", "description": "Practice in researching and gathering material for and preparation of news stories for print media.  COMM 332 Reporting (3) The course is an introduction to the various tools and techniques of researching and gathering information, using a combination of traditional research methods and new computer-based technologies. It develops performance and critical skills focusing on concepts of news, fact checking, finding and developing sources, interviewing, writing styles, and structures of different story types. It also provides solid grounding in historical, ethical, and legal dimensions of U.S. newspaper journalism within a comparative media system context. For the duration of the course, there shall also be continuous discussion on the role of the journalist in society, where students shall examine the legal provisions and ethical considerations that govern the practice of journalism, the unwritten \"social contract\" between journalists and their audiences, and the nature of the relationship between journalists and those who wield political and economic power in the community.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "333", "credits": "3 Credits", "description": "Film History I describes the prehistory and history of the medium of cinema to 1960. The course explores the artistic, technical, economic development of the cinema, and the cultural contexts in which this development occurred. The course covers narrative, experimental, and documentary cinema and trains students in the techniques of close formal analysis of the cinema. The course stresses formal, thematic, and cultural analysis of the cinema throughout the first decades of its history. This course is integral to the curriculum in Film-Video. It provides Film-Video students with a detailed description of trends in their art form. It provides students with intensive study in the history of an influential medium in the development of the concept of mass media and communications.", "prerequisite": "COMM 242"}, {"department": "COMM", "number": "335", "credits": "3 Credits", "description": "This course is the Capstone Experience for Public Humanities Fellows in the Humanities Institute. The course provides students with hands-on experience applying skills and insight gained during the prerequisite course, Introduction to Public Humanities. Students will gain substantive experience in research, digital media production, and community engagement. The centerpiece of the course is an individual digital public humanities project on a topic of the student's choosing. Students will also participate in public outreach events in conjunction with the Humanities Institute, actively participating in a community engagement plan in coordination with the Institute's documentary film series, HumIn Focus.", "prerequisite": "COMM 235N", "other": ["Cross-listed with: LA 335"]}, {"department": "COMM", "number": "337", "credits": "3 Credits", "description": "Exploration of documentary video techniques and aesthetics through the completion of short exercises and projects.  COMM 337 Intermediate Documentary Production (3) This course focuses on intermediate technical and aesthetic aspects of single-camera documentary production with an emphasis on storytelling. In producing a series of short visual exercises students will explore the conventions of the documentary form, formal concepts of the visual image -- both still and motion, the principals of controlling light and sound recording, the conventions of editing, and idea development. Written work and group critique will also inform the study of non-fiction modes of visual media.  Technically this course builds on the skills and knowledge obtained in the beginning production course. Students work independently and collaboratively on the production of short media projects using video and digital technologies that provide project-driven experience in the disciplines of writing, producing, directing, camera work, sound, and editing. This course introduces new technologies and production techniques in relation to non-fiction modes. Students will develop ideas for one or more documentary projects and will have the opportunity to work in a variety of production roles. The course will require a significant amount of work outside of class. Students are encouraged to participate in class discussions and contribute critical feedback on their classmates' projects.", "prerequisite": "COMM 242"}, {"department": "COMM", "number": "338", "credits": "3 Credits", "description": "Exploration of narrative film or video techniques and aesthetics through the completion of short exercises and projects.  COMM 338 Intermediate Narrative Production (3) This course is an intermediate aesthetic and technical production course in short-form narrative production. Through screenings, discussions, readings and creative production projects, students will explore the collaborative process of narrative filmmaking and the conventions of the fiction form. This course builds on the skills and knowledge obtained in the beginning production course. Students work independently and collaboratively on the production of short media projects using video and digital technologies that provide project-driven experience in the disciplines of writing, producing, directing, camera work, sound, and editing.  The success of any narrative film depends on a focused collaborative effort by a number of individuals to tell a story. In this course, students will explore the process of producing a short narrative video using traditional production techniques. An emphasis is placed on learning the responsibilities and established practices of key production roles such as producer, director, cinematographer, sound designer and editor. Working in small groups, students will develop a short project where they will apply the processes associated with pre-production, production and post-production. Students will be building on their technical and aesthetic knowledge of digital video formats through lectures, demonstrations, outside readings and class exercises; videos will be viewed throughout the semester to demonstrate these concepts. Students will participate in class discussions and contribute critical feedback on their classmates' projects. The emphasis will be on the exploration of visual and aural expression and a fundamental mastery of the digital medium as it applies to traditional narrative production.", "prerequisite": "COMM 242"}, {"department": "COMM", "number": "339", "credits": "3 Credits", "description": "Exploration of alternative film or video production techniques and aesthetics through the completion of short exercises and projects.  COMM 339 Intermediate Alternative Production (3) COMM 339 is an intermediate level course in alternative film and video aesthetic theory and technique. The class is designed to expose students to a broad range of alternative and avant-garde filmmaking concepts, including classical and contemporary experimental practices, animation and new forms of cross disciplinary media production.  The course is designed to encourage students to think about film and video production as the beginning point in an expanding journey of creative exploration. It exposes students to a diverse range of historical and contemporary alternative or experimental filmmaking practices and forms and enables them to:  - Expand their creative horizons beyond preconceived and popular forms of film culture.  - Develop their abilities to discover their own personal filmmaking focus and language.  - Learn the skills necessary to create unique bodies of work in film and video media.  - Critically assess the success of their own and their fellow students' efforts.", "prerequisite": "COMM 242"}, {"department": "COMM", "number": "340", "credits": "3 Credits", "description": "Exploration of film and video production techniques through the use of camera, lighting, audio and digital post-production equipment.", "prerequisite": "COMM 242"}, {"department": "COMM", "number": "342W", "credits": "3 Credits", "description": "Introduction to various modalities of idea development and written expression for media production. COMM 342 Idea Development and Media Writing (3) This writing-intensive course is designed to introduce students to various modalities of idea development and expression for audio-visual projects. Writing as an ideational, descriptive or reflexive tool is an integral element of each modality. Learning objectives encompass the development of skills in the following areas: Conceptualization, Visualization, Decision-making, Intellectual articulation and Manifestation. Emphasis will be placed on using written work as an integral part of the creative process. As a designated W course, students will gain experience in the writing of media criticism and analysis as well as learning the writing styles specific to the profession. Writing assignments will include informal writing such as exercises in intuitive and timed writing, one minute response papers and collective story telling. Formal writing assignments will include observational essays, descriptive essays or stylistic \"treatments\", formal narrative proposals, analytic and editorial story reports, and self-reflexive critique papers. Students will progress through a series of creative exercises that support the development of the above skills consisting of short (200-500 word) written and oral exercises, exercises in visual thinking, visual storytelling and image composition and longer (750-1500 word) written assignments in various forms (descriptive, persuasive, analytical, editorial and critical) tailored to the professional requirements of the film-video major; these include descriptive essays or stylistic \"treatments\" formal narrative proposals, analytic and editorial story reports, and self-reflexive critique papers. Written feedback from the instructor will be provided on a regular basis, as well as in class peer critique and story workshops. Students will be required to redraft and rewrite assignments as needed.", "prerequisite": "COMM 242", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "346", "credits": "3 Credits", "description": "A beginning course in narrative Screenwriting emphasizing analysis, creativity, and critiquing skills necessary for the development of storytelling.  COMM 346 Writing for the Screen I (3) The course is about the creative process of conceiving and fashioning films that wish to order experience into a meaningful and expressive narrative structure. It is designed for students who wish to delve more deeply into screenwriting and those wishing to develop a script for senior-level production. It continues to develop screenwriting and storytelling skills introduced in Introductory Film and Video Production and Media Writing, and seeks to further hone their creative skills as writer-filmmakers. A large part of classroom sessions will be conducted in a traditional writers workshop structure, focusing on the presentation, discussion, and critiquing of written work; other sessions will concentrate on the analysis and critiquing of professional screenplays, with particular emphasis on close-reading of individual scenes, and study of screenwriters writing about the process. Scripts produced will be limited to short-form work, target length being no more than 15 pages maximum. Such a length combines both the virtues of disciplined, sharply-focused perceptions with a length sufficient for developed narrative arcs and tonal and thematic complexity. Scripts produced in this class will be appropriate for all of the advanced single semester advanced production courses and submission as part of a student's application for the two-semester advanced production for groups course. Assessment is based on the progress of creative written work throughout the semester, as well as participation within the critiquing process, both verbally in class discussions and in critical writing submitted to each other and the instructor. Each individual will be expected to: (a.) display an understanding of the various creative elements of filmic storytelling - including visual story-telling, character, dialogue, narrative structure, and theme - and how those elements create and amplify meanings in the work; (b.) thoroughly develop original and meaningful narratives and effectively convey them cinematically; (c.) hone the specific writing and (most especially) re-writing skills needed for successful screenwriting through their application and practice; (d.) illustrate the ability to thoughtfully and constructively critique their own work as well as that of their fellow writers in the class. During the semester students will be expected to learn to write original and creative constructed pitches, treatments, and scripts.", "prerequisite": "COMM 342W"}, {"department": "COMM", "number": "360", "credits": "3 Credits", "description": "Reporting, writing, producing, and presenting radio news programs, focusing on the development of news judgment and writing skills. COMM 360 Audio News Production (3)COMM 360 provides an introduction to broadcast news writing and radio production. Students take this course after they have completed an introductory print reporting course but before they take advanced courses that focus on television news production. This course is designed to introduce students to the general principles of broadcast writing used in both the radio and television mediums. As a prerequisite for 400-level courses, COMM 360 is offered on a regular basis to allow students to complete curricular requirements in a timely manner. Students learn the techniques needed to report, write and produce radio news. During the semester, students report on news and learn to produce, anchor and engineer a newscast. Learning objectives for COMM 360 are that students: * demonstrate an understanding of professional ethical principles in news reporting and apply those principles in newsgathering; * demonstrate basic proficiency in the tools used to report and produce broadcast-quality radio news; * demonstrate the ability to write news for a broadcast format; * demonstrate the ability to produce quality work on deadline; * apply an understanding of news values in the creation of a newscast; and * demonstrate the ability to supervise other students in a working newsroom. Students work together in a broadcast facility to produce a radio newscast. They are evaluated throughout the semester on their ability to integrate skills and concepts they learn into their broadcast stories. Upon successful completion of the course, students will have learned the theories and skills at the core of their broadcasting profession.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "361", "credits": "3 Credits", "description": "This course provides an overview of entrepreneurship and innovation in journalism and teaches students how to recognize and act on opportunities to innovate and launch journalism-related enterprises. Active learning pedagogies are emphasized to support student learning and skill development. First students learn trends, concepts, theories and/or current best practices and then apply them in assignments and major projects. Topics may include innovation in the news business, entrepreneurship, intrapreneurship and self-employment/freelancing in media, disruption caused by technology, globalization, competition and changes in customer/user news habits, opportunity recognition and idea assessment, customer discovery, value proposition design, lean methods, rapid prototyping, due diligence, analyzing/researching markets and competition, negotiation skills, pitching ideas to investors, financing and marketing for start-ups, and digital branding. Students apply what they learned in projects that could include developing and assessing their own news enterprise idea with a completed business plan or lean canvas, conducting primary market research, designing and implementing a digital brand, practicing negotiation techniques and pitching their idea to potential investors and/or customers.", "prerequisite": "MGMT 215"}, {"department": "COMM", "number": "362", "credits": "3 Credits", "description": "In this introduction to podcasting, students will explore one of the 21st century's fastest-growing digital journalism platforms. They will learn the skill of audio storytelling by creating, editing and publishing audio projects that include scripted stories and unscripted interview and discussion programs. Students will also examine podcasting's revenue-generating models as well as the ethical challenges of advertising, sponsorship and branding. By the end of the course, students should be able to launch audio podcasts for organizations, such as news sites, or for their own personal use. Beyond getting a broad understanding of podcasting, students will learn important entry-level journalism skills to do podcasts -- using microphones, audio recorders and non-linear audio editing software.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "363", "credits": "3 Credits", "description": "Practical and theoretical approach to visual communication production in newspaper journalism, advertising, public relations, and other communication industries.  COMM 363 Desktop Publishing (3) An introduction to publication design and production for the print media, with an emphasis on newspaper, newsletter, advertising, and magazine design. Students critically analyze existing publication designs in order to develop their visual literacy and visual analysis vocabularies. For assignments, students make layouts and designs using desktop publishing and visual editing software, learning to combine visual and textual elements in publications to make them elegant, consistent, and visually appealing as well as readable and accessible. Assignments are critiqued in class discussion sessions designed to further develop critical visual vocabularies. Unique design issues associated with online and interactive media design are also discussed.", "prerequisite": "COMM 215"}, {"department": "COMM", "number": "364", "credits": "3 Credits", "description": "In this course, students will learn to recognize and appreciate data-driven stories. They will produce stories from data by demonstrating proficiency in sorting, filtering and using simple functions of Excel. Students will use the U.S. Census website to find and download demographic data, file a federal Freedom on Information Act or state right-to-know request and use tools such as Structured Query Language, Chartbuilder, Tableau and Carto to query databases as well as build charts and maps. Students will also learn how data and visualizations, including graphics and maps, have become integral parts of story-telling in all journalism platforms -- print/digital, broadcast and multimedia.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "365", "credits": "3 Credits", "description": "As social media are profoundly transforming human communication, this course aims to help students develop in-depth knowledge of social media communication. With these soft skills, students are better equipped in assessing and analyzing information flows on social media platforms. More importantly, they will design and improve social media action plans for news media organizations and other institutes. This course aims to study the mechanism of social media communication. Specifically, it focuses on human communication happening on social media, not social media per se. Most of the training materials will be constantly updated to reflect the latest social media trends. All the soft skills learned in this course are directly relevant to communication professions, such as news media, advertising, public relations, and marketing."}, {"department": "COMM", "number": "370", "credits": "3 Credits", "description": "Public understanding of organizations and institutions; identification and analysis of public; media relations; public relations practice.  COMM 370 Public Relations (3) This is the introductory course in public relations. It is a survey course that will provide students with a foundation for understanding the role and function of public relations and public opinion in American society, business and industry. The course defines the role of public relations, its societal value, and the workplace settings where public relations is practiced. Students are introduced to the interrelationships between the disciplines of public opinion and public relations and the many definitions of public relations and how they vary from organization to organization. Students learn how individuals, interest groups, organizations, corporations and politicians monitor and analyze public attitudes, opinions and issues that impact individual citizens, groups, organizations, institutions, and society. Students examine public relations from a historical perspective and study important social campaigns that have laid the groundwork for public relations in the modern era. Students are introduced to a myriad of communications theories and how they apply to different scenarios ranging from persuasion to crisis communications. The course helps students develop an understanding of the history, structure, and functions of public relations, the four-step public relations process (research, objectives, programming, and evaluation), the tools used to carry out public relations, ethics in public relations, and legal framework adhered to by public relations practitioners. Additionally, students are taught to appreciate the value of public relations in solving problems and making policy, i.e., the importance of being involved in the decision-making body of a corporation or public relations firm. Students are also shown why individual as well as institutional credibility is critical to public relations practice.", "prerequisite": "Third Semester Standing"}, {"department": "COMM", "number": "370H", "credits": "3 Credits", "description": "Public understanding of organizations and institutions; identification and analysis of public; media relations; public relations practice.  COMM 370H Public Relations (3) This is the introductory course in public relations. It is a survey course that will provide students with a foundation for understanding the role and function of public relations and public opinion in American society, business and industry. The course defines the role of public relations, its societal value, and the workplace settings where public relations is practiced. Students are introduced to the interrelationships between the disciplines of public opinion and public relations and the many definitions of public relations and how they vary from organization to organization. Students learn how individuals, interest groups, organizations, corporations and politicians monitor and analyze public attitudes, opinions and issues that impact individual citizens, groups, organizations, institutions, and society. Students examine public relations from a historical perspective and study important social campaigns that have laid the groundwork for public relations in the modern era. Students are introduced to a myriad of communications theories and how they apply to different scenarios ranging from persuasion to crisis communications. The course helps students develop an understanding of the history, structure, and functions of public relations, the four-step public relations process (research, objectives, programming, and evaluation), the tools used to carry out public relations, ethics in public relations, and legal framework adhered to by public relations practitioners. Additionally, students are taught to appreciate the value of public relations in solving problems and making policy, i.e., the importance of being involved in the decision-making body of a corporation or public relations firm. Students also show why individual as well as institutional credibility is critical to public relations practice.", "prerequisite": "Fourth Semester Standing", "other": ["Honors"]}, {"department": "COMM", "number": "372", "credits": "3 Credits", "description": "This course discusses digital strategies and techniques for public relations.  COMM 372 Digital Public Relations (3) This course provides students with a conceptual and applied overview of how digital media are used in the field of public relations. Digital media combines traditional public relations content creation with social media, search and mobile, thus transforming static news into conversations and connecting directly with target audiences online. This hands-on experience will be supported by theoretical, strategic and professional best practices. A specific focus will be on current digital tools while preparing students for future growth and changes by covering trends, strategy, and analytics.", "prerequisite": "COMM 370"}, {"department": "COMM", "number": "373", "credits": "3 Credits", "description": "The course is designed to introduce students to organizational risk assessment and protecting an organization's reputation in times of crisis.  COMM 373 Crisis Communications in Public Relations (3) All organizations, large or small, face the prospect of a crisis. At best, a crisis is a challenge; at worst, it has the potential to destroy the organization';s ability to conduct business. Nearly half of Fortune 500 companies operate without a crisis communications plan in place, yet there are scores of examples of crises that should serve as a warning to businesses to prepare for the worst. This course is designed to introduce students to organizational risk assessment and how to protect the company's reputation while minimizing the. Students learn to deliver positive media interviews in order to deliver key messages to target publics. In times of crisis, public perception is reality. It is the practitioner's job to be prepared and to act quickly and efficiently in times of crisis and be able to work with the media, not against them. It is also important that practitioners address their audiences with the right messages at the right time. Students will learn how to assemble a crisis communication team, hold a news conference to address a crisis, manage key information, and maintain effective media relations during a time of high anxiety. Students will learn the basic anatomy of a crisis in order to be able to respond with clarity and vision in the heat of a crisis. From product-tampering to oil spills, students will be able to recognize the warning signs of a crisis and identify the five stages of a crisis. In a world connected by the Internet and social media, it's likely the news media will be at the organization's doorstep before the public relations director gets there, and it places enormous pressure on corporate leadership and government leaders to make decisions quicker and respond to media queries as quickly as possible. Successful crisis management begins before a crisis occurs. It is the responsibility of crisis management specialists to see the crisis coming and move to minimize the impact or even relegate the impending crisis to a problem. It is far better to be proactive than reactive. Having a crisis management plan is important, but avoiding a crisis by identifying its weaknesses; identifying the resources the company can use before, during and after a crisis; identifying any perceived threats that can turn into a crisis, and identifying the things that company does well in a crisis can go a long way toward negating long-term negative effects of a crisis.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "374", "credits": "3 Credits", "description": "Theory and practice in studio recording and broadcasting techniques, including continuity/news writing, control room operation and audio production.  COMM 374 Audio Communication (3) Studio techniques for the production of audio essays, musical portraits, news, and on-air editorials and radio drama are explored through various writing and control room exercises. Students learn how to make interesting, marketable audio material suitable for both broadcast and non-broadcast markets. This course also covers the aesthetic limitations of each format and the marketing potential in the current broadcast and narrowcast markets. The cultural genesis and brief history of each medium and format provides the context for the producer, as will readings covering the ethical and legal constraints particular to each production medium.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "375", "credits": "3 Credits", "description": "Through a combination of case studies and lectures, this class will prepare students to build upon their knowledge of the planning process and to learn how to make strategic public relations decisions based on diverse scenarios. Specifically, they will explore problem-solving and decision-making processes in strategic communication through the analysis of case studies and the development of strategic planning documents. A significant amount of work in this class is team-based. After this class, the student will be ready to develop a public relations campaign in COMM 473, the capstone course of the public relations major.", "prerequisite": "COMM 370"}, {"department": "COMM", "number": "380", "credits": "3 Credits", "description": "Introduction to basic principles of management as they apply in electronic media industries.  COMM 380 Telecommunications Management (3) This course aims to introduce students to the operation and management of the broadcast, cable and telecommunications industries. It is one of three required courses for the telecommunications major of the Bellisario College of Communications, and is the entry-point into the major's management sequence.The learning objectives for the course is to provide an understanding of the management function in the media and telecommunications industries; to familiarize students with sources of information about firm and markets; to provide basic training in critically evaluating and using financial information; and to improve writing skills. An associated objective is to prepare students for successful careers in the media and telecommunications industries, by building awareness about industry events and trends, and communicating information about job designations and career paths.The class provides a broad survey of management topics and includes modules devoted to topics such as financial management, marketing and sales, and human resources. These topics are customized to accommodate the management issues specific to the media and telecommunications industries, such as program management, ratings analysis and the Federal Communications Commission's Equal Employment Opportunity (EEO) guidelines. A special module devoted to management ethics is included in the course.Topical coverage for the course includes not only the radio and television industries that have been the traditional mainstay of telecommunications careers, but also industries such as cable, wireline and mobile telephony, and the dot-com sector in which increasing numbers of telecommunications majors are finding job opportunities.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "381", "credits": "3 Credits", "description": "Overview of the regulation of electronic media."}, {"department": "COMM", "number": "383", "credits": "3 Credits", "description": "COMM 383 uses rotating topics to teach advanced video and television production techniques. Building on the concepts and skills taught in the introductory production course, students will learn advanced techniques in production budgeting, preproduction planning, location scouting, logistics, advanced lighting and audio techniques, post-production techniques, video formats and distribution issues. Throughout the course students will learn how to produce a live remote multi-camera broadcast from the ground up. Each semester the instructor will choose an appropriate project that will serve as the focus of the course. Projects that occur outside the studio will include logistical issues such as power supply and safety and environmental considerations. Examples of projects include coverage of live sporting events, development of scripted and non-scripted programs, and exploration of alternative distribution platforms via the Internet and alternative telecommunications networks.", "prerequisite": "COMM 283"}, {"department": "COMM", "number": "383A", "credits": "3 Credits", "description": "Explore all aspects of producing a live television show. Includes streaming a live webcast online.  COMM 383A Webcast Production (3) The purpose of this course is to learn all aspects of producing a live video webcast. The first goal is to learn the technical aspects of video production. The class will learn how to plan a live remote broadcast including site selection and evaluation, audio and video techniques, lighting and contingencies for outdoor productions, converting a video signal into an IP stream, and streaming the signal live over the Internet. The second goal of this course is to apply the acquired skills to the production of a live webcast.", "prerequisite": "COMM 283"}, {"department": "COMM", "number": "384", "credits": "3 Credits", "description": "Professional selling is the set of skills, knowledge, values and activities involved in selling a product to a customer. But it is so much more. Every business and non-profit enterprise, whether it's a new startup or big firm, expect all employees to understand or engage with users, audiences and customers. In other words, everyone - from designers and engineers to coders, production line staffers and creatives -- is in sales. This is especially true for communications, information and new technology products and services. The two-fold purpose of this course is 1) understanding the sales profession with respect to innovation and 2) learning and practicing customer-focused sales and service skills, including customer relationship management (CRM). The context is the everchanging, globalized marketplace for information, communication and new technologies across industries including news/media, non-profits, health/medicine, food/agriculture, education/training, manufacturing, finance, arts, music, sports, retail, and tourism/hospitality. Topics covered include sales professionalism, the customer-focused selling process; ethics, communication and planning skills; presenting/pitching and negotiating; customer discovery in the context of design thinking; customer relationship management (CRM) systems. Class time is devoted to lectures and active learning including using a CRM system, case study discussion, simulations and roles plays of sales pitches, service and consulting.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "385", "credits": "3 Credits", "description": "Framework, principles, and strategies for media programming from perspective of content distributors and media outlets.  COMM 385 Media Programming Strategies (3) This course will expose the students to the framework, principles, and strategies for content distribution via wired and wireless networks. Students will learn programming strategies for cable and broadcast networks, local television stations, cable systems, Internet sites, and other distribution outlets. The class will explore programming from the perspective of the network or outlet that acquires programming content as well as the perspective of the content producer trying to obtain distribution. The course explores how new technologies, laws, and social trends influence programming strategies. Students will learn audience analysis including Nielsen ratings and Internet measurement techniques. The class typically includes multiple group projects, presentations and written reports that evaluate programming strategies in addition to quizzes and exams. By the end of the course students should have a fundamental understanding of programming strategies, trends, and terminology. Broader course objectives include the understanding and application of ethics, diversity, the role of professionals in the industry, critical thinking, written and oral presentations including the use of visual information, appropriate use of mathematical concepts, professional writing, clear communication, and conducting and evaluating research.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "386", "credits": "3 Credits", "description": "Historical development of telecommunications systems in the United States, including telegraph, telephone, radio, television, and the internet. COMM 386 Telecommunications History (3) Telecommunications History examines the development of electric and electronic communication systems in the United States within their economic, political, social and cultural contexts. Students will look at the origins and growth of communications systems and how those systems arise from and are constrained by existing social conditions. The evolution and impact of the telegraph, telephone, radio, television and Internet systems and industries will be among major topics addressed. In the process of examining the evolution of specific industries, students will be exposed to broader theories of technology and social chance. As a 300-level course, students will be expected to acquire modest skills in historical research, including library, Internet and some original research such as oral histories."}, {"department": "COMM", "number": "388", "credits": "3 Credits", "description": "Videos are an important means by which organizations communicate, whether online, through social media, during presentations, or delivered through traditional media platforms. In the professional arena, more and more organizations use videos to raise money, communicate, or market and promote their business. This course teaches students how to manage a video production agency and produce videos for clients. COMM 388, through a combination of lecture, readings, and practical exercises, will teach students how to communicate with clients, assign production team roles, create accurate and effective production timelines and budgets, as well as understand the legal issues that can arise when creating videos for clients that meet their specific needs. Student will bring an actual client's story from the idea phase to final delivery, as well as learn and utilize proper client etiquette, including email, phone, and in person conversations. Student will have the opportunity to learn about the responsibilities of each member on a production team, how to create and manage a production budget, the purpose and use of contracts and release forms, all while working together as a team to create a video for their client. The course will follow a standard production timeline starting with pre-production topics such as the basics of pitching, story development, and budgeting. The second portion of the class will focus on production issues particularly as they apply to client based production. This will include scheduling, interview outlining, location scouting, conducting on camera interviews, and filming footage. Finally, post-production and formatting topics will be addressed including discussions of different delivery platforms, including online, presentation, and social media. Throughout the semester students will complete practical exercises that will help build their skills at translating a client's idea into a realized project with a minimum budget and maximum production value.", "prerequisite": "COMM 242"}, {"department": "COMM", "number": "395", "credits": "0.5-2 Credits/Maximum of 2", "description": "In this unique experiential education opportunity, students visit a variety of companies and businesses in the media and communications eco-system and have the opportunity to engage in small group settings directly with key industry players. Students will be able to learn from senior executives who are shaping the fields that our students will soon enter. Students will have the opportunity to engage with alumni and friends of the school through dinner/networking events."}, {"department": "COMM", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "COMM", "number": "400", "credits": "3 Credits", "description": "Students will produce, report, anchor and direct half-hour sports magazine show.  COMM 400 In the Game: TV Sports Magazine (3) Magazine shows have expanded beyond traditional news subjects to cover various aspects of American culture. None is more prominent and prevalent than the coverage of sports. In the Game: TV Sports Magazine is a sports story-telling course in which students examine sports-related topics in their context within society. Students will use writing, photography, editing and technical skills gained from their journalism skills courses. The goal will be to produce sports enterprise stories.", "prerequisite": "COMM 465"}, {"department": "COMM", "number": "401", "credits": "3 Credits", "description": "Relationship of news media to social, economic, and political developments in the Western world.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "COMM", "number": "402", "credits": "3 Credits", "description": "International Reporting is an advanced level course in the Bellisario College of Communications designed to give student journalists experience in reporting the news in a foreign country.  COMM 402 International Reporting (3) International Reporting is an advanced level course in the College of Communications designed to give student journalists experience in reporting the news in a foreign country. The course is offered in the spring semester only. The key component is a 10-day reporting trip over the spring break to a foreign country. In its first three semesters, the class has gone to Mexico City and Shanghai, and Cape Town, South Africa. The course has been approved as an embedded program by the Office of Global Programs. Admission to the course is highly selective and open only to junior and senior journalism majors. Students must apply for admission and present examples of their work as well as recommendations by a member of the journalism faculty.The aim of this course is to help young journalists acquire the skills they will need to compete in an industry where increasingly the threads of even the most local stories either come from, or lead, overseas. This is not a course aimed at training students to become foreign correspondents. Rather, we hope to prepare students to function in a foreign environment, and to recognize, overcome and ultimately benefit from the linguistic, cultural, economic and legal challenges that working in another country will entail.The course has three segments. In the first half of the semester we study the history, culture, politics and economics of the country to which we are traveling. We also develop and refine our ideas for the stories we will report when we get there. We will also learn about foreign reporting and how it differs from the reporting we have been used to doing here. The second part of the course consists of supervised travel to our target country. Here, we report the stories we have selected, file blogs and video posts to ComMedia, and also meet with local journalists, officials and students of the host country. Depending on the country in which we are working, students also have the opportunity to collaborate, when appropriate, with students from local universities. The final half of the semester is devoted to supervised individual work aimed at turning our reporting into stories suitable for publication or broadcast.Although students are required to acquire a general working knowledge of the country to which we are traveling, and will be tested on it, in the end they will be evaluated almost entirely on their work product. This results-oriented approach has been chosen because it most closely replicates the environment of a professional newsroom.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "403", "credits": "3 Credits", "description": "Nature and theories of law; the Supreme Court and press freedom; legal problems of the mass media.  COMM 403 Law of Mass Communications (3) This discussion-intensive seminar provides an in-depth analysis of contemporary First Amendment issues ranging from the protection of violent media content and sexually explicit speech to defamation and invasion of privacy. Students explore the legal standards, public policies and theories that protect - and restrict - the Constitutional rights of free speech and free press. The primary area of study in this course is the law of mass communications and, in particular, legal issues facing the entertainment and news media. Using a law school casebook, written by a Harvard Law School professor, we will cover legal issues related to topics such as sex and violence in the media, defamation, privacy, and copyright.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "COMM", "number": "403H", "credits": "3 Credits", "description": "Nature and theories of law; the Supreme Court and press freedom; legal problems of the mass media.  COMM 403H Law of Mass Communications (3) This discussion-intensive seminar provides an in-depth analysis of contemporary First Amendment issues ranging from the protection of violent media content and sexually explicit speech to defamation and invasion of privacy. Students explore the legal standards, public policies and theories that protect - and restrict - the Constitutional rights of free speech and free press. The primary area of study in this course is the law of mass communications and, in particular, legal issues facing the entertainment and news media. Using a law school casebook, written by a Harvard Law School professor, we will cover legal issues related to topics such as sex and violence in the media, defamation, privacy, and copyright.", "other": ["Honors"]}, {"department": "COMM", "number": "404", "credits": "3 Credits", "description": "Overview of the regulation of electronic media.  COMM 404 Telecommunications Law (3) Telecommunications Regulation offers students an introduction to a wide range of regulatory and policy issues affecting the telecommunications industries. These industries include traditional radio and television broadcasting, cable, satellite, telephone (wired and wireless), broadband, and the internet. This class is especially useful for students interested in careers in telecommunications, electronic commerce, public policy, information science, business management, law, information policy, and other related fields. Students taking this course will learn how regulations can affect business opportunities and how public policy shapes the development of the world's communications infrastructure.New developments in technology, business practices and regulatory philosophy are leading to dramatic changes in the regulatory climate in telecommunications. The goal of this course is to help you understand the implications of these chances for business strategy and for society as a whole. Some of the questions we will consider include: Why do we regulate telecommunications? What are the legal parameters of regulation? How does the regulatory process work? Why do \"experts\" disagree on the proper way to regulate? How do regulations influence business strategy and industry development? How do regulations affect the way individuals communicate and acquire information? How can we choose the best policies for the future to balance reliance on marketplace forces versus the need for Government intervention? This course emphasizes an economic and legal approach to regulation. Readings will include primary documents such as FCC regulations, court cases, and statutes as well as historical and economic analyses of telecommunications regulation."}, {"department": "COMM", "number": "405", "credits": "3 Credits", "description": "COMM 405 takes a critical look at the structure and practices of the U.S. mass media within the U.S. and global political economy. The normative purpose of the course is to consider whether a media system operates in a manner which supports and promotes the development of a democratic society. As such, the course is both a theoretical and practical exploration of the study of political economy and the development of capitalism as it relates to the mass media. Topics include: the structure of contemporary capitalism (its nature and logic); the ownership and control of mass communications; commercialism, advertising and their impact on U.S. society, the mass media and journalism: the economic structure and organization of the cultural industries and precarious labor; the political economy of digital media; media policy; the tenets of democratic communication.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "COMM", "number": "406", "credits": "3 Credits", "description": "Intermediate level skills in creating and editing television news packages. COMM 406 Electronic News Gathering and Editing (3) This course is designed to provide a substantial background in video production techniques coupled with electronic newsgathering and the use of video equipment. Although students enrolled in this course would be expected to have a basic understanding of video production from previous courses, more advanced editing techniques, along with sustained practice in interviewing, taping, organizing and writing various types of news and feature packages, should provide an excellent preparation for subsequent internships or employment. This is a \"hands-on\" course and will provide extensive opportunities for practical application of material covered in class. Students will be evaluated on the quality of their productions. This course serves as a supporting course in the Communication and Media Studies major.", "prerequisite": "COMM 315"}, {"department": "COMM", "number": "407A", "credits": "3 Credits", "description": "This course examines the relationship between politics, governance, and news media, and provides a foundation for understanding media's role in public policy.  COMM 407A Media and Government (3) The course is designed to broaden, inform, and empower thinking about media influence on the ways people think about issues and how that influences public policy choices. The course will also analyze the various ways in which elected officials seek to craft messages and manipulate media to encourage support for policy agendas and initiatives. Through the process of examining the relationship between these powerful forces, students will gain critical thinking skills that will better prepare them to consume and create media and to function as citizens in American democracy. This course will examine the symbiotic relationship between politics, governance, and media, particularly news media, and will provide a foundation of classic media theory combined with new thinking on media's role in public policy formation and its impact on the larger society. The course will emphasize the importance of political narratives, how they are constructed and communicated and also how they influence elections and public policy choices. Primary sources will provide diverse perspectives on the many questions that will emerge from readings and discussions. This course is only offered as part of the Washington, D.C. Program."}, {"department": "COMM", "number": "407B", "credits": "3 Credits", "description": "The course examines a number of current issues and topics surrounding journalism including: ethics, state of the industry, and news vs. entertainment.  COMM 407B Perspectives on American Journalism (3) Journalism is a unique occupation. News editors, reporters, producers, anchors, and other media professionals have a special responsibility to the public - the responsibility to provide their readers and audience members with the information they need in order to make choices about how to vote, what issues to get involved with, how to live their daily lives. While journalists - unlike members of other professions - have very few laws that exist specifically to govern their work, their duty to the public carries with it a number of important ethical burdens and responsibilities to the public and to society as a whole. The course examines a number of current issues and topics surrounding journalism. While there will be new themes and topics for each week's class, nearly all of the topics are interrelated, and each class will build on what has gone before. Among the topics that will be covered are the current state of the news industry, the ethical guidelines that journalists are supposed to follow, the blurring of lines between news and entertainment, and the news media's role in making people famous or infamous. The issues that we examine in this course will be most directly related to the practice of journalism, although we may touch on other aspects of communications (e.g. advertising or public relations) from time to time. Our goal will be to examine news coverage with a critical eye - to think about the reasoning and decision-making that shape the final products that we read or view. The class meetings themselves will center on discussion of the readings and presentation of real-world examples drawing from current news stories and issues involving the news industry."}, {"department": "COMM", "number": "407C", "credits": "3 Credits", "description": "COMM 407C helps to make sense of the impact of media, public opinion and non-state actors shaping foreign policy."}, {"department": "COMM", "number": "408", "credits": "3 Credits", "description": "Examination of oral, scribal, print, industrial, and electronic cultures; analysis of impact of technology on communications and social structure.  COMM 408 / STS 408 Cultural Foundations of Communications (3)(BA) This course meets the Bachelor of Arts degree requirements. COMM 408 / STS 408 traces the development of communications technologies and their impact on culture over the last 500 years. Students will examine how different tools for communicating changed the way people organized and made sense of their worlds. The course begins by looking at oral cultures and moves on to the scribal, print, industrial, electronic and post-industrial or postmodern cultures, studying the media developments that marked each of these eras. With each period and its corresponding technology students will examine how and why the new media altered not only the form of communication (the type of speech, form of writing and/or speed of information transfer), but also how such changes altered the content of knowledge (how people made sense of their lives and communities). Readings are drawn from a range of disciplinary perspectives on the issues, from history, sociology and anthropology, to philosophy, communication studies and cultural theory. The historical and theoretical knowledge provided by the course will give students a solid foundation for coming to terms with media trends in present-day society and for thinking through their possible epistemological, political and cultural impacts.The course is a communications elective for the Journalism and Telecommunications majors and the Media Studies minor.", "prerequisite": "COMM 110", "other": ["Cross-listed with: STS 408", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "COMM", "number": "409", "credits": "3 Credits", "description": "Ethical problems in the practice of journalism; principal public criticisms of news media; case study approach.  COMM 409 News Media Ethics (3) Ethics is about doing the right thing - which, in the news business, is rarely as easy as it sounds. Is it ever OK for reporters and photographers to intrude on grieving families? Is it ever OK to lie to get information? Are the sex lives of politicians and celebrities our business? COMM 409 will give students a fuller understanding of how journalists do their jobs and how they should make ethically sound decisions. This class is more about learning to ask the right questions than learning the right answers. We'll rely on recent news coverage to get us in the habit of working through the moral dilemmas that reporters routinely confront.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "COMM", "number": "409H", "credits": "3 Credits", "description": "Ethical problems in the practice of journalism; principal public criticisms of news media; case study approach.  COMM 409H News Media Ethics (3) Ethics is about doing the right thing - which, in the news business, is rarely as easy as it sounds. Is it ever OK for reporters and photographers to intrude on grieving families? Is it ever OK to lie to get information? Are the sex lives of politicians and celebrities our business? COMM 409H will give students a fuller understanding of how journalists do their jobs and how they should make ethically sound decisions. This class is more about learning to ask the right questions than learning the right answers. We'll rely on recent news coverage to get us in the habit of working through the moral dilemmas that reporters routinely confront.", "other": ["Honors"]}, {"department": "COMM", "number": "410", "credits": "3 Credits", "description": "The role of international media in communication among and between nations and peoples.  COMM 410 International Mass Communications (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the role of international mass media in communications and debates about global questions and/or crises between and among nations and peoples. These roles will be examined using such theories as imperialism, hegemony, information society, modernization, globalization, capitalism, cultural industries, propaganda, and others. Among other issues the course will examine the way in which media report, portray, represent, misrepresent, and construct knowledge about global questions and crises that may border on social injustices, health, the politics of armament, disarmament, and recognition of statuses of states. The course may also explore other issues of international importance not limited to those involving economic questions such as balance of trade, global debt, and financial crises.In addition, this course provides avenue for the appraisal of mediated debates between nations at such platforms as the United Nations (UN), the World Health Organization (WHO), and the World Trade Organization (WTO) among other international and bilateral organizations that serve as platforms for consideration of issues of global importance.Students are led to understand ways in which states relate and communicate with each other in the environment of supranational governance. Students are exposed to these issues through readings in pertinent theories, ICT-enhanced conversations, and critical examinations of applicable concepts, exposure to contemporary issues via media messages; including those presented via newspapers, news magazines, broadcast documentaries, films, and other media products that will aid students' ability to better appreciate issues of historical and contemporary relevance to the global community.", "prerequisite": "COMM 110", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "COMM", "number": "411", "credits": "3 Credits", "description": "The mass media as creators and critics of mass culture in American life; relationships between the media and mass culture.  COMM 411 Cultural Aspects of the Mass Media (3) This course examines the mass media as creators and critics of mass culture in American life and the relationship between the media and the mass culture.What are the mass media? What is culture? What are the relationships between mass media and culture? How do mass media help construct the way we live our lives? Do the mass media reflect or condition social reality? How does one study or engage the mass media? Why would you want to anyway? This course is designed to answer some of these questions by promoting a critical understanding of the mass media from historical, social, philosophical, cultural, and economic perspectives. Ultimately, the course will equip students to address these opening questions on their own terms, without simply allowing the mass media to provide their own pictures of how they should be understood. One of the goals of this course is to denaturalize the way people view the mass media-as simply a given, or as pure unmediated reality. Media culture has been and continues to be made. Course materials and lectures will provide several ways of thinking about and studying the conditions of media making and interpretation. Students are encouraged to think as broadly and creatively as possible: to this end, the course will make use of research across a wide range of academic fields such as sociology, history, ethnography, cultural studies, literature, politics, gender studies, economics, art, and philosophy. The course is a communications elective for the Journalism and Telecommunications majors and the Media Studies minor.", "prerequisite": "COMM 305", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "COMM", "number": "411H", "credits": "3 Credits", "description": "The mass media as creators and critics of mass culture in American life; relationships between the media and mass culture.  COMM 411H Cultural Aspects of the Mass Media (3) COMM 411H takes a cultural studies approach to media and more generally culture and politics. The class is predicated upon three assumptions about media. First, media must be examined in context. Second, media play a significant role in the construction of our lived reality. Third, these constructions and all attempts to study them are political and implicated in relations of power. As such, this course treats media as part of cultural and political processes that are not separable, but instead co-constitutive. In other words, these three assumptions have some immeasurable effect on each other and impact our understanding of their relationships.", "prerequisite": "COMM 305", "other": ["Honors"]}, {"department": "COMM", "number": "412", "credits": "3 Credits", "description": "Sport and media relationship in American culture. COMM 412 Sports, Media and Society (3) This course is designed to help students more critically view the role of sport media in American culture. The influence of/relationship between sport media and issues such as race, gender, sexuality (homophobia), nationalism, capitalism/consumerism, violence and civic life will be examined. Issues in relation to journalism ethics and the production of sport media also will be examined."}, {"department": "COMM", "number": "413W", "credits": "3 Credits", "description": "Social-level and political theories of the relationships between media and public; media influences on public opinion; social pressure on the media; political communications.  COMM 413W The Mass Media and the Public (3) This course is designed to explore the complex and dynamic relationships among the media, public, and government. These relationships are examined through the lenses of sociological and political theories regarding the nature and process of mass communication. The central questions answered in the course are: \"How do the media influence the public, its opinions, and social and political behavior?\" and \"How does the public - through social pressures, and political constraints - influence media performance and content?\" Special attention is paid to modes of inquiry in communication research, social functions and control of the media, social construction of reality, political communication, and public opinion. The goals of the course are to introduce students majoring in professional areas of communications to theoretical frameworks that help explain media practices, advance the understanding of the communications research literature for Media Studies majors, and develop skills of all students to be informed and critical consumers of the media. The course is required of Media Studies majors and is a communications elective for the Journalism and Telecommunications majors, the Corporate Communications and Journalism options in Communications, and the Media Studies minor.", "prerequisite": "COMM 110", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "COMM", "number": "414", "credits": "3 Credits", "description": "Theoretical bases and practical approaches for management and administration of communications projects, organizations, and resources.  COMM 414 Media Management (3) Students examine various management styles and how they are applied in various media industries. Special issues in media management such as intellectual rights and work-for-hire contracts are covered. General business management topics are also covered, such as human resource management, sales, motivation, working with unions, managing talent and other assets, and maximizing profits within the framework of very basic business principles. In addition, this course includes topics useful for small media business startups and freelance media content producers. Usually this course utilizes a case/book study approach relying heavily on in-class discussion.", "prerequisite": "COMM 251"}, {"department": "COMM", "number": "415", "credits": "3 Credits", "description": "Advanced applications in documentary photography emphasizing the narrative qualities of imagery, and utilizing digital technologies.  COMM 415 Advanced Photography (3) An advanced undergraduate examination of documentary photography with the goal for each student to produce a portfolio of pictures suitable for exhibition or to show prospective employers. Each week students complete photographic assignments designed to simulate commercial photography work and to give experience with a variety of photographic techniques and subjects. Assignments include topics such as portraiture, documentary photo story production, studio lighting, fill-flash lighting, and sports photography. Classroom exercises include demonstrations of various techniques as well as critique sessions to discuss student assignments and other photography work.", "prerequisite": "COMM 215"}, {"department": "COMM", "number": "416", "credits": "3 Credits", "description": "News Practicum is a professionally oriented course for students who have mastered basic news writing and interviewing skills to produce stories for professional news outlets.  COMM 416 News Practicum (3) This is a course in which students employ skills they developed in previous classes including: reporting, writing and working in collaboration with editors to develop a variety of short and long stories that are designed to be used in professional publications. In the course of reporting stories, students will work independently, using sources ranging from first responders to local government officials and experts, to gather information that they will use writing their stories. Students will turn in multiple drafts to the instructor, who will work with them to edit the stories in preparation for publication. Part of the course will include post-publication review of the stories to discuss techniques and how to improve upon them.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "417", "credits": "3 Credits", "description": "Ethical issues in practice of advertising and public relations; legal and regulatory issues; case studies. COMM 417 Ethics and Regulation in Advertising and Public Relations (3) The purpose of this course is to help students gain an understanding of the complex legal and ethical issues they may face in advertising and public relations practice. Through an examination of historic and contemporary issues and cases, students will develop a professional framework for evaluating ethical dilemmas. Perspectives of advertisers, public relations practitioners, agencies, government, media, clients and advocacy groups will be examined, with a focus on social responsibility in professional practice.", "prerequisite": "COMM 320", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "COMM", "number": "418", "credits": "3 Credits", "description": "Investigation of social and psychological effects of media messages and technologies via theories and empirical evidence pertaining to processes of effects. COMM 418 Media Effects (3) This is an upper-level undergraduate course on the social and psychological effects of media messages and technologies, which moves beyond a simple introduction of media theories. Drawing on social and behavioral research in communication, psychology and related disciplines, it will attempt an advanced understanding of media effects via theories and empirical evidence pertaining to the processes of effects. Emphasis will be placed on rigorous examination of theory testing and theory development. The class will assume a general familiarity of basic communication theories pertaining to the relationship between media and public (COMM 118) and a working knowledge of quantitative research methods (COMM 304).", "prerequisite": "COMM 118"}, {"department": "COMM", "number": "419", "credits": "3 Credits", "description": "Comparative study of modern mass systems and the evolution and structure of specific countries' systems.  COMM 419 World Media Systems (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is a comparative study of modern mass media systems with focus on the ways in which two or more countries' media have evolved and are structured by the political, economic, social, and cultural environments within which they exist. Students will be exposed to the theories and practices of media systems - as explained in such normative expositions as the four theories of the press and other contemporary iterations. One objective of the course is for students to gain a better appreciation of the structure and location of the media system in the United States vis-à-vis  greater awareness of media systems in other political contexts where media cultures may vary from the U.S. matrix. Across the board of sampled countries'; media systems, students will be exposed to the ways in which each country's media have developed, are shaped, and are continually shaped by factors that include history, political cultures, evolving legal regimes, media regulations, finances, media economics, new technologies, institutional arrangements, citizens' access to information, or lack thereof.Another objective of this course is to equip students with a toolbox and framework with which they can replicate comparative media systems analyses in other countries and regions of interest as they contemplate study abroad and/or long-term career (employment, graduate studies) engagements. To achieve foregoing objectives students will be exposed to readings in theories of media systems and to academic articles using comparative methodologies to examine structural evolution of media in tandem with countries transformations over time. Students will analyze historical or contemporary media systems' developments through careful comparisons and applying critical thinking skills. In the process, students develop analytical skills useful in contending with academic and professional environments.", "prerequisite": "COMM 410", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "COMM", "number": "419H", "credits": "3 Credits", "description": "Comparative study of modern media systems of mass communications in selected foreign countries. COMM 419H World Media Systems (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. Students in this course will have the opportunity to discover the variety of media systems in the world today and, more importantly, how they got that way and what functions they perform for their respective societies. Students will evaluate each media system's history and analyze the functions of the mass media in the respective contexts. They will examine the historical, social, economic and cultural forces that influence the adoption of a national media system. They will compare perspectives on the problems and issues in freedom of expression within national media systems and evaluate the organization, regulation and economics of those systems. Finally, students will analyze the national development of media systems and the impact of the mass media in the modernization of peasants.", "prerequisite": "COMM 410", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "Honors"]}, {"department": "COMM", "number": "420", "credits": "3 Credits", "description": "Primary and secondary research methods used in the development of solutions to advertising and public relations problems. COMM 420 Research Methods in Advertising and Public Relations (3) This course is designed to provide an introduction to the logic and methods of social science research and its applications in the professional practice of advertising and public relations. Students will be introduced to methods of primary research used in the advertising and public relations fields such as survey, focus group, content analysis, and experimental design. Students will also become more familiar with basic and advanced statistical techniques and statistical software used in the field. Understanding how research is conducted and the strengths and limitations of research findings is a critical first step in developing the ability to apply research findings to communication problems in advertising and public relations.  In addition to helping students understand how to conduct research, this course is also designed to help them become critical consumers of the research conducted by others. Advertising and public relations problems often require the identification, understanding, synthesis, and application of data collected by others in developing problem solutions. Understanding secondary sources of data commonly used in the field, such as Simmons, Nielsen, Arbitron and SRDS, is an essential component of professional expertise. Problem-solving in advertising and public relations requires decision-making in a turbulent and dynamic marketing environment. To help students learn how to relate research tools and outcomes to the advertising and public relations problems at hand, this course will examine the role of research in decision-making at the critical steps in the problem-solution process. As part of developing understanding of this decision-making process, students will also become more aware of the ethical issues associated with research in advertising and public relations.", "prerequisite": "COMM 320"}, {"department": "COMM", "number": "421W", "credits": "3 Credits", "description": "Planning, designing, writing advertisements; introduction to graphics and production techniques and processes; layout and copywriting practice and critiques. COMM 421W Advertising Communications Problems (3) This course is designed to provide students with an overview of the intellectual and practical skills involved with the development of advertising creative work. Students are introduced to research and thinking strategies that lead to creative ideas and are provided with computer software and other training that facilitates the execution of advertising based on their ideas. The course requires students to complete several creative projects, in distinct product categories (e.g., packaged goods, durable goods, public services, consumer services), over the course of the semester. Before developing advertising, students will be expected to research the product, service or idea that constitutes the creative project. They will gain an understanding of the kinds of information most valuable to creative professionals in the development of ideas, and be provided with an overview of research strategies leading to the discovery of such information. After completing the required research, students will produce briefs that summarize findings and serve as a platform for further work on their creative projects. Given the course 's designation as writing intensive, these documents will be evaluated both for their content and the degree of accuracy demonstrated in grammar, spelling, punctuation and word choice. Since the evaluation of creative ideas is inherently subjective, these written research documents are usually weighted more heavily in the calculation of final course grades. Students will use their own research as the platform for generating creative ideas to advertise their product, service or idea. Instruction on creative thinking techniques will be provided as tools for this activity. As ideas are developed, students are encouraged to share their work with their peers and the instructor for feedback. In \"workshop\" fashion, these in-class critiques of creative work serve to refine and improve ideas. Over the course of the semester, students work toward finalizing creative solutions. By semester's end, each student will be expected to submit a final portfolio of work that demonstrates proficiency in the subject matter covered by the course. Traditionally, the final portfolio includes creative briefs and ads developed from them.", "prerequisite": "COMM 320", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "422", "credits": "3 Credits", "description": "Analysis, selection, and scheduling of advertising media; examination of algorithms, technologies, and software used in media planning.  COMM 422 Advertising Media Planning (3) This course is designed to provide an introduction to the concepts and techniques of media planning. The course will cover traditional and online media options. The student will learn to use software models to facilitate media decisions.Secondary sources of research used in the media planning process will be discussed. The design, construction, implementation and evaluation of effective media plans that meet specific advertising objectives will be detailed. Ethical media planning processes will be reviewed. The goal of the course is to develop critical thinking skills that will improve decision making in a dynamic and turbulent media environment.", "prerequisite": "COMM 320"}, {"department": "COMM", "number": "424", "credits": "3 Credits", "description": "Advertising campaign problems from the viewpoint of the national advertiser and advertising agency; production of a complete advertising campaign. COMM 424 Advertising Campaigns (3) This comprehensive capstone course is designed to provide an opportunity to showcase your creativity and knowledge about advertising communications. Strategic integrated marketing communications concepts are emphasized.The campaign proposal developed in this course will showcase the full weight of your knowledge and skill in the area of advertising communications. Students will need a background in creative design and practices, media planning principles and practices, and research methods used to delineate appropriate target groups and evaluate campaign effectiveness.A strong focus will be on understanding the audience and developing message strategies that have a high potential to influence attention and marketing behaviors. During the course you will create a complete advertising/marketing communications campaign proposal that reflects a set of communication goals derived from a set of measurable objectives all designed to meet the needs of your client.A situation analysis will be developed to provide a detailed assessment of the product or service environment.This includes analysis of the product class, life cycle, generic and brand level competition, and target group identification. The goal is to gain relevant information that can be used to make justifiable strategic decisions related to the advertising campaign.Strategic goals and objectives will be developed that allow the direction and efficacy of the campaign to be measured.Tactics must reflect the strategies developed in the campaign. Campaigns include diagnostic and performance benchmarks used to evaluate the progress of a set of predetermined measurable objectives.The goal is to provide timely feedback that allows the agency and client to evaluate the effectiveness of the campaign. This is especially important as client -agency relations continue to adapt a series of formal measures of campaign effectiveness. The class is designed to develop critical thinking skills. For example, each strategic decision presented in a campaign must have a fully explicated rationale that is based on quantitative and qualitative criteria. Research tools will be presented in class that allow and support the development of measurable objectives. The campaign proposal must include a series of benchmarks designed to evaluate the progress of the campaign at key time points.The campaign will have a complete media plan that includes selected media, cost efficiencies, and media schedule. Students will be expected to be familiar with media principles and media planning software.", "prerequisite": "COMM 420"}, {"department": "COMM", "number": "425", "credits": "3 Credits", "description": "An academic option for student AAF members who will develop an integrated advertising campaign to be presented in District competition.  COMM 425 Advanced Advertising Campaigns (3) The class is structured along the lines of a real-world advertising agency and the manner in which they might pitch a new account. Students work through the research and situational analysis to develop an integrated communication plan, campaign budget, and message strategies for a client. The client is provided by the National Student Advertising Competition. This group provides undergraduate advertising students with a realistic problem that is solved through team effort, knowledge and creativity. Students might have the opportunity to pitch their plan to the NSAC client.", "prerequisite": "COMM 424"}, {"department": "COMM", "number": "426", "credits": "3 Credits", "description": "Advertising and public relations in the international and intercultural arenas; multicultural strategic communications strategies. COMM 426 International and Intercultural Strategic Communication (3) COMM 426 will provide students with a framework for applying their existing public relations and advertising tools in the global arena. Working internationally and/or interculturally challenges the advertising, public relations or marketing executive to think outside his or her own \"cultural box.\" Some of the challenges include finding research about consumers, competitors and the marketplace outside of North America and Western Europe, understanding local cultures and customs, understanding the importance of ethnicity, and building an integrated core of professional communications that work with a common purpose, even if they come from different backgrounds - or are on different continents.The emphasis will be on developing a methodology for researching international and intercultural strategic communications problems, and then discussing possible communications-based solutions. To that end, case studies from both the international advertising and international public relations disciplines will play an important role in the course. Additionally, students will be exposed to a number of frameworks for analyzing culture, coming from the areas of anthropology (Schwartz' 10 Value Domains), social psychology) Bond's essay on impression management in multicultural organizations) and international business (Hofstede's Dimensions of National Culture).", "prerequisite": "COMM 320"}, {"department": "COMM", "number": "427", "credits": "3 Credits", "description": "Building and maintaining client/agency relationships in advertising, public relations and direct response agency business functions. COMM 427 Client/Agency Relations (3) Client/Agency relations provides students with an understanding of advertising, public relations and direct response agency business functions, and the important role of building and maintaining client/agency relationships. It covers the phases of pre-relationship (identifying, prospecting, pitching and winning accounts), developing relationships with clients and maintaining and enhancing these relationships over time. Client/agency relationships are built on the development of viable partnerships with clients, establishing strategies to support and maintain the vitality of client business success, and the on-going delivery of fresh creative ideas from all agency disciplines. Today's agency has become a resource for all integrated marketing communication (MARCOM) needs. This includes, but is not limited to, advertising, promotion, public relations, direct response marketing, event marketing, customer-relationship marketing, interactive internet communication and branding ideas. This course covers the integration of these disciplines on behalf of an agency's clients.", "prerequisite": "COMM 421W"}, {"department": "COMM", "number": "428A", "credits": "3 Credits", "description": "Principles of Strategic Communications provides an overview of the various media and communications methods that comprise modern integrated marketing campaigns.  COMM 428A Principles of Strategic Communications (3) Principles of Strategic Communications will introduce students to strategic communications in the context of integrated marketing communication (IMC). It will overview the industry by providing a foundation for understanding what IMC is and how it developed to its current state, what it tries to accomplish, how it works, and how it can affect society. It lays the groundwork for other courses in the strategic communications sequence. The fundamentals of consumer psychology will be introduced, along with theories of persuasion. In addition to traditional advertising, the course will review other critical functional areas of IMC such as public relations, sales promotion and direct marketing. The role of the internet and emerging new media technologies will also be covered. The advantages and disadvantages for different media will be summarized, and the basics of media planning will be introduced. Course content is present in the context of strategy and planning, with the goal of illustrating how various elements in the promotional mix work together to achieve campaign objectives. The importance of effective measurement and accountability at each point of campaign development and execution will be explained. Finally, the ethical and regulatory environment for IMC will be explored."}, {"department": "COMM", "number": "428B", "credits": "3 Credits", "description": "Analysis of laws and regulations affecting online advertising and strategic communications.  COMM 428B Strategic Communications Law (3) Strategic communications law focuses on the key legal issues affecting strategic communications, advertising and marketing in an online environment. Major topics include First Amendment protection for commercial speech; advertising regulation including spam and the use of trademarks and copyrights; privacy regulation including the collection of user data and use of endorsements, and procedural issues such as jurisdiction and analysis of various regulatory authorities. Additional topics will include domain names, marketing to minors and current developments in advertising and Internet law.", "prerequisite": "COMM 428A"}, {"department": "COMM", "number": "428C", "credits": "3 Credits", "description": "Strategic Communications in a Global Environment will provide students with a framework for applying public relations and advertising tools across media platforms and across cultures.  COMM 428C Strategic Communications in a Global Environment (3) Strategic Communications in a Global Environment will provide students with a framework for applying public relations and advertising tools across media platforms and across cultures. While cross-cultural communication has always been a challenge for strategic communicators, introducing online elements to campaigns exposes strategic communications professionals to a host of new challenges, including a wide range of ethical and legal dilemmas emanating from new to abilities to collect sensitive data from audiences, often without their knowledge. Students will be exposed to a number of frameworks for segmenting publics in this new environment, both geographically and psychographically, and will learn the skills to work with colleagues across borders and cultures to create effective, ethical strategic communications campaigns.", "prerequisite": "COMM 428A"}, {"department": "COMM", "number": "428D", "credits": "3 Credits", "description": "This course covers online research methods for strategic communication, including web analytics, online surveys, online interviews, and content analysis.  COMM 428D Research and Analytics (3) Increasingly, organizations are using the web as a vehicle for communicating with key audiences such as customers, shareholders, volunteers, donors, community members, and government entities. In this class students will be exposed to theories and practices in the areas of online research and analytics with a focus on understanding how customers perceive the organization, assessing the engagement with target audiences online, measuring the value of relationships that organizations initiate and build online, and tracking how web site visitors experience an organization's site. The course will expose students to tools for tracking and measuring online communication, and it will help students understand how to prioritize audiences and communication to maximize the effectiveness of measurement. Research methods taught in this class include web analytics, online surveys, online interviews, content analysis, and online focus groups. Gauging the impact of online communication helps organizations engage in more efficient and effective communication practices. Practitioners in strategic communication need to understand how to measure and evaluate the effectiveness of their communication in this medium. This course will prepare students to conduct online research in practice.", "prerequisite": "COMM 428A"}, {"department": "COMM", "number": "428E", "credits": "3 Credits", "description": "This course covers social media theory, tools and best practices to prepare students for current and future use of social media. COMM 428E Social Media Strategies (3) Social media - including social networking, podcasting, bookmarking, blogging, microblogging, location-based, wikis, and other collaborative content creation platforms - are changing the field of public relations. While many public relations professionals claim to be social media \"experts,\" those who can demonstrate true expertise are rare and much sought after. This course narrows the focus from the broad field of social media to cover the specific tools and best practices needed to conquer current and future use of social media in public relations.", "prerequisite": "COMM 428A"}, {"department": "COMM", "number": "428F", "credits": "3 Credits", "description": "This is an advanced strategic communications class that covers the process and steps involved in campaign planning. Lectures and readings will cover the relevant concepts and strategies in campaign preparation. Students will have the opportunity to apply the concepts and skills and develop a communications campaign for a client. An important part of the class is the final project that students are required to put together. The class will begin by reviewing the key concepts and steps of campaign planning. It will review the tools and resources for students to conduct both primary and secondary research. Based on the research, students will develop the message and communication strategies for a comprehensive campaign. At the end of the semester, students will present the final campaign in the class.", "prerequisite": "COMM 428A"}, {"department": "COMM", "number": "430", "credits": "3 Credits", "description": "Study of mass media as institutions and the effects of the mass media on politics, public policy, and citizens. COMM 430 Mass Media and Politics (3) In Mass Media and Politics, we address issues and relations of the political realm, the media institutions, and the public sphere. Particular attention is dedicated to the influence of and coverage by both the domestic and international news media. In addition, we also examine topics such as bias in the media, women and politics, political campaigns, and advertising, ideology and hegemony, and cultural representations in the media. Of importance are notions of how and why mass media influences the national political debate, as well as what mass media exports in terms of culture and what this means to the political reality of other nations. The discussion of these issues is often couched in terms of technologies, especially emerging and traditional mass media technology systems such as convergence technologies, the World Wide Web, television, radio, and newspapers. Prerequisite: COMM 251.", "prerequisite": "COMM 251"}, {"department": "COMM", "number": "431", "credits": "3 Credits", "description": "Study television technologies, techniques, audiences, genres and trends in relation to a specific decades or cultural periods.", "prerequisite": "COMM 180", "other": ["Bachelor of Arts: Arts"]}, {"department": "COMM", "number": "433", "credits": "3 Credits", "description": "History of the art, industry, economics, culture, and technology of cinema from 1960 to the present.  COMM 433 Film History for Filmmakers II: The Development of the Cinema from 1960 to the Present (3) Film History for Filmmakers II presents the history of the medium of cinema from 1960 to the present. The course explores the artistic, technical, economic development of the cinema, and the cultural contexts in which this development occurred. The course covers narrative, experimental, and documentary cinema and trains students in the techniques of close formal analysis of the cinema. The course builds upon formal, thematic, and cultural analysis of the cinema introduced in Film History I. This course is integral to the existing curriculum. It provides Film-Video students with a detailed description of trends in their art form. It provides students with a more intensive study in the history of an influential medium in the development of the concept of mass media and communications. The course will be taught each Spring semester.", "prerequisite": "COMM 333"}, {"department": "COMM", "number": "434", "credits": "3 Credits", "description": "Study of Jewish American Film and Popular Culture.  COMM (J ST) 434 Movies, Media, and the Jewish American Experience (3) The course examines film and other popular media, including theater, radio, and television, as important sources for understanding the Jewish experience and its impact on and relationship with American culture more generally since the late 19th century. Topics to be considered include US film and popular media as representations of Jewish history, culture, and experience; the role of Jews as prominent directors, producers, actors, and writers in their social-historical context; and the history and function of the representational modes and techniques used in these texts. A major emphasis of the course will be on analyzing film and other media texts as lenses to reflect, refract, and focus on Jewish American identity. By way of analyzing the interrelationships between filmic and other media texts and Jewish American experience, the course will attend to a number of key themes in Jewish cultural history, including Jewish life in late 19th-early 20th century Europe; immigrant life in turn of the century America and questions such as assimilation, preservation of tradition, family life, social mobility, and male/female relations; Jews in show business, organized crime, and sports; American Jews and the Holocaust; American Jews and Israel; Jews in the modern age; generational and denominational differences among Jews; and Jews and anti-Semitism.", "prerequisite": "A previous course in Jewish Studies, Film Studies, Media Studies,   Art, Music, English, or Comparative Literature.", "other": ["Cross-listed with: JST 434"]}, {"department": "COMM", "number": "436", "credits": "3 Credits", "description": "Advanced concepts and techniques of audio production in analog and digital formats with hands-on experience in recording, mixing and editing.  COMM 436 Advanced Audio Production (3) This course builds on the concepts and techniques of audio production in both analog and digital formats introduced in COMM 374 and includes in-depth examination of sound theory and hands-on practice in advanced projects involving recording, mixing and editing in analog and digital formats. This course provides an understanding of technical and aesthetic aspects of advanced audio production, and provides students the opportunity to demonstrate advanced skills in recording, editing and mixing. Students gain an understanding of professional studio and field practices and develop advanced studio and field projects suitable for a portfolio.", "prerequisite": "COMM 374"}, {"department": "COMM", "number": "437", "credits": "3 Credits/Maximum of 6", "description": "Advanced exploration of documentary production techniques and aesthetics through the completion of a short video project. COMM 437 Advanced Documentary Production (3 per semester/maximum of 6) This course is designed to enable students to produce portfolio-quality work while bringing together ideas, processes, practices, and theories in the service of documentary production. Students will explore the history, conventions and theory of the documentary film form, while developing and producing a film or video work for screening at the end of the semester. Working in small crews with others from the class and using sophisticated production equipment, students will write and produce short digital video projects. Utilizing a workshop structure, class time will be focused on discussion and analysis of the challenges faced by individual productions as well as on providing the support, guidance, and critique necessary for a successful production. Particular emphasis is given to the traditions of social criticism, the creative treatment of actuality, the individual and collective points of view. The history of documentary form is illustrated by comparing the work of the American 'Direct Cinema' style embodied in the work of Drew Associates to the French 'Cinema Verite 'style developed by Jean Rouch. The evolution of these styles into what we now just refer to as 'Verite' filmmaking is put into practice through a series of exercises that incorporate a variety of points of view. Analysis of the above works, as well as examples from Barbara Kopple, Errol Morris, and Frederick Wiseman, provide students with a springboard to develop their own style, vision, and personal creative voice. An examination of Bill Nichols taxonomy of non-fiction film classification further contextualizes aesthetic and theoretical issues for students. A series of lectures, discussions, readings, and screenings move students through the personal and collaborative process of documentary production.", "prerequisite": "COMM 337"}, {"department": "COMM", "number": "437A", "credits": "3 Credits", "description": "Advanced exploration of documentary production techniques and aesthetics through the completion of a short video project abroad.  COMM 437A Advanced Documentary Production Abroad (3) This course is designed to enable students to produce portfolio-quality work while bringing together ideas, processes, practices, and theories in the service of documentary production. Working in small crews with others from the class and using sophisticated production equipment, students will write and produce short digital video projects. While exploring the history, conventions and theory of the documentary film form, students will develop and produce a 3-9 minute video work to be filmed abroad either during the Spring Break, in the middle of Maymester or over the Thanksgiving Break (depending on the semester offered). Upon return from their time abroad, students will edit and screen their final projects. Utilizing a workshop structure, class time will be focused on discussion and analysis of the challenges faced by individual productions as well as on providing the support, guidance, and critique necessary for a successful production. Particular emphasis is given to the traditions of social criticism. The history of documentary form is illustrated by comparing the work of the American \"Direct Cinema\" style embodied in the work of Drew Associates to the French \"Cinema Verite\" style developed by Jean Rouch. The evolution of these styles into what we now just refer to as \"Verite\" filmmaking is put into practice through a series of exercises that incorporate a variety of points of view.Analysis of the above works, as well as examples from Barbara Kopple, Errol Morris, and Frederick Wiseman, provide students with a springboard to develop their own style, vision, and personal creative voice. An examination of Bill Nichols taxonomy of non-fiction film classification further contextualizes aesthetic and theoretical issues for students. A series of lectures, discussions, readings, and screenings move students through the personal and collaborative process of documentary production.", "prerequisite": "COMM 337"}, {"department": "COMM", "number": "438", "credits": "3 Credits/Maximum of 6", "description": "Advanced exploration of narrative production techniques and aesthetics through the completion of a short film or video project.  COMM 438 Advanced Narrative Production (3 per semester/maximum of 6) This course is designed to enable students to produce portfolio-quality short projects that bring together ideas, processes, practices, and theories in the service of narrative production. Over the course of the semester, students will pursue an entire project from conception to completion through intensive pre-production, production, and post-production stages. Working in small crews composed of fellow classmates and using sophisticated production equipment, students will write and produce short digital video projects. Utilizing a workshop structure, class time will be focused on discussion and analysis of the challenges faced by individual productions, as well as providing the support, guidance, and critiques necessary for a successful production. There will be an emphasis on the thorough execution and evaluation of the steps taken toward completion of their project. As a workshop, specific topics pertaining to the three stages of production will be reviewed as necessary. Students will be expected to hand in a pre-production packet (budget, schedule, script breakdown and lined script) before proceeding to the production phase.", "prerequisite": "COMM 338"}, {"department": "COMM", "number": "439", "credits": "3 Credits/Maximum of 6", "description": "COMM 439 Advanced Alternative Production (3) is a senior level course focusing on the development and expression of the individual filmmaker. The emphasis of the course is on exploring the history, conventions and modes that surround the experimental and animation film forms and using this knowledge in creating work that challenges conventions of mainstream media. The course involves viewing works of classic and contemporary alternative media, discussing its contribution or value in communications, and using these examples as models for exploration. Utilizing a workshop structure, class time will be focused on discussion and analysis of the challenges faced by individual productions, as well as on providing the support, guidance, and critique necessary for a successful production. There will be an emphasis on the thorough execution and evaluation of the steps taken toward completion of their project. This course assumes a working knowledge of intermediate film and video production and post-production techniques. Additional production and post-production techniques may be introduced based on the students' interest.", "prerequisite": "COMM 339"}, {"department": "COMM", "number": "440", "credits": "3 Credits", "description": "Advanced exploration in camera, lighting, audio, and color-grading techniques, emphasizing technical skills as well as aesthetics. COMM 440 Advanced Cinematography and Lighting Techniques (3)This course is a comprehensive approach to techniques, equipment and procedures of film and video production with an emphasis on both practical skills and aesthetics. The course is divided into four sections that will employ a combination of lectures and workshops in camera, lighting, audio and color grading. The course will focus on understanding the theory and procedures underlying dynamic composition, visual and psychological perspective, practical and emotive lighting and sound, color, and the conveyance of meaning through color and continuity. In addition, students will learn accepted procedures in care and use of film and video cameras, sound recording equipment, lighting and grip gear, as well as proper organization, media storage and maintenance techniques specific to post-production. Students will work individually and collaboratively to produce projects for critique and evaluation. The emphasis of the course is on the artistic and technical aspects that allow an idea to be cinematically realized on celluloid and/or a suitable digital format. The course involves viewing the work of outstanding, established cinematographers and videographers in great detail, and assessing their contributions to film aesthetics and history through the detailed, direct analysis of film excerpts and sequences from landmark films and video work, and the discussion of assigned reading materials on both film and video technique. Students then work in specific film and video production positions to reproduce precisely scenes from the films analyzed. By doing so, students will develop an understanding of the technology and artistic vision used in film and video production so that they may be better prepared to successfully create challenging and thought-provoking projects. In addition, this course also allows for an exploration and comparison of the ever-changing technology used in film and video production. Through this direct use of multiple visual and audio formats, students will discover the creative advantages and disadvantages of various media used to fulfill their artistic vision.COMM 440 is a support course for the senior level production courses. Student cinematographers in COMM 448 (Adv. Production for Groups) are strongly encouraged to take this course concurrently. It can also be taken as an elective technique course in conjunction with any of the one-semester mode specific advanced production courses (COMM 437, COMM 438, or COMM 439).", "prerequisite": "COMM 340"}, {"department": "COMM", "number": "441", "credits": "3 Credits", "description": "Theory and practice designing graphic visual communication in commercial, non- commercial, and fine art formats for print and on-line media.  COMM 441 Advanced Graphic Design (3) An advanced examination of graphic design. Students develop proficiencies in the art, craft, formats, and vocabulary of commercial graphic design by creating original work in a series of hands-on projects. During the semester, students learn to research, organize, and interpret verbal and visual information and to solve increasingly complex communication problems. They will further refine their creative problem solving and collaborative production skills. By semester end, students will have begun to develop their own styles and are able to verbally articulate it to others. Assignments generally include topics such as interactive media design, animation, advertising design, and infographic design.", "prerequisite": "COMM 241"}, {"department": "COMM", "number": "443", "credits": "3 Credits", "description": "This course will immerse students in the language and practice of producing film and video projects.  COMM 443 Producing Workshop (3) Through a combination of lecture, readings, screenings, and practical exercises, students will learn the fundamental producing skills needed to begin to understand creative producing in an increasingly complex global marketplace. Producing students will learn how to bring stories all the way from development through post-production and beyond. Students will be afforded an opportunity to develop their creative voices, all the while developing their communication and problem-solving skills. The course will follow a standard production timeline starting with pre-production topics such as the basics of pitching, script development, and financing. The second portion of the class will focus on production issues particularly as they apply to independent film production. This will include line producing and production management, including scheduling/budgeting, script breakdowns, assembling talent and crew, location scouting, and running a set. Finally post-production and distribution topics will be addressed including discussions of trends from major trade publications that impact the industry.Throughout the semester students will complete practical exercises that will help build their skills at translating a script into a realized project with a minimum budget and maximum production value.COMM 443 is a support course for the senior level capstone production courses. Student producers in COMM 448 (Adv. Production for Groups) are strongly encouraged to take this course concurrently. It can also be taken as an elective technique course in conjunction with any of the one-semester mode specific advanced production courses (COMM 437, COMM 438, or COMM 439). The prerequisites are in place to ensure students have the necessary production background taught in the intermediate-level courses.", "prerequisite": "COMM 340"}, {"department": "COMM", "number": "444", "credits": "3 Credits", "description": "This course offers intensive practical experience in editing, motion graphics and sound mixing techniques, emphasizing both technical skills and aesthetics.  COMM 444 Advanced Post-Production Techniques (3) Through a combination of lectures, readings, screenings, and practical exercises, students will learn advanced post-production techniques needed to produce high quality finished film and video pieces. The course includes modules on the theory and aesthetics of editing, motion graphics, visual effects, 2D animation, audio signal processing and audio mixing. The course will enable students to develop creative skills for translating ideas into short films and to serve as post-production support for senior level productions. Specific design strategies and approaches will be discussed. Students will also be required to demonstrate competence in a variety of digital graphics programs. Throughout the semester students will work individually and collaboratively on practical exercises for critique and evaluation, developing technical, analytical and critical skills.The course is divided into three sections. In the first section students will focus on the procedures for successful post-production supervision and workflow management, including an exploration of accepted professional practices of editing departments. Students will explore advanced methods of picture editing in all modes and will edit and critique a professionally produced scene. In the second section of the course, students will work on graphics, animation and special effects procedures generally accepted as part of film-video post-production processes. The focus will be on techniques that translate to a variety of software and work environments; including manipulation of picture and text, light and color effects, compositing of multiple images and manipulation thereof. The third section of the course will focus on the practice of preparing elements for a professional audio mix and use of advanced digital audio workstations. This section will feature a discussion of the theory and practice of how tracks are organized, advanced psychoacoustics and signal processing, preparing a multi-track project for mix, and completion of a mixed sound design project.", "prerequisite": "COMM 340"}, {"department": "COMM", "number": "445", "credits": "3 Credits", "description": "An advanced aesthetic and skill production course in directing for the screen.  COMM 445 Directing Workshop (3) This course is an advanced aesthetic and skill production course in directing for the screen. The class is designed to introduce more advanced directing concepts and techniques as well as to more deeply explore the collaborative processes of working with a creative team on effectively integrating the aesthetics of cinematography, production design and acting performance in film narrative. The first section of the course will focus on understanding the actor's preparation and process with the goal of developing the appropriate and effective communications skills to coach performance. Students will thoroughly explore scenes for interpretation of subtext and motive, and will learn accepted practices of script preparation. Casting and audition styles will be investigated and demonstrated, as will various types of rehearsal techniques. At the end of this section students will workshop a scene in a small group, blocking it and executing it to illustrate concepts of character relationships, stage and camera craft to produce a short scene for discussion and critique. The second section of the course will be an advanced aesthetic exploration of the visual vocabulary, including cinematic, psychological and fine art concepts that contribute to the planning and design of screen direction. Students will then analyze the technical means to execute this aesthetic vision through production design, lighting and composition. In practice the students will then translate this analysis into a working scene plan and will produce a short scene for discussion and critique. Students will also be introduced to professional practices such as location and studio set protocols and on-set safety procedures. The third section of the course will explore narrative conventions and their relationship to screen genres in the interest of understanding the film language shared between filmmaker and audience. At the end of the section students will produce a short classic scene with an alternative interpretation for discussion and critique.", "prerequisite": "COMM 340"}, {"department": "COMM", "number": "446", "credits": "3 Credits", "description": "An advanced course in screenwriting that further develops elements of storytelling technique.", "prerequisite": "COMM 346"}, {"department": "COMM", "number": "448", "credits": "3 Credits", "description": "COMM 448 Advanced Group Production I (3) is designed to enable students to produce portfolio-quality work in any production mode (alternative, documentary, narrative) and to bring together ideas, processes, practices, and theories in the service of this production. Over the course of the semester, students will engage in intensive pre-production and production of an approved film or video project. Utilizing a workshop structure, class time will be focused on discussion and analysis of the challenges faced by collaborative productions as well as providing the support, guidance, and critique necessary for a successful production. There will be an emphasis on the thorough execution of every step of pre-production, principal photography, and preparation for post-production in spring semester. Students will fill a single production role (such as producer, director, cinematographer, sound designer, editor) throughout the two semesters and are strongly encouraged to take concurrently the supporting technique course for that production role. Students will be assigned individual exercises specific to their production role in addition to the collaborative work of the project's production. Production groups will be formed the first week of class. The first part of the semester is devoted to the development of the projects and pre-production. Roughly half way through the semester, the projects will begin production, with shooting and editing to be completed the following semester.", "prerequisite": "COMM 340"}, {"department": "COMM", "number": "449", "credits": "3 Credits", "description": "Continuation of advanced production course emphasizing intensive collaborative film-video production from script through post-production.  COMM 449 Advanced Film and Video Projects (3) This course is the second half of a two-semester production course designed to enable students to produce portfolio-quality work in any production mode and to bring together ideas, processes, practices, and theories in the service of this production. Students from the fall semester will complete production and engage in intensive post-production in order to have a high-quality finished project to submit to film festivals by the end of the semester. Utilizing a workshop structure, class time will be focused on discussion and analysis of the challenges faced by individual productions as well as providing the support, guidance, and critique necessary for a successfully completed project. Students will continue in the same production role (producer, director, cinematographer, sound designer, editor) from the fall semester, learning new skills for their role in the post-production phase. Students will be assigned individual exercises specific to their production role in addition to the collaborative work of the project's production. It is expected that all production group members will continue into the spring as well.", "prerequisite": "COMM 448"}, {"department": "COMM", "number": "450", "credits": "3 Credits", "description": "Digital advertising has transformed many industry activities related to buying and delivering advertising. Information technology and big data have revolutionized the way media and content providers interact and negotiate with advertisers, agencies and third parties. This course will explore the digital advertising and media ¿ecosystem,¿ identify key players and trends, and review performance analysis and evaluation. Particular attention will be paid to sources, management, storage, analysis and visualization of data. Trends in industry regulation and ethics will be explored. This includes ad industry selfregulation and data privacy regulations. The implications of big data and artificial intelligence on industry ethics is discussed.", "prerequisite": "COMM 310", "other": ["Cross-listed with: IST 450"]}, {"department": "COMM", "number": "450A", "credits": "3 Credits/Maximum of 3", "description": "This project-oriented course provides students with the knowledge and skills necessary to conduct sponsored advertising-based marketing campaigns. This course offers students an opportunity to gain knowledge and hands-on experience on sponsored search and email advertising. Strategies for developing successful digital advertising campaigns will be discussed, including qualifying and researching clients, account and campaign structure, identifying and organizing keywords, bidding strategies and budgeting, and targeting approaches (including geo, time-based, audience, content and domain targeting), and conversion tagging, tracking and attribution. Students will earn certifications for Google Search and Display, and gain experience with the Google Ads platform, including use of the keyword planning tool, setting up campaigns, ad groups and keywords, writing text and display ad copy, and applying proper settings at the account, campaign, ad group and ad levels. Finally, students will learn important principles for landing page design and become proficient building professional landing pages. Students cannot earn credit for both COMM 450A and MKTG 473.", "prerequisite": "COMM 450", "other": ["Cross-listed with: IST 450A"]}, {"department": "COMM", "number": "451", "credits": "3 Credits/Maximum of 6", "description": "Critical and historical studies of American films. Analysis of directing, cinematography, editing, screenwriting, and acting.", "prerequisite": "COMM 250", "other": ["Cross-listed with: AMST 451"]}, {"department": "COMM", "number": "452", "credits": "3 Credits/Maximum of 6", "description": "Critical and historical studies of topics in non-American film. Analysis of theory, direction, cinematography, editing, and screenwriting.", "prerequisite": "COMM 250"}, {"department": "COMM", "number": "453", "credits": "3 Credits", "description": "This course explores the relationships between language and the medium of film through analysis of adaptations between other mediums and the cinema, and by analysis of the influences between the discourses of literature(s) and the cinema. The course has broad applicability not only to students of literature and students of the cinema, but to all students who need to understand ways to compare relationships between disparate communications and artistic media. Students begin by understanding techniques and theories of both cinematic and literary analysis. Then, they explore theories of adaptation between media, including general theories of artistic and cultural influence. Among the media students may encounter in addition to literary fiction and narrative cinema are the graphic novel, creative nonfiction, drama, poetry, journalism, video games, the documentary cinema, and the experimental cinema. Students work through case studies of adaptation in literal terms, such as the transformation of graphic novels into narrative cinema. Students also work through case studies in influence, in which distinct art and media discourses affect one another, as in the relationship between videogames and the cinema. Students study transmedia storytelling, in which core narratives are expressed in different media. Students also study transcultural and transnational storytelling, in which adaptation and influence are conducted across borders. Students study questions of representation, particularly of difference (race, class, sexuality/gender) and cultural specificity. Students learn the historical and institutional settings which have conditioned these intermediations. The economics of literary and media production and the circumstances of reception of distinct media are explored. Students will experience classical and non-classical forms of storytelling, as well as fictional and non-fictional discourses. In this course, students will meet ancillary concerns in adaptation, such as translation, dramaturgy, and genre scholarship. Students express their individual conclusions in summary projects which apply theory to particular instances of adaptation and influence between media. These projects may include creative work, and multimedia texts which enact as well as analyze adaptation. As advanced scholars in the disciplines of literary and cinematic studies, students are expected to synthesize previous learning in these fields in their summary projects.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: CMLIT 453", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "COMM", "number": "454", "credits": "3 Credits/Maximum of 6", "description": "Study of representative films from various documentary movements, examining form, technique, trends, and audience objectives.", "prerequisite": "Fourth Semester Standing"}, {"department": "COMM", "number": "455", "credits": "3 Credits/Maximum of 6", "description": "Description: This capstone course builds upon scholarly ideas and experiences in COMM 150 to familiarize the student with various theories of film, and their application to specific films and categories of films. This course requires media studies and film/video majors to develop the ability to perform criticism: that is, to select among philosophical, analytical, and rhetorical tools those which best fit the goals of a specific critical engagement with a media text, and to execute this criticism in a manner that will be persuasive to readers, listeners, and/or viewers. Because this extended critical and evaluative act is fundamental to both the study and making of media, this course is designed to have broad applicability to a variety of media-based professions. Among the concepts students will engage in this course are: neoformalism, semiotics, auteurism/authorship, genre theory, feminist film theory, theories of difference (including race, class, and sexuality/gender), theories of national and transnational cinema, cultural history, realist and montage theories, behavioral studies, psychoanalytic and apparatus theory, reception studies, political economic and convergence theories of the cinema, and theories of the digital in cinema. Students will engage a selection of film styles: narrative, documentary, experimental, and animation; silent and sound, national and international. Students will analyze the cinema as an art form, and as a mass communications medium. Students will also gain knowledge of the history of theory and the history of criticism in the cinematic medium. During the course of their semester's work, students will use the tools of reading, discussion/presentation, analysis, examination, and particularly writing to develop performative skills in criticism. Students are expected to become proficient in the practice of criticism, as well as understanding the principles of criticism. In their summary work in this course, students apply the theories they have learned to cinema in various ways: in group projects, in individual research papers, or through multimedia and digital scholarship settings. Students are expected to demonstrate a synthesis of ideas and experiences from previous course work in cinema studies and media studies. In some iterations of this course, students will address a single overarching topic, such as \"Authorship and the Cinema,\" through which the broad learning objectives and capstone nature of the course will be realized.", "prerequisite": "COMM 250"}, {"department": "COMM", "number": "456", "credits": "3 Credits", "description": "Critical and theoretical approaches to the analysis of media and communication. To what extent does media (television, movies, print, radio, Internet, etc.) shape our awareness of not only the world around us but also ourselves as thinking human beings? Is it all a matter of perception and relative exposure to these media? How do we approach everyday interfaces with the immense number of media messages in both public and private spaces? Where do our opinions of the validity of both the informational and the aesthetic standards of media messages come from? In this course, we attempt to come to terms with the rise and apparent predominance of media as a dominant cultural institution.", "prerequisite": "COMM 371"}, {"department": "COMM", "number": "457", "credits": "3 Credits", "description": "Survey of the ways media attempt to influence audience reception and how audiences hold sway over media content.  COMM 457 Media Audiences and Contexts (3) The course begins with an examination of how the mass audience is conceived as a statistical entity by analyzing quantitative methods such as the Nielsen ratings. Much of the course is then spent interrogating how this statistical information is used and by whom. If the audience is created as a commodity and is sold to advertisers, what ethical guidelines are in place? How do audience profiles influence the programs we see and consume? As media become more and more fragmented, how does the problem of audience as a commodity get resolved? Students utilize a case-study approach to explore a variety of audience problems and present their findings in papers, demonstrations, and exhibitions.", "prerequisite": "COMM 251"}, {"department": "COMM", "number": "458", "credits": "3 Credits", "description": "The study and practice of key issues in media law and ethics, including libel law, conflict of interest, truth in advertising.  COMM 458 Media Law and Ethics (3) An examination of the role of the mass media in American society in regard to the rights, responsibilities, and duties of practicing media professionals. The semester is almost evenly divided between law and ethics topics. Students examine current laws in mass media with the goal of preparing them to be lawful and responsible members of the profession. Law topics include defamation, privacy, intellectual property and protection of anonymous sources. Students also get an introduction to ethical theories and their practical applications in media industries. Topics include journalistic responsibilities, objectivity, conflicts of interest, invasion of privacy, and the ethics of persuasion and entertainment.", "prerequisite": "COMM 251"}, {"department": "COMM", "number": "459", "credits": "3 Credits", "description": "Study of the global social impact and rhetorical limitations of converging media, emphasizing cross-cultural media influences.  COMM 459 Cultural Effects of Interactive and Online Media (3) An examination of the various effects of digital media on society and culture. The nature of digital media affects content and production, the way people use media, and social interaction. Topics include convergence, the information society, the global village, and the various changes in the ways media producers do their work. Various aspects of changes including philosophical, economical, and political are examined with the goal of helping students understand how to prepare for future changes in media industries.", "prerequisite": "COMM 251"}, {"department": "COMM", "number": "460W", "credits": "3 Credits", "description": "Techniques in reporting news and trends at the local, regional, and county levels. Emphasis on both deadline and interpretive reporting.", "prerequisite": "COMM 260W", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "461", "credits": "3 Credits/Maximum of 6", "description": "Students will learn about idea conception, writing, and editing of magazine stories.  COMM 461 Magazine Writing (3 per semester/maximum of 6) Students will learn about idea conception, writing, and editing of magazine stories. They will walk through the idea process, including how to pitch their ideas to editors. They will learn about research and reporting for stories, and then begin the process of organizing and writing their material. They will write stories and then work with editors to rewrite and improve the story for publication.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "461A", "credits": "3 Credits/Maximum of 6", "description": "Students will be expected to develop a coherent editorial voice that will engage and educate their identified target audience. This voice will be embodied in a regularly updated web site which will be monitored and improved by a student team. Students will also be expected to manage a coordinated professional social media campaign to expand the reach of the publication well beyond the classroom. The structures in place can easily accommodate students from various campuses. This will allow easily for a diversity of content within a common enterprise.", "prerequisite": "COMM 271"}, {"department": "COMM", "number": "462", "credits": "3 Credits", "description": "Reporting and writing the human interest article for newspapers and magazines. COMM 462 Feature Writing (3) COMM 462 teaches the fundamentals of reporting and writing feature stories for newspapers and magazines. Students learn reporting and writing techniques for various types of feature stories. The course emphasizes the development of sound journalistic judgment and proper ethical standards. Students write various types of features stories.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "463", "credits": "3 Credits", "description": "This course will cover newspaper design.  Students will learn to solve design problems, edit photos, and work with industry software.  COMM 463 Newspaper Design (3) This upper-division course will cover contemporary design theory, grid systems, typography, color and photography as they pertain to newspapers. Students will develop skills necessary to solve design problems associated with the editing process. Students will also learn to use photo editing and page layout software.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "464W", "credits": "3 Credits", "description": "Introduces techniques of editorial, opinion and commentary writing. COMM 464W Editorial, Opinion and Commentary Writing teaches the fundamentals of writing editorial, opinion and commentary articles. Students learn the techniques of gathering information and writing various types of opinion articles. The course emphasizes the development of sound journalistic judgment and proper ethical standards. Students write various types of opinion articles.", "prerequisite": "COMM 260W", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "465", "credits": "3 Credits", "description": "Television news reporting and production. COMM 465 Television Reporting (3) COMM 465 provides an introduction to television news reporting and production. Students learn the techniques of reporting and writing news for television. They also learn the audio and video techniques required to produce television news stories. The course emphasizes the development of sound news judgment and proper ethical standards. Students complete actual news assignments.", "prerequisite": "COMM 360"}, {"department": "COMM", "number": "466", "credits": "3 Credits", "description": "Students research, write, produce and direct public affairs shows and in-depth reports.  COMM 466 Public Affairs Broadcasting (3) This is an advanced field production and reporting course focusing on the exploration of timely public affairs issues on the local, state and national level. Students learn to research a topic, conduct effective television interviews in the field, and produce in-depth reports with emphasis on solid broadcast writing, visual storytelling, editing, fairness, balance and accuracy.", "prerequisite": "COMM 465"}, {"department": "COMM", "number": "467", "credits": "3 Credits", "description": "Concepts and procedures involved in processing news for various news media, but with emphasis on print media editing.  COMM 467 News Editing and Evaluation (3) The goal of the course is to qualify the student to be a proficient newspaper copy editor. These skills can be easily transferred to editing assignments on a Web site, in magazines and other publications, in broadcasting, and in public relations. Even if the student does not intend to become a copy editor, the course should help him or her do a better job of writing. The course emphasizes editing for accuracy, clarity, precision in language, and fairness of content. Students will learn about evaluating the relative importance of news and writing headlines, captions and other display elements. The course familiarizes the student with editing photographs and graphics and designing a newspaper page.Skill in editing is particularly important to the student majoring in print journalism. It is useful to anyone who regularly works with words. The student is evaluated through written work (editing copy, writing headlines and captions) and through quizzes, examinations, or other methods the instructor chooses to assess a familiarity with the theory and principles of the course.Because students need an opportunity to practice their skills under supervision, the course must be taught in a laboratory setting in which each student has access to a computer connected to the Internet.COMM 260 is a prerequisite. COMM 467 builds on the student's understanding of reporting and news writing techniques by teaching rigor in the use of language.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "468", "credits": "3 Credits", "description": "Issues, concepts, and practice identified with contemporary design strategies for print journalism, advertising, and public relations.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "469", "credits": "3 Credits", "description": "Development of an informed and critical approach to photocommunication; individual and team projects, seminars, and critiques.", "prerequisite": "COMM 269"}, {"department": "COMM", "number": "470A", "credits": "3 Credits", "description": "Practicum emphasizing newsgathering and reporting for newspaper and for additional media formats.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "470B", "credits": "3 Credits", "description": "Practicum emphasizing television news package production for periodic campus news program and for additional media formats. Students must have completed COMM 260W and (COMM 242 or COMM 282) or receive permission from the program before enrolling in COMM 470B. Please complete the Prerequisite Override Form to request permission from the program to override a prerequisite and enroll in the course.", "prerequisite": "COMM 260W and (COMM 242 or COMM 282)"}, {"department": "COMM", "number": "470C", "credits": "3 Credits", "description": "The digital revolution and cross media ownership has challenged all areas of communications, especially the electronic and print news media. Most media outlets now have an online presence along with their traditional operations. Increasingly news outlets are producing news packages for more than one media outlet, which can include online production of breaking news reports presented with text, images, movies and/or sound bites. Currently students preparing for news careers must have traditional news skills across media along with multimedia computer-based skills to develop versatility in reporting and production. This practicum in streaming radio and online news provides opportunities to produce pieces for streaming radio and online publications and also to reformat these pieces for other media outlets such as the newspaper or television. It will also give students the opportunity to produce news pieces suitable for a cross-media portfolio. Students must have completed COMM 260W and (COMM 270 or COMM 374) or receive permission from the program before enrolling in COMM 470C. Please complete the Prerequisite Override Form to request permission from the program to override a prerequisite and enroll in the course.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "471", "credits": "3 Credits", "description": "Analyzing media and audiences for public relations purposes; planning, designing, and writing public relations communications; press relations and publicity methods. COMM 471 Public Relations Media and Methods (3) COMM 471 introduces students to the methods used in public relations to generate news media coverage for organizations and individuals. The public relations practitioner must understand the goals of the client organization and its publics to establish effective and ethical communication between them. This course focuses on writing and is designed to assist students in developing and improving professional writing skills for public relations practice, in many forms and for a wide variety of media. Students will learn the importance of different writing approaches required for specific publics and news media organizations. In this course students learn to: (1) locate, read, and evaluate research materials; (2) develop clear, concise program objectives based on the organizations' or clients' goals and the results of their research; (3) determine materials that need to be developed and written to achieve the program objectives; (4) develop newsworthy story ideas; (5) write clear, concise copy that is accurate and logically organized; (6) write in a variety of formats commonly used in public relations practice, including: pitch letters, news releases, position papers, backgrounders, public service announcements; and (7) design media kits.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "472", "credits": "3 Credits", "description": "Effective planning, organization, implementation and evaluation of events planning.  COMM 472 Public Relations Events Planning (3) This course links the public relations theories and practices with skills and techniques required for effective events planning. Students will build on their understanding of public relations introduced in COMM 370 by working on projects that are designed to help them to develop skills in conceptualizing public relations events, designing events, selecting sites, analyzing audiences, budgeting, and promoting/marketing. Students will gain experience in event conceptualization and implementation through in-class exercises and discussions, and public events projects. These assignments will provide students the opportunity to develop portfolio materials.", "prerequisite": "COMM 370"}, {"department": "COMM", "number": "473", "credits": "3 Credits", "description": "Case studies and problems in publicity and public relations in industry, government, and institutions. COMM 473 Public Relations Problems (3) This capstone course in the public relations major is designed to provide the student with the opportunity to develop a comprehensive public relations/marketing communications campaign plan based on the four-step process of public relations programming. Those steps include formative research, objectives, programming, and evaluative research. Initially, students will critically analyze award-winning public relations problems, cases, and programs that will provide a foundation for understanding the public relations planning process. Students will be introduced to public relations and communications theories that provide the foundation for excellence in program development. The public relations campaign plan will be developed from the analysis of primary and secondary research sources. The campaign plan will begin with a situation analysis that includes the client's historical, financial, and competitive position in the marketplace. Previous public relations, advertising, and marketing communications programs will be reviewed and evaluated. Additional secondary research will include a content analysis of the client's news media coverage as well as an analysis of the psychographic and demographic profiles of previously targeted publics. Account teams will design and conduct surveys and focus groups as part of the formative research required in setting the program objectives, strategies, and tactics. The public relations plan will require the development of a media plan, media objectives, production timetable, and budget for implementing the program objectives, strategies, and tactics. Students will apply their critical thinking skills and creative abilities to design and produce communication executions that will communicate the program message to the targeted publics. Those creative abilities include a working knowledge of writing, desktop publishing, photography, and graphic communication. The final phase of the public relations/marketing communications plan will include the design of evaluative research to measure the effectiveness of the program objectives. Those research methods will include content analysis, survey research, and focus groups. Students will work in account teams where each team will be responsible for developing a public relations counseling firm, where team members will produce a firm manual outlining the firm's mission statement, organizational policies, organizational chart, records of all meetings with clients, records of all firm meetings, time sheets for each firm member, a weekly summary of firm activities, project budget reports, bi-weekly evaluations of firm members, and a client presentation plan. The final public relations plan will be presented to the client for evaluation and critique. The final goal of the course is to provide students with the technical and managerial knowledge and experience required for effective public relations program design and implementation.", "prerequisite": "COMM 370"}, {"department": "COMM", "number": "474", "credits": "3 Credits", "description": "Exploration of strategies for developing indepth newspaper or magazine articles, with an emphasis on gathering information and long-form writing.  COMM 474 Depth Reporting (3) This is an upper-level undergraduate course designed to prepare students for writing in-depth newspaper or magazine articles, which extends beyond the basics of writing and reporting techniques emphasized in courses such as News Writing and Reporting, Reporting Methods, and the Feature Article. Depth stories are comprehensive accounts that go well beyond a basic news story or feature. An emphasis on longer, more comprehensive stories that require extensive research and interviews gives students an opportunity to be more than technicians following a rigid set of journalistic guidelines or principles. Depth stories require journalists to spend days, weeks or months exploring and investigating a topic and writing a lengthy story that must be cemented with effective transitions.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "475", "credits": "3 Credits", "description": "Newspaper and television management, the state of the industry and topics that prospective employees should know about. COMM 475 Issues for Newsroom Managers (3)This is an upper level course for students with an interest in newspaper or/and television management. Issues that managers deal with and management approaches will be covered, emphasizing practical experiences. The basic text may be a packet based on professional experiences of instructor. There will be two papers of roughly 1,500 words. There will be one oral presentation, accompanied by a short summary outlining the main points. The class will consider major issues affecting the industry - the economy, the effort to attract younger audiences and how the look of a product forms the basis of what the audience thinks about the brand and whether it appeals to them. The class will consider how the Internet can be an asset to TV stations and newspapers, if used effectively. Students will evaluate some TV and newspaper Internet sites. The role of advertising and community relations for newspapers and television stations will be discussed. Newspaper opinion pages and public (or interactive journalism) will be covered. The importance of a good local report, and evaluating how effective local coverage is, will focus on state newspapers and television stations. The role of The Associated Press and other news agencies and their approach to coverage and how they relate to local media will be covered. Leadership, management and decision-making will be part of the course. The traits of effective leaders and managers will be discussed. There will be some in-class exercises on managing and ethics. Strategy focusing on the start-up of USA TODAY will illustrate how local newspaper can make strategic gains by following the same checklist. There will be occasional video on the topics covered.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "476", "credits": "3 Credits", "description": "Techniques in sports reporting and writing for media.  COMM 476 Sports Writing (3) This is an upper-level course designed to prepare students to write sports stories for news outlets. These specialized stories - including contest coverage, analysis, columns, enterprisers, profiles, and sidebars - require skills that go beyond those taught in classes such as News Writing. As the popularity of high-school, college, and professional sports grows, the sports section has become one of the most widely read sections of newspapers. Many magazines as well cover a variety of sports. Modern sports writing requires sportswriters to not only attend games and interview coaches, but also to use statistics, profile sports figures, and explore trends in sports industry. Through a variety of story assignments, the course provides students with the skills that will prepare them for the demands of being modern sportswriters. The course grounds them in the ethical principles that all journalists must follow.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "477", "credits": "3 Credits", "description": "Techniques of sports broadcasting for radio and television. COMM 477 Sports Broadcasting (3) This is an upper-level course designed to prepare students to broadcast sports events and news. These specialized broadcasts - including play-by-play, studio sportscasts, field reporting, and features - requires myriad skills that go beyond those taught in classes such as Broadcast Journalism I (Radio News Reporting) and Broadcast Journalism II (Television News Reporting).As the popularity of high-school, college, and professional sports has exploded, sports shows have become some of the most popular on radio and television. Myriad networks and shows are devoted to sports coverage exclusively. But increasingly knowledgeable sports viewers demand more from sports broadcasters then game coverage and opinion pieces. Modern sports broadcasting requires journalists to not only attend games and interview coaches, but also to use statistics, profile sports figures, and explore trends in sports. Through a variety of story assignments, the course will give students the experience that will prepare them for the demands of being modern sports broadcasters. And it will ground them in the ethical principles that all journalists must follow.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "478", "credits": "3 Credits", "description": "Techniques of effective media relations used in a sports information office. COMM 478 Sports Information (3) This is an upper-level course designed to prepare students for a specialized form of modern media relations, sports information. Sports information professionals combine skills of both journalists and public relations specialists, so the advanced techniques go beyond those taught in introductory classes such as News Writing and Public Relations Methods.As the popularity of high-school, college, and professionals sports has exploded, sports information professionals have increasing demands put on them. More and more journalists, working for a variety of publications and broadcasts, cover sports today. Moreover, the growing complexities of modern sports - from the impact of drugs to the enormous salaries of many athletes - means that sports information professionals have to provide more than simple information on athletes, coaches and sporting contest. Through a variety of assignments, the course will provide students with the experience that will prepare them for the demands of being sports information professionals. And it will ground them in the ethical principles that all media relations specialists must follow.", "prerequisite": "COMM 260W"}, {"department": "COMM", "number": "479", "credits": "3 Credits", "description": "Economic, regulatory/business issues in the design/operation of large-scale telecommunication networks such as telephone, cable, wireless, and computer networks.  COMM 479 Telecommunications Economics (3) The objective of the course is to help students understand the economic, regulatory, and business aspects of the physical infrastructures underlying modern telecommunications. We will discuss the large-scale technological systems such as telephone, cable, wireless and computer networks over which media and telecommunications services are delivered today. We will not be discussing the content offered over telecommunications networks as much as the infrastructures themselves: the conduits over which information is delivered to the home and the workplace.With technological convergence and regulatory changes, telephone, cable and wireless networks have acquired the capability to provide services earlier reserved exclusively for one or the other network. For example, we can now access telephone services over wireless networks or over the Internet. Similarly, Web content is available with the traditional telephone modem, as well as over cable, wireless and even satellite networks. In the not too distant future, it may become more meaningful to talk in terms of consumer network to a broadband conduit for all types of content, rather than to particular services such as cable television or long-distance telephony.It thus becomes necessary for those who wish to participate in the telecommunications industry of the future to have a clear understanding of the way large-scale telecommunications infrastructures are put together and operated. Existing courses in the telecommunications curriculum provide instruction in the technology and content aspects of the media and telecommunications industries. The proposed course will complement these existing courses by focusing on the economic, regulatory and business aspects of large-scale networks, in a historical and policy context.What are the mechanisms by which large-scale telecommunications systems such as telephone, cable, wireless and computer networks are deployed over time? What are the costs involved in the initial deployment and expansion, and how do they influence policy? How do planners evaluate and choose between alternative technologies of delivering services? What are the economic justifications for and against government regulation of networked technologies? How do companies charge for services provided over networked systems? What problems do we face as more and more services--such as real-time gaming and interactive television--are added to telecommunications networks, and what are some of the current proposals to solve these problems? These are some of the questions that will be discussed in class.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "480", "credits": "6 Credits", "description": "Produce a weekly television newscast. COMM 480 Television News (6) COMM 480-Television News will help prepare students for a career in television newscast content, presentation and production with a strong multimedia component. Students will gain experience in all aspects of producing a newscast. The class will meet Mondays and Fridays, but they will be expected to produce content on a daily basis, whenever and wherever stories in Centre County happen. After a few weeks of training, we will produce the Centre County Report each week with elements BOTH ONAIR and ONLINE. This is NOT a newscast focusing only on Penn State activities. Students must be prepared to produce a newscast that informs the larger audience of Central Pennsylvania. COMM 480 needs the best students to produce the Centre County Report. Students will primarily serve as the news-editorial side of the newscast (anchors, reporters, sports, producers and some in-field photojournalists and studio camera operation) or as the technical team (director, technical director, audio, graphics, studio camera operator AND field production/photojournalists). By the end of this course, students will have the skill set to: 1. Pursue a career in television news 2. rite solid television news scripts 3. Enhance your storytelling ability 4. Enhance your ability to produce and technically support a newscast 5. Understand the importance of multimedia  6. Produce an effective resume tape", "prerequisite": "COMM 465"}, {"department": "COMM", "number": "481", "credits": "3 Credits", "description": "Advanced work in multimedia production using web authoring, video editing, audio editing, image editing and animation software.  COMM 481 Advanced Multimedia Production (3)This course builds on the foundations of multimedia production developed in COMM 270 giving students the opportunities to create multimedia website projects. Students will apply advanced multimedia concepts and techniques to website production and demonstrate versatility in multimedia software. Working individually and in teams, students will develop projects for clients using multimedia software, including web authoring, video editing, audio editing, image editing and animation software. These projects will be uploaded to the World Wide Web, and will serve as portfolio materials for the students. This course emphasizes skills development in multimedia and visual media in support of program objective to help students develop cross-media skills and versatility in media.", "prerequisite": "COMM 465"}, {"department": "COMM", "number": "482", "credits": "3 Credits", "description": "This course, in conjunction with the Penn State Office of Strategic Communications or other non-profit groups will teach students how to combine advanced production skills and advanced branding knowledge with social media strategies and brand storytelling techniques to engage and inspire a target audience. COMM 482, through a combination of advanced production workshops, lectures, exercises and assignments students will learn how to create engaging digital content that helps deliver a specific brand message. Students will work directly with a client to develop a semester-long storytelling project. This collaboration will span the entire production process to ensure that the creative vision of the students aligns with the needs of the client. By participating in advanced production workshops, students will be expected to learn how to use professional quality production equipment. They will learn how lens selection and lighting can impact storytelling. Students will interact with creative professionals to understand how brand identity and messaging will impact their assignments. Students will gain hands on experience working in a client driven environment. They will be expected to develop a creative pre-production plan, successfully pitch that plan to a client and produce and deliver a professional quality multi-media project. During this process students will learn advanced branding techniques. They will learn how social media and digital platforms are utilized to reach the desired groups and they will be expected to work effectively in a team environment.", "prerequisite": "COMM 242"}, {"department": "COMM", "number": "483", "credits": "3 Credits", "description": "A broad examination of the wireless phone industry including its development, current structure and future.  COMM 483 Wireless Communications Industry (3) Since the 1990s, the wireless industry has transformed \"how\" people communicate. The ability to offer mobile communication services to consumers allowed the telecommunications industry to rapidly expand and create new products and services. Throughout this period of rapid growth, new players emerged from relative obscurity while incumbent telecommunication providers weighed the benefits & drawbacks of deploying this new technology.Although wireless devices have become pervasive throughout the United States, few people appreciate the technology and partnerships that are required to offer wireless services for millions of customers. This course will address a variety of wireless topics to allow students to develop a greater understanding and appreciation of the wireless industry. In terms of course design, there are three distinct elements: (1) The early days of the wireless and the key figures and events that shaped an industry, (2) A current state view of the tier 1 carriers, device manufacturers and product offerings, (3) The emerging trends in the wireless industry and the potential impact on consumer products and services.By the end of this course, the objective is for students to view the wireless industry quite differently. Students will understand the relationship between wireless spectrum, carrier, device manufacturer and products. The industry landscape will be clearer to students and they will be well positioned to pursue a career in wireless.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "484", "credits": "3 Credits", "description": "Overview of technology of electronic media and related societal issues. COMM 484 Emerging Telecommunications Technologies (3) COMM 484 introduces advanced topics related to the technologies in telecommunications and information processing. The course investigates old, new and prospective technologies primarily through analysis of incumbent or emerging companies bringing products and services to market. Students will examine materials not customarily used by undergraduates including stock prospectuses, company annual reports, and Internet searches. The class will consider recent strategic alliances, mergers and acquisitions (whether consummated or not) in the context of whether and how technologies drove the deal.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "484A", "credits": "3 Credits", "description": "Wireless devices and applications have become pervasive throughout the world. Global wireless carriers continue to evolve their networks to provide increased access and data speeds for their subscribers. To leverage the increased network capabilities, device manufacturers have responded by introducing Smartphone wireless devices that are feature-rich, complex and dramatically influence the way subscribers access and download wireless applications. This course will specifically focus on the design challenges facing the major wireless device manufacturers across the world. Students will work in teams and utilize IBM¿s Design Thinking methodology to address a broad array of usability challenges that impede user adoption and threaten long-term success in the global marketplace. Students will also develop an appreciation for the intense competition that exists in the wireless device market as well as how swiftly market conditions can impact the long-term viability of a device manufacturer.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "484H", "credits": "3 Credits", "description": "Overview of technology of electronic media and related societal issues.  COMM 484H Emerging Telecommunications Technologies (3) COMM 484H introduces advanced topics related to the technologies in telecommunications and information processing. The course investigates old, new and prospective technologies primarily through analysis of incumbent or emerging companies bringing products and services to market. Students will examine materials not customarily used by undergraduates including stock prospectuses, company annual reports, and Internet searches. The class will consider recent strategic alliances, mergers and acquisitions (whether consummated or not) in the context of whether and how technologies drove the deal.", "prerequisite": "COMM 180", "other": ["Honors"]}, {"department": "COMM", "number": "486W", "credits": "3 Credits", "description": "Drawing on normative theory and political philosophy, this course explores problems in ethics and social responsibility in telecommunications.  COMM 486 Telecommunications Ethics (3) In this course the instructor and students work together to consider and analyze ethical issues in contemporary telecommunications practice. Using the tools of ethical and political philosophy, students will discuss current cases in often long-standing problem areas such as truth, privacy and content control. The intention is that all involved will develop a greater sensitivity to the ethical dilemmas confronting telecommunication professionals and a greater ability to evaluate media performance. The course also strives to help students gain a deeper insight into their own ethical principles and become more keenly aware of the foundations and professional implications of those principles. In the first few weeks of the semester, students will review the major ethical theories and theorists. They will discuss the nature and types of normative analysis, including the major systems of ethical thought, the process of ethical reasoning and the meta-ethical problems of definition and justification. They will also explore the foundations of political philosophy as they relate to the role of telecommunications industries in democratic society. Related topics will include the nature and history of professional norms and values, the development of ethical codes within specific industries and existing organizational processes for the applications of those standards (the clearance process). In the remainder of the semester, students will discuss case studies involving various ethical dilemmas in professional practice across all segments of the relevant industries including, broadcasting, cable, telephony and the Internet. Special attention will be given to contemporary problems in areas such as social networking and Internet search companies.Topics will include: content control in entertainment and advertising, including issues involving race, gender and age; freedom of expression; privacy; intellectual property; international and cross-cultural issues; truth and anonymity; system access and power; questions of civic engagement; image ethics in a digital age; and broader philosophical questions about the inherent social nature of telecommunications technology.There are, of course, no 'correct' answers in these cases; stress is placed on the process of analysis. Students will be evaluated on their ability to articulate their assumptions and formulate coherent ethical rationales based on those assumptions.Comm 180 is a prerequisite for his course.", "prerequisite": "COMM 180", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "487W", "credits": "3 Credits", "description": "Strategic management, leadership and ethics issues including marketing, financing, entrepreneurship, and innovation.  COMM 487 Advanced Telecommunications Management and Leadership (3) This senior-level capstone course discusses a range of strategic management, leadership and ethics issues in telecommunications and media firms. Learning objectives include creative problem-solving, critical thinking and writing, basic financial literacy and management considerations in ethics, globalization, diversity and free speech. Specific areas of emphasis include marketing, programming, customer service, technology adoption, finance and strategic planning. Broadly, the aim is the honing of critical and creative problem solving skills and the enhancement of collaboration and communication skills.The course also stresses the fiduciary and social responsibilities that adhere to the telecommunication manager's role.", "prerequisite": "COMM 180", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "488", "credits": "3 Credits/Maximum of 99", "description": "Workshop designed for advanced students interested in professional writing, involving extensive mutual and self-criticism.  COMM 488 COMM 488 Writer's Seminar (3) This course is designed for advanced students interested in professional writing in the theatre, screen, and media arts. The class work involves submission and extensive revision of a variety of written projects. Revisions are based upon direct feedback from the instructor, as well as mutual critiques from classmates. Students will also learn the technique of self-criticism of their writing and in doing so develop a sense of their own writing style and subject matter preferences.", "prerequisite": "COMM 230W"}, {"department": "COMM", "number": "489W", "credits": "3 Credits", "description": "Exploration of advanced topics related to the telecommunications industries. COMM 489 Advanced Telecommunications Topics (3)  This capstone course provides students with an in-depth exploration of current issues facing the telecommunications industries. Students will have the opportunity to synthesize and apply the concepts and skills they have acquired in their previous telecommunications courses. Topics vary by instructor and semester and may include: intellectual property, privacy and surveillance, technology applications, children and media, social impact of telecommunications, impact of telecommunications on democracy, environmental impact of telecommunications, and the relationship of telecommunications to economic development. Students must have senior standing and completed all required core courses in the major before taking this course.", "prerequisite": "COMM 180", "other": ["Writing Across the Curriculum"]}, {"department": "COMM", "number": "490", "credits": "3 Credits", "description": "Analysis of issues related to electronic commerce over the Internet.  COMM 490 Issues in Electronic Commerce: Policy and Implementation (3) This senior level course teaches students about the unique business, policy, regulatory and legal aspects of commerce on the Internet, as well as the social implications of the global implementation of such commerce for areas such as privacy and consumer protection. Learning objectives include creative problem-solving, critical thinking and writing, basic financial literacy and management considerations in ethics, globalization, diversity and free speech.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "490A", "credits": "3 Credits", "description": "This seminar examines media convergence issues, trends, and effects on society through discussions, presentations, and creation of a capstone project.", "prerequisite": "COMM 470A"}, {"department": "COMM", "number": "491", "credits": "3 Credits", "description": "Impact of globalization, regulation, and new technologies on telecommunications in different countries and regions.  COMM 491 International Telecommunications (3) This course will provide a forum for students to investigate and debate ongoing or anticipated conflicts in international telecommunications. Students will learn how international bodies such as the ITU, WTO, WIPO, and United Nations influence telecommunications. The course also will examine how various nations have organized and reorganized the telecommunications sector. In this portion, we will consider such developments as privatization, liberation, deregulation and globalization. Students will explore how technology, culture, and law interact within a nation or region to shape the development and structure of its telecommunications industries. Students will study how media and communications firms and regulators in a given nation respond to technological change and how a nation's specific geographic, cultural, and political environment shapes its response. Students will also examine how the nation's regulatory scheme and the structure of its telecommunications industries impact freedom of expression, political discourse, and commerce.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "491A", "credits": "0 Credits", "description": "This course focuses on how a nation or region's unique cultural and political environment shapes the development and impact of its media and telecommunications industries, and how those industries in turn influence the nation's or region's cultural and political trajectory. The course includes one week of travel to the country or region being studied during the semester. A passport and an additional mandatory fee to cover partial travel expenses is required. Students will explore how information and communication technologies (ICTs) such as computers, telephone networks, mass media, and the Internet develop within a particular cultural context and how they influence the socio-economic and political development of a society. Students will study the historical development of telecommunications within the country or region being studied and examine how that nation or region's geographic, cultural and political environment shapes its response to technological change and where future opportunities may lie. The class will also explore ways ICTs can be used to foster economic development, human rights and international development. Ultimately, students will come away with a better understanding of how ICTs influence society and how the adoption and use of ICTs is grounded within a particular cultural context.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "492", "credits": "3 Credits", "description": "Development in the law, policy, and business of Internet-mediated communications and commerce; emphasis on impact on existing legal, regulatory, and economic models. COMM 492 Internet Law and Policy (3) This course will provide a forum for students to investigate and debate ongoing or anticipated conflicts in Internet-mediated telecommunications, information processing and commerce. The resulting confrontations may stem from technological innovation, real or perceived changes in the marketplace, or the imperatives of prevailing regulatory, political or economic philosophies. Conflict resolution often results from persuasive advocacy, coalition building, and accommodation of outsiders with new perspectives or entrepreneurial visions, rather than applying legal precedent or treaty interpretations. Internet mediation has the potential to change how we communicate, educate, inform, entertain, and transact business. Technological and marketplace convergence means that Internet mediation will have a profound impact on many legal, regulatory and economic constructs, i.e., the preexisting templates we use to describe and understand the communications process and impact on individuals and society. The course also will examine the growing body of cases that have addressed aspects of Internet-mediation in each of the following general categories: *Speech-commercial and political speech, obscenity, forums analysis  *Legal and Regulatory Consequences of Convergence-the juxtaposition of telecommunications and information processing technologies, markets and regulatory regimes  *Governance and regulation of the Internet-whether the need exists for government intervention on such matters as numbering and domain registration  *Intellectual Property Rights-the impact of Internet-mediation on copyright, trademark and patent laws *Electronic Commerce-the law and policy of Internet-mediated transactions, privacy and encryption concerns  *Equity, Competition Policy and Consumer Protection Concerns-what, if anything, should governments do to remedy market failures", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "493", "credits": "3 Credits", "description": "Provides students with knowledge/tools to take their innovation/technology idea through the business planning, capital, and operations budgeting processes.  COMM 493 Entrepreneurship in the Information Age (3) COMM 493 provides students with knowledge and tools to take their own idea for a media or communications innovation and determine the feasibility of launching it as a small business. Students bring their own ideas for a communications product or service. They work through the market feasibility, business planning, capital and operations budgeting processes to finally researching and seeking start up capital. This course is designed for both students plan to pursue careers as entrepreneurs and those who wish to learn more about small business management in the information age. Topics include entrepreneurship, business planning and budgeting, starting and managing a small media or communication technology firm, economic history of media, telecommunications and information innovation, trends and opportunities in media and information sectors, high tech start up legal and employment issues, financing options, overview of venture capital, COMM 493 and market capitalization, market feasibility analysis. Cases of recent successes and failures in the information and media sectors are used to illustrate principles of business planning, market and financing trends and entrepreneurship.", "prerequisite": "COMM 180"}, {"department": "COMM", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "COMM", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "COMM", "number": "495", "credits": "1-3 Credits/Maximum of 6", "description": "Supervised practicum with a variety of communications-specific entities including but not limited to digital media outlets, newspapers, broadcast/cable stations and networks, public relations agencies, advertising agencies, full-service marketing firms and film/video production companies.", "other": ["Full-Time Equivalent Course"]}, {"department": "COMM", "number": "495A", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised practicum with a variety of communications-specific entities including but not limited to digital media outlets, newspapers, broadcast/cable stations and networks, public relations agencies, advertising agencies, full-service marketing firms and film/video production companies."}, {"department": "COMM", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "COMM", "number": "496H", "credits": "1-6 Credits/Maximum of 6", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses. These are generally used as thesis credits for undergraduate students in the Schreyer Honors College with the area of honors in one of the majors in the College of Communications. The honors thesis may take the form of a scholarly project involving the examination of some aspect of the field of communications, or the thesis may involve the production of a professional project.", "other": ["Honors"]}, {"department": "COMM", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "COMM", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "COMM", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Study of mass communication systems and practices in selected foreign countries, by individual or group instruction.", "other": ["International Cultures (IL)"]}]