[{"department": "CRIM", "number": "12", "credits": "3 Credits/Maximum of 3", "description": "Criminology is the study of the causes of criminal behavior. As such this course is an introduction to the topic with special focus on the major theories and concepts explaining criminal behavior. A key focus of the class is examining the most recent scientific research testing the basic theories in criminology. The students learn the various research techniques that have been methods and data sources used to study criminal behavior. Several important areas of study that link understanding criminal behavior and its distribution across the social system are investigated including age, gender, race and ethnicity. One goal of the course is to promote a more complete understanding of crime and how it is enmeshed in human social life. Students read a general text, as well as scholarly articles in Criminology.", "other": ["Cross-listed with: CRIMJ 12, SOC 12", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CRIM", "number": "12H", "credits": "3 Credits", "description": "Criminology is the study of the causes of criminal behavior. As such this course is an introduction to the topic with special focus on the major theories and concepts explaining criminal behavior. This honors version of Introduction to Criminology is especially designed to be appropriately challenging for Schreyer Honors College students. A key focus of the course is examining the most recent scientific research testing the basic theories in criminology. Students learn the various research methods and data sources used to study criminal behavior. Several important areas of study that link understanding criminal behavior and its distribution across the social system are investigated including age, gender, race and ethnicity. One goal of the course is to promote a more complete understanding of crime and how it is enmeshed in human social life. Students read a general text, as well as scholarly articles in criminology.", "other": ["General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CRIM", "number": "100", "credits": "3 Credits", "description": "Criminal Justice 100 is an overview of the United States criminal justice system and the major components of police, courts and corrections. Students will engage in reviews of, evaluate and consider legal foundations, types and causes of crime, the development of policing, the influence and evolution of the court process, and rehabilitative and reintegrative components of corrections. Specific topics can include, but are not limited to, the extent of crime in the United States; competing and complementary goals within the criminal justice system; sources of criminal law; interactions between various agencies within the criminal justice system; and the impact of crime on victims. During the course of study of the criminal justice system, students will have various opportunities to examine how age, gender, race and ethnicity impact and are impacted by the criminal justice system at critical phases.", "other": ["Cross-listed with: CRIMJ 100", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "CRIM", "number": "113", "credits": "3 Credits", "description": "Introduction to law in society with a focus on criminal law, judicial code, laws of sentencing and corrections, ciminal procedure.  CRIM (CRIMJ) 113 Introduction to Law (3) Introduction to the law is designed to provide CLJ majors with an introductory level of knowledge of the criminal law, and other legal codes such as the Judicial Code, laws of corrections, probation and parole, and the rules of criminal and appellate procedure. The course will serve as a gateway course to taking more advanced criminology and criminal justice courses. CRIMJ (CRIM) 113 is one of the Prescribed Courses in the CLJ curriculum and is used as a prerequisite for many 400 level courses including CRIM 467 AND 469.", "other": ["Cross-listed with: CRIMJ 113", "United States Cultures (US)"]}, {"department": "CRIM", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "CRIM", "number": "201", "credits": "3 Credits", "description": "The criminal justice system is a human creation and some errors are expected. Sometimes guilty parties go free and sometimes innocent people are convicted. In this course, we will employ the perspective of the social scientist to understand why and how wrongful convictions occur. How can social science help to predict, explain, and prevent wrongful convictions? This course is organized into three units. In the first unit, we will examine the large body of social science research that demonstrates disparities in all stages of the criminal justice system. For example, young Black and Latino men are disproportionately arrested, charged, convicted and imprisoned for violent crimes. This is partly due to these men disproportionately living in environments that foster crime, but social science research shows sometimes it's also partly due to the discretionary decisions of police, prosecutors, and courts. As a result, these demographic groups are most likely to be wrongfully convicted. In the second unit, we'll explore the factors in the justice system that might lead to a wrongful conviction, including false confessions, eyewitness misidentification, poor legal representation, government misconduct, and informants and snitches. Social scientific findings elucidate how each of these factors influence conviction accuracy. Finally, we'll discuss how social science research on the risks and factors that contribute to wrongful convictions can be used to improve policies to reduce the risk of such convictions. Simple reforms such as openness about plea-bargaining, eyewitness identification reform (e.g., sequential lineups, double-blind procedures, etc.), recording of interrogations, and introducing Innocence Commissions in every state can improve our criminal justice system.", "other": ["Cross-listed with: SOC 201", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "CRIM", "number": "225N", "credits": "3 Credits", "description": "IT 225N / CRIM 225N, Organized Crime in Film & Society, examines the relationship between criminological and justice theories regarding organized crime and the portrayal of the mafia in popular Italian American film. The course follows two simultaneous threads of inquiry: an examination of historical and theoretical models of organized crime in the United States and the state and federal laws that address them; and an analysis of how such models are depicted in American films and television about the the Italian American community. By the end of the course, students will gain key literacy skills by identifying varied definitions of organized crime and distinguishing between structural models, particularly La Cosa Nostra and network models. Students will also sharpen analytical and critical thinking skills through written and spoken interpretations of films and the scholarly approaches to studying organized crime (e.g. research methods). Throughout the semester students will also be able to apply knowledge of the social scientific aspects of organized crime to guide their observations and analyses of film and Italian American culture, thus refining Integrative Thinking across the humanities and social sciences.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CRIM", "number": "249", "credits": "3 Credits", "description": "This course provides criminology majors a more in-depth understanding of the theories, methodologies, and research results within the scientific discipline of criminology. Students will first focus on concepts and definitions associated with theory development and research methods prior to applying these to historical and present theories of criminal behavior. Sociological theories and methods will be given greater weight in the course. At the end of the course, students will apply what they've learn to theoretically motivate a testable research question and outline this in a short research proposal. Throughout the course, theoretical concepts and evidence will be connected to current and historical criminal justice policies. This course serves as the foundation for later courses on specific substantive criminological topics, such as violence, race, gender, and neighborhood crime. The course also provides students the theoretical and methodological background for completing CRIM 250W, Research Methods in Criminal Justice, which includes an empirical research paper component. The Criminology program learning objectives directly relevant for this course are: - Recognize the causes and consequences of crime at the micro and macro levels and match these with prominent criminological Course Justification perspectives. - Apply theories of crime to explain actual and hypothetical scenarios, behaviors, and trends. - Explain the various social science methods of inquiry and use these to test specific criminological research questions.", "prerequisite": "CRIM 12"}, {"department": "CRIM", "number": "250W", "credits": "3 Credits", "description": "The purpose of this writing-intensive course is to engage students in the social scientific research process used by criminologists to answer empirical research questions. It is the second course (after CRIM 249) that overviews theory and research in criminology. Students learn to use social science research methods through instructor-led demonstrations and applications of research methods, data analysis exercises, and critical reading of published research. Students apply their research knowledge and skills to an empirical research project completed in a sequence of steps producing written drafts that receive instructor feedback. After completion of this course, students will have acquired the following knowledge and skills: (1) The ability to generate a research question and effectively and efficiently search and review the relevant research literature. (2) A working knowledge of how to apply social science research methods and research designs to answer research questions. (3) The ability to strategically read published research articles to extract different types of information. (4) An understanding of the inductive and deductive aspects of the research process. (5) The ability to collect, analyze, and interpret quantitative and qualitative data. (6) The ability to design a quantitative research project to test hypotheses of interest to criminologists. (7) The ability to summarize and explain in writing the methods used and results derived from studies seeking answers to a common research question. (8) An understanding of social science research methods needed to be critical consumers of research and claims about crime, criminal behavior, and social response to them. (9) A certified knowledge about ethical issues in social science research.", "prerequisite": "CRIM 249", "other": ["Writing Across the Curriculum"]}, {"department": "CRIM", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or smal-group basis."}, {"department": "CRIM", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "CRIM", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "CRIM", "number": "297I", "credits": "3 Credits", "description": "Formal course given on a topical or special interest subject offered infrequently; several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GH/GS GenEd course.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain"]}, {"department": "CRIM", "number": "298", "credits": "1-6 Credits/Maximum of 6", "description": "CRIM 298 Preceptorship in Criminology (1-6 per semester/maximum of 6) The Preceptorship provides undergraduates with an opportunity to work closely with a faculty member in a regularly scheduled course as a teaching assistant. Undergraduate juniors and seniors who have done well in a particular course can deepen their understanding of the material by assisting in teaching about the subject. The Preceptorship also provides greater opportunity for interaction between faculty and students. Moreover, if graduate students also are involved in teaching, they provide role models for undergraduates."}, {"department": "CRIM", "number": "395", "credits": "1-9 Credits/Maximum of 9", "description": "Field experience focusing on the student's major interest within the area of criminal justice.", "prerequisite": "CRIM 250W"}, {"department": "CRIM", "number": "406", "credits": "3 Credits", "description": "Theory and research concerning deviant behaviors and lifestyles viewed as significant departures from a group's normative expectations.  SOC (CRIMJ/CRIM) 406 Sociology of Deviance (3) (BA) This course meets the Bachelor of Arts degree requirements.Sociology of Deviance focuses on the theory and research in social construction of social norms, the violation of norms, and social reaction to the violation of norms. The course focuses on the role of social structure and power in the definition of deviance, on structural, cultural, and social psychological processes involved in deviant behavior, and the dynamics of social reaction to deviance. The course includes some content focusing on criminal deviance, but also emphasizes non-criminal deviance, as well as the role of social movements and social change in constructing and contesting deviance definitions. CRIMJ/SOC/CRIM 012 and CRIM/CRIMJ 250W are prerequisites. This course may be counted toward the credits required for the B.A. and B.S. in Crime, Law, and Justice. It would fulfill one of the 400-level requirements in the 'Crime' component of the major. The course may also be counted toward credits required for the B.A. and B.S. in Sociology for students with the Deviance and Criminology specialization.", "prerequisite": "3 credits of SOC, CRIM, or CRIMJ", "other": ["Cross-listed with: CRIMJ 406, SOC 406", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIM", "number": "412", "credits": "3 Credits", "description": "Legal and extralegal control; public opinion on crime; criminal justice and correctional processes; legal sanctions; control strategies.  Field trip.", "prerequisite": "CRIM 012 , CRIM 013 , or SOC  005", "other": ["Cross-listed with: CRIMJ 412"]}, {"department": "CRIM", "number": "413", "credits": "3 Credits", "description": "This course provides an in-depth look at theories of crime and examines influential empirical studies designed to these theories.  CRIMJ 413CRIMJ (CRIM/SOC) 413 Advanced Criminological Theory (3)Advanced criminological theory is intended to extend and deepen students' knowledge of core ideas in criminology. The course has four main emphases: 1) learning major schools of thought in criminology, 2) learning about the uses and construction of theory, 3) learning about approaches to integrating criminological theories, and 4) exploring how criminological concerns are grounded in and interrelated with core issues in sociology. The course is offered once a year with 50 seats per offering. CRIMJ/CRIM/SOC 012 is a prerequisite. Students will be evaluated on research or analytical papers, written assignments on course readings, and/or in-class essay-style exams. This course may be counted toward the credits required for the B.A. and B.S. in Crime, Law, and Justice. It would fulfill one of the 400-level requirements in the major. The course may also be counted toward credits required for the B.A. and B.S. in Sociology for students with a Deviance and Criminology specialization.", "prerequisite": "SOC 12", "other": ["Cross-listed with: CRIMJ 413, SOC 413"]}, {"department": "CRIM", "number": "421", "credits": "3 Credits", "description": "The impact of violent crime on victims, their families, and communities; the police process as it relates to violent crime.  CRIMJ 421CRIMJ (CRIM) 421 Violent Crime (3)This course will examine the nature, frequency, and causes of violence, generally and of assault, robbery, rape, and homicide, specifically. Several different theoretical and research perspectives are reviewed, including biological, psychological, social, and cultural. The course also examines individual and societal responses to violence. Students are evaluated on three objective exams (25% each) and a series of short assignments (25%). CRIM/CRIMJ 421 may be used by both CLJBA and CLJBS degree candidates to satisfy a 400-level course requirement in the major. This course will be offered twice a year with 60 seats per offering.", "prerequisite": "CRIMJ012", "other": ["Cross-listed with: CRIMJ 421"]}, {"department": "CRIM", "number": "422", "credits": "3 Credits", "description": "Examines the history, how victimization is measured/studied in social sciences, public policy implications of victimization movement in U.S. CRIM 422 / CRIMJ 422 Victimization (3) Victimology has emerged as an important area of study for the social sciences and an important arena for policy development. This course will familiarize students with the historical development of the research into victimization and the importance of the victims' movement to public policy. Areas explored will include the relationship between victim and offender, the cultural images of victims and their impact on the victim and the response of the criminal justice system to them, and how research has attempted to measure victimization.The course will be one of the supporting courses where the student must select 6 credits at the 400 level.", "prerequisite": "CRIM 250W", "other": ["Cross-listed with: CRIMJ 422"]}, {"department": "CRIM", "number": "423", "credits": "3 Credits", "description": "Legal, sociological, and psychological perspectives on sexual and domestic violence. CRIMJ 423 / CRIM 423 / WMNST 423 Sexual and Domestic Violence (3) (US) This course investigates violence against women, specifically domestic, sexual, and relationship violence. Students will examine some of the legal, sociological, and psychological perspectives about sexual, domestic, and relationship violence as well as the social and cultural roots of violence against women. Students will also gain an understanding of the experiences of victims of domestic and sexual violence as well as the issues presented by perpetrators. Students will be evaluated based on performance on exams, and two research papers. CRIMJ 423 / CRIM 423 / WMNST 423 is a supporting course in both the WMNST major and minor as well as a supporting course in the CLJ major. It may also be used to satisfy a GI requirement. This course is offered fall and spring semester with an enrollment of 60 students each semester.", "prerequisite": "CRIMJ100", "other": ["Cross-listed with: CRIMJ 423, WMNST 423", "United States Cultures (US)"]}, {"department": "CRIM", "number": "424", "credits": "3 Credits", "description": "Why do people take drugs? Why and how does society attempt to control drug use and distribution? What is the association between drugs and crime? Exploring questions such as these will be central in CRIM 429. The focus of this course will be examining explanations of drug use and the social construction of drug policies. We will begin by asking the question \"What are drugs?\" From there, we will discuss theories of drug abuse and the methods used to study patterns of drug use. We will also take an in-depth look at the histories, pharmacologies, and patterns associated with the most popular drugs in modern society. In the second half of the semester, we will focus on the social control of drugs and the connections between drugs and crime. At the heart of this discussion will be the causes and consequences of modern U.S. drug policies. We will conclude with a look at alternative drug policies and what the future may hold for drug use in America.Throughout the semester, you will be asked to think critically about material and evaluate its strengths and weaknesses. To foster critical thinking skills, you will have ample opportunities to discuss topics in class, analyze arguments in written assignments and in-class exercises, and apply ideas to real world situations through course projects and presentations.", "other": ["Cross-listed with: CRIMJ 424"]}, {"department": "CRIM", "number": "425", "credits": "3 Credits", "description": "This course examines organized crime in terms of historical antecedents, structure, related theories, and policy issues.  CRIM (CRIMJ) 425 Organized Crime (3) This course will provide students with a historical and theoretical overview of organized crime. Students will gain an understanding of the structure of organized crime as well as an understanding of the businesses associated with traditional and nontraditional organized crime groups. The course will also provide students with a detailed analysis of state and federal laws and policies regarding organized crime. Students will be evaluated by two mid-term exams (25% each), an essay final exam (40%), and class participation (10%). Crime, Law, and Justice students may use this course to satisfy a 400-level course requirement in the Bachelor of Arts and Bachelor of Science majors. This course will be one of the supporting courses from which students are required to select six credits.", "prerequisite": "CRIM 100", "other": ["Cross-listed with: CRIMJ 425"]}, {"department": "CRIM", "number": "429", "credits": "3-4 Credits/Maximum of 7", "description": "This course explores the study of the application of criminological theories to our understanding of various forms of criminal behavior.  CRIM 429 Seminar in Criminal Behavior (3-4/maximum of 7) The course is intended to provide in the curriculum an avenue for the faculty to offer special focus courses on emerging forms of criminal behavior. For example, during the past several years the criminal justice system has had to respond to new forms of criminal behavior that have developed as we have developed new technologies. Recent use of the Internet as a means of committing crime has been the focus of federal and state legislation. Thus, societies have developed new forms or new means to old forms of criminal behavior through the use of technology. CRIM 429 will provide the faculty with the opportunity to develop special criminal behavior topic courses on offenses such as these and many other topics on our understanding and ability to explain criminal behavior. The course can satisfy 400 level requirements for the students in the CLJ major. This course will evaluate the students using a combination of written assignments and oral presentations.", "prerequisite": "CRIM 012"}, {"department": "CRIM", "number": "430", "credits": "3 Credits", "description": "Study of corrections from probation, intermediate punishment, adult and juvenile correctional institutions to parole.  CRIM 430 American Correctional System (3) This course examines the correctional system from the sentencing decision to reentry or release from the correctional system. The course focuses on the choices that decision-makers face in sentencing, classification and responding to violations by offenders as well as the problems that offenders face as they confront their treatment/punishment. As part of the analysis the course explores the persistent conflicting expectations that society imposes on our correctional system and the effectiveness of the system in rehabilitating, deterring and incapacitating offenders. This course expands on the brief introduction of the topic in CRIM/CRIMJ 100 and relies on the student's understanding of social science research developed in CRIM/CRIMJ 250W to critically analyze what we know about corrections. This course provides the opportunity for students to study in depth a major component of the criminal justice system and is one of five classes students may select from to meet a major core course requirement.", "prerequisite": "CRIM 100"}, {"department": "CRIM", "number": "432", "credits": "3 Credits", "description": "This course examines the American court system including structure and the way courts process offenders with special focus on sentencing.  CRIM (CRIMJ) 432 Crime and the American Court System (3) CRIM/CRIMJ 432, Crime and The American Court system, studies the courts from the lower courts to the Supreme Court and the various actors that play important roles in the functioning of the courts. First, the course studies the jurisdictions of the various courts and their organization in various state systems as well as the federal courts as well as the organization of state and federal administrative offices that manage the courts including the training of judges and the preparation of the court budget. Subsequent to the development of the basic understanding of the court jurisdiction and organization, the class studies the roles of the key actors in the day-in and day-out operation of the courts. In the spotlight are judges, prosecutors and defense attorneys although the role of the probation officers and clerk of courts are also intertwined with the processing of defendants. Of particular importance in this component of the course is the development of what is referred to as the court community and the focal concerns and goals that the court must consider as it processes cases. An, understanding of court community and focal concerns serves as crucial context for understanding the role of public policy as it attempts to shift or change the decision making of the court. One important dynamic of this course is the understanding that the court, although functioning as an institution to provide a neutral field on which accusations of criminality are to be played out, operates similarly to other organizations in that they are to be efficient (move cases with minimum overhead) and to be effective (provide justice, and protect the public). How the courts balance these competing demands and the informal processes that emerge in the processing of defendants is the key focus of the class. Finally, the course explores the attempts to reform the courts from the sentencing reforms such as determinate sentencing, mandatory minimums including '3 strikes' and sentencing guidelines. These issues highlight the political context of the courts and adaptability of the courts to attempts to change their values, and decisions. This course serves as one core 400-level course in the major. Each student must take two of the five core 400-level courses.", "prerequisite": "CRIM 100", "other": ["Cross-listed with: CRIMJ 432"]}, {"department": "CRIM", "number": "433", "credits": "3 Credits", "description": "This course studies sentencing from prosecutorial charging decisions through revocation of probation, and the complex goals and responsibilities at sentencing.  CRIM 433 Sentencing (3) This course focuses on the key decision in our court system--sentencing. The course covers the historical development of sentencing both within the United States and internationally as a backdrop to the reform efforts of the late 20th Century. The course explores how sentencing has changed from a judge-based discretionary system to a system where numerous restrictions to judicial discretion have been imposed by state and federal legislatures. Students will be evaluated on two essay exams (midterm and final) with the midterm worth 20 and the final 30 percent of the grade. A research analysis paper will be required that will be completed in three stages. The first stage will be the setting forth of a research problem and a scheme for analyzing the data (10%). The second stage will be an oral presentation of the findings (20%). The final stage will be a written term paper on the project (20%). This course will be used by CLJ majors as one of the six credits of 400-level elective credits required in the major.", "prerequisite": "CRIM 100"}, {"department": "CRIM", "number": "435", "credits": "3 Credits", "description": "This course will focus on current, historical, theoretical, and research issues surrounding law enforcement in the United States.  CRIM 435 Policing in America (3) This course is designed to provide a basic knowledge of the structure of policing in America and to explore findings from research considering police behavior. Students will examine and discuss controversial issues relating to policing in American society. Current trends in policing philosophies and strategies will be identified and their effectiveness will be debated. The relationship between police and citizens will be stressed. CRIM 435 can be used to satisfy a core 400-level course requirement in the CLJBA and CLJBS majors.", "prerequisite": "CRIM 100"}, {"department": "CRIM", "number": "441", "credits": "3 Credits", "description": "Historical and contemporary view of the juvenile justice system. Focus on analyzing components of the system, their interactions, processing, and handling of youths.  CRIMJ 441 CRIMJ (CRIM) 441 Delinquency and Juvenile Justice (3) This course examines delinquency and the juvenile justice system from a variety of viewpoints. It looks at the problems the system is expected to address, how the problems have changed through the ages, how the current juvenile justice system developed, and the programs used to prevent and control delinquency and their effectiveness. By the end of the course, students should be able to think critically about the research and issues in the field. Evaluation methods include exams, brief writing assignments and a longer paper on policy issues. Students will be evaluated through brief written assignments, a term paper, a mid-term essay, and essay final. This course will be offered twice a year with 60 seats per offering. Students in the major may select CRIM (CRIMJ) 441 as one of several required courses in either the BA or BS program. This course is one of the core courses in the curriculum from which students must choose six credits from five core courses offered. It also serves as one of the supporting courses in the curriculum from which the students must take six credits at the 400-level.", "prerequisite": "CRIMJ100", "other": ["Cross-listed with: CRIMJ 441", "United States Cultures (US)"]}, {"department": "CRIM", "number": "451", "credits": "3 Credits", "description": "This course focuses on the significance of race, class, and ethnicity to criminal justice processing and criminal offending.  CRIMJ 451 CRIMJ (CRIM) 451 Race, Crime, and Justice (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. This class is designed to explore the relationship between the criminal justice system and racial minorities in the United States. Students will examine theoretical issues of race and justice, as well as empirical understandings of the relationship between race, crime, and the criminal justice system. Students will endeavor to understand some of the economic, political, and sociological reasons why racial minorities are over-represented in the criminal justice system. Students will also explore normative issues of justice and equity in broader social interactions that influence and are influenced by crime and the criminal process.This course may be used towards the additional courses requirements for the CLJ BS/BA and ADM J degrees. It will also satisfy the Intercultural/International competence (GI). Students will be evaluated by a midterm and final exam, a term paper and class participation. This course will be offered twice a year with 60 seats per offering.", "prerequisite": "CRIMJ100", "other": ["Cross-listed with: CRIMJ 451", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"department": "CRIM", "number": "453", "credits": "3 Credits", "description": "This course focuses on the experiences of women as offenders, victims, and professionals in the criminal justice system. CRIMJ 453 / CRIM 453 / WMNST 453 Women and the Criminal Justice System (3) (US) The course will examine the role of women in the criminal justice system and look at the issues related to women as offenders, victims of crime, and as professionals in the system. Students will gain an understanding of the issues concerning women in the criminal justice system, examine how societal arrangements affect women as offenders, victims, and criminal justice professionals, and better understand the overlooked problems faced by women in the criminal justice system. Students will be evaluated on the basis of exams, presentations, and papers. CRIMJ 453 / CRIM 453 / WMNST 453 is a supporting course for both WMNST and CLJ majors, as well as the WMNST minor. This course may also be used to satisfy a GI requirement. This course will be offered twice a year with 60 seats per offering.", "prerequisite": "CRIMJ100 or WMNST100", "other": ["Cross-listed with: CRIMJ 453, WMNST 453", "United States Cultures (US)"]}, {"department": "CRIM", "number": "459", "credits": "3 Credits", "description": "In this course you will learn about how crime levels vary across different types of neighborhoods and about the role of different socioeconomic, demographic, spatial, and informal social control aspects of neighborhoods in promoting or buffering crime. We will address the patterns, concepts, theories, methods, and policies related to communities and crime. We will critically assess theory and research on the effects of neighborhood structure and social organization on crime, focusing in particular on the classic and contemporary thinking on poverty, social disorganization, disorder, collective efficacy, institutional trust, cultural heterogeneity, segregation, immigration and how they affect criminal behavior and victimization. Through readings, class discussions, and activities, writing projects, and presentations, you will be given the opportunity to reflect on what you are learning and to apply the theoretical concepts to real-life examples and to new contexts in and out of the class.", "prerequisite": "SOC 12", "other": ["Cross-listed with: SOC 459"]}, {"department": "CRIM", "number": "466", "credits": "3 Credits", "description": "Explains how communities solve local problems by partnering with researchers, practitioners, and policy makers. Demonstrates how such partnerships help communities tackle complex problems by clarifying their causes, identifying solutions, leveraging resources, and mobilizing stakeholders to act. Examines community-engaged research projects - such as collaborative efforts to revitalize neighborhoods, reduce crime & violence, empower youth, house the homeless, improve health, and promote sustainability - that address local manifestations of broader societal problems. Students will collaborate with community partners to design, implement, and evaluate problem-solving projects. Provides students with skills and knowledge needed to collaborate productively in community-engaged problem-solving initiatives.", "prerequisite": "SOC 207"}, {"department": "CRIM", "number": "467", "credits": "3 Credits", "description": "Law and society studies the social origins of law and legal systems; occupational careers, and decision-making of legal officials.  SOC (CRIMJ/CRIM) 467 Law and Society (3) (BA) This course meets the Bachelor of Arts degree requirements.Law and society teaches students' knowledge of key concepts and core ideas about the role of law in society. The course will cover the basics of key legal philosophies, major social science theories of law and society, research in law and society, the structure of the legal profession, and vital contemporary issues involving the role of law in society. CRIM/CRIMJ 113 and CRIM/CRIMJ 250W are prerequisites. The evaluations methods will include written assignments on course readings, and essay-style exams. Law and Society may be counted toward the credits required for the B.A. and B.S. in Crime, Law and Justice. It would fulfill one of the 400-level requirements in the 'Law' component of the major. The course may also be counted toward credits required for the B.A. and B.S. in Sociology for students with the Deviance and Criminology specialization.", "prerequisite": "CRIM 12", "other": ["Cross-listed with: CRIMJ 467, SOC 467", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIM", "number": "469", "credits": "3-4 Credits/Maximum of 7", "description": "The focus of this seminar is the law such as the laws of sentencing, appellate course decisions and their impact.  CRIM 469 Seminar in Law (3-4 per semester/maximum of 7) This seminar explores topics related to the law and will vary from semester to semester depending on current events, faculty research and other areas of study related to the criminal law. Evaluation methods will vary depending on the focus of the seminar, however, student evaluations will rely on techniques such as writing and presentations to enhance student presentation skills as well as evaluate their understanding of the course material. Students may take this course twice. This course serves as one of the supporting courses from which students must select 6 credits at the 400-level. It also serves as one of the additional courses from which students must select 18 credits under the Legal Studies Option.", "prerequisite": "CRIM 113"}, {"department": "CRIM", "number": "480H", "credits": "1 Credits", "description": "Supervised experience in planning the honors thesis and a criminological career. In this 1 credit Honors course, criminology students who are in the Schreyer Honors College, who are Criminology majors, and who are in the fall of their Junior year will begin the thesis research process with faculty supervision. The course focuses on a variety of activities and assignments that help students learn about criminological research, become acquainted with Criminology faculty research projects, develop their own research interests, identify potential faculty thesis supervisors, and develop a concrete idea for their Honors thesis research project in cooperation with a faculty thesis supervisor.", "prerequisite": "CRIM 250", "other": ["Honors"]}, {"department": "CRIM", "number": "481H", "credits": "1 Credits", "description": "This one-credit seminar is intended for Scholars in the spring semester of their third year who intend to complete their honors thesis in Crime, Law, and Justice. This course surveys the structures of information, patterns of information retrieval, and the resources and technologies used to research topics related to crime, law, and justice. Students complete a series of assignments involving information retrieval and the effective use of information technologies. This includes working with their faculty supervisor and collecting information on the topic they have selected for their honors thesis. At the conclusion of the class, students present a research proposal for their honors thesis, including a review of the relevant literature and a schedule for completing the thesis during their fourth year.", "prerequisite": "CRIM 480H", "other": ["Honors"]}, {"department": "CRIM", "number": "482", "credits": "3 Credits", "description": "Relates organizational and public policy management approaches to police, courts, and correctional institutions.  CRIM (CRIMJ) 482 Seminar, Criminal Justice Agency Administration (3) In this course, you will learn about the nature of criminal justice organizations, individual and group behavior within the system, and the issues involved in reforming the system. This course will NOT teach you how to become an administrator in the criminal justice system, but hopefully will teach you about the issues and theories surrounding organizations and reform-and most importantly, teach you to think and communicate (in both written and verbal form). After taking this course, you should have a more accurate perception of criminal justice organizations and have a better understanding of the complexity surrounding the administration and management of these organizations. Criminal Justice Agency Administration may be counted toward the credits required for the B.A. and B.S. in Crime, Law, and Justice.", "prerequisite": "CRIM 100", "other": ["Cross-listed with: CRIMJ 482"]}, {"department": "CRIM", "number": "490", "credits": "3 Credits", "description": "This course focuses on criminal justice policy and the factors that influence policy development and implementation.  CRIM 490 Crime Policy (3) This class will study crime and criminal justice in the context of law and the development and implementation of public policy. The course will focus on the politics of law and social control by exploring the construction of crime as a social problem, fundamental aspects of the policy development and implementation process, the legal interpretation of public policy, and the role of federal, state, and local governments in crime control. Students will be evaluated on essay exams and a term paper. This course is intended to be a capstone course for advanced undergraduates. The course will draw on the broad range of course work that students will have taken prior to taking this course to develop a course that takes what we know about crime, the law and the justice system and focus on public policy as it relates to these areas. The course may be used toward the six credits required at the 400 level under Additional Courses or as one of the courses under the Legal Studies Option.", "prerequisite": "CRIM 250W"}, {"department": "CRIM", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "CRIM", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "CRIM", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "CRIM", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]