[{"department": "CRIMJ", "number": "12", "credits": "3 Credits/Maximum of 3", "description": "Criminology is the study of the causes of criminal behavior. As such this course is an introduction to the topic with special focus on the major theories and concepts explaining criminal behavior. A key focus of the class is examining the most recent scientific research testing the basic theories in criminology. The students learn the various research techniques that have been methods and data sources used to study criminal behavior. Several important areas of study that link understanding criminal behavior and its distribution across the social system are investigated including age, gender, race and ethnicity. One goal of the course is to promote a more complete understanding of crime and how it is enmeshed in human social life. Students read a general text, as well as scholarly articles in Criminology.", "other": ["Cross-listed with: CRIM 12, SOC 12", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CRIMJ", "number": "12H", "credits": "3 Credits", "description": "Criminology is the study of the causes of criminal behavior. As such this course is an introduction to the topic with special focus on the major theories and concepts explaining criminal behavior. This honors version of Introduction to Criminology is especially designed to be appropriately challenging for Schreyer Honors College students. A key focus of the course is examining the most recent scientific research testing the basic theories in criminology. Students learn the various research methods and data sources used to study criminal behavior. Several important areas of study that link understanding criminal behavior and its distribution across the social system are investigated including age, gender, race and ethnicity. One goal of the course is to promote a more complete understanding of crime and how it is enmeshed in human social life. Students read a general text, as well as scholarly articles in criminology.", "other": ["General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CRIMJ", "number": "13", "credits": "3 Credits", "description": "Juvenile conduct, causes of delinquency, current methods of treatment; organization and function of agencies concerned with delinquency.", "other": ["Cross-listed with: SOC 13", "General Education: Social and Behavioral Scien (GS)"]}, {"department": "CRIMJ", "number": "100", "credits": "3 Credits", "description": "Criminal Justice 100 is an overview of the United States criminal justice system and the major components of police, courts and corrections. Students will engage in reviews of, evaluate and consider legal foundations, types and causes of crime, the development of policing, the influence and evolution of the court process, and rehabilitative and reintegrative components of corrections. Specific topics can include, but are not limited to, the extent of crime in the United States; competing and complementary goals within the criminal justice system; sources of criminal law; interactions between various agencies within the criminal justice system; and the impact of crime on victims. During the course of study of the criminal justice system, students will have various opportunities to examine how age, gender, race and ethnicity impact and are impacted by the criminal justice system at critical phases.", "other": ["Cross-listed with: CRIM 100", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "CRIMJ", "number": "113", "credits": "3 Credits", "description": "Introduction to law in society with a focus on criminal law, judicial code, laws of sentencing and corrections, ciminal procedure.  CRIM (CRIMJ) 113 Introduction to Law (3) Introduction to the law is designed to provide CLJ majors with an introductory level of knowledge of the criminal law, and other legal codes such as the Judicial Code, laws of corrections, probation and parole, and the rules of criminal and appellate procedure. The course will serve as a gateway course to taking more advanced criminology and criminal justice courses. CRIMJ (CRIM) 113 is one of the Prescribed Courses in the CLJ curriculum and is used as a prerequisite for many 400 level courses including CRIM 467 AND 469.", "other": ["Cross-listed with: CRIM 113", "United States Cultures (US)"]}, {"department": "CRIMJ", "number": "150N", "credits": "3 Credits", "description": "This course will consider the overlapping responsibilities and epistemologies of criminal justice and public health. Both fields concerned with the promotion of population welfare, the public health and criminal justice systems nevertheless confront the same social problems from different ethical perspectives, research methodologies, and knowledge bases. Each may further mobilize different institutional actors driven by divergent political agendas. While we will discuss the productive collaboration between public health and public safety agencies, we will also consider ongoing ownership struggles over certain issues, behaviors, and even populations. Given its practical relevance to many ongoing social issues and controversies of general importance, this course is motivated by a commitment to community-engaged scholarship, and thus will include topics, readings, assignments, speakers, and field trips of local and state importance. At the same time, specific topics will be framed in terms of their national and international importance, and students will be encouraged to link micro-level problems to macro-level processes.", "other": ["Cross-listed with: BBH 150N", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CRIMJ", "number": "159", "credits": "3 Credits", "description": "Chronological survey of the History of the FBI since its founding in 1908, focused on the evolution of Federal law enforcement, bureaucracy, the increasing power of the Executive branch, the targeting of various minority groups, civil rights and civil liberties issues, and the growth of a national security role for the federal government over time. In its long history the FBI has intersected with a wide variety of groups and issues, and this reality will further expose students to the histories of African Americans, gays and lesbians, women's groups, Latinos, Native Americans, war protesters, students, various political dissenters, immigrants, targeting of morality, obscenity, and labor organizing. Because the FBI is responsive to both the political and policy interests of presidents and the influences of American society, students will come to appreciate the influences that politics has on bureaucracy and law enforcement, as well as the different social, political, economic, and cultural influences that each historical time period have exerted on the FBI to help shape its priorities and structure.", "other": ["Cross-listed with: HIST 159", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "CRIMJ", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction."}, {"department": "CRIMJ", "number": "200", "credits": "3 Credits", "description": "A general introduction to the field of private security and asset protection.  CRIMJ 200CRIMJ 200 Introduction to Criminal Justice (3) (GS)(BA) This course meets the Bachelor of Arts degree requirements. This course focuses on a body of scholarship addressing the critical issues, policies, and complexities of the criminal justice system. It includes specific topics on key components of the system while demonstrating the intra-relationships of the system. Students will be provided numerous opportunities to broadly survey the concept of justice as well as investigate comparative issues on a governmental level and internationally. Students will also focus on specific social and justice system challenges such as substance abuse, family violence, minorities and justice, street crime, corrections for adults and juveniles, sentencing patterns, and ethics. Students will also analyze the global impact of criminality as they study transnational crime and the challenges faced by the collaboration of nations. Students will be required to familiarize themselves with electronic web sites, refereed journals, and national and international events for class discussion, research, and writing assignments. Students will learn how to comprehend legal decisions and legal procedures. By the end of the course students will be expected to integrate the information of the semester into comparisons and critical evaluation of the criminal justice system components. Frequency of enrollment: Every semester with 35 students."}, {"department": "CRIMJ", "number": "205N", "credits": "3 Credits", "description": "This course closely examines the place and power of race in America. By tracing the history of how race works in particular American institutions, such as public education, criminal justice, and federal housing, students will gain a deep sense of how social categories and understandings shape material conditions and human welfare. Through the study of policies, court cases, memoirs, documentary films, and freedom struggles, this course will interrogate the many Americas that race has created and their implications for democracy and justice. Not only will this course focus on making race visible, but also the many ways that race intersects with class, gender, and sexuality and how these concepts empower and marginalize at the same time. All the while, students will use Critical Race Theory methods to reach empathy and strengthen social (GS) and historical (GH) literacies. Discussion, writing, critical reading, and primary source analysis will be integral to this class. Class sessions will include whole- and small-group discussion where active listening and thoughtful participation will be taught and required. Students will be encouraged to explore their own conceptions of race and how those ideas shape knowledge and experience. Ultimately, this is a course that will weave data, theory, and story as we encourage students to move toward empathy through comprehensive understandings of race. This course therefore examines race as both deeply personal and structural.", "other": ["Cross-listed with: EDUC 205N, SOC 205N", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "CRIMJ", "number": "210", "credits": "3 Credits", "description": "Police organization and operations in America.", "prerequisite": "or concurrent: CRIMJ100"}, {"department": "CRIMJ", "number": "220", "credits": "3 Credits", "description": "Purpose and function of criminal courts in society, organization, jurisdiction and staffing; prosecution, adjudication, and sentencing of offenders.", "prerequisite": "CRIMJ100"}, {"department": "CRIMJ", "number": "221", "credits": "3 Credits", "description": "Examination of the models of the criminal process, functions of the justice system, and approaches to crime and punishment.", "prerequisite": "CRIMJ100"}, {"department": "CRIMJ", "number": "230", "credits": "3 Credits", "description": "Punishment and treatment of sentenced offenders, correctional institution organization, staffing, inmates, and subcultures."}, {"department": "CRIMJ", "number": "234", "credits": "3 Credits", "description": "Traditional and innovative technical approaches utilized by law enforcement scientists; capabilities and limitations of technical techniques highlighted.  CRIMJ 234 CRIMJ 234 Fundamental Techniques of Scientific Criminal Investigation (3) This course is designed to introduce students to the fundamental methods by which scientific-criminal investigations are pursued. Course objectives focus upon a familiarity with various strategies and techniques of scientific criminal investigation within the law enforcement context so that students may understand both the potentials and limitations of such methods. The course maintains a focus upon traditional methods of scientific criminal investigation as well as examination of scientific developments that have altered investigation in recent years. While this course cannot produce expertise in the more sophisticated technologies of criminal investigation, it serves as a basic introduction to the field. As such, it is designed to give an overview of various possibilities, so that students completing the course will have a general grasp of the various strategies and techniques that are available for criminal investigation and will be in a position to call upon the necessary and appropriate expertise when the occasion arises. The course design alerts students to many of the limitations of the various strategies and techniques of scientific criminal investigation, equipping, them to judge the validity of various findings and to assess the qualifications, and methods employed by different experts. The course gives special attention to strategies and tactics of interrogation and to means of' corroborating interrogation data with scientific data obtained from other investigative techniques. The course provides an introduction to various techniques of' fingerprinting, including ink pads and dusting techniques, as well as several techniques for bringing out latent fingerprints, with an emphasis on the careful collection and preservation of this evidence. It will introduce methods of drug testing, including techniques for insuring the validity of specimens and basic chemical analysis kits currently available for drug testing, with an emphasis on the careful collection and preservation of this evidence. It demonstrates and provides practical experience in breathalyzer utilization, as well as other investigative techniques for assessing driver impairment resulting from excess alcohol intake. It provides a basic introduction to DNA technology to the point of equipping students with a fundamental understanding of DNA evidence, including probabilities associated with various findings. Throughout the course, there is special stress on the concept of crime scene investigation, including strategies for cordoning off crime scenes and restricting contamination of evidence, basic crime scene mapping, and analysis of evidence such as blood splattering, foreign objects, unusual markings, hair and fiber samples, and other aspects of evidence. Finally, the course stresses preparation of investigative reports, with an emphasis upon clarity of presentation, attention to relevant details, preparation for presentation of evidence in court, and careful and concise writing. Faculty Member Proposing Course : Richard A. Ball"}, {"department": "CRIMJ", "number": "240W", "credits": "4 Credits", "description": "Field research and observational strategies appropriate to the identification, investigation, and analysis of research questions in criminal justice.  CRIMJ 240W CRIMJ 240W Field Research in Criminal Justice (4) Administration of Justice majors who are interested in completing an internship must first complete CRIMJ 240W. As augmented, this course attempts to introduce students to research strategies appropriate to the identification, investigation, and analysis of research questions in the administration of justice, while also providing intensive training in the use of various investigative strategies and intensive training in analysis of findings derived from such research, as well as preparation for an internship and extensive writing experience. As augmented, it will involve additional writing assignments by which students will demonstrate their ability to identify researchable questions, lay out their investigative strategies in written form and produce in writing analyses of their findings and conclusions, with recommendations for policy if appropriate. Considerable time is devoted to strategies for identification of research questions. Students will be required to perform an analysis of a setting in administration of justice, locate and specify aspects of the setting that require systematic research in order to explicate the setting or provide information on problems that might be solved by various administrative approaches or promising programs, projects or policies that might be adopted by other agencies. The course will provide an overview of field research methods appropriate to investigation of administration of justice issues such as those identified earlier. The course will include introduction to the theory and rationale of field research in the social sciences and considerable training and experience in field research methods across several different areas of methodology. The overview of field research methods introduces students to the variety of field methods that are available to researchers in administration of justice. Students will then proceed to an understanding of the issues associated with the theoretical perspectives and epistemological assumptions underlying the various field methods examined in the preceding overview. Here attention will be given to the assumptions upon which each research method is built and the strengths and weaknesses of each method. As augmented, this course is designed to require students to take special account of the weaknesses of the various methods and learn how to counter these weaknesses by augmenting the research strategy by complementary methods where appropriate. As augmented, the course is designed to teach students the reasons for use of various methods as well as the methods themselves. Because this course places such emphasis on data collection, and because research is best learned by doing it, the course is further augmented with additional research exercises. Students are required to spend additional time in the field research exercises beyond that required for a 3-credit course, completing as much as 20 hours of participant observation for sharpening their observational skills, as 10 hours of focus group work, with much of this effort aimed at sharpening their ability to interpret communications from several different sources with respect to the same events, and as 20 hours of interviewing, using several different interviewing techniques. These efforts concentrate upon developing students' ability to elicit information from interviewees and cross-validate the information through a variety of interview techniques. Students must complete several papers demonstrating their ability to organize their research finding and present them in understandable form. The research writing elements in this course include development of hypotheses, preparation of a research proposal, development of literature reviews, description of research settings, and preparation of research bibliographies. Finally, this course is designed to serve as a bridge in preparation for a successful internship experience. As such, it must succeed in teaching students how to develop and conduct a research study on their own before graduation. Faculty Members Proposing Course : Lisa Morris and Richard A. Ball", "prerequisite": "CRIMJ100", "other": ["Writing Across the Curriculum"]}, {"department": "CRIMJ", "number": "241", "credits": "3 Credits", "description": "Introduction to computer applications for criminal justice and public affairs agencies.  CRIMJ 241 CRIMJ (PUBPL) 241 Computer Applications in Public Affairs (3)The student will gain a working knowledge of microcomputer and Internet applications to utilize them in course and/or job functions. The class will be treated primarily as a lab. The purpose is to make the student familiar with popular computer applications in current use. Applications covered include: Word Processing (Microsoft Word); Spreadsheet (Microsoft Excel); Presentation Package (Microsoft PowerPoint); Database (Microsoft Access). Internet Applications include: email - Webmail; World Wide Web Browser - Netscape Communicator and Internet Explorer; and creating a Homepage.", "other": ["Cross-listed with: PUBPL 241"]}, {"department": "CRIMJ", "number": "250W", "credits": "3 Credits", "description": "Fundamental concepts of social science research including design, measurement, sampling, and interpretation of the study of crime, law, and justice.", "prerequisite": "CRIM 012", "other": ["Writing Across the Curriculum"]}, {"department": "CRIMJ", "number": "260", "credits": "3 Credits", "description": "Methods of collection, presentation, and analysis of quantitative data in the social science; procedures, interpretation, and application.  CRIMJ 260 Statistical Analysis for the Social Sciences (3)This course covers the theory and methodology of statistical analysis. This course includes mathematical calculation of Univariate and Bivariate models, including mean, mode median, variance and standard deviation, Crosstabs with Chi-Square, Independent and Paired Samples t-tests, Anova and Tukey's H.S.D, Correlation and Regression. It also makes use of SPSS and publically available data sets to examine univariate data, and test hypotheses at both the bivariate and multivariate level. Students become familiar with the calculations behind the analysis, and engage in the analysis and reporting of actual data.", "prerequisite": "2 units of High School Algebra, and CRIMJ100 , or permission of the program", "other": ["General Education: Quantification (GQ)"]}, {"department": "CRIMJ", "number": "290", "credits": "1-3 Credits", "description": "Planning and preparation for field experience in a criminal justice agency setting. This course provides the student learner with an intimate understanding of the academic requirements of the criminal justice internship. Students will engage in practical application of the skills, traits, characteristics and qualities necessary to be successful in the criminal justice internship, as well as their chosen career. Guidance will be provided as to how to conduct themselves in a professional setting and learn to utilize critical thinking and problem-solving in the day-to-day encounters in the field.", "prerequisite": "CRIMJ100 ; Prerequisite or concurrent: CRIMJ240W"}, {"department": "CRIMJ", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "CRIMJ", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "CRIMJ", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "CRIMJ", "number": "304", "credits": "3 Credits", "description": "Interdisciplinary analysis of security and loss prevention; its administration, role in crime control and prevention, and relationship to criminal justice."}, {"department": "CRIMJ", "number": "310", "credits": "3 Credits", "description": "Presentation of the techniques, skills, and limitations of modern crime laboratory.  CRIMJ 310 CRIMJ 310 Forensic Science I (3) Presentation of techniques, the principles underlying the techniques, skills and limitations of the modern crime laboratory for student who has no background in the forensic sciences form the basis of the course. The nature of physical evidence is emphasized along with limitations that technology and knowledge impose on its individualization and characterization. Particular attention is paid to the meaning and role of probability in interpreting the individual significance of scientifically evaluated evidence. Major, lecture topics include the following: The Crime Scene; Physical Evidence; Physical Properties of Glass, Soil, and Plastics; Organic Analysis; Inorganic Analysis; the Microscope; Hairs, Fibers, and Paints; Drugs; Forensic Toxicology; Forensic Aspects of Arson and Explosion Investigation; Forensic Serology; Forensic Anthropology; DNA; Finger Prints; Fire Arms; Tool Marks and Other Impressions; Document and Voice Examination; and Forensic Science on the Internet. To understand the techniques used in crime scene analysis hands-on activities as formal experiments in the laboratory setting form part of the course. The specific objectives of the laboratory components of the courses are: 1) To provide a first set of laboratory experiments for criminal justice and general science students who have had little or no previous science laboratory experience. 2) To show beginning students in criminal justice and general science the significance of physical evidence at the scene of a crime. 3) To demonstrate what happens to physical evidence when it is sent to the laboratory so that students will know what is needed, how much is needed, and how to prepare 4) To educate the student in basic laboratory practices so that they can ask and/or answer questions more intelligently in a court of law. And probably most important, to educate students so that they will not unintentionally destroy physical evidence at a crime scene, and will in fact try to preserve it for the trained forensic scientist. The experiments are designed to provide students with an overview of what can be done as a prelude to making them potential professional forensic scientists/criminologists. The proposed courses are meant for students majoring in the Administration of Justice Programs and should augment their knowledge of criminology and reinforce approaches utilized by law enforcement scientists. Students will carry out hands on experiments in biology, chemistry and physics in a dedicated laboratory setting. Use of instrument to analyze specimens and gather/interpret data using computers and statistical techniques form part of the course. Students will be graded based on their understanding of the principles involved in selecting and using specific laboratory techniques and on the quality of results of their laboratory experience. It is anticipated that the course will be offered once a year, first part during fall semester and the second part during the following semester. Since laboratory space and instruments are limited class size will not exceed fifteen.", "prerequisite": "CRIMJ100"}, {"department": "CRIMJ", "number": "345", "credits": "3 Credits", "description": "Justice agencies and the community's crime prevention and participation strategies; community involvement in policy development.", "prerequisite": "CRIMJ100"}, {"department": "CRIMJ", "number": "389", "credits": "3 Credits", "description": "The history, structure, and practices of gangs in America as well as societal reaction to them.  CRIMJ 389CRIMJ 389 Gangs and Gang Behavior (3) This class takes a look at gangs: their history, structure, activities, and practices-as well as law enforcement practices targeting gangs and gang members. This class examines the following types of gangs: Outlaw Motorcycle Gangs, Supremacists and Militias, Skinheads, African-American, Latino, and Asian Gangs. It also addresses relatively recent phenomena in gang involvement: (1) the rise of the independent girl gang; (2) middle class suburban gangs (Goths); and, (3) anti-drug and anti-sex Straight-Edge gangs. Both the positive and negative functions of gangs are examined critically through a comparison of conventional and non-conventional youth activities. It concludes with an examination of emerging trends in gang development and activities, including the link between street gangs and organized crime. This course complements CRIMJ 403-Juvenile Law and Justice and is recommended for students wishing to pursue a career in juvenile intervention. It consists of three examinations (objective and subject measures), three traditional essays (out-of-class), and four directed asynchronous message board essays (using ANGEL course management software). This course will be offered annually with a projected enrollment of 25 students."}, {"department": "CRIMJ", "number": "406", "credits": "3 Credits", "description": "Theory and research concerning deviant behaviors and lifestyles viewed as significant departures from a group's normative expectations.  SOC (CRIMJ/CRIM) 406 Sociology of Deviance (3) (BA) This course meets the Bachelor of Arts degree requirements.Sociology of Deviance focuses on the theory and research in social construction of social norms, the violation of norms, and social reaction to the violation of norms. The course focuses on the role of social structure and power in the definition of deviance, on structural, cultural, and social psychological processes involved in deviant behavior, and the dynamics of social reaction to deviance. The course includes some content focusing on criminal deviance, but also emphasizes non-criminal deviance, as well as the role of social movements and social change in constructing and contesting deviance definitions. CRIMJ/SOC/CRIM 012 and CRIM/CRIMJ 250W are prerequisites. This course may be counted toward the credits required for the B.A. and B.S. in Crime, Law, and Justice. It would fulfill one of the 400-level requirements in the 'Crime' component of the major. The course may also be counted toward credits required for the B.A. and B.S. in Sociology for students with the Deviance and Criminology specialization.", "prerequisite": "3 credits of SOC, CRIM, or CRIMJ", "other": ["Cross-listed with: CRIM 406, SOC 406", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIMJ", "number": "407", "credits": "3 Credits", "description": "This course will explore the legal, emotional, and social responses to the process of victimization by offenders and third parties. CRIMJ 407 Victimology (3) (US) Victimology studies the victim-offender relationship. Victimization is analyzed using the Bible, Anglo-Saxon Law, Common Law, and legal precedent as a historical development of the status of \"victim.\" Cultural changes during the 1950s and 1960s resulted in the reemergence of the victim and the designation of social services and community awareness for victims. Social scientific studies of the status of unique groups analyzed victimizations according to demographics and socioeconomic status. Political viability of victims in terms of restitution and community response are viewed in terms of Census data, the Department of Justice's National Crime Victimization Survey and The Uniform Crime Reports, Morbidity Reports, Emergency Room Reports, and the Insurance Industry Reports. The above data is evaluated in terms of age, race, education, socioeconomic status, and gender. The development and merging of culture, sub-cultural liaisons, social relationships, leisure activities, and routine transactions are reviewed as they apply to personal and unique group victimizations. Comparative issues and transnational crime are addressed under the format of globalization, gender, economics, and cultural mores. Interdisciplinary evaluation of Victimology considers psychology, medicine, sociology, criminal justice, legal studies, and mass media. Documentaries, case studies, problem based learning, and popular films provide numerous activities for discussion, analysis, and integration in writing and for discussion.", "other": ["United States Cultures (US)"]}, {"department": "CRIMJ", "number": "408", "credits": "3 Credits", "description": "Principles of administration as they relate to a police organization; and policy development.  CRIMJ 408CRIMJ 408 Legal Aspects of Law Enforcement (3) This course is one of the law enforcement offerings directed at students interested in pursuing a career in the field. This course builds upon legal courses and the police administration course. It is intended to challenge students to comprehend the complexities of working within a litigious society where policing is often the target of simultaneous praise and criticism. Research is introduced to allow students to consider alternatives to conflicts and the court's interpretation of the efficacy and constitutionality of such efforts. Civil liberties, use of force, use of technology, and communications have played significant roles challenging public safety. The consistent expansion of the role of law enforcement presents complexities that are often different according to the jurisdiction and community sentiment. Issues of hiring, training, education, accreditation, force, and racial profiling are the basis for assignments, research, and directed projects and class discussion.", "prerequisite": "CRIM 100"}, {"department": "CRIMJ", "number": "409", "credits": "3 Credits", "description": "In this course students will learn what kinds of offenses constitute the various types of white collar crime including occupational crime, corporate crime, governmental crime, state-corporate crime, avocational white collar crime, and contrepreneurial crime. The course will explore how white collar crime is measured and will examine the victimization and offending patterns revealed by data on white collar crime. The course will further examine the usefulness of various criminological theories such as strain, control, and learning theories in explaining white collar offending. Comparisons to street crime in terms of seriousness, punishment, and offender and victimization patterns will be discussed throughout the course.", "prerequisite": "CRIM 12"}, {"department": "CRIMJ", "number": "410", "credits": "3 Credits", "description": "Tracing the steps of criminal cases through the investigative stage, arrest, trial, sentencing and appellate review in Pennsylvania.", "prerequisite": "CRIMJ100 , CRIMJ113"}, {"department": "CRIMJ", "number": "412", "credits": "3 Credits", "description": "Legal and extralegal control; public opinion on crime; criminal justice and correctional processes; legal sanctions; control strategies.  Field trip.", "prerequisite": "CRIM 012 , CRIM 013 , or SOC  005", "other": ["Cross-listed with: CRIM 412"]}, {"department": "CRIMJ", "number": "413", "credits": "3 Credits", "description": "This course provides an in-depth look at theories of crime and examines influential empirical studies designed to these theories.  CRIMJ 413CRIMJ (CRIM/SOC) 413 Advanced Criminological Theory (3)Advanced criminological theory is intended to extend and deepen students' knowledge of core ideas in criminology. The course has four main emphases: 1) learning major schools of thought in criminology, 2) learning about the uses and construction of theory, 3) learning about approaches to integrating criminological theories, and 4) exploring how criminological concerns are grounded in and interrelated with core issues in sociology. The course is offered once a year with 50 seats per offering. CRIMJ/CRIM/SOC 012 is a prerequisite. Students will be evaluated on research or analytical papers, written assignments on course readings, and/or in-class essay-style exams. This course may be counted toward the credits required for the B.A. and B.S. in Crime, Law, and Justice. It would fulfill one of the 400-level requirements in the major. The course may also be counted toward credits required for the B.A. and B.S. in Sociology for students with a Deviance and Criminology specialization.", "prerequisite": "SOC 12", "other": ["Cross-listed with: CRIM 413, SOC 413"]}, {"department": "CRIMJ", "number": "414", "credits": "3 Credits", "description": "Research on and theory of criminal careers and crime organizations, emphasizing recruitment and disengagement; offender characteristics and lifestyles; policy implications.", "prerequisite": "CRIMJ012 , or CRIMJ013 , or SOC  005", "other": ["Cross-listed with: SOC 414", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIMJ", "number": "415", "credits": "3 Credits", "description": "Examines the history of drug control policy in the United States; comparisons and contrasts with other countries' experiences.  CRIMJ 415 CRIMJ (PUBPL) 415 Drug Control Policy in Comparative Perspective (3)This course focuses on the history of drug control policy in the United States and the internationalization of drug prohibition. We also examine the experience of other countries with drug use, abuse and control, including alternative regulatory policies in Western Europe. This class is both historical and comparative in orientation: in tracing the roots of drug prohibition, and examining the experience of other countries, we seek to enrich our understanding of American style drug control and the feasibility of alternative approaches.", "prerequisite": "CRIMJ200 or PL SC001 or PL SC014 or SOC  001", "other": ["Cross-listed with: PUBPL 415"]}, {"department": "CRIMJ", "number": "416", "credits": "3 Credits", "description": "The death penalty is the ultimate punishment in the criminal justice systems in the world. The United Sates is one of the few democratic nations that still uses this punishment. The death penalty is also one of the most central and debated topics for candidates in high-profile political elections. In this course, students are introduced with the complexity and implications of this punishment to better understand the American exceptionalism regarding criminal sanctions in comparison to the rest of the world; the focus is on the development of the death penalty in the modern-era United States. Surrounding the death penalty debate, issues such as deterrence, retribution, incapacitation, cost, innocence, and constitutionality are critically examined using key Supreme Court cases and important scholarly readings. In addition, six foreign countries are discussed to offer a comparative view in the procedural and substantive domains of the death penalty.", "prerequisite": "SOC 12", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"department": "CRIMJ", "number": "417", "credits": "3 Credits/Maximum of 3", "description": "This course is primarily a discussion-based seminar, engaging in a critical analysis of hate crime, extremism, and terrorism from a criminological perspective. First, students will engage with issues related to genocide and the role of the state in fostering hate. Students will then grapple with the arguments surrounding legislation relevant to hate speech and hate crime. There will also be an overview of the nature of hate crime, focusing on victims, motivations, and explanations of such crime. After discussing organized hate and extremist groups, students will also engage with the debate on the nature of the hate crime-terrorism relationship. The second half of the course focuses on terrorism as students learn about complexity of defining and explaining terrorism, focusing on the wide array of definitions of terrorism and the main theories of terrorism across a variety of disciplines. Students will examine different types of terrorism, including state and dissident terrorism generally as well right-wing, left-wing, religious, and international terrorism in the United States. The course will end with an overview of responses to hate crime, extremism, and terrorism, including issues surrounding the War on Terror. Students will further develop research, writing, and critical analysis skills after writing a term paper addressing a topic related to hate crime, extremism, and/or terrorism.", "prerequisite": "CRIMJ 12"}, {"department": "CRIMJ", "number": "420", "credits": "3 Credits", "description": "Common law and statutory crimes; constitutional rights of accused persons, liability of criminal justice professionals.", "prerequisite": "CRIMJ113"}, {"department": "CRIMJ", "number": "421", "credits": "3 Credits", "description": "The impact of violent crime on victims, their families, and communities; the police process as it relates to violent crime.  CRIMJ 421CRIMJ (CRIM) 421 Violent Crime (3)This course will examine the nature, frequency, and causes of violence, generally and of assault, robbery, rape, and homicide, specifically. Several different theoretical and research perspectives are reviewed, including biological, psychological, social, and cultural. The course also examines individual and societal responses to violence. Students are evaluated on three objective exams (25% each) and a series of short assignments (25%). CRIM/CRIMJ 421 may be used by both CLJBA and CLJBS degree candidates to satisfy a 400-level course requirement in the major. This course will be offered twice a year with 60 seats per offering.", "prerequisite": "CRIMJ012", "other": ["Cross-listed with: CRIM 421"]}, {"department": "CRIMJ", "number": "422", "credits": "3 Credits", "description": "Examines the history, how victimization is measured/studied in social sciences, public policy implications of victimization movement in U.S. CRIM 422 / CRIMJ 422 Victimization (3) Victimology has emerged as an important area of study for the social sciences and an important arena for policy development. This course will familiarize students with the historical development of the research into victimization and the importance of the victims' movement to public policy. Areas explored will include the relationship between victim and offender, the cultural images of victims and their impact on the victim and the response of the criminal justice system to them, and how research has attempted to measure victimization.The course will be one of the supporting courses where the student must select 6 credits at the 400 level.", "prerequisite": "CRIM 250W", "other": ["Cross-listed with: CRIM 422"]}, {"department": "CRIMJ", "number": "423", "credits": "3 Credits", "description": "Legal, sociological, and psychological perspectives on sexual and domestic violence. CRIMJ 423 / CRIM 423 / WMNST 423 Sexual and Domestic Violence (3) (US) This course investigates violence against women, specifically domestic, sexual, and relationship violence. Students will examine some of the legal, sociological, and psychological perspectives about sexual, domestic, and relationship violence as well as the social and cultural roots of violence against women. Students will also gain an understanding of the experiences of victims of domestic and sexual violence as well as the issues presented by perpetrators. Students will be evaluated based on performance on exams, and two research papers. CRIMJ 423 / CRIM 423 / WMNST 423 is a supporting course in both the WMNST major and minor as well as a supporting course in the CLJ major. It may also be used to satisfy a GI requirement. This course is offered fall and spring semester with an enrollment of 60 students each semester.", "prerequisite": "CRIMJ100", "other": ["Cross-listed with: CRIM 423, WMNST 423", "United States Cultures (US)"]}, {"department": "CRIMJ", "number": "424", "credits": "3 Credits", "description": "Why do people take drugs? Why and how does society attempt to control drug use and distribution? What is the association between drugs and crime? Exploring questions such as these will be central in CRIM 429. The focus of this course will be examining explanations of drug use and the social construction of drug policies. We will begin by asking the question \"What are drugs?\" From there, we will discuss theories of drug abuse and the methods used to study patterns of drug use. We will also take an in-depth look at the histories, pharmacologies, and patterns associated with the most popular drugs in modern society. In the second half of the semester, we will focus on the social control of drugs and the connections between drugs and crime. At the heart of this discussion will be the causes and consequences of modern U.S. drug policies. We will conclude with a look at alternative drug policies and what the future may hold for drug use in America.Throughout the semester, you will be asked to think critically about material and evaluate its strengths and weaknesses. To foster critical thinking skills, you will have ample opportunities to discuss topics in class, analyze arguments in written assignments and in-class exercises, and apply ideas to real world situations through course projects and presentations.", "other": ["Cross-listed with: CRIM 424"]}, {"department": "CRIMJ", "number": "424W", "credits": "3 Credits", "description": "Analysis of international narcotics trafficking in the twentieth century.", "prerequisite": "CRIMJ100", "other": ["Writing Across the Curriculum"]}, {"department": "CRIMJ", "number": "425", "credits": "3 Credits", "description": "This course examines organized crime in terms of historical antecedents, structure, related theories, and policy issues.  CRIM (CRIMJ) 425 Organized Crime (3) This course will provide students with a historical and theoretical overview of organized crime. Students will gain an understanding of the structure of organized crime as well as an understanding of the businesses associated with traditional and nontraditional organized crime groups. The course will also provide students with a detailed analysis of state and federal laws and policies regarding organized crime. Students will be evaluated by two mid-term exams (25% each), an essay final exam (40%), and class participation (10%). Crime, Law, and Justice students may use this course to satisfy a 400-level course requirement in the Bachelor of Arts and Bachelor of Science majors. This course will be one of the supporting courses from which students are required to select six credits.", "prerequisite": "CRIM 100", "other": ["Cross-listed with: CRIM 425"]}, {"department": "CRIMJ", "number": "426", "credits": "3-6 Credits/Maximum of 6", "description": "Study of special offender types; relationships with criminal justice system (drug abuse, victimless crime, white collar crime considered different semesters).", "prerequisite": "3 credits in Criminal Justice or permission of program"}, {"department": "CRIMJ", "number": "430", "credits": "3 Credits", "description": "Control and treatment of offenders in the community, probation and parole organizations, diversion programs, innovative sentences, supervision techniques. This course introduces students to the system of \"criminal justice\" as defined and interpreted by the Supreme Court as well as lower courts. Students study the judicial process, the intricacies of opinion formation, the nature and extent of judicial power, the willingness of the courts to hear appeals, and the reality of criminal sanctioning and procedure. The adversarial process, the willingness of the courts to hear appeals, and the conflicting opinions of the court introduce students to the lack of conformity that is part of upholding Constitutional rights. Court attitudes and how the changing system is studied through stare decisis and case briefing. Particular cases and issues are critiqued such as capital punishment of the mentally ill, juveniles, and those who are mentally challenged. The tension between justice versus law is studied through cases, evaluation of court behavior , and changing attitudes towards racial inequities.", "prerequisite": "CRIMJ100 , and CRIMJ113 , and CRIMJ230 , or permission of program"}, {"department": "CRIMJ", "number": "431", "credits": "3 Credits", "description": "The identification of correctional problems and the setting of objectives as reflective of court rulings, legislative change, and administrative law.", "prerequisite": "CRIMJ100 , CRIMJ113   CRIMJ230 or permission of program"}, {"department": "CRIMJ", "number": "432", "credits": "3 Credits", "description": "This course examines the American court system including structure and the way courts process offenders with special focus on sentencing.  CRIM (CRIMJ) 432 Crime and the American Court System (3) CRIM/CRIMJ 432, Crime and The American Court system, studies the courts from the lower courts to the Supreme Court and the various actors that play important roles in the functioning of the courts. First, the course studies the jurisdictions of the various courts and their organization in various state systems as well as the federal courts as well as the organization of state and federal administrative offices that manage the courts including the training of judges and the preparation of the court budget. Subsequent to the development of the basic understanding of the court jurisdiction and organization, the class studies the roles of the key actors in the day-in and day-out operation of the courts. In the spotlight are judges, prosecutors and defense attorneys although the role of the probation officers and clerk of courts are also intertwined with the processing of defendants. Of particular importance in this component of the course is the development of what is referred to as the court community and the focal concerns and goals that the court must consider as it processes cases. An, understanding of court community and focal concerns serves as crucial context for understanding the role of public policy as it attempts to shift or change the decision making of the court. One important dynamic of this course is the understanding that the court, although functioning as an institution to provide a neutral field on which accusations of criminality are to be played out, operates similarly to other organizations in that they are to be efficient (move cases with minimum overhead) and to be effective (provide justice, and protect the public). How the courts balance these competing demands and the informal processes that emerge in the processing of defendants is the key focus of the class. Finally, the course explores the attempts to reform the courts from the sentencing reforms such as determinate sentencing, mandatory minimums including '3 strikes' and sentencing guidelines. These issues highlight the political context of the courts and adaptability of the courts to attempts to change their values, and decisions. This course serves as one core 400-level course in the major. Each student must take two of the five core 400-level courses.", "prerequisite": "CRIM 100", "other": ["Cross-listed with: CRIM 432"]}, {"department": "CRIMJ", "number": "435", "credits": "3 Credits", "description": "This course provides knowledge about government organizations charged with American border security, guiding laws and policies.  CRIMJ 435 Border Security (3) The Border Security course provides depth of knowledge of key border issues for students of homeland security. The course achieves this goal by focusing on border integrity strategies, the motivation and nature of criminal and other organizations which violate borders, the policies established by governments to maintain border integrity, identification of the key players in maintaining the border, and the relevant legal issues in enforcing laws on the border. This course allows the student to apply principles and concepts of homeland security to a specialized and very relevant area.", "prerequisite": "6th semester standing"}, {"department": "CRIMJ", "number": "439", "credits": "3 Credits", "description": "Analysis of political terrorism as a violent alternative for peaceful change and traditional warfare in the nuclear age.", "prerequisite": "CRIMJ100 or PL SC014 , or permission of program", "other": ["Cross-listed with: PLSC 439", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIMJ", "number": "441", "credits": "3 Credits", "description": "Historical and contemporary view of the juvenile justice system. Focus on analyzing components of the system, their interactions, processing, and handling of youths.  CRIMJ 441 CRIMJ (CRIM) 441 Delinquency and Juvenile Justice (3) This course examines delinquency and the juvenile justice system from a variety of viewpoints. It looks at the problems the system is expected to address, how the problems have changed through the ages, how the current juvenile justice system developed, and the programs used to prevent and control delinquency and their effectiveness. By the end of the course, students should be able to think critically about the research and issues in the field. Evaluation methods include exams, brief writing assignments and a longer paper on policy issues. Students will be evaluated through brief written assignments, a term paper, a mid-term essay, and essay final. This course will be offered twice a year with 60 seats per offering. Students in the major may select CRIM (CRIMJ) 441 as one of several required courses in either the BA or BS program. This course is one of the core courses in the curriculum from which students must choose six credits from five core courses offered. It also serves as one of the supporting courses in the curriculum from which the students must take six credits at the 400-level.", "prerequisite": "CRIMJ100", "other": ["Cross-listed with: CRIM 441", "United States Cultures (US)"]}, {"department": "CRIMJ", "number": "441W", "credits": "3 Credits", "description": "Historical and contemporary view of the juvenile justice system. Focus on analyzing components of the system, their interactions, processing, and handling of youths.", "prerequisite": "CRIMJ100 or permission of program", "other": ["Writing Across the Curriculum"]}, {"department": "CRIMJ", "number": "450W", "credits": "3 Credits/Maximum of 6", "description": "Capstone course exploring past, current and future developments in criminal justice.", "prerequisite": "CRIM 100", "other": ["Writing Across the Curriculum"]}, {"department": "CRIMJ", "number": "451", "credits": "3 Credits", "description": "This course focuses on the significance of race, class, and ethnicity to criminal justice processing and criminal offending.  CRIMJ 451 CRIMJ (CRIM) 451 Race, Crime, and Justice (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. This class is designed to explore the relationship between the criminal justice system and racial minorities in the United States. Students will examine theoretical issues of race and justice, as well as empirical understandings of the relationship between race, crime, and the criminal justice system. Students will endeavor to understand some of the economic, political, and sociological reasons why racial minorities are over-represented in the criminal justice system. Students will also explore normative issues of justice and equity in broader social interactions that influence and are influenced by crime and the criminal process.This course may be used towards the additional courses requirements for the CLJ BS/BA and ADM J degrees. It will also satisfy the Intercultural/International competence (GI). Students will be evaluated by a midterm and final exam, a term paper and class participation. This course will be offered twice a year with 60 seats per offering.", "prerequisite": "CRIMJ100", "other": ["Cross-listed with: CRIM 451", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"department": "CRIMJ", "number": "453", "credits": "3 Credits", "description": "This course focuses on the experiences of women as offenders, victims, and professionals in the criminal justice system. CRIMJ 453 / CRIM 453 / WMNST 453 Women and the Criminal Justice System (3) (US) The course will examine the role of women in the criminal justice system and look at the issues related to women as offenders, victims of crime, and as professionals in the system. Students will gain an understanding of the issues concerning women in the criminal justice system, examine how societal arrangements affect women as offenders, victims, and criminal justice professionals, and better understand the overlooked problems faced by women in the criminal justice system. Students will be evaluated on the basis of exams, presentations, and papers. CRIMJ 453 / CRIM 453 / WMNST 453 is a supporting course for both WMNST and CLJ majors, as well as the WMNST minor. This course may also be used to satisfy a GI requirement. This course will be offered twice a year with 60 seats per offering.", "prerequisite": "CRIMJ100 or WMNST100", "other": ["Cross-listed with: CRIM 453, WMNST 453", "United States Cultures (US)"]}, {"department": "CRIMJ", "number": "455", "credits": "3 Credits/Maximum of 3", "description": "This course will examine some of the current and most pertinent issues facing law enforcement today. This course will examine some of the current and most pertinent issues facing law enforcement today. The course is designed to provide both insight and application of some of the fundamentals necessary to be successful as a law enforcement professional. An interactive and collaborative learning approach will focus on various topics of concern which are vital to effective law enforcement personnel. Examples of these topics may include; use of force, drug enforcement, search and seizure, interviewing and interrogation, stress in policing, as well as any other topics which may develop as an issue of concern for law enforcement.", "prerequisite": "CRIMJ 100"}, {"department": "CRIMJ", "number": "457", "credits": "3 Credits", "description": "Although violent crime has generally been on the decline since the mid-1990's, the subjects of gun ownership, gun violence, and gun control have become ubiquitous in election campaigns. This course explores the historical, legal, and cultural context of this debate. To address historical context, the course examines the US. Constitution, early U.S. history, and American gun culture. The course then shifts to modern history to outline what is known about gun ownership and gun crime today. With this background, students explore both sides of the gun control debate and resulting legislation from the 1800's to the present. Current laws regulating gun ownership and purchase, conceal carry and self-defense are also addressed. Law enforcement efforts, including crime scene investigation, are explored. Lastly, the course highlights examples of international and transnational efforts related to gun control and trade.. Students will have the opportunity to explore controversial gun-related topics in an independent course project. At the completion of this course, students will be able to: 1. Describe the early history of gun ownership in the U.S. 2. Detail the known trends in gun ownership and the life cycle of a gun. 3. List arguments for and against regulation of gun ownership. 4. Describe the laws regulating gun ownership, purchase, and conceal carry. 5. Detail law enforcement and legislative efforts to restrict or deter the use of guns in crime. 7. Identify examples of international and transnational attempts to address gun ownership and trade. 8. Detail and evaluate the future of a modern issue related to firearms and Criminal Justice.", "prerequisite": "CRIMJ 100"}, {"department": "CRIMJ", "number": "460", "credits": "3 Credits", "description": "Historical development of criminal justice system components (police, courts, corrections) related to formulation and function of the state.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIMJ", "number": "462", "credits": "3 Credits", "description": "A comparison of American and selected foreign justice systems to illustrate the variety of possible responses to crime.", "prerequisite": "CRIMJ100 or permission of program", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIMJ", "number": "465", "credits": "3 Credits", "description": "Ethical behavior in the criminal justice system.", "prerequisite": "CRIMJ100 or permission of program"}, {"department": "CRIMJ", "number": "467", "credits": "3 Credits", "description": "Law and society studies the social origins of law and legal systems; occupational careers, and decision-making of legal officials.  SOC (CRIMJ/CRIM) 467 Law and Society (3) (BA) This course meets the Bachelor of Arts degree requirements.Law and society teaches students' knowledge of key concepts and core ideas about the role of law in society. The course will cover the basics of key legal philosophies, major social science theories of law and society, research in law and society, the structure of the legal profession, and vital contemporary issues involving the role of law in society. CRIM/CRIMJ 113 and CRIM/CRIMJ 250W are prerequisites. The evaluations methods will include written assignments on course readings, and essay-style exams. Law and Society may be counted toward the credits required for the B.A. and B.S. in Crime, Law and Justice. It would fulfill one of the 400-level requirements in the 'Law' component of the major. The course may also be counted toward credits required for the B.A. and B.S. in Sociology for students with the Deviance and Criminology specialization.", "prerequisite": "CRIM 12", "other": ["Cross-listed with: CRIM 467, SOC 467", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "CRIMJ", "number": "469", "credits": "3 Credits", "description": "Examines the history and dimensions of drug use and analyzes the impact of drug policy.  CRIMJ 469 / HIST 469 Drugs and Drug Policy in the United States (3) For nearly a century, the United States has been waging its version of a hundred years' war on drugs, spending billions of dollars and incarcerating thousands of offenders while failing to significantly reduce the use of illicit drugs. This course examines drug use in a historical context while addressing the changing nature and dimension of drug use, including the pharmacology of drugs, patterns of drug use, and sentencing policies. Because drug control is inextricably linked to social, political, and public policy, the course will provide the student with a foundation for critical thinking and rational decision making relative to the efficacy of the various drug control initiatives. Since drugs seemingly permeate every level of American society and directly or tangentially touch most Americans' lives, issues such as drug testing in the workplace, the use of drug courier profiles, legalized medical marijuana, and needle exchange programs are evaluated. Students will be expected to learn the pharmacology of various drugs, the history of drug use in the United States since the colonial era, the evolution of federal drug agencies, and acquire knowledge about contemporary drug issues. They also will be expected to develop and strengthen their critical thinking skills as they assess the consequences of implementing particular anti-drug policies and their impact on reducing the use of illicit drug use. An example of the evaluation methods would be: students will be evaluated on the basis of three exams and four \"think pieces\" (requiring students' critical responses to an assigned topic) scheduled throughout the semester. Class attendance also will influence the grade. Faculty Member Proposing Course : John C. McWilliams", "prerequisite": "CRIMJ100 or HIST 021", "other": ["Cross-listed with: HIST 469", "Bachelor of Arts: Humanities"]}, {"department": "CRIMJ", "number": "471", "credits": "3 Credits", "description": "Civil law issues within a justice agency and between criminal justice agencies and members of the public.", "prerequisite": "CRIMJ100"}, {"department": "CRIMJ", "number": "473", "credits": "3 Credits", "description": "Law of evidence and proof, constitutional constraints on police procedures (arrest, search, etc.) in society and the business community.", "prerequisite": "CRIMJ100"}, {"department": "CRIMJ", "number": "482", "credits": "3 Credits", "description": "Relates organizational and public policy management approaches to police, courts, and correctional institutions.  CRIM (CRIMJ) 482 Seminar, Criminal Justice Agency Administration (3) In this course, you will learn about the nature of criminal justice organizations, individual and group behavior within the system, and the issues involved in reforming the system. This course will NOT teach you how to become an administrator in the criminal justice system, but hopefully will teach you about the issues and theories surrounding organizations and reform-and most importantly, teach you to think and communicate (in both written and verbal form). After taking this course, you should have a more accurate perception of criminal justice organizations and have a better understanding of the complexity surrounding the administration and management of these organizations. Criminal Justice Agency Administration may be counted toward the credits required for the B.A. and B.S. in Crime, Law, and Justice.", "prerequisite": "CRIM 100", "other": ["Cross-listed with: CRIM 482"]}, {"department": "CRIMJ", "number": "489W", "credits": "3 Credits", "description": "This course uses medical, social scientific and legal research to study the complexities of predatory crime.  CRIMJ 489WCRIMJ 489W Victimology: Predatory Crime (3) This course builds upon CRIMJ 407, Victimology. Students are directed toward the development of forensic knowledge, crime scene analysis, comprehension of predatory injuries, films, and current serial crimes to initiate research and critical thinking. Issues such as gender, family abuse, protective services, trends in victim selection, and societal responses provide numerous opportunities for learning communities and interaction with other classes. The use of WEB based assignments and Department of Justice information encourages students to expand their research skills for writing assignments, short research papers, and legal research. The course also uses graphic slides to introduce students to the reality of physical and sexual child abuse, sexual assault, and homicide. Students are expected to review anatomy and use proper terminology when speaking about predatory behavior, victimization injuries, and psychological issues. Crime classification is introduced using the Federal Bureau of Investigation Manual and the DSM IV is used to classify aberrant behavior. Research completed by leaders in the field are assigned readings and special topics such as female serial killers, angels of death, spree killers, and terrorism provide a basis for class discussions and projects. The course also includes the \"high crime low-war\" classification of international terrorism and concepts of lethality of attack.", "prerequisite": "CRIMJ407", "other": ["Writing Across the Curriculum"]}, {"department": "CRIMJ", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.  CRIMJ 494CRIMJ 494. Research TopicsThis common course will focus on specific research issues. Issues to be covered will be social violence, legal issues, and impact on crime control. Students will study the design and implementation of topical issues as they address specific issues. The course will add to the diversity offerings within the criminal justice program.Facult member proposing course: M. A. DuPont-Morales"}, {"department": "CRIMJ", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "CRIMJ", "number": "495", "credits": "3-12 Credits/Maximum of 12", "description": "Experience with a criminal justice agency coordinated through readings and discussion.", "prerequisite": "CRIMJ100"}, {"department": "CRIMJ", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall ourside the scope of formal courses."}, {"department": "CRIMJ", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "CRIMJ", "number": "499", "credits": "6 Credits", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]