[{"department": "DANCE", "number": "100", "credits": "3 Credits", "description": "Explore dance as a vital, communicative and performing art, reflecting social values and cultural beliefs. DANCE 100 Dance Appreciation (3) (GA;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. An introduction to dance as a vital, communicative and performing art reflecting social values and cultural beliefs. Through a combination of lectures, video samples, and active participation in scheduled movement classes, lecture demonstrations and live performances, this course will examine a wide range of dance across cultures and time periods. Students will learn to identify the key components of movement: time, space, shape and effort. Once identified, these elements will become the building blocks for further analysis and understanding of the myriad forms of movement that can be called dance. Emphasis will be placed on the integration of dance within various cultural belief systems and the relationship between dance and cultural identity. The influence of social and political values as they relate to the development of specific dance forms will also be examined. Students will be graded on their ability to clearly and intelligently articulate their observations and analysis through participation in threaded discussions and online quizzes. Students will also be graded on their level of participation in scheduled movement classes, lecture demonstrations and attendance at live performances. The mid-term and final exams will assess the student's ability to integrate and synthesize the experiential components of the course.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "DANCE", "number": "170", "credits": "1.5 Credits/Maximum of 3", "description": "This course is designed to improve technique through strengthening, toning, improving coordination, increasing balance, and helping alignment. The course also addresses common areas of injury. Dance Conditioning is designed to enhance the efficiency of movement and body usage by applying a mind-body for increasing strength and flexibility in the body. Dance is both athletics and an art form, and equal training is essential for both. This course applies the tools and principles of athletic dance training to health and fitness for the non-dancer to achieve efficient and effective usage of the body while increasing well-being. In addition to increased strength, muscle tone, and flexibility the Kinesthetic and proprioceptive senses are developed resulting in greater balance, coordination, and dynamic alignment. The course completes with the creation of a Personal Practice.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "DANCE", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "DANCE", "number": "220", "credits": "1.5 Credits/Maximum of 3", "description": "Mojah introduces intermediate/advanced level dance students to a unique dance technique that blends Horton, Dunham, West African and jazz movements in one form.  DANCE 220 Mojah Fusion Dance (1.5 per semester/maximum of 3) DANCE 282 is an introduction to the Mojah dance form. Moja is a Swahili term meaning one. Mojah fuses various forms to create a unique style of modern African dance that blends Horton, Dunham, West African and jazz movements into one form. The objectives of the course include: learning/executing Mojah terminology and technique; and learning/executing the techniques from which Mojah is derived. Mojah is a dance course and is directly related to other dance courses, theatre/arts courses and African American studies courses.", "prerequisite": "DANCE 222"}, {"department": "DANCE", "number": "221", "credits": "1.5 Credits", "description": "Africa, with its diverse people, languages, and history has a rich cultural foundation that includes many artistic elements including music, dance, folk tales, poems, graphic/plastic arts, mask making and more. According to Lynne Emery, author of Black Dance in America, \"music and dance are two of the most highly developed of the arts and the complexities of African rhythmic structure. . . dance is a fundamental element of African aesthetic expression that historically was recreational and secular, but in one form or another pervaded all of African life.\" This course will introduce you to traditional West African based dance movements and culture. The course focuses on integrating music, movement, drama, costume, and vocalization."}, {"department": "DANCE", "number": "222", "credits": "1 Credits", "description": "Beginning Hip Hop dance introduces the student to Hip Hop culture through dance, free expression with the body/freestyle and choreography.  DANCE 222 Beginning Hip Hop Dance (1) Hip Hop dance is designed for students with an interest in Hip Hop dance/culture. This class introduces students to Hip Hop through movement that includes freestyle dancing, locomotive movements, and choreography. In addition, this class includes lecture sessions and discussions about Hip Hop culture and its role in society. This course seeks to introduce students to a culturally significant art form, enhance mind/body awareness, and provide practical opportunities for students to apply skills learned in class via performances. This course is directly related to dance, theatre, African American history and other arts based and humanities based courses."}, {"department": "DANCE", "number": "225", "credits": "1.5 Credits/Maximum of 6", "description": "Introduction to Hip Hop. Dance 225 Intro to Hip Hop (1.5 per semester/maximum of 6) (GA) (BA) This course meets the Bachelor of Arts degree requirements. Dance 225 is an introduction to Hip Hop and the many elements of this genre of dance. The course is designed for any student with an interest in Hip Hop. This class explores the many influences and components of Hip Hop developed through history. Emphasis is placed on the development of technique, expression, and performance. Each semester the student will be introduced to different aspects of Hip Hop which will require an increasing awareness of Hip Hop and its' impact on all of dance. Technique classes will be supported through viewing historical and contemporary dance footage. In every class, daily movement experiences will be introduced to build coordination, self-awareness, strength and flexibility, as well as the understanding of the Hip Hop genre of dance.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "230", "credits": "1.5 Credits/Maximum of 6", "description": "An exploration of Ballet technique.  DANCE 230 Ballet (1.5 per semester/maximum of 6) (GA)(BA) This course meets the Bachelor of Arts degree requirements. DANCE 230 is an exploration of Ballet technique. The course is designed for any student with an interest in Ballet and to support the Dance Studies Minor. This class explores the many styles and genres of Ballet developed through history. Emphasis is placed on the development of a strong technique, vocabulary, and performance. Ballet, as a technique class, has at its core, increasing the strength, alignment and flexibility of each dancer. Each semester, the dancer will be introduced to different aspects of ballet which will require an increasing awareness of ballet and its' impact on all of dance. Technique classes will be supported through viewing historical and contemporary dance footage. In every class, daily movement experiences will be introduced to build coordination, flexibility and strength, as well as the understanding of the ballet technique. These experiences will take place at the barre, in the center floor, adagios and allegros, and culminate in a combination of all these experiences in a combination to develop their potential as a performer.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "231", "credits": "1.5 Credits", "description": "An introduction to the techniques of ballet.  DANCE 231 Beginning Ballet I (1)In DANCE 231, the student will learn the basics of ballet. These include the structure of a ballet class and the required focus and behavior of the successful student, as well as the fundamental positions and vocabulary of movement characteristic of ballet. The course is designed for any beginning student of ballet and, in particular, to instruct the first-year BFA Music Theatre candidate with a foundation of technique to support their success in the prescribed sequence of dance courses in that major. The student will be introduced to alignment exercises from the Zena Rommett floor barre technique and the Pilates technique to develop strength and flexibility in their execution of dance. The course also is designed to help the student develop greater physical self-awareness and discipline. The student's grade is determined by their attendance, attitude, and progress. More than three absences or lateness will affect the grade. Their attitude should be positive, receptive to correction, and exhibit an eagerness to work, and their progress should reflect growth in their abilities to perform the choreography and to know the terms used. The student will be required to identify and explain the meaning of the terms used in class, as well as perform choreography with confidence and a sense of character. This course serves as a prerequisite for DANCE 232. Together, these two semesters satisfy requirements for the BFA Music Theatre option and can also fulfill optional requirements for the Dance Minor. For the BFA Music Theatre candidates: part of the final exam for this course will be a performance juried by members of the School of Theatre Performance Faculty. Their evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance course sequence. Required dress for this course for women is black leotard, pink or tan tights, pink ballet shoes and for men is black tights, white t-shirt, black ballet shoes, and dance belt. Belts, suspenders, leg warmers are optional. Sweat clothes are not to be worn. All hair must be secured so that it cannot fly into the face.", "prerequisite": "Admission into THRMT_BFA major"}, {"department": "DANCE", "number": "232", "credits": "1.5 Credits", "description": "A continuation of Beginning Ballet I to augment technical proficiency.  DANCE 232 Beginning Ballet II (1)DANCE 232 allows the student who has successfully completed DANCE 231 to continue broadening their knowledge of fundamental movements in ballet. The barre warm-up and the center floor work is more demanding and challenges the student to learn the combinations of movement quicker. Choreography is more complex, involving more different kinds of turns, large jumps, and adding beats to the petit allegro. Adagios are longer and demand more stamina to sustain. The ability to communicate character and mood through dance is emphasized more strongly. The student will deepen their knowledge of the Zena Rommett floor barre techniques and Pilates techniques to develop more strength and flexibility. The development of increased self-awareness and discipline is stressed. The student's grade is determined by their attendance, attitude, and progress. Also, to supplement their understanding of the variety of ways ballet can be performed, the student is required to write two papers, expressing their reactions to two different dance concerts viewed during the semester. Classical ballet concerts are preferred, but the student is encouraged to consult the instructor concerning a performance they are interested in viewing. Dates will be designated for the completion of these papers. No late papers will be accepted. Attendance is mandatory; more than three absences or lateness will affect the grade. The attitude should be positive, receptive to correction, and exhibit an eagerness to work, and the student's progress should reflect growth in their ability to perform the choreography and to know the terms used. The student will be required to identify and explain the meaning of the terms used in class, as well as perform choreography with confidence and a sense of character. Students enrolling in this course should have successfully complete DANCE 231 or have received the permission of the instructor. For the BFA Music Theatre candidate, this course serves as a prerequisite for DANCE 241, Beginning Jazz I. Part of the final exam for this course will be a performance juried by members of the School of Theatre Performance Faculty. Their evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance course sequence. Required dress for this course for women is black leotard, pink or tan tights, pink ballet shoes and for men is black tights, white t-shirt, black ballet shoes, and dance belt. Belts, suspenders, leg warmers are optional. Sweat clothes are not to be worn. All hair must be secured so that it cannot fly into the face.", "prerequisite": "DANCE 231"}, {"department": "DANCE", "number": "240", "credits": "1.5 Credits/Maximum of 6", "description": "An exploration of jazz dance technique throughout history. DANCE 240 Jazz Dance (1.5 per semester/maximum of 6) (GA) (BA) This course meets the Bachelor of Arts degree requirements. DANCE 240 is an exploration of Jazz Dance. The course is designed for any student with an interest in Jazz Dance and to support the Dance Studies Minor. This class explores the many styles and genres of jazz dance developed through American history. Emphasis is placed on the development of a personal jazz dance style, exploration, and self-expression. Jazz dance, as a technique class, has at its core, increasing the strength, alignment and flexibility of each dancer. Each semester the dancer will be introduced to different styles of jazz which will require a changing perspective of the body and its' movement. Movement classes will be supported through viewing a variety of the dance styles being studied. In each style, daily movement experiences will be introduced to build coordination, flexibility and strength, as well as the understanding of the particular jazz dance idiom. These experiences will take place in the center floor, across the floor accumulations, and culminate in a combination of all these experiences in a dance to develop their potential as a performer. Connections to the social aspect of jazz dance will be consistently addressed, as all dance forms are vernacular in origin. Jazz dance, being a true American dance form, has its roots in the late 1800's and early 1900's with a pre-history in Africa and West Indies. The desire for self-expression through physical movement drove the dance form to a formal art expression on the concert stage. This connection to the vernacular has been maintained in the jazz dance idiom. The exploration in Jazz Dance emphasizes the individual expression through movement in response to music particular to the style being presented in each semester.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "241", "credits": "1.5 Credits", "description": "An introduction to the techniques of Jazz dance.  DANCE 241 Beginning Jazz I (1)DANCE 241 is an introduction to basic jazz techniques. The course is designed for any beginning student with an interest in jazz dance, those who are BFA Music Theater candidates, and Dance Minors. The work will include awareness of space as related to the barre, floor, other dancers, and environment. The student will learn basic jazz dance vocabulary as well as the awareness of space to stage elements such as audience, direction, focus, and energy. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. More than three absences or lateness will affect the grade. Maintaining a positive attitude, proper discipline, and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). Students are responsible for learning and executing all material taught in class. This course serves as a prerequisite for DANCE 242. Together, the two semesters of jazz satisfy requirements for the BFA Music Theater option and the Dance Minor. The BFA Music Theater student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: Jazz shoes, t-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: Jazz shoes, leotard and tights (possible character shoes).", "prerequisite": "DANCE 232"}, {"department": "DANCE", "number": "242", "credits": "1.5 Credits", "description": "A continuation of Beginning Jazz I to augment technical proficiency.  DANCE 242 Beginning Jazz II (1)DANCE 242 allows the student who has successfully completed DANCE 241 to continue to broaden their knowledge of beginning jazz dance. The course will emphasize a broader dance vocabulary and more complex dance combinations. The repetition and rehearsal techniques will be reinforced and intensified. The ability to communicate character and setting through dance is strongly emphasized. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. More than three absences and lateness will affect the grade. Maintaining a positive attitude, proper discipline, and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). Students are responsible for learning and executing all material taught in class. Students enrolling in this course should have successfully completed DANCE 241 or have permission of the instructor. JAZZ 242 satisfies requirements for the BFA Music Theater option and the Dance Minor. The BFA Music Theater student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: Jazz shoes, t-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: Jazz shoes, leotard and tights (possible character shoes).", "prerequisite": "DANCE 241"}, {"department": "DANCE", "number": "250", "credits": "1.5 Credits/Maximum of 6", "description": "An exploration of tap dance technique throughout history.  DANCE 250 Tap Dance (1.5 per semester/maximum of 6) (GA)(BA) This course meets the Bachelor of Arts degree requirements. DANCE 250 is an exploration of Tap Dance. The course is designed for any student with an interest in Tap Dance and to support the Dance Studies Minor. This class explores the many styles and genres of Tap Dance developed through American history. Emphasis is placed upon the understanding of the origins of tap, exploration, and self-expression. Tap Dance is grounded in rhythm, exploration and importance of improvisation and origins with a focus on the entertainment component.DANCE 250 will introduce the dancer to different styles of tap, which will require a changing perspective of rhythm and expression. In each style, daily movement experiences will be introduced to build coordination, stamina and flexibility with rhythms, as well as the understanding of the particular historical aspect of Tap Dance. These experiences will take place in the center floor, across the floor accumulations, and culminate in a combination of all these experiences in a dance to develop their potential as a performer.The origins and influences of tap are rich and deep, imbedded in the history of the country and the people. The richness of this history allows the dancer to take on a personal and individual style important to the further development of tap and dance in general. Tap Dance will emphasize this importance and assist the student in their exploration of this dance form.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "251", "credits": "1.5 Credits", "description": "An introduction to the technique of tap dance.  DANCE 251 Beginning Tap I (1)DANCE 251 is an introduction to basic tap techniques. The course is designed for any beginning student with an interest in tap dance, those who are BFA Music Theater candidates, and Dance Minors. The work will include awareness of space, sound, rhythm, and tempo. The work will also introduce counting, executing rhythm, and developing confidence for a beginner level tap dancer. The student will learn basic tap vocabulary as well as the awareness of space and stage elements such as audience, direction, focus, and energy. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. More than three absences or lateness will affect the grade. Maintaining a positive attitude, proper discipline, and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). Students are responsible for learning and executing all material taught in class. This course serves as a prerequisite for DANCE 252. Together, the two semesters of jazz satisfy requirements for the BFA Music Theater option and the Dance Minor. The BFA Music Theater student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: tap shoes, or hard soled shoes with taps attached. T-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: tap shoes, leotard and tights (possible character tap shoes). The clothing must allow movement, and still be able to distinguish an outline of the dancer's body.", "prerequisite": "DANCE 232"}, {"department": "DANCE", "number": "252", "credits": "1.5 Credits", "description": "A continuation of Beginning Tap I to augment technical proficiency.  DANCE 252 Beginning Tap II (1)DANCE 252 allows the student who has successfully completed DANCE 251 to continue to broaden their knowledge of beginning tap dance. The course will emphasize a broader dance vocabulary and more complex dance combinations. The repetition and rehearsal techniques will be reinforced and intensified. The ability to communicate character and setting through dance is strongly emphasized. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. More than three absences or lateness will affect the grade. Maintaining a positive attitude, proper discipline, and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). They are responsible for learning and executing all material taught in class. Students enrolling in this course should have successfully completed DANCE 251 or have permission of the instructor. Tap DANCE 252 satisfies requirements for the BFA Music Theater option and the Dance Minor. The BFA Music Theater student will be juried by the School of Theatre Performance Faculty as part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: tap shoes, or hard soled shoes with taps attached. T-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: tap shoes, leotard and tights (possible character tap shoes). The clothing must allow movement, and still be able to distinguish an outline of the dancer's body.", "prerequisite": "DANCE 251"}, {"department": "DANCE", "number": "260", "credits": "1.5 Credits/Maximum of 6", "description": "Introduction to Modern Dance. DANCE 260 Intro to Modern Dance (1.5 per semester/maximum of 6) (GA) (BA) This course meets the Bachelor of Arts degree requirements. DANCE 260 is an introduction to modern dance and the many elements of this vast form of dance. The course is designed for any student with an interest in Modern Dance and to support the Dance Studies Minor. This class explores the many influences and components of modern dance developed through history. Emphasis is placed on the development of strong technique, performance and exploration. Each semester the dance will be introduced to different aspects of modern dance which will require in increasing awareness of modern dance and its' impact on all of dance. Technique classes will be supported through viewing historical and contemporary dance footage. In every class, daily movement experiences will be introduced to build coordination, self-awareness, strength and flexibility, as well as the understanding of modern dance.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "261", "credits": "1.5 Credits/Maximum of 6", "description": "Introduction to modern dance as an art form; development of dance technique and composition; teaching methods for improvisational skills.  DANCE 261 Beginning Modern Dance I (1.5) (GA) (BA) This course meets the Bachelor of Arts degree requirements.DANCE 261 is an introduction to Modern Dance. The course is designed for any student with an interest in Modern Dance and Dance Minors. This class explores the use of weight, time, space, and energy in relation to a release based modern dance technique. There is emphasis placed upon the development of a personal movement vocabulary, experimentation, and self-expression. Modern dance is grounded in somatic practices with importance placed upon finding organic or efficient ways to engage the body in movement. Students should demonstrate an opening and willing attitude in every class situation. Students are responsible for learning and executing all material taught in class. This class serves as a prerequisite for DANCE 262. Together these two semesters serve as core technique classes for all dance minors.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "DANCE", "number": "262", "credits": "1.5 Credits", "description": "A continuation of Beginning Modern Dance I to augment technical proficiency and to further comprehension of choreographic methods.  DANCE 262 Beginning Modern Dance II (1.5)DANCE 262 is a continuation of Beginning Modern Dance I. The course is designed for any student with an interest in Modern Dance and Dance Minors. This class explores the use of weight, time, space, and energy in relation to a release based modern dance technique. There is emphasis placed upon the development of a personal movement vocabulary, experimentation, and self-expression. Modern dance is grounded in somatic practices with importance placed upon finding organic or efficient ways to engage the body in movement. The students grade is based upon attendance, participation, attitude, progress, keeping a dance journal, setting dance goals, doing a mid-semester self evaluation, and attending a mid-semester 'check-up' with the instructor. More then three absences (excused or unexcused) will automatically drop the final grade one letter. Students should demonstrate an opening and willing attitude in every class situation. Students are responsible for learning and executing all material taught in class. Beginning Modern Dance I and Beginning Modern Dance II serve as core technique classes for all dance minors.", "prerequisite": "DANCE 261"}, {"department": "DANCE", "number": "270", "credits": "3 Credits", "description": "Physical and theoretical approach to movement:  facilitates efficiency, and expression through dynamic alignment, mobility, kinesthetic awareness; reduce physical injuries.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "270Z", "credits": "3 Credits", "description": "Physical and theoretical approach to movement: facilitates efficiency, and expression through dynamic alignment, mobility, kinesthetic awareness; reduce physical injuries.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "280", "credits": "1 Credits", "description": "Introduction to the concepts and techniques of dance improvisation."}, {"department": "DANCE", "number": "285", "credits": "1-2 Credits/Maximum of 8", "description": "Contemporary Dance Performance is designed to introduce the beginning performer to the choreographic and rehearsal process as preparation for performance.  DANCE 285 Contemporary Dance Performance (1-2 per semester/maximum of 8) This is a dance course to introduce the beginning performer to the rehearsal process, creative process and performance experience. The class will develop around the building of an original dance piece, created on and for the participating students by the instructor of record.The students will perform this piece at the end of the semester in a formal performance situation, on a proscenium stage with full lighting and sound accompaniment. The instructor will create an original dance on students enrolled in this course which will provide the student with performance experience in a live dance concert. The student will learn original choreography, be responsible for retention of movement, experience and assist in the choreographic process, participate in discussions concerning choreography, expression, rehearsal expectations and roles. The student will keep a journal and complete written assignments which demonstrate cognitive understanding of the artistic process.Each student will be expected to execute the choreography at a level suitable for concert performance, show an understanding of the choreographic process through written work, demonstrate growth as a dancer and artist through performance and written work and participate fully in a concert performance of the dance work created in class."}, {"department": "DANCE", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "DANCE", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "DANCE", "number": "301", "credits": "2 Credits", "description": "Introduce student to principles of practical and abstract movement analysis to determine individual physical limitations and potentials."}, {"department": "DANCE", "number": "320", "credits": "1.5 Credits/Maximum of 9", "description": "Intermediate Mojah continues instruction for intermediate level dance students and builds on the technical training of Beginning Mojah 7.  DANCE 320 Intermediate Mojah Fusion Dance (1.5 per semester maximum of 9) Intermediate Mojah Fusion Dance builds upon the foundations of Beginning Mojah dance. Moja is a Swahili term meaning one. Mojah fuses various forms into one to create a unique style of modern African dance based in Horton, Dunham, West African and jazz movements.", "prerequisite": "DANCE 220"}, {"department": "DANCE", "number": "331", "credits": "1.5 Credits/Maximum of 6", "description": "A continuation of the course work established in Beginning Ballet II.  DANCE 331 Intermediate Ballet I (1) Dance 331 allows the student who has had a solid introduction to the fundamental movements and style of ballet to develop more strength and flexibility in their technique. The pace of the class is faster. Choreography is more complex and taught more quickly. The student is expected to know the elements that constitute a ballet class and is ready to embrace seriously the study of the skill and artistry required to perform ballet. The student is expected to be able to execute a double pirouette and simple beats in petit allegro. Interpretation of choreography taught for exams is emphasized more strongly than in the previous courses. The attitude should be positive, receptive to correction, and exhibit an eagerness to work, and the student's progress should reflect growth in their abilities to perform the choreography and to know the terms used. The student will be required to identify and explain the meaning of the terms used in class, as well as perform choreography with confidence and a sense of character. Required dress for the course for women is black leotard, pink or tan tights, pink ballet shoes and for men it is black tights, white T-shirt, black ballet shoes, and dance belt. Belts, suspenders, leg warmers are optional. Sweat clothes are not to be worn. All hair must be secured so that it cannot fly into the face.", "prerequisite": "DANCE 230"}, {"department": "DANCE", "number": "332", "credits": "1.5 Credits/Maximum of 6", "description": "A continuation of the course work established in Intermediate Ballet I.  DANCE 332 Intermediate Ballet II (1) Dance 332 allows the student who has a strong background in the basics of ballet technique to be challenged with more difficult movements and choreography and to develop a more mature approach to healthy alignment. The Zena Rommett floor barre and the Pilades techniques will be explored with more emphasis than in the beginning semesters of ballet study. The student is expected to know the terms used in ballet in French, their meaning, and how to execute them. The student should be able to perform choreography with a sense of character and style, as well as strong technique. The attitude should be positive, receptive to correction, and exhibit an eagerness to work, and the student's progress should reflect growth in their abilities to perform the choreography and to know the terms used. Required dress for the course for women is black leotard, pink or tan tights, pink ballet shoes and for men it is black tights, white T-shirt, black ballet shoes, and dance belt. Belts, suspenders, leg warmers are optional. Sweat clothes are not to be worn. All hair must be secured so that it cannot fly into the face.", "prerequisite": "DANCE 230"}, {"department": "DANCE", "number": "341", "credits": "1.5 Credits", "description": "A continuation of the course work established in DANCE 242, Beginning Jazz II.  DANCE 341 Intermediate Jazz I (1) Dance 341 allows the student who has successfully completed Beginning Jazz II to continue to broaden their knowledge of Intermediate Jazz Dance. The purpose of this course is to improve the beginner's knowledge of jazz dance. Technique will be stressed, but performance and interpretation will be emphasized with the following in mind: to develop character, mood and ability to improvise and choreograph Jazz Dance. A variety of choreographed dances ranging from pop, jazz, to musical theatre styles will be taught. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. A positive attitude and maintaining proper discipline and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). They are responsible for learning and executing all material taught. Jazz Dance 341 satisfies the requirement for the BFA Music theatre option and fulfills one of the requirements for the Dance Minor. The BFA musical theatre student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may enroll into the next level of the performance sequence. The required dress for men: Jazz shoes, T-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: Jazz shoes, leotard and tights (possible character shoes).", "prerequisite": "DANCE 242"}, {"department": "DANCE", "number": "342", "credits": "1.5 Credits", "description": "A continuation of the course work established in DANCE 341, Intermediate Jazz I.  DANCE 342 Intermediate Jazz II (1) Dance 342 allows the student who has successfully completed Intermediate Jazz Dance I to continue to broaden their knowledge of Jazz Dance. The purpose of this course is to continue to improve the dancer's technical aspect of Jazz Dance. Combinations will be taught at a faster pace. Techniques will be stressed, but performance and interpretation will be emphasized with the following in mind: to develop character, mood and the ability to improvise and choreograph Jazz Dance. A variety of challenging choreographed dances ranging from pop, jazz, to musical theatre styles will be taught which the student will be expected to perform. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. A positive attitude and maintaining proper discipline and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). They are responsible for learning and executing all materials taught. Jazz Dance 342 satisfies the requirement for the BFA Music Theater option and fulfills one of the requirements for the Dance Minor. The BFA musical theatre student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: Jazz shoes, T-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: Jazz shoes, leotard and tights (possible character shoes).", "prerequisite": "DANCE 341"}, {"department": "DANCE", "number": "361", "credits": "1.5 Credits/Maximum of 6", "description": "This course is a development of techniques and principles of modern dance at the intermediate level. DANCE 361 Intermediate Modern Dance I (1.5), continues to build on the technical foundation from Beginning Modern I and Beginning Modern II in relation to a release-based modern dance technique. Along with technique, students should develop greater flexibility, strength, and alignment. The emphasis of this course is movement as a lexicon used with specificity for expression of context, content, metaphor, image, and representation. Through this course, students gain a greater understanding of the body as a vehicle for communication and develop skills for creating and performing a specific vocabulary for expression. This course builds upon exploring the use of weight, time, space, energy, initiation, isolation (gesture), integration (whole body or body segment), suspension, and grounding as well as the Bartenieff/Laban vocabularies.", "prerequisite": "DANCE 262", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "362", "credits": "1.5 Credits/Maximum of 6", "description": "This course is a continuation of Modern Dance to augment technical proficiency.  DANCE 362 Intermediate Modern Dance II (1.5) continues to build on the technical foundation from Intermediate Modern Dance I (DANCE 361) in relation to a release-based modern dance technique. This course also highlights elements of the genre Dance Theatre. This intermediate level class centers on continuing developing a strong technical foundation in modern dance and how to apply that in performance. Along with technique, students should develop greater flexibility, strength, and alignment. The concepts of weight, time, energy, and space are central to the class. The body as a tool of expression and communication and using dance as a language is stressed.   The emphasis of this course is movement as a lexicon used with specificity for expression of context, content, metaphor, image, and representation. Through this course, students gain proficiency in communication with the body and develop skills for creating and performing a specific vocabulary for expression. This course builds upon exploring the previous explorations and moves into a more formal structure of creating dance theatre. This class serves as a prerequisite for DANCE 461.", "prerequisite": "DANCE 361", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "DANCE", "number": "365", "credits": "3 Credits", "description": "An intermediate level modern dance technique utilizing improvisation to enhance technical and performance issues: alignment, connection, balance, transition, expression, discovery.  DANCE 365 Contemporary Movement Lab I (3) DANCE 365 is an intermediate level modern dance course utilizing improvisation as a tool for understanding technique and performance. This class is designed specifically for the Dance Studies Minor student to enhance the efficient and expressive use of the body as a vehicle for expression. The student will not only develop greater flexibility, strength, and alignment, but also will gain self-awareness and begin to develop a personal dance vocabulary.Contemporary Movement Lab I will meet four hours a week, with an additional 1 hour studio lab for personal discovery. CML I is designed to further expose the intermediate level dancer to the style and techniques of modern dance as it uses improvisation for expression and performance. The intermediate level dancer will be developed through more thorough movement requirements, floor work, and strengthening experiences with the support of improvisation as a tool. Full articulation of body, feet and arms will be fostered through regular exercises, which will bring about stronger connections through the body to support complicated and difficult movement. Each class period will allow time to be spent in the traditional aspects of an intermediate modern dance technique class: floor warm up and connection to center of weight, center floor balance and strengthening technique exercises and combinations, traveling sequences across the floor, and final accumulative combination.An equal amount of time will be spent in the exploration of improvisation: personal introspection, group interaction based on conceptual themes, weight sharing and beginning contact improvisational techniques, and development of a group structured performance improvisation. Improvisation will be explored regularly through individual and group work. The students will experience moving without specific directions for the body, but rather with directions for content, sensing, theme, or task oriented physicality. Observation of self and others will aid in the discovery of the freedom of moving improvisationally. Outside reading and follow up discussions will further support their experience in the studio. Discussion, journals, goal setting and writing assignments will allow for opportunities to express and share levels of comfort and personal discoveries with various experiences. This is an important aspect of the process of opening up to the act of improvisation.", "prerequisite": "DANCE 230"}, {"department": "DANCE", "number": "366", "credits": "3 Credits", "description": "An intermediate level modern dance technique utilizing composition to enhance technical and performance issues: alignment, connection, balance, transition, expression, discovery.  DANCE 366 Contemporary Movement Lab II (3) DANCE 366 is an intermediate level modern dance course utilizing the techniques, tools and theories of composition for understanding technique and performance. This class is designed specifically for the Dance Studies Minor student to enhance the efficient and expressive use of the body as a vehicle for expression. The student will not only develop greater flexibility, strength, and alignment, but also will gain self-awareness and further develop a personal dance vocabulary.Contemporary Movement Lab II will meet four hours a week, with an additional 1-hour studio lab for personal discovery. CML II is designed to further expose the intermediate level dancer to the style and techniques of modern dance as it uses composition for expression and performance. The intermediate level dancer will be further developed through a more thorough level of movement requirements: floor work, and strengthening experiences while exploring the connections of technique to composition and performance. Full articulation of body, feet and arms will be fostered through regular exercises, which will bring about stronger connections through the body to support complicated and difficult movement. Each class period will allow time to be spent in the traditional aspects of an intermediate modern dance technique class: floor warm up and connection to center of weight, center floor balance and strengthening technique exercises and combinations, traveling sequences across the floor, and final accumulative combination.An equal amount of time will be spent in discovering the many theories and tools of composition: time, weight, space, rhythm/phrasing, theme based creative experiences, and dance as a tool for communication. Students will be expected to create a variety of studies regularly through individual and group work. Outside reading and follow up discussions will further support their experience in the studio. Discussion, journals, goal setting and writing assignments will allow for opportunities to share and express levels of comfort and personal discoveries with various experiences.", "prerequisite": "DANCE 230"}, {"department": "DANCE", "number": "370", "credits": "3 Credits", "description": "The purpose of this course is to provide performers with anatomical theory and concepts to apply to movement. The course will progress through the body in systems as they relate to the biomechanics of movement and the body in performance. All body systems will be covered, but we will explore the musculoskeletal system in dept including specific bones and muscles most commonly used in the movement of the performing arts. Students will not only become proficient in the anatomy and physiology of the moving body, but also learn to apply this material to specific movements to facilitate the efficiency of movement in their area of interest. This course will be grounded in specific principles of western anatomy and physiology, but will also focus on application to analyze movements for the biomechanical basis that allows each movement, and the way the body system function and interact when performing. This knowledge is to aid in more efficient moving, peforming, better body awareness/understanding, and injury prevention. The class covers different topics each week and will build upon practices learned in each previous session. Within each class period, lecture will be immediately followed by experiential hands on exercises and experiential learning application.", "prerequisite": "DANCE 100", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "DANCE", "number": "370H", "credits": "3 Credits", "description": "To provide performers with anatomical theory and concepts applicable to the disciplines of the performing arts.", "other": ["General Education:  Natural Sciences (GN)"]}, {"department": "DANCE", "number": "370Z", "credits": "3 Credits", "description": "The purpose of this course is to provide performers with anatomical theory and concepts to apply to movement. The course will progress through the body in systems as they relate to the biomechanics of movement and the body in performance. All body systems will be covered, but we will explore the musculoskeletal system in depth including specific bones and muscles most commonly used in the movement of the performing arts. Students will not only become proficient in the anatomy and physiology of the moving body but also learn to apply this material to specific movements to facilitate the efficiency of movement in their area of interest. This course will be grounded in specific principles of western anatomy and physiology, but will also focus on application to analyze movements for the biomechanical basis that allows each movement, and the way the body systems function and interact when performing. This knowledge is to aid in more efficient moving, performing, better body awareness/understanding, and injury prevention. The class covers different topics each week and will build upon practices learned in each previous session. Within each class period, the lecture will be immediately followed by experiential hands-on exercises and experiential learning application.", "prerequisite": "DANCE 100", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "DANCE", "number": "381", "credits": "2 Credits", "description": "Introduction to the basic principles and craft of choreography.  DANCE 381 Dance Composition I (2)This course is an introduction to the basic principles and craft of the art of choreography. The students will work with the principles and craft of choreography through practical methods to foster and enhance the creative process with relation to the solo form. Each student will develop an understanding of the architectural strengths of the proscenium stage and how best to use these for the solo form; gain knowledge of professional working methods through the exploration and use of the choreographic tools; develop an individual vocabulary through improvisational and choreographic elements; gain a knowledge of the craft for original creative expression; and demonstrate an overall understanding of the course by choreographing an original solo work as a culminating project."}, {"department": "DANCE", "number": "382", "credits": "1.5 Credits", "description": "A practical study of dance styles from the 1890'S to the 1990'S.  DANCE 382 Music Theatre Dance --Style I (1.5) DANCE 371 allows the student who has successfully completed two semesters of ballet (DANCE 231 and 232), two semesters of jazz (DANCE 241 and 242), and two semesters of Music Theatre Studio (THEA 223 and 224) to expand their capabilities of combining their skills of dancing and acting through the use of different stylistic approaches. In this semester, the BFA Music Theatre candidate will study and perform choreography characteristic of Vaudeville, Charleston, Ragtime, Ballet, Folk/Ethnic and elements of Modern and Jazz. In particular, Agnes deMille's use of ballet and Jerome Robbins' use of Ballet/Jazz/Modern will be studied. The goals of the course include enabling the student to fell confident in identifying, performing, and competing in the professional audition venue using these styles. Also, the student should deepen their understanding of how the use of varied dance styles contributes to the development of character and/or the furthering of plot in Music Theatre. Successfully completing DANCE 371 is the prerequisite for DANCE 372.", "prerequisite": "THEA 224"}, {"department": "DANCE", "number": "383", "credits": "3 Credits/Maximum of 9", "description": "Devised performance is that which that does not proceed from a published script or score. In this course, students will use the various languages of the stage--including movement, dance, and design--as equal partners in creating new works. Students will use various methodologies for creation, including some that come from dance such as Viewpoints, and others that come from Theatre, such as Moment Work. Through a collaborative auto-course based process, students will create new performances in collaboration with others. The semester will end with one or more new devised performance pieces that will be performed as classroom projects and/or public showings. Although everyone in class is expected to move/perform as part of the learning process, contributions from designers, dramaturgs, and directors are encouraged.", "prerequisite": "DANCE 100", "other": ["Bachelor of Arts: Arts"]}, {"department": "DANCE", "number": "384", "credits": "1.5 Credits", "description": "A continuation of course work established in Music Theatre Dance Style I.  DANCE 384 Music Theatre Dance --Style II (1.5) DANCE 372 allows the student who has successfully completed DANCE 371 to continue broadening their understanding and expanding their performance skills of different stylistic approaches to choreography. In this course the student will study and perform choreography using stronger Jazz and Folk/Ethnic/Social influences. In particular, the works of Jerome Robbins, Ron Field, Michael Bennett, and Bob Fosse will be studied. The goals of the course include enabling the student to feel confident in identifying, performing, and competing in the professional audition venue using these styles. Also, the student should deepen their understanding of how the use of varied dance styles contributes to the development of character and/or the furthering of plot in Music Theatre.", "prerequisite": "DANCE 382"}, {"department": "DANCE", "number": "385", "credits": "1 Credits", "description": "Supervised experiences in teaching and assisting with the teaching of dance techniques.", "prerequisite": "DANCE 100"}, {"department": "DANCE", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "DANCE", "number": "410", "credits": "3 Credits", "description": "Survey of dance history concerning perspectives of culture, race, and gender with a focus on Nineteenth and Twentieth centuries.  DANCE 410 Dance History (3) (US/IL) DANCE 484 (US;IL) Dance History (3) Survey of dance history concerning perspectives of culture, race, and gender with a focus on Nineteenth and Twentieth centuries. Dance History (3) General Education: NoneDiversity: US;ILBachelor of Arts: NoneEffective: Fall 2006 Note : Class size, frequency of offering, and evaluation methods will vary by location and instructor. For these details check the specific course syllabus.", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"department": "DANCE", "number": "411", "credits": "3 Credits", "description": "From Africa to Hip Hop- Evolution of African-American Dance History will explore the history of African related dance from its beginnings in West Africa through the contemporary expressions of Hip Hop.  DANCE 411 From Africa to Hip Hop- The Evolution of African-American Dance History (3) (GH) From Africa to Hip Hop- Evolution of African-American Dance History will explore the history of African related dance from its beginnings in West Africa through the contemporary expressions of Hip Hop.", "prerequisite": "DANCE 261", "other": ["General Education: Humanities (GH)"]}, {"department": "DANCE", "number": "412", "credits": "3 Credits", "description": "This course will guide the students in movement-oriented activities and explore how these activities relate to learning academic concepts.  DANCE 412 Practical Applications of Movement in the Classroom (3) Moving and learning is the focus of this course. Classrooms vary in size, age, understanding, world experience and venue. Being able to recognize all these situations as learning opportunities is a talent built on experience. This class will challenge the students to see learning not just as an event that must happen in desk chairs with only the use of traditional classroom technology to support the 'lesson' but also as an opportunity for expansion into the whole child, including the moving child. Experience in designing and applying movement ideas into curriculum ideas and concepts will be developed throughout the semester. The student will begin to see ideas and learning themes as opportunities to engage the child through their physicality while expressing ideas, challenging the expected way of learning and yes, even having fun. Teaching is a creative act, learning is a creative act, and designing moving opportunities to reinforce the act of learning creates a sense of knowing within the child that becomes embodied. Reading, discussion, classroom application of material, and critical assessment of self and others will create an environment, at times, modeling some of the potential venues in which the student may expect to find themselves. Using this information will be critical to their growth into visualizing movement as a viable option for teaching and learning.", "prerequisite": "3 credits in HDFS or PSYCH or EDPSY or DANCE"}, {"department": "DANCE", "number": "422", "credits": "1.5 Credits", "description": "Advanced Hip Hop Dance reinforces and expands concepts from Beginning Hip Hop Dance.  Free expression of the body, freestyle, and choreography are emphasized.  DANCE 422 Advanced Hip Hop Dance (1.5) Advanced Hip Hop Dance is designed for the serious minded dance student with an interest in Hip Hop dance/culture. This class provides an intensive study of dance, choreography and culture. As in Beginning and Intermediate Hip Hop Dance, freestyle dancing, locomotive movements, and choreography are emphasized. In addition, this class includes lecture sessions and discussions about Hip Hop culture and its role in society. By the end of this course students should be able to articulate why Hip Hop is a culturally significant art form and choreograph and perform a Hip Hop dance combination. This course also enhances mind/body awareness, and provides choreographic and performance opportunities. This course is directly related to dance, theatre, African American studies and other arts based and humanities based courses.", "prerequisite": "DANCE 222"}, {"department": "DANCE", "number": "431", "credits": "1.5 Credits", "description": "An advanced ballet training course.  DANCE 431 Advanced Ballet I (1)DANCE 431 allows the student who has successfully completed DANCE 232, or who has interviewed with the Instructor concerning their previous training in ballet, to develop greater profiency in performing ballet. The barre work continues to emphasize proper alignment, supported by exercises using the Zena Rommett floor barre technique and the Pilates technique, and the floor work moves more quickly then in the beginning levels of study. The student will learn more complex steps requiring greater strength and coordination, and the class will move at a faster pace, thus enabling the student to learn choreography more quickly. The student will also develop their ability to communicate character and mood through their dancing. More advanced ballet terminology will be taught, and the student will learn the French terms, their English meanings, be able to identify the steps and perform them. DANCE 431 can satisfy one of the two semesters of advanced dance study required by the BFA Music Theatre degree option and can satisfy requirements for the Dance Minor. The student's grade is determined by their attendance, attitude, and progress. Attendance is mandatory. More than three absences or lateness will affect the grade. The attitude should reflect a serious focus on improving their abilities with a positive approach to applying corrections to their dancing. Their progress will be assessed through observation of their classroom work and especially the video-taped performances of their mid-term and final exam choreography. There will be a final showing at the end of the semester with an invited audience. The exams will also include an oral section, covering the terms used in class. Required dress for class is -- for men, dance belt, black tights, white t-shirt, and black ballet shoes, and for women, pink or tan tights, leotard, and pink ballet shoes. All hair must be pulled back and secured away from the face. No sweat clothes may be worn, but leg warmers, belts, and suspenders are optional.", "prerequisite": "DANCE 230"}, {"department": "DANCE", "number": "432", "credits": "1.5 Credits", "description": "A continuation of Advanced Ballet I to augment technical proficiency.  DANCE 432 Advanced Ballet II (1)DANCE 432 allows the student who has successfully completed DANCE 431, or who has interviewed with the Instructor concerning their previous dance training, to challenge themselves further in the study of ballet. The barre work continues to emphasize proper alignment, supported by exercises using the Zena Rommett floor barre technique and the Pilates technique. The center work expands on some of the vocabulary taught in DANCE 431, requiring more confidence, strength, and stamina in different ways of turning and jumping, as well as adagio work. The student will learn more complex steps requiring greater strength and coordination, and the class will move at a faster pace, thus enabling the student to learn choreography more quickly. The student will also develop their ability to communicate character and mood through their dancing. More advanced ballet terminology will be taught, and the student will learn the French terms, their English meanings, be able to identify the steps and perform them. DANCE 432 can satisfy one of the two semesters of advanced dance study required by the BFA Music Theatre degree option and can satisfy requirements for the Dance Minor. The student's grade is determined by their attendance, attitude, and progress. Attendance is mandatory. More than three absences or lateness will affect the grade. The attitude should reflect a serious focus on improving their abilities with a positive approach to applying corrections on their dancing. Their progress will be assessed through observation of their classroom work and especially the video-taped performances of their mid-term and final exam choreography. There will be a final showing at the end of the semester with an invited audience. The exams will also include an oral section, covering the terms used in class. Required dress for class is - - for men, dance belt, black tights, white t-shirt, and black ballet shoes, and for women, pink or tan tights, leotard, and pink ballet shoes. All hair must be pulled back and secured away from the face. No sweat clothes may be worn, but leg warmers, belts, and suspenders are optional.", "prerequisite": "DANCE 431"}, {"department": "DANCE", "number": "441", "credits": "1.5 Credits", "description": "An advanced course in the techniques of jazz dance.  DANCE 441 Advanced Jazz I (1)DANCE 441 allows the student who has successfully completed DANCE 242 to continue their study of jazz technique and performance. The focus of the course is to improve capability through learning and performing more challenging choreography at a faster pace. Eight combinations of choreography are taught, to music of various types -- pop, jazz, and musical theatre. Performing with confidence and a sense of character will be emphasized. The student will also become familiar with the fundamentals of the Pilates technique to improve alignment, strength, and flexibility. The student will also be given opportunities to develop confidence in improvisation. DANCE 441 enables the BFA Music Theatre candidate to satisfy one semester of advanced level dance training. For the Dance Minor and other students of dance, it provides challenges in technical execution and a greater range of jazz styles. The student's grade will be determined by their attendance, attitude, and progress at learning quickly and performing the dance combinations, as well as the completion of two projects. Attendance is mandatory; more than three absences or lateness will affect the grade. The attitude should be focused, positive, receptive to correction, and eager. Progress will be assessed in frequent performance 'quizzes'. The mid-term and final exams will be video-taped and viewed by the class. The two projects consist of paper and one minute of original choreography. The paper should consist of the student's personal analysis of jazz dancing and their abilities, based on their past and present experience. The choreography should reflect work learned in class and be performed to instrumental music. The student will perform their choreography for the class. Required dress for DANCE 441 consists of dance belt, dance pants, t-shirt and jazz shores for men and tights and leotard, jazz and character shoes for women. Dance sneakers are not appropriate for warm-ups and certain combinations.", "prerequisite": "DANCE 240"}, {"department": "DANCE", "number": "442", "credits": "1.5 Credits", "description": "A continuation of Advanced Jazz I to augment technical proficiency.  DANCE 442 Advanced Jazz II (1)DANCE 442 allows the student who has successfully completed DANCE 441 to continue to broaden their knowledge of advance jazz dance. The purpose of this course is to improve capability through learning and performing more challenging choreography at a faster pace. Technique will be stressed, but performance and interpretation will be emphasized with the following standard in mind: to develop character, mood, and ability to improvise and choreograph jazz dance. A variety of choreographed dances ranging from pop, jazz, to musical theaters styles will be taught. Students are responsible for learning and executing all material taught in class. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. More than three absences or lateness will affect the grade. Maintaining a positive attitude, proper discipline, and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). Students enrolling in this course should have successfully completed DANCE 441 or have permission of the instructor. JAZZ 442 satisfies requirements for the BFA Music Theater option and the Dance Minor. The BFA Music Theater student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: Jazz shoes, t-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: Jazz shoes, leotard and tights (possible character shoes).", "prerequisite": "DANCE 240"}, {"department": "DANCE", "number": "451", "credits": "1.5 Credits", "description": "An advanced course in the techniques of tap dance.  DANCE 451 Advanced Tap I (1)DANCE 451 allows the student who has successfully completed DANCE 251 and 252, or has permission of the instructor, to continue to broaden their knowledge to tap dance. The work will include expanding the student's knowledge of tap vocabulary, rhythm, tempo and counting. The work introduces audition techniques from the dancer's perspective and expands the awareness of proper rehearsal discipline. Professional conduct and behavior is now cultivated into a useful marketing tool. Material is taught faster and with greater detail to reinforce audition techniques and equate professional challenges. Audition classes will be held at the instructor's discretion. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. More than three absences or lateness will affect the grade. Maintaining a positive attitude, proper discipline, and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). Students are responsible for learning and executing all material taught in class. Students enrolling in this course should have successfully completed DANCE 251, 252 or have permission of the instructor. Tap DANCE 451 satisfies requirements for the BFA Music Theater option and the Dance Minor. The BFA Music Theater student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: tap shoes, or hard soled shoes with taps attached. T-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: tap shoes, leotard and tights (possible character tap shoes). The clothing must allow movement, and still be able to distinguish an outline of the dancer's body.", "prerequisite": "DANCE 250"}, {"department": "DANCE", "number": "452", "credits": "1.5 Credits", "description": "A continuation of Advanced Tap I to augment technical proficiency.  DANCE 452 Advanced Tap II (1)DANCE 452 allows the student who has successfully completed DANCE 451 to continue to broaden their knowledge of advanced tap dance. The course will emphasize a broader dance vocabulary and more complex dance combinations. The repetition and rehearsal techniques will be reinforced and intensified. The ability to communicate character and setting through dance is strongly emphasized. Material is taught faster and with greater detail to reinforce audition techniques and equate professional challenges. The student's grade will be based on attendance, attitude, and progress of learning and performing dance combinations. More than three absences or tardiness will affect the grade. Maintaining a positive attitude, proper discipline, and willingness to work and learn are essential. The student is required to perform individual rehearsal hours (as homework). Students are responsible for learning and executing all material taught in class. Students enrolling in this course should have successfully completed DANCE 451 or have permission of the instructor. Tap DANCE 452 satisfies requirements for the BFA Music Theater option and the Dance Minor. The BFA Music Theater student will be juried by the School of Theatre Performance Faculty as a part of their final grade. The jury will consist of a showing of the pieces taught in class. This evaluation will help to determine whether the candidate may be allowed to enroll into the next level of the performance sequence. The required dress for men: tap shoes, or hard soled shoes with taps attached. T-shirt or muscle shirt, dance belt, Jazz pants or tights. For women: tap shoes, leotard and tights (possible character tap shoes). The clothing must allow movement, and still be able to distinguish an outline of the dancer's body.", "prerequisite": "DANCE 250"}, {"department": "DANCE", "number": "461", "credits": "1.5 Credits/Maximum of 9", "description": "Development of dance technique and movement combinations on the advanced level. DANCE 461 Advanced Modern Dance I (1.5) DANCE 461 is Advanced Modern Dance. This class continues the technique foundation from DANCE 261 & DANCE 262 of exploring the use of weight, time, space, and energy in relation to a release-based modern dance technique. DANCE 461 also works with focus, style, and performance techniques. Students should gain greater technical proficiency , flexibility, strength, and alignment. Understanding and demonstrating the different uses of weight and the concept of grounding is essential. Students should begin to develop as an individual mover (personal artistic voice) and gain greater confidence in using the body as a tool of expression and communication. Students should demonstrate an opening and willing attitude in every class situation. Students are responsible for learning and executing all material taught in class. This class serves as a prerequisite for DANCE 462. Together these two semesters serve as core technique classes for all dance minors.", "prerequisite": "DANCE 262"}, {"department": "DANCE", "number": "462", "credits": "1.5 Credits/Maximum of 9", "description": "A continuation of Advanced Modern Dance I to augment technical proficiency.  DANCE 462 Advanced Modern Dance II (1.5)DANCE 462 is a continuation of Advanced Modern Dance I. This class continues the technique foundation from DANCE 261, 262, and 461 of exploring the use of weight, time, space, and energy in relation to a release based modern dance technique. DANCE 462 also works with focus, style, and performance techniques. Students should gain greater technical proficiency, flexibility, strength, and alignment. Understanding and demonstrating the different uses of weight and the concept of grounding is essential. Students should begin to develop as an individual mover (personal artistic voice) and gain greater confidence in using the body as a tool of expression and communication. Students should demonstrate an opening and willing attitude in every class situation. Students are responsible for learning and executing all material taught in class. DANCE 461 and 462 serve as core technique classes for all dance minors.", "prerequisite": "DANCE 361"}, {"department": "DANCE", "number": "466", "credits": "3 Credits/Maximum of 6", "description": "An advanced exploration of modern dance techniques supported by the choreographic process.  DANCE 466 Contemporary Movement Lab III (3 per semester/maximum of 6) DANCE 466 is an advanced level modern dance course using the choreographic process and experience as a way to enhance and further understand technique and performance. This class is designed specifically for the Dance Studies Minor student to enhance the efficient and expressive use of the body as a vehicle for expression. The student will not only develop greater flexibility, strength, and alignment, but also will gain ability for self-awareness and increase in personal dance vocabulary.Contemporary Movement Lab III will meet four hours a week, with a minimum additional 1-hour studio lab for personal discovery. CML III is designed to further expose the advanced level dancer to the choreographic process as a means of expression of modern dance as it influences the discovery of personal style and communication. The advanced level dancer will be further developed through higher levels of movement requirements: floor work, and strengthening experiences while exploring the connections of movement as a goal for communication and performance. Each class period will allow time to be spent in the traditional aspects of an advanced modern dance technique class: floor warm up and connection to center of weight, center floor balance and strengthening technique exercises and combinations, traveling sequences across the floor, and final accumulative combination.An equal amount of time will be spent in discovering the choreographic process utilizing the tools of composition from Dance 366 and improvisation from Dance 365 to successfully communicate personal ideas or themes through fully explored dances. Students will be expected to create a number of dances/studies throughout the semester with the goal of producing one for the concert stage. Outside reading and follow up discussions will further support their experience in the studio. Discussion, journals, goal setting and writing assignments will allow for opportunities to express levels of comfort and personal discoveries with various experiences.", "prerequisite": "DANCE 365"}, {"department": "DANCE", "number": "472", "credits": "3 Credits", "description": "Observe and analyze movement elements by exploring concepts of Body, Effort, Shape, and Space to increase personal communication and expression.  DANCE 472 Introduction to Laban Movement Analysis (3) Laban Movement Analysis (LMA) is a method and language for describing, visualizing, interpreting and documenting all varieties of human movement. It is one type of Laban Movement Study originating from the work of Rudolf Laban. In addition many derived practices have developed with great emphasis on LMA methods. This course focuses on elements known as Laban/Bartenieff Movement Analysis, which uses a multidisciplinary approach, incorporating contributions from anatomy, kinesiology, psychology, Labanotation and many other fields. It is used as a tool by dancers, actors, musicians, athletes, physical and occupational therapists, psychotherapy, peace studies, anthropology, business consulting, leadership development, health & wellness and is one of the most widely used systems of human movement analysis today. In this course, students will study and practice the basic categories of LMA: Body (Bartenieff Fundamentals, total-body connectivity), Effort (Energetic dynamics), Shape, and Space (Space Harmony). In addition students will discover how LMA looks at the categories in terms of Phrasing and themes of opposites. The themes are: Mobility/Stability, Inner/Outer, Function/Expression, and Exertion/Recuperation.", "prerequisite": "DANCE 230"}, {"department": "DANCE", "number": "480", "credits": "2 Credits", "description": "Choreographic practicum experiences for concert performances.  DANCE 480 Choreographic Projects (2) This course is a forum for choreographic practicum experiences for concert performances. This course will provide an opportunity to students to develop their artistic and creative abilities in the field of dance. The student will create a group choreographic work to be presented in concert dance. This course will cover skills for advanced group dances, the creative process, selection of music of dance, costuming for dance, lighting for dance, rehearsal techniques, performance techniques, and organizational/leadership skills.Each student will submit a written proposal of the dance s/he intends to create, specifying the number of dancers, choreographic intent, and movement phrases as well as ideas for music, costumes, and lighting. The student will complete one choreographic dance to be performed in concert, which is presented each semester. The student must attend technical week prior to the concert, use past choreographic experiences gained from compositional study and be responsible for organizing weekly rehearsals. The student is required to hand in a self-evaluation paper reflecting on the original proposal and completed dance, and to maintain a journal throughout the semester documenting the choreographic process.This course will be offered fall semester with an enrollment of 10 students.", "prerequisite": "DANCE 381"}, {"department": "DANCE", "number": "485", "credits": "1-2 Credits/Maximum of 12", "description": "An advanced dance course in the choreographic process with emphasis on original choreography in performance.  DANCE 485 Contemporary Dance Repertory (1-2)This is an advanced dance course in the choreographic process with emphasis on original choreography. The instructor will create an original dance on students enrolled in this course which will provide the student with performance experience in a live dance concert. The student will learn original choreography, experience and assist in the choreographic process, participate in discussions concerning choreography, performance and style. The student will keep a journal and complete written assignments which demonstrate cognitive understanding of the artistic process. Each student will demonstrate proper rehearsal protocol and behavior, execute the choreography at a level suitable for concert performance, show an understanding of the choreographic process through written work, demonstrate growth as a dancer and artist through performance and written work and participate fully in a concert performance of the dance work created in class.", "prerequisite": "permission of the program"}, {"department": "DANCE", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "DANCE", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "DANCE", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]