[{"department": "DIGIT", "number": "100", "credits": "3 Credits/Maximum of 3", "description": "The traditional theories and methods that underwrote the study of literature, history, and philosophy in the 20th century are now being supplemented with new techniques and tools. While this class will give a sense of the breadth of theoretical writings that have defined digital humanities (DH), we will imagine how current debates in DH share similarities to a longer history of philosophy, literature, and technology. Intended for students unfamiliar with digital humanities, this course surveys an array of tools, techniques, and cultures related to the field. We will be reading a survey of literature that emerged alongside computing and digital humanities properly. This course will challenge you to experiment with new techniques, and students who are resourceful, creative, and energetic will find this course an ideal forum to test their curiosity and inquisitiveness.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "DIGIT", "number": "110", "credits": "3 Credits", "description": "DIGIT 110 teaches students standardized encoding techniques for archival quality data creation, storage, and analysis."}, {"department": "DIGIT", "number": "210", "credits": "3 Credits", "description": "Course teaches students programmatic and algorithmic techniques and tools for accessing and analyzing unstructured text."}, {"department": "DIGIT", "number": "297", "credits": "3-6 Credits/Maximum of 6", "description": "Formal courses given infrequently to explore, in dept, a comparatively narrow subject which may be topical or of special interest."}, {"department": "DIGIT", "number": "400", "credits": "3 Credits", "description": "This course will introduce students to the tools and resources available to design and implement digital project.", "prerequisite": "DIGIT100 , DIGIT110 , DIGIT210"}, {"department": "DIGIT", "number": "409", "credits": "3-6 Credits/Maximum of 6", "description": "Students will develop 3d digital creation skills in relation to their field(s) of study. DIGIT 409: Advanced Digital Creations is a problem-based learning class that uses the digital media concepts and tools introduced in Art 168 to develop an in-depth understanding of 3d digital art. They will enhance their creative and philosophical sensibilities in the technology, software, and media relevant to the field (s) of study they are pursuing.Through a series of learning problems, students will synthesize advanced skills and knowledge needed to accomplish techniques used in the creation of digital 3d imagery. They will integrate 3d sculpting, modeling, animation, and/or painting practices with computer-based image processing for creative, and professionally oriented results. They will develop critical and conceptual sensibilities needed to discuss and evaluate their work and the work of others using these methods. Students will identify, research, and analyze effective professional and creative practices in the field of digital creativity with emphasis on developing skillful digital processing techniques. These practices include creating mockups of concepts, art-making practices for enhanced digital workflow, and choosing the 3d processing techniques most appropriate for the end-use of the work. The digital medium has a relatively short history, however, as the advancement of digital technology continues these techniques have entered the popular mainstream. This shift has raised challenges in graphic-reliant fields such as the arts, engineering, advertising, simulation, and gaming. This course will give students of these fields the opportunity to develop their artistic skills further than possible in Art 168. Students will analyze and assess the factors related to their fields in in order to make sound design decisions.", "prerequisite": "ART 168"}, {"department": "DIGIT", "number": "410", "credits": "3 Credits", "description": "In-depth understanding of techniques and software for data visualization. Students will be introduced to complex data sets and learn how to present findings in interactive and innovative ways.", "prerequisite": "STAT 200"}, {"department": "DIGIT", "number": "430", "credits": "3 Credits", "description": "In Modeling and Simulation, students will develop an understanding of the systems, processes, tools, and implications of this field.", "prerequisite": "3 credits of programming; 3 credits of mathematics", "other": ["Cross-listed with: GAME 430"]}, {"department": "DIGIT", "number": "489", "credits": "1 Credits/Maximum of 2", "description": "Students taking this course will have completed or be enrolled in Digital Project Design (DIGIT 400) or Senior Project (DIGIT 494) or Internship (DIGIT 495). This class will extend the content knowledge of those courses into professional applications. Specifically, students will gain experience in communicating their digital competence orally and in writing for their post-baccalaureate life. Students will complete a professional digital portfolio of their work that presents themselves, their ideas, and their projects. They will write and revise cover letters, resumes, and portfolio materials to feature their DIGIT projects as they prepare for a career or graduate school. Topics include: - Mapping potential careers and/or graduate programs - Writing, reviewing, and revising job letters, personal statements - Developing resumes and/or curriculum vitae - Mock job interviews - Portfolio development and review - Planning, sharing, and delivering project presentations Conference participation"}, {"department": "DIGIT", "number": "494", "credits": "3 Credits", "description": "DIGIT 494 is a senior capstone course that allows students to design, complete, and present an independent digitally based project.", "prerequisite": "DIGIT100 , DIGIT110 , DIGIT400"}, {"department": "DIGIT", "number": "495", "credits": "3 Credits", "description": "A professional internship opportunity with a business, organization, or non-profit agency.", "prerequisite": "DIGIT100 , DIGIT110 , DIGIT400"}, {"department": "DIGIT", "number": "496", "credits": "3-9 Credits/Maximum of 9", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal course."}, {"department": "DIGIT", "number": "497", "credits": "3-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "DIGIT", "number": "499", "credits": "3-6 Credits/Maximum of 6", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]