[{"department": "EARTH", "number": "2", "credits": "3 Credits", "description": "EARTH 2 is a broad introduction to the Earth and to the forces and processes that shape the present-day global environment. The course focuses on global-scale changes, both natural and human-induced. These include: global climate change, destruction of stratospheric ozone, tropical deforestation, species extinction, and the loss of biodiversity. The discussion of these modern environmental issues occupies about 40% of the course. Unlike other \"environmental\" courses, this one sets these issues in the context of the long-term evolution and natural variability of the Earth systems. Thus, the course is structured around three major themes--the issues of global change, time scales of change, and understanding the Earth as a system. By the end of this course, we expect students to: 1) Recognize that: - the Earth operates as a complex system, - there is considerable interaction between the different components of this system (e.g. atmosphere, oceans, solid Earth, and biota), - changes in one part of the system can be expected to impact all others to a greater or lesser degree. 2) Develop an understanding of how the Earth system operates at the global scale, and the consequences this has for regional variability. 3) Understand how this system has evolved through time. 4) Understand how to use systems and graphical analyses to predict system response to perturbations. As a result of this course, we expect students to: 1) Synthesize this information to better appreciate the complexity of modern global change issues. 2) Be in a position to make more informed judgments on the nature and seriousness of these issues.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EARTH", "number": "10", "credits": "1 Credits", "description": "Energy and Earth's Climate examines the immense value we get from energy, where we get most of our energy, why the energy system must change eventually, and why a faster change would help us. Our ancestors burned trees and whales far faster than nature produced more, gaining good from the energy but causing big problems. Our use of fossil fuels allows us to live well, and to let the whales and trees grow back. But highly confident science shows that fossil-fuel-sourced carbon dioxide promises even bigger problems in a warming future, if we don¿t change course. This course is based on the widely viewed PBS series Earth: The Operators' Manual. In the series, Dr. Richard Alley's (Evan Pugh University Professor of Geosciences) presents an objective, accessible assessment of the Earth¿s problems and possibilities. Through this course, successful students will be able to: - Recognize the natural and human-driven systems and processes that produce energy and affect the environment - Explain scientific concepts in language non-scientists can understand - Find reliable sources of information on the internet - Use numerical tools and publicly available scientific data to demonstrate important concepts about the Earth, its climate, and resources", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EARTH", "number": "100", "credits": "3 Credits", "description": "This course is designed to introduce students to issues surrounding the development and maintenance of human civilization on Earth. This includes developing an understanding of how human population has grown over time, the resources required by humans and how this has changed over time, and the by-products of activities related to resource extraction on the environment and, hence, on human health and the cost of maintaining human civilization. A considerable focus is placed on developing critical thinking skills by using scientific data to describe, and evaluate the relative importance of, environmental issues. Accordingly, the course presents, and explains, scientific data in formats that students are likely to find in scientific journals, mass media, and websites. In this course, students will: * Develop an understanding of the Earth system and how it operates, * Quantify human demands on natural resources, * Learn how resource extraction and use impacts the environment, * Foster the ability to critically evaluate scientific arguments, and * Practice expressing reasoned opinions on complex problems. By the end of the semester, students will be able to: * Identify important, and human-relevant, environmental issues. * Understand the breadth and complexity of environmental issues. * Think critically about environmental issues. * Have scientifically-accurate discussions about environmental issues with others. * Propose, and evaluate critically, solutions to environmental issues.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EARTH", "number": "100H", "credits": "3 Credits", "description": "Examination of climate change and energy issues.  EARTH 100H Environment Earth: Environment and Energy (3) (GN) In this course, students will be asked to investigate the natural processes that affect the Earth's climate and their effects on Life on Earth. Once a fundamental understanding of natural processes is developed, then an examination of the anthropogenic atmospheric changes covers the increases in greenhouse gases mainly due to fossil fuel use and agriculture. After discussing the potential environmental and economic impacts of increased greenhouse gases on Man and Nature, the major energy sources will be studied for their potential to meet increasing energy needs and their possible ability to mitigate climate change.", "other": ["General Education:  Natural Sciences (GN)", "Honors"]}, {"department": "EARTH", "number": "101", "credits": "3 Credits", "description": "\"Natural Disasters: Hollywood vs. Reality\" investigates a variety of natural hazards and disasters. We use the popular media as a starting point to motivate discussions and development of tools for analyzing the causes of disasters. Using excerpted segments of 'disaster films' in conjunction with scientific treatments, the class identifies the causes, consequences and public perceptions of natural hazards. Small group discussions and cooperative research activities held 'real time' in the classroom are a major component of this course. The goal is to help students develop both an understanding of natural hazards and disasters, and enhance their understanding of scientific approaches to problem solving.", "other": ["Bachelor of Arts: Natural Sciences", "United States Cultures (US)", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "EARTH", "number": "103N", "credits": "3 Credits", "description": "Earth has a complex, fascinating, interconnected system of processes that control the state of the climate. If we can understand how this system works, then we can make intelligent predictions about the climate in the future. The future of climate is of great importance to the quality of life in the future. In this class, we will explore the workings of the climate system ¿ at the present, and in the past ¿ through a series of modules with hands-on learning activities. We will learn how simple and sophisticated computer models can provide useful tools for making predictions about what our climate will be like in the next few hundred years, which will be a critical time for our species as we endeavor to find a more sustainable way of living. A changing climate means changes in, among other things, temperature and precipitation, which will affect our water supplies, our energy consumption, and our ability to grow enough food to feed the people of Earth. A changing climate also means a range of stresses on the global economy. We will examine these climate impacts, but we will not stop there ¿ we will also focus our attention on what can be done to help us successfully meet these challenges", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "EARTH", "number": "104N", "credits": "3 Credits", "description": "This class explores how we can shift our society to a sustainable energy system that improves our quality of life, our economy, and our natural environment. Energy provides well-being, jobs and about 10% of our economy, while powering the rest. But, energy is also the least sustainable part of our economy-we rely on fossil fuels that we are burning about a million times faster than nature saved them for us. These fossil fuels, mostly coal, oil and gas, help us grow food and avoid some environmental disasters, but the limited fossil-fuel supplies mean we must move toward a more sustainable system. And, we will be better off by avoiding damaging climate changes from fossil-fuel CO2 if we move before all of the fossil fuels are gone. The warming influence of fossil-fuel CO2 is shown by physics known for more than a century and really refined by the US Air Force after WWII. History, data, and models confirm the physics, giving us high confidence that burning much of the remaining fossil-fuel resource and releasing the CO2 will cause much larger climate changes than we have experienced so far. This class will explore the big issues in energy, including the value of burning oil rather than whales, and other historical insights. Then, after looking at the basic science and engineering of our energy system and how it affects climate, we will examine the multitude of options for the future, including alternative energy sources, conservation, and intentionally manipulating the climate. The economics, policies and ethics of these options will help us consider how to build a sustainable energy system that will encourage economic growth and improved quality of life, while at the same time defending against potentially catastrophic future climate change.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EARTH", "number": "105N", "credits": "3 Credits", "description": "Significant natural features of Africa as related to human endeavor; case studies include the Nile, climate change, and natural resources. EARTH 105N Environments of Africa: Geology and Climate History (3) (GN/GS;IL)(BA) This course meets the Bachelor of Arts degree requirements. Environments of African: Geology and Climate History investigates the interrelationships between geology, hydrology, land use, societies and human development in several areas of Africa. We focus primarily on regions north of the equator, although there is a brief segment on South Africa mining. Specific topics include the Nile River (sources of the Nile, agricultural practices, effects of damming the Nile, hydropolitics), the Sahara and Sahel (salt mines, climate change, drought, water resources), and natural resources and their role in politics (gold, diamonds, oil, and gas). The theme of climate change cuts across the entire semester. The quantitative and analytical components of the course involve working through a combination of map exercises and data manipulations (flood stage, groundwater age, rainfall and temperature records). Writing exercises are conducted both individually (essays, analysis of readings) and in collaborative teams (climate change analysis). Readings for the course come from the popular scientific literature; current refereed research journals, and transcribed oral histories of African people. Faculty lectures will comprise ~30% of the course, and student presentations ~20%, with the remainder of the time devoted to in-class collaborative exercises. There are no pre-requisites for this course. It will be offered annually with a maximum enrollment of 100 students.The goals of the course are to (1) explore the relationship between human society and the natural world; (2) develop quantitative and scientific reasoning skills; (3) introduce the scientific study of Africa. The topics that we explore (e.g., global climate change, allocation of limited water resources) are important political issues that affect people in developed and developing countries throughout the world. It is crucial that the next generation of citizens be informed as to how scientific data is obtained, presented, and interpreted by scientists as well as politicians. Students will work individually and (more commonly) in teams to analyze real data from natural African systems, and will then report their findings to the class both orally and in writing. Examples of the data sets include 100-year records of monthly rainfall and temperature from stations throughout the continent, fossil suites from ancient lake cores in the modern Sahara, and historical writings of Nile flood levels from pre-Biblical times. Through these exercises students will gain an appreciation of the scope of geological time and change, and will be able to incorporate this new long-term perspective into identification and resolution of modern questions.", "other": ["Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "EARTH", "number": "106", "credits": "3 Credits", "description": "Study of earthquakes and seismic waves to learn about the geology and plate tectonics of the African continent.  EARTH 106 Shaking Up Africa: The Geology and Tectonics of Africa (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Earthquakes are natural phenomena that can cause immense human suffering because of intense ground shaking, and are consequently of great societal importance. Earthquakes are also important because the seismic waves that generate the ground shaking provide scientists with important information about Plate Tectonics and geology, in particular information about the structure and composition of our planet and how the insides of the planet are deforming. In this course, earthquakes in Africa and the seismic waves they generate are used to help students to learn about the geology of Africa and how the earth beneath the African continent is being deformed by Plate Tectonics.EARTH 106 is designed in four modules. Modules, in turn, are divided into weekly lessons. Offered in a 'hybrid' format, each weekly lesson includes a single face-to-face class meeting, complemented by online reading assignments, self-check learning activities, and discussions. The online, hands-on learning activities are similar to the labs conducted in similar courses that are offered solely in face-to-face environment, including the manipulation of geographic data, map reading exercises, and rock and mineral identification activities. They are designed to help students learn skills and knowledge that they then apply to a course project. While the weekly lesson activities involve working with seismic data from East Africa, the course project requires students, working in small groups, to apply their skills and knowledge to another geographic area of the African continent. In addition to the weekly lesson activities and the course project, students are required to complete weekly quizzes that assess comprehension of the online reading assignments. Quizzes that come at the end of a module also assess the skills and knowledge addressed in the lesson learning activities for that module.This course is a general education offering in natural sciences (GN) and is open to all students regardless of academic major.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "EARTH", "number": "107N", "credits": "3 Credits", "description": "Ten percent of the world's population or approximately 600 million people live on land that is within 10 meters of sea level. This low elevation coastal zone includes some of the world's most populous cities including New York, London, Miami, Calcutta, Tokyo, and Cairo. This zone is threatened by a host of environmental challenges, including but not limited to sea level rise. The overarching goal of this course is to provide students with a global perspective of coastal landscapes, the processes responsible for their formation, diversity and change over time, as well as socioeconomic and policy responses to current biophysical changes in the coastal zones around the world. Students will use real-world coastal data sets to evaluate hazards such as hurricanes and tsunamis and their effects on coastal populations. Coastal processes to be considered include tectonic settings, effects of glaciation, sediment supply, and wave and tidal energy. The impacts of sea level rise and its local effects on communities will be a focus. Engineering solutions to projected sea level rise impacts such as coastal flooding and habitat loss in coastal areas will also be examined.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EARTH", "number": "109", "credits": "3 Credits", "description": "Energy is a critical component of modern society, yet we face significant challenges associated with balancing energy demands, energy security, environmental sustainability, and stable economics with sound regulations and policy. Unconventional energy development from shale formations has been a game changer for the fossil fuel industry over the past decade and is projected to continue to grow over the next several decades. But there are still many uncertainties on how to optimally develop these largely untapped resources to maximize the social benefits while minimizing environmental impacts. This course covers key topics needed to provide students with an overview of the science, engineering, environmental impacts, geopolitics, economics and societal impacts of shale energy development. These topics include geology, resource assessment, drilling technology, hydraulic fracturing methods, environmental impacts, economics, workforce needs, infrastructure, utilization trends, regulation, energy policy, energy exports, international geopolitics, societal considerations, and the future of unconventional energy and its relationship with other energy forms. The class is geared toward a broad audience of students to provide a big picture view of the shale energy landscape. The course is structured in four parts. The course begins with the geology of shale (part 1), then examines engineering and environmental aspects of shale energy production (part 2), then explores relevant economic, geopolitical and societal issues (part 3) and ends with a capstone project (part 4). Shale energy development in a key U.S. shale basin is used in parts 1 -3 to provide examples and illustrate concepts, impacts and problems. In the capstone project, students will learn about the shale energy development in another basin of their choosing and present their findings to the class, thereby developing further the students' understanding of the core course content while gaining an overview of shale energy development beyond the U.S. shale basin presented in the course.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "EARTH", "number": "111N", "credits": "3 Credits", "description": "The Earth is often called \"The Blue Planet\", a reference to the fact that over two-thirds of its surface is covered by water. Despite its apparent abundance, water is a valuable and limited resource; less than 2.5% of the water on the planet is fresh, and only one third of that is potable. The small fraction of Earth¿s water that is useable to humans is distributed very unevenly. As a result, conflicts over water occur from the local level, for example: pitting rancher against developer - to the global level, at which nations square off against one-another in war and use water as a mechanism for imposing sanctions. The dire situation in some regions has spurred numerous research and technological endeavors, such as water desalinization, genetic engineering of crops, and major overhauls of agricultural practice. In this course, we explore the relationships between water and human populations, with emphasis on water resources and quality in the Western U.S., and how these have shaped history and modern politics. We will focus first on developing the scientific underpinnings of water¿s unique properties, behavior, movement, occurrence, and quality. With this background, we will then discuss key issues relating to modern and historical conflicts, human impacts on the natural world, and human engineering accomplishments driven by our thirst for this valuable resource. We will discuss historical examples from the American West, specifically the development of water resources in Arizona, Colorado and California. We will also explore modern and historical conflicts between stakeholders. Major themes will include political and economic conflicts over (1) water resources - for example, balancing agricultural and urban demands in the American west in the Denver and Los Angeles metropolitan areas, (2) water quality - for example, considering the impact of economically profitable human activities on water quality and transmission of disease, and (3) human impacts on natural processes, specifically connecting human activity with our cultural history of water use and exploration in the American West.", "other": ["United States Cultures (US)", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EARTH", "number": "112", "credits": "3 Credits", "description": "Concepts of climate sciences highlighted by evidence-based explanations and scientific discourse in preparation for K-6 science teaching. This introductory, multidisciplinary course will focus on the interactions among physical science concepts, earth science concepts, and scientific practices to develop understandings about Earth's climate system. The course is primarily intended for prospective elementary school teachers (Childhood and Early Adolescent Education, PK-4 and 4-8 majors), although it is available to other non-science majors. The development of models is an integral part of the course as a means to facilitate climate systems thinking by serving as a means to explain phenomena and predict outcomes. In addition, students in the course consider how what they are learning applies to teaching by offering opportunities to think about how they might extend their knowledge to teaching contexts. This course consists of integrated lectures and laboratory investigations in class meetings each week, with work on collaborative projects outside of class.", "other": ["Cross-listed with: SCIED 112"]}, {"department": "EARTH", "number": "150", "credits": "3 Credits", "description": "One of the most dramatic developments in the Earth sciences is the suggestion that extinction of the dinosaurs was caused by a meteorite impact. Evidence for and against this controversial idea is just one of the subjects addressed by this course, dealing broadly with the history of our planet, the evolution of life upon it, and the sometimes rocky development of our understanding of Earth history. In addition to dinosaur extinction, we will discuss issues relating to catastrophic vs. gradual theories about the Earth's history, fossils and the history of life, and mass extinctions, including whether or not we're in the middle of one now. How are scientific discoveries made? What distinguishes a scientific argument from a non-scientific one? What roles do social and historical factors play in the construction and acceptance of scientific theories? Questions such as these will permeate the course. Readings will include selected texts by leading scientists, with supplements from the primary scientific literature, including current discoveries published in Science and Nature.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EARTH", "number": "155N", "credits": "3 Credits", "description": "EARTH 155N Scientific Controversies and Public Debate is an introduction to critical thinking about the messages consumers get from public relations (PR) on behalf of industry, and from scientists regarding environmental health risks. Because such messages may be contradictory, the course seeks to help students understand the extent to which message communication influences our perception of risk. The course is designed to familiarize students with science topics that, because of message manipulation, are (or historically were) perceived as controversial (e.g., smoking, secondhand smoke, flame retardants, nuclear energy, the ozone hole, global climate change, acid rain, junk science, rBGH milk, biosolids, pesticides, vaccines, and endocrine disrupting chemicals). Students will learn the science and environmental health risks underlying several controversial topics. They will be guided to consider how industry and science messaging has shaped their own perceptions of risk. Then, using tools for effective communication, and avoiding communication pitfalls and deceptive tactics, students will combine accurate science content with compelling storytelling in a professional-quality video to inform the public about a targeted environmental health risk and persuade the public to avoid that risk. EARTH 155N focuses on the intersection between science and communication in the realm of environmental health. The course guides students to closely examine controversial environmental health topics, learn the science to understand public health risks, learn strategies to identify false or misleading arguments, and then think critically about industry and science messaging, including the impact of such messaging on their own lives. EARTH 155N Scientific Controversies and Public Debate is an interdomain course that integrate GN environmental health topics with GH message evaluation. It has no prerequisites, and is designed for students who may be unfamiliar with, or have only introductory knowledge of controversial environmental health topics, the norms of science communication, and public relations techniques.", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "EARTH", "number": "240", "credits": "4 Credits", "description": "The geography, geology, biology ecology and chemistry of coral reef ecosystems; threats to reef environments; and techniques for reef surveying and monitoring; with local geologic and distant modern field studies.  EARTH 240 Coral Reef Systems (4) (GN) The course introduces students to coral reef environments, past and present. It describes the processes that control the distribution, growth, and morphology of reefs and introduces students to the complexity of the coral reef ecosystem. The course emphasizes the role that reefs play in the natural environment and examines their importance to society both globally (e.g. in terms of biodiversity and its potential benefits) and locally in terms of, for example, food supply and tourism. We then look at the natural disturbances (such as disease, storms, sea surface temperature variations) that affect the reef, as well as ways in which reefs are threatened from human impacts, with an emphasis on global climate change and the long-term outlook for reef survival. Students will work in groups to research elements of the system, first at a global scale, and then focusing specifically on one region -- the Bahamas platform. Students will look at the history of the Bahamas platform and its relationship to the present nature and distribution of coral reefs. They will then examine these in the context of their social, cultural, and economic importance to local communities. A third component of the course will concentrate on the identification of vertebrate and invertebrate species and substrate conditions that are important indicators of reef health. There will then be a one-week field trip to a coral reef system to conduct reef surveys. The surveys follow the Reef Check protocol (a volunteer, community-based monitoring protocol designed to measure the health of coral reefs on a global scale). Reef Check is administered out of the University of California at Los Angeles. The coral reef surveys will be conducted on scuba and the field trip and participation in the survey are required elements of the course. Students who are not scuba certified will be given the opportunity to obtain open water scuba certification as part of the course, through Penn State&rsquo;s Science Diving Program (The PSU Science Diving Program is a member of the American Academy of Underwater Sciences). There will be an additional charge for the scuba certification course and the field trip. Student assessment will be through group presentations, term papers, 3 exams and their contribution to the field program. The course satisfies part of the field requirement for the University's Marine Science Minor and serves as an introduction to the Science Diving Program.", "prerequisite": "Prerequisite or concurrent: KINES045 or Nationally Recognized Scube Certification", "other": ["General Education:  Natural Sciences (GN)"]}, {"department": "EARTH", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "EARTH", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "EARTH", "number": "303", "credits": "3 Credits", "description": "Climate change is an existential threat that will impact every aspect of life in countries around the world, including basic needs for human survival such as food and water. Understanding the systems that control Earth's climate is key to making predictions about the future. Even though the direction of climate change is clear, predictions are uncertain because of the complexity of the climate system and the ability of countries to curb carbon emissions. Widespread understanding of the scientific issues and choices among citizens is central to making sound decisions about sustainability in their own lives. Beyond this, communication of this understanding to business leaders and lawmakers is critical to making changes in policy and the corporate world that will impact future sustainability. In this course, students will learn about the climate system, predictions for the coming century and how they are made, the impact on food, water, and sea level, and what changes are necessary to help us successfully meet these challenges. A fundamental part of the course will be the development and communication of sound policy aimed at lawmakers and corporate leaders.", "prerequisite": "ENGL 15"}, {"department": "EARTH", "number": "400", "credits": "3 Credits", "description": "Interdisciplinary study of environmental problems in the earth sciences.", "prerequisite": "seventh-semester standing in the Earth major"}, {"department": "EARTH", "number": "402", "credits": "3 Credits", "description": "Earth 402 is a course that focuses on modeling Earth systems with a focus on the climate system, including the economic and policy aspects of energy and carbon emissions. By building and experimenting with numerical models of these systems, students gain insight into the dynamics of these systems, including the future consequences of different policy decisions that impact the climate system.", "prerequisite": "EARTH 2"}, {"department": "EARTH", "number": "412", "credits": "3 Credits", "description": "EARTH 412 examines the relationships between people and the environment in the context of urban spaces with international context, United States national conditions and perspectives, and local implementation and practice. The course explores the fundamental question of \"What is urban sustainability?\" by: First, framing sustainability through the unique aspects of urban sustainability including political, economic, and social challenges; and investigating the roots of unsustainability and possible ways to address it. Second, the dimensions of sustainability will introduce urban food production and food systems issues; challenges linking affordable housing and transportation alternatives; urban waste management problems; and urban water systems incorporation of green infrastructure and low-impact development research and implementation. And third, improving sustainability with an introduction to industrial ecology; the role of intermediaries and civic engagement; and an examination of the role of government policy in addressing urban sustainability through legislation, regulation, and judicial action. Concepts of sustainable development principles, justice and equity, urban food policy, affordable housing, transportation options, water and green infrastructure, waste management, industrial ecology, sustainable design, and community development will be addressed via in class activities and (virtual or in-person) field trips.", "prerequisite": "EARTH 2"}, {"department": "EARTH", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"department": "EARTH", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "EARTH", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "EARTH", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]