[{"department": "ECON", "number": "14", "credits": "3 Credits", "description": "ECON 14 Principles of Economics (3)(GS)(BA) This course meets the Bachelor of Arts degree requirements. Economics is the study of how people satisfy their wants in the face of limited resources. Economics is a consistent set of methods and tools that is valuable in analyzing certain types of problems related to decision-making, resource allocation, and the production and distribution of goods and services. There are two main branches of economics, microeconomics, and macroeconomics. Microeconomics deals with the behavior of individual households and firms and how that behavior is influenced by government. Macroeconomics is concerned with economy-wide factors such as inflation, unemployment, and overall economic growth. ECON 14 is a survey course that covers introductory topics from both microeconomic and macroeconomics. The course is designed as a general education course in basic economics for non-majors. An important goal of this course is to take each student as far down the road of \"thinking like an economist\" as possible. The course begins by studying microeconomic topics, including supply and demand, elasticity, and market efficiency. The course then switches course to macroeconomics topics, including GDP, income, growth, inflation, unemployment, fiscal policy, and monetary policy. A variety of mechanisms is used to assess student performance. These evaluation methods typically include exams, quizzes, and homework assignments. Students who have passed ECON 102 or ECON 104 or who are registered in the College of Business Administration may not schedule this course.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "102", "credits": "3 Credits", "description": "Methods of economic analysis and their use; price determination; theory of the firm and distribution. ECON 102 Introductory Microeconomic Analysis and Policy (3)(GS)(BA) This course meets the Bachelor of Arts degree requirements. Economics is the study of how people satisfy their wants in the face of limited resources. One way to think about economics is that it is a consistent set of methods and tools that is valuable in analyzing certain types of problems related to decision--making, resource allocation, and the production and distribution of goods and services. There are two main branches of economics, microeconomics, and macroeconomics. Macroeconomics is concerned with economy--wide factors such as inflation, unemployment, and overall economic growth. Microeconomics deals with the behavior of individual households and firms and how government influences that behavior; it is the subject of this course. More specifically, ECON 102 is an introduction to microeconomic analysis and policy. The principal objective of the course is to enable students to analyze major microeconomic issues clearly and critically. Students will be introduced to the methods and tools of economic analysis, and these analytical tools will be applied to questions of current policy interest. Learning these methods and tools and applying them to interesting policy questions and issues is sometimes called \"thinking like an economist.\" An important goal of this course is to take each student as far down the road of \"thinking like an economist\" as possible. A variety of mechanisms are used to assess student performance. These evaluation methods typically include exams, quizzes, homework assignments, and group projects. ECON 102 is an introductory course in economics and as such, serves as a prerequisite for several microeconomics--oriented 300--level courses. It is also a required course for all majors and minors in economics, and meets requirements for a General Education (GS) or Bachelor of Arts social science course. Students who have completed ECON 302 may not enroll in this course.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "102H", "credits": "3 Credits", "description": "ECON 102H Introductory Microeconomic Analysis and Policy, Honors (3)(GS)(BA) This course meets the Bachelor of Arts degree requirements. Economics is the study of how people satisfy their wants in the face of limited resources. One way to think about economics is that it is a consistent set of methods and tools that is valuable in analyzing certain types of problems related to decision--making, resource allocation, and the production and distribution of goods and services. There are two main branches of economics, microeconomics, and macroeconomics. Macroeconomics is concerned with economy--wide factors such as inflation, unemployment, and overall economic growth. Microeconomics deals with the behavior of individual households and firms and how government influences that behavior; it is the subject of this course. More specifically, ECON 102 is an introduction to microeconomic analysis and policy. The principal objective of the course is to enable students to analyze major microeconomic issues clearly and critically. Students will be introduced to the methods and tools of economic analysis, and these analytical tools will be applied to questions of current policy interest. Learning these methods and tools and applying them to interesting policy questions and issues is sometimes called \"thinking like an economist.\" An important goal of this course is to take each student as far down the road of \"thinking like an economist\" as possible. A variety of mechanisms are used to assess student performance. These evaluation methods typically include exams, quizzes, and homework assignments. This course serves as a prerequisite for several microeconomics--oriented 300--level courses. This honors version of the course is designed to provide the opportunity to pursue this course at a more in-depth and mathematically rigorous level.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "104", "credits": "3 Credits", "description": "This course meets the Bachelor of Arts degree requirements. Economics is the study of how people satisfy their wants in the face of limited resources. One way to think about economics is that it is a consistent set of methods and tools that is valuable in analyzing certain types of problems related to decision-making, resource allocation, and the production and distribution of goods and services. There are two main branches of economics, microeconomics, and macroeconomics. Microeconomics deals with the behavior of individual households and firms and how that behavior is influenced by government. Macroeconomics is concerned with economy-wide factors such as inflation, unemployment, and overall economic growth; it is the subject of this course.More specifically, ECON 104 is an introduction to macroeconomic analysis and policy. The principal objective of the course is to enable students to analyze major macroeconomic issues clearly and critically. Students will be introduced to the methods and tools of economic analysis, and these analytical tools will be applied to questions of current policy interest. Broadly, the course focuses on the determination of national income, on unemployment, inflation, and economic growth in the context of a global economy, and on how monetary and fiscal policy, in particular, influence the economy. Learning the methods and tools of economics and applying them to interesting policy questions and issues is sometimes called \"thinking like an economist.\" An important goal of this course is to take each student as far down the road of \"thinking like an economist\" as possible. A variety of mechanisms is used to assess student performance. These evaluation methods typically include exams, quizzes, homework assignments, and group projects.ECON 104 is an introductory course in economics, and as such, serves as a prerequisite for 300-level courses in intermediate macroeconomic analysis, international economics, and money and banking. It is also a required course for all majors and minors in economics, and meets requirements for a General Education or Bachelor of Arts Social Science (GS) course. Students who have completed ECON 304 may not enroll in this course.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "104H", "credits": "3 Credits", "description": "ECON 104H Introductory Macroeconomic Analysis and Policy (3)(GS)(BA) This course meets the Bachelor of Arts degree requirements. Economics is the study of how people satisfy their wants in the face of limited resources. One way to think about economics is that it is a consistent set of methods and tools that is valuable in analyzing certain types of problems related to decision-making, resource allocation, and the production and distribution of goods and services. There are two main branches of economics, microeconomics, and macroeconomics. Microeconomics deals with the behavior of individual households and firms and how that behavior is influenced by government. Macroeconomics is concerned with economy-wide factors such as inflation, unemployment, and overall economic growth; it is the subject of this course. More specifically, ECON 104H is an introduction to macroeconomic analysis and policy. The principal objective of the course is to enable students to analyze major macroeconomic issues clearly and critically. Students will be introduced to the methods and tools of economic analysis, and these analytical tools will be applied to questions of current policy interest. Broadly, the course focuses on the determination of national income, on unemployment, inflation, and economic growth in the context of a global economy, and on how monetary and fiscal policy, in particular, influence the economy. Learning the methods and tools of economics and applying them to interesting policy questions and issues is sometimes called \"thinking like an economist.\" An important goal of this course is to take each student as far down the road of \"thinking like an economist\" as possible. A variety of mechanisms is used to assess student performance. These evaluation methods typically include exams, quizzes, and homework assignments. This course serves as a prerequisite for 300-level courses in intermediate macroeconomic analysis, international economics, and money and banking. This honors version of the course is designed to provide the opportunity to pursue this course at a more in-depth and mathematically rigorous level.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "106", "credits": "3 Credits", "description": "Basic statistical concepts used in economics. Topics include probability distributions, expectations, estimation, hypothesis testing, correlation, and simple regression. Students who have completed ECON 306 may not schedule this course.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "106H", "credits": "3 Credits", "description": "Statistical Foundations for Econometrics Honors (ECON106H) teaches basic statistical concepts used in economics, specifically in the area of econometrics. Econometrics is a field of economics where quantitative methods are used to study economic data. Topics studied in this course include probability distributions, expectations, estimation, hypothesis testing, correlation, and simple regression. Since probability and statistics is a mathematical subject, it is nearly impossible to study it without using mathematical tools such as sets and functions. Therefore, students are expected to be comfortable with, or at the minimum open to, using algebra and mathematical arguments. Some concepts from calculus (e.g. derivatives and integrals) are important to understand continuous probability distributions such as the famous normal distribution. Therefore, the course will spend some time reviewing important concepts and results from calculus as needed. Students will also learn and other probability distributions and density functions, and be able to apply them in practice. Students will use computer programs to model randomized experiments and run regressions on datasets for analysis. Interpreting the findings of the regressions are key to understanding what the data shows, and depending on the data, the results may also have important policy implications. ECON106 is a required course for all majors in economics. This honors version of the course is designed to provide the opportunity to pursue this course at a more in-depth and mathematically rigorous level. It is a natural preparation for taking an honors section of Econometrics (ECON306), which is an introductory course on econometrics. Students who have completed ECON306 may not schedule this course.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"department": "ECON", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "ECON", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ECON", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "ECON", "number": "302", "credits": "3 Credits", "description": "ECON 302, Intermediate Microeconomics (3 credits) (GS) (BA). This course teaches microeconomic theory at an intermediate undergraduate level, taking a more mathematical approach. Major components of the course are constrained maximization, the theory of the consumer, the theory of the producer, general equilibrium, market structures, and game theory. The goal of this course is to give the student the fundamentals of microeconomics that will be applied widely to upper level courses in economics. The course begins by developing a model of consumer behavior. This model is extended to derive a consumer's demand for a good, and then numerous applications of this model are investigated, including income and substitution effects of a price change, as well as the determination of relative prices in a general equilibrium framework. The supply side of the market is then discussed. The theory of the firm is developed, and students will explore firm behavior and welfare analysis in various market settings including perfectly competitive markets, monopoly, and oligopoly with strategic interaction between firms. Economics is an analytical subject. Students will learn to use inductive reasoning and other scientific methodology necessary to understand this and other (social) sciences. In short, students will learn to think like an economist. The goal of this course is to extend student understanding of the topics introduced in the principles-level class to the way they are applied in the upper level courses in economics.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "302H", "credits": "3 Credits", "description": "ECON 302H Intermediate Microeconomic Analysis (Honors) (3) (GS) (BA) This course is the honors version of ECON302 and meets the Bachelor of Arts degree requirements. There are two branches within the discipline of economics: microeconomics, focused on the behavior of individual economic actors (consumers, firms, and government) and macroeconomics, focused on economic aggregates (e.g., inflation, unemployment, aggregate economic growth). There are four core courses in economics that are required of all majors and minors: introductory and intermediate courses in microeconomics and macroeconomics. This course is the upper-level core course in microeconomic analysis. Students will learn, at a deeper level than that covered in the beginning microeconomics course (ECON 102), and with extensive use of calculus, about supply and demand, consumer theory, the theory of the firm, market structure and market power, factor markets, and extensions to consider uncertainty, missing markets, and limited information. Students will develop their skills for analysis of microeconomic issues. The skills learned in this course are necessary for a student to succeed in advanced courses. As such, this course is a prerequisite for a large number of microeconomics-oriented courses at the 400 level. This honors version of intermediate microeconomics is designed to provide the opportunity for students with advanced knowledge to pursue this key course at a more rigorous and in-depth level.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "304", "credits": "3 Credits", "description": "ECON 304 (Intermediate Macroeconomics) (3) (GS) (BA). This course looks at the causes and consequences of business cycles. Students begin by examining key macroeconomic variables, including nominal and real interest rates, nominal and real GDP, unemployment rates, and potential economic growth. A two-period consumption model is also analyzed with the life cycle theory of consumption. Economic models are studied to analyze these topics, and macroeconomic goals for a society are discussed. After acquiring many analysis tools, the course discusses general equilibrium, where formal theories can model a variety of shocks that hit the macroeconomy and the corresponding reactions in a variety of markets. Related topics include the production function, marginal productivity of capital, firm investment, labor demand, labor supply, marginal product of labor, the supply side of the economy, and aggregate demand. After establishing a solid understanding of general equilibrium, students will examine the Federal Reserve, monetary policy, the market for reserves, open market operations, and quantitative easing. The course finishes with lessons comparing and contrasting classical economic theory vs. Keynesian economic theory. The strengths and weaknesses of each theory are considered relative to the business cycle data.", "prerequisite": "ECON 104", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "304H", "credits": "3 Credits", "description": "ECON 304H Intermediate Macroeconomic Analysis (Honors) (3) (GS) (BA) This course is the honors version of ECON304 and meets the Bachelor of Arts degree requirements. There are two branches within the discipline of economics: microeconomics, focused on the behavior of individual economic actors (consumers, firms, and government) and macroeconomics, focused on economic aggregates (e.g., inflation, unemployment, aggregate economic growth). There are four core courses in economics that are required of all majors and minors: introductory and intermediate courses in microeconomics and macroeconomics. This course is the upper-level core course in macroeconomic analysis. Students will learn, at a deeper level than that covered in the beginning macroeconomics course (ECON 104), and with extensive use of calculus, about the measurement and structure of the national economy, long-run economic performance and the factors that influence it, business cycles and macroeconomic policy, and the environment and institutions that are pertinent to macroeconomic policy. Students will develop their skills for analysis of macroeconomic issues and policy. The skills learned in this course are necessary for a student to succeed in advanced courses. As such, this course is a prerequisite for a large number of macroeconomics-oriented courses at the 400 level. This honors version of intermediate macroeconomics is designed to provide the opportunity for students with advanced knowledge to pursue this key course at a more rigorous and in-depth level.", "prerequisite": "ECON 104", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "306", "credits": "3 Credits", "description": "The implementation of statistical techniques to analyze data and address economic questions.  Econometric results are produced and assessed.", "prerequisite": "ECON 106"}, {"department": "ECON", "number": "306H", "credits": "3 Credits", "description": "The implementation of statistical techniques to analyze data and address economic questions.  Econometric results are produced and assessed.  ECON 306H Introduction to Econometrics (3) In this course students learn basic quantitative methods used in applied economics, focusing on linear regression models and their applications. The course will cover topics similar to those covered in ECON 306 but with more mathematical rigor (i.e., using calculus). Following an introduction and reviews of probability and statistics, the course will focus on: (1) the statistical properties of commonly-used estimators and test statistics in regression models, (2) how to use them in practice for statistical inference, and (3) the issue of endogeneity and instrumental variables. Students will study both practical and theoretical aspects of econometrics, by which they will be able to implement the basic methods in practice and to understand the limitations of these methods. This course is an honors version of the second quantitative course in economics that is now required of all economics majors. As noted above, students will learn both theoretical and practical aspects of econometrics, so that they will be able to carry out econometric analyses of data. Evaluation of student performance will be based on homework assignments, midterm exams, and a final exam. Typically, the homework assignments would account for 20 percent of the overall course grade, each of two midterm exams would count for 25 percent of the grade, and the final exam would count for the remaining 30 percent of the grade. This course has ECON 106/106H, Statistical Foundations for Econometrics, as a prerequisite, and will use calculus. Further, the course is a prerequisite for advanced course work in econometrics, such as ECON 465W, ECON 466W, and ECON 483W, as well as other 400-level courses requiring econometrics.", "prerequisite": "ECON 106", "other": ["Honors"]}, {"department": "ECON", "number": "315", "credits": "3 Credits", "description": "Labor Economics, ECON 315 (3 credits) (GS) (BA). This course is designed to develop the concepts and techniques of labor economic theory and its applications. Key questions to consider for the course include: Why do some people earn more than others? When would people choose to work or not? When would someone choose to further his or her education? Do earnings differences necessarily mean discrimination? To answer these questions, students will begin the course by learning the basics of the labor market, including labor demand and labor supply. Employment and earnings are then discussed, including the definition of unemployment, different types of unemployment, and reasons individuals would choose to work or not. Data is used to examine labor market trends and their implications. The course also explores human capital, wage determination, collective bargaining, wage differentials, discrimination, and related government policies. Considerable emphasis will be placed on problem solving and the application of labor economics to selected public policy issues and current economic events. Knowledge and understanding will be assessed through exams, homeworks, and a final project. This course is one of several 300-level electives which can used toward the Economics major and meets requirements for a General Education (GS) or Bachelor of Arts social science course.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "323", "credits": "3 Credits", "description": "ECON 323, Public Finance (3) (GS) (BA). This course examines contemporary fiscal institutions in the United States, public expenditures, public revenues, and the incidence of major taxes such as the personal income tax, the corporate income tax, and consumption taxes. We also discuss intergovernmental fiscal relations in a federal system of government, and public debt (or deficit financing). We explore the economic rationale for, the current data, and status of the political debate on these topics and others as time permits. Some of the key topics discussed in the lectures include externalities and solutions to market failure associated with them, efficient provision of public goods, and cost-benefit analysis as a nonmarket way to allocate scarce resources. We also devote a substantial amount of time to the market for health care and the role of government in the provision of health care in the United States. In addition to government¿s role in health care, we spend a great deal of time on other major federal government spending programs including social security and a number of spending programs targeted at low income citizens. The later includes the Temporary Assistance for Needy Families (TANF) and the Supplemental Nutrition Assistance Program (SNAP). Here, students are expected to critically analyze the major effects of these programs on poverty as well as incentives to work. On the revenue side of public finances, we focus on both the redistributive and efficiency effects of taxation. We discuss the statutory and economic incidence of consumption taxes, the personal income tax, and the corporate income tax. The last part of the course includes two major topics deficit financing and intergovernmental fiscal relations. In the deficit-financing chapter, we focus on the federal government debt. Students learn about the different measures of public debt, which include gross national debt, intergovernmental debt, and debt held by the public. Under intergovernmental fiscal relations, we discuss the delineation of spending responsibilities between the federal and state governments. We also discuss major funding sources for states and local governments in the United States.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "333", "credits": "3 Credits", "description": "ECON 333, International Economics (3 credits) (GS) (BA). This course applies the knowledge from Introductory of Microeconomics (ECON 102) and Introductory of Macroeconomics (ECON 104) into International trade. Students will learn about why nations trade and the effects of trade on both consumer and producer. Some people will gain and some people will lose from trade and students will learn how to measure gain and loss from trade. This class also introduces trade barrier policies imposed by the government such as tariff, quota, subsidy and other commercial policy such as dumping and countervailing duty. The creation of the international organizations, such as the World Trade Organization (WTO) and General Agreement on Tariffs and Trade (GATT) are discussed. Later in the course, the Macroeconomics side of the international trade is discussed as well as the Balance of Payments, which is a way to summarize and measure a countries trade with the rest of the world. Students will also examine some of the basics of the foreign exchange market and the relationship with the interest rates. Toward the end of the course, the lessons will cover the International monetary systems, which include the gold standard, Bretton Woods system, fixed exchange rates, and flexible exchange rates", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "342", "credits": "3 Credits", "description": "Industrial Organization (3 credits) (GS) (BA) Industrial Organization focuses on the study of markets with imperfect competition. After reviewing the Perfect Competition model, the assumptions of that model are systematically relaxed, allowing us to focus on market failures that result, and how they might be remedied. The Structure-Conduct-Performance paradigm is followed. The structure of an industry affects the behavior of firms in that industry, which in turn affects the performance of that industry, evaluated from an efficiency standpoint. Much current material is discussed, especially potential mergers in certain industries and how they might affect market outcomes. Attention is given to oligopolies, using game theory as a tool with which to analyze the performance of these types of markets. Pricing strategies, asymmetric information, advertising, and antitrust law are also covered. The course is designed to provide students with a theoretical background with which to understand current market structures and events. Empirical data is discussed to test the models and theories presented in class.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "351", "credits": "3 Credits", "description": "Money, credit, commercial and central banking, financial intermediaries, treasury operations, monetary policy. Students who have already taken ECON 451 may not schedule this course.  ECON 351 Money and Banking (3)(BA) This course meets the Bachelor of Arts degree requirements. In this course, students learn all about the Federal Reserve and the conduct of monetary policy: both conventional and unconventional. Students will examine many different interest rates and learn how they are determined. Students will study the importance of the Federal Reserve's dual mandate and become familiar with business cycles in the US economy since 1970 and the associated Fed policy during these episodes. Term structures of interest rates are analyzed as well as the risk structure of interest rates. The Taylor Rule and various specifications of the Taylor Rule are applied to these topics. Students also study the efficient market theory and the determination of stock and bond prices. The course finishes by engaging students in the topics of futures, options, and futures options and hedging with futures and options.The objective of the course is help students get a better understanding of macroeconomic and monetary topics and policy. Upon successful completion of this course, students will be able to contribute to any discussion about the U.S. economy and Federal Reserve policy, analyze real world events as they relate to U.S. monetary policy, and share their newly acquired human capital with others.The prerequisite for this course is ECON104. Students who have taken ECON451 cannot schedule ECON351.", "prerequisite": "ECON 104", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ECON", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "ECON", "number": "400M", "credits": "3-12 Credits/Maximum of 12", "description": "Readings, discussion, and oral and written reports on selected topics in economics.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors", "Writing Across the Curriculum"]}, {"department": "ECON", "number": "401", "credits": "3 Credits", "description": "Survey of economic ideas from Greco-Roman times to the present.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "402", "credits": "3 Credits", "description": "Development and application of the tools for decision making under uncertainty and for game theoretic analysis of economic problems.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "404", "credits": "3 Credits", "description": "An analytical survey of significant problems of current economic policy and the application of economic analysis to important social issues. This course is designed to give students a more in-depth study of various special topics and current events. Considerable analysis will focus on the economics behind these issues, including studying (where relevant) firm and consumer behavior related to the topics. Students will be expected to use intermediate and advanced economic methods and models while analyzing these issues. The specific topics chosen will reflect the academic and research interests of the instructor who will be qualified to provide an extremely detailed course and lesson plan related to the issues.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "404W", "credits": "3 Credits", "description": "An analytical survey of significant problems of current economic policy and the application of economic analysis to important social issues.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "ECON", "number": "406", "credits": "3 Credits", "description": "Economic theory of the resolution of social conflicts: social choice theory, voting, noncooperative games, voluntary trade, and allocation by force.", "prerequisite": "ECON 402"}, {"department": "ECON", "number": "407", "credits": "3 Credits", "description": "Applications of the tools of game theory to analyze topics in collective decision making.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "407W", "credits": "3 Credits", "description": "Applications of the tools of game theory to analyze topics in collective decision making. ECON 407W Political Economy (3) The course covers two main topics. First, the course will analyze elections as a mechanism to aggregate preferences of the electorate. It will be shown that elections provide a good tool to strike a compromise between all members of the electorate if the scope of disagreement in the electorate is one-dimensional. A simple model of taxation in which citizens' preferences over tax rates are \"one-dimensional\" in the above sense will be developed. This model will be used to predict how tax rates in democratic countries change with the income distribution. It will be shown next that no satisfaction mechanism of preference aggregation exists in a slightly more general model of taxation. This result is a special case of the famous Impossibility Theorem by Arrow.Secondly, conditions will be given under which elections are a good mechanism to aggregate information that is spread throughout the electorate. It turns out that theories of information aggregation yield a convincing theory about abstention. A model in which the less informed voters delegate the decision to the more informed voters by simply abstaining will be discussed. The discussion of political debates and the media will be framed in terms of an information aggregation model. Finally, the potential of information aggregation theories to explain social movements will be discussed.Game theory provides a framework to think about many issues in the social sciences. This particular course focuses on some applications of game theory to politics. The first, and very specific goal, is to use the lens of game theory to understand the workings of various political institutions. The second, more general, goal is to enable students to apply game-theoretic reasoning to a wide range of topics in the social sciences. The third is to make the research frontier in the field of political economy as accessible as possible. It is hoped that students would get a better understanding of what graduate school would be like.This course has as its broad objective to expose students to the use of the tools of game theory to analyze collective decision making. Students will learn how to use economic theory to analyze real-world situations of collective decision making. They will develop their analytical skills as well as their skills in writing in economics.The writing-intensive course is one of a series of 400-level writing intensive seminars that the Economics Department is offering to its advanced undergraduates in seven different area of economics. This seminar is in the area of microeconomic theory.The course will count toward the major and the minor in economics as a 400-level course. Further, it will count toward completion of a module (specialization) in the area of theory and quantitative methods.", "prerequisite": "ECON 402", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "408", "credits": "3 Credits", "description": "A comparative and cost-benefit analysis of intellectual property that examines patents, copyrights, governmental supported research, and prizes.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "408W", "credits": "3 Credits", "description": "A comparative and cost-benefit analysis of intellectual property that examines patents, copyrights, government supported research, and prizes.  ECON 408W Intellectual Property (3)We live in a society that has a decentralized system based on the institutions of private property and trade. In such a system, things belong to people and can be transferred by their owners to other people. An exchange that moves something to someone who values it more than its present owner produces a net benefit, which may be shared between the parties to the exchange. Thus such a system tends to move everything to those who most value it, producing an efficient allocation of goods and services. The logic and limitations of this process make up the branch of economics called price theory. The course undertakes an examination of intellectual property, a subfield of property rights. In the context of intellectual property, there are five specific areas of note: patent races, poorly constructed incentives, standards, licenses, and an examination of costs. There are three factors relevant to the costs of providing legal protection to some particular sort of intellectual property. One is how easy it is to define and defend property in that sort of idea. Another is the degree in which someone who creates and claims ownership in that particular sort of intellectual property reduces, by so doing, the options available to other people. The more serious these problems are, the less the gains from defining and enforcing property rights in ideas. Where they are sufficiently serious, we are better off with an intellectual commons--a legal regime in which certain classes of ideas are free for all to use than with intellectual property. These three costs must be balanced against the benefits--production of more and better intellectual property and better coordination of intellectual property once produced. The larger these benefits are likely to be, the greater the costs we are willing to bear in order to get them. The course objectives are to apply the framework of comparative and cost-benefit analysis to the study of intellectual property. The course will examine the empirical evidence, and also consider policy issues in this area.", "prerequisite": "ECON 302", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "409", "credits": "3 Credits", "description": "Terrorism throughout history; economic causes, costs, sources, and consequences.", "prerequisite": "ECON 402"}, {"department": "ECON", "number": "409W", "credits": "3 Credits", "description": "Terrorism throughout history; economic causes, costs, sources, and consequences.  ECON 409W Economics of Terrorism (3)This microeconomics seminar examines the economics of terrorism. Beginning with a survey of terrorism through history and extending to terrorism in the 21st century, economic tools are deployed to better understand the causes and sources of terror. Terrorism imposes substantial economic costs, but there are also significant costs with policies to combat terrorism. A society is better off if the threat of terrorism can be reduced, or even eliminated, just as it is better off if the threat of crime can be reduced or eliminated. There are some economic roots of terrorism, but these have more to do with the incentives and constraints that individuals and organizations face than with any specific set of easily quantifiable factors that push people toward involvement in terrorist organizations. This suggest that policy responses to terrorism need to multi-faceted and flexible. Security policies, for example, need to be more cost effective, in order for both to achieve results and to limit the negative consequences of devoting excessive resources to security purposes. Similarly, aid policies need to concentrate on achievable objectives, both to obtain positive results and to provide a more representative and optimistic outlook on the future. Policies need to be targeted at filling in the voids left by weak states and shifting incentive structures within societies away from the use of violence.", "prerequisite": "ECON 402", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "410", "credits": "3 Credits", "description": "Economic analysis of the employment relationship from the microeconomic perspective, with emphasis on current labor-market problems and public policy issues.", "prerequisite": "ECON 102"}, {"department": "ECON", "number": "411", "credits": "3 Credits", "description": "Topics in behavioral economics; selected games; evolutionary models of social behavior, herding, overconfidence.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "411W", "credits": "3 Credits", "description": "Topics in behavioral economics; selected games; evolutionary models of social behavior; culture and social behavior; herding; overconfidence.  ECON 411W Behavioral Economics (3)Behavioral economics examines recent evidence from experiments that seems to violate the hypotheses of economic rationality in traditional microeconomic theory. The course considers, among others, the following three topics: (1) Altruism in human behavior, as demonstrated, for example, in public goods experiments where people typically contribute some positive amount, even with the individually optimal strategy being to contribute nothing. (2) The prevalence of co-operative behavior in societies, which seems essential to their functioning, but which is hard (but not impossible) to explain on the basis of the actions of purely self-interested individuals. (3) Fairness in distribution: for example, people do not try to extract everything that their partners or opponents can give even when they are in a position of power (as in being the proposer of a take-it-or-leave-it offer). Students play some well-known games with each other to generate examples of their own behavior in multi-person interaction contexts; the results of the games are analyzed to detect regularities in the observed behavior; and the class discusses possible explanations drawn from economics, evolutionary biology and psychology as to why people (specifically the students) played the way they did in these games. Overall, then, students will learn about various aspects of behavioral economics, including several games and evolutionary models of social behavior, and how these aspects square with conventional economic theory. Students will develop the skill of analyzing behavior from a behavioral economics perspective. This course is a 400-level seminar, part of the Economics Department's offerings, many of them writing-intensive, for our advanced students in each of seven broad areas of economics. This writing-intensive seminar is in the area of microeconomic theory. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 302", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "412", "credits": "3 Credits", "description": "Advanced topics in labor economics: theory, empirical evidence, and policy.  ECON 412 Labor Economics and Labor Markets: Theory, Evidence, and Policy(3)This course is an advanced course in labor economics. Its coverage of topics overlaps somewhat with the topics covered in ECON 315, but typically the treatment of the topics considered will be distinctly more rigorous for this 400-level course. The broad areas that will be focused on in the course include labor supply, investment in human capital, labor demand, wage determination, search and unemployment, and earnings inequality. The objective of this course is to introduce students to topics in labor economics with a rigorous and advanced analytical approach. For each topic, the course will consider the underlying theory, pertinent empirical evidence, and implications for public policy. The instructional and educational objectives are to provide students with a strong background in labor economics. This will allow them to take advanced seminar courses in the labor field. This course is an advanced introduction to labor economics, and as such has a prerequisite of either ECON 302 or ECON 315. In turn, this course will serve as a gateway to advanced seminar courses in labor economics at the 400 level that the Economics Department is in the midst of creating. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 306", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "413", "credits": "3 Credits", "description": "This course is for those who are interested in the challenge posed by persistent world poverty. We will address many different poverty related issues and the goal is to examine how economists can contribute to shedding light on the problem of world poverty and providing insights into its alleviation. Among the questions that we will address are: How persistent is the extent of world poverty? Does rapid economic growth help the poor? Why do some countries grow fast and others fall further behind? What is economic life like when living under a dollar a day? How do we deal with the disease burden? Does providing meals in schools help students perform better? Is microfinance overrated? Has globalization hurt or help the poor? Does foreign aid help or hinder the economic prospects of poor countries?", "prerequisite": "ECON 304"}, {"department": "ECON", "number": "413W", "credits": "3 Credits", "description": "Economic prosperity in historical perspective; recent successes (East Asia, China, India); ongoing challenges (the bottom billion; sub-Saharan Africa).  ECON 413W The Challenge of World Poverty (3)This course will first consider economic growth and the spread of economic prosperity in historical perspective. Then contemporary success stories, including the East Asian miracle and growth in China and India, will be studied. The last part of the course focuses on the poor worldwide, and examines poverty traps in Africa, why aid doesn't work, and why globalization hasn't helped. Students are expected to learn about the barriers to reducing world poverty and proposals aimed at alleviating poverty. Students will also learn about the growth and diffusion of economic prosperity, with both historical and contemporary examples. Students will develop analytical skills as we4ll as writing skills. This course is one of a series of 400-level seminars, many of them writing-intensive, for our advanced students in each of seven broad areas of economics. This writing-intensive seminar is in the area of economic growth and development. The course will count toward both the major and the minor in economics. Students will read four books about world poverty, write short book summaries, and write a term paper focuses on one feasible solution to alleviating poverty in Africa. In addition, there will be a midterm exam and a final exam.", "prerequisite": "ECON 471", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "414", "credits": "3 Credits", "description": "Economics/life according to Gary Becker: criminal behavior; economics of the family (marriage, divorce, intrahousehold resource allocation, bequests), policy issues.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "415", "credits": "3 Credits", "description": "Evidence on climate change; economic models of the environment and market failure; cost-benefit analysis of policy options; carbon markets.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "415W", "credits": "3 Credits", "description": "Evidence on climate change; economic models of the environment and market failure; cost-benefit analysis of policy options; carbon markets.  ECON 415W The Economics of Global Climate Change (3)The first part of the course reviews the scientific evidence on global climate change (IPCC studies). This is followed by an analysis of market failure in the production of greenhouse gas emissions, and consideration of carbon markets as a policy response. A cost-benefit study of the control of greenhouse gases (the Stern Report) is examined, and the concluding part of the course looks at a computer model of economic activity and the environment. Students will learn about the scientific evidence on global climate change, and the associated economic implications, market failures, and policy options to mitigate those market failures. Students will develop skills to assess policy options in this area, and they will become conversant with applied cost-benefit analysis and a computer model of economic activity and the environment. This course is one in a series of 400-level seminars, many of them writing-intensive, for advanced economics students in each of seven broad areas of economics. This writing-intensive seminar is in the area of applied microeconomics. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 428", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "417", "credits": "3 Credits", "description": "Uncertainty and Risk as related to finance, insurance, health, labor, industrial organization, and macroeconomics.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "417W", "credits": "3 Credits", "description": "Uncertainty is examined in contracts, with an emphasis on limited liability. Asymmetric information and economic puzzles are also considered.  ECON 417W The Economics of Uncertainty (3)This course studies the allocation of resources under uncertainty. Decisions without perfect information require the use of probability theory and expected utility preferences. The seminal work of Arrow and Debreu is used as a starting point. Probability and utility theory are then used to interpret insurance contracts. Limited liability is introduced and the Modigliani-Miller Theorem is applied to loan guarantees, deposit insurance, and insurance claims. Finally, asymmetric information is discussed and the resulting problems of moral hazard and adverse selection are addressed. The course objectives are to introduce students to the theoretical framework used by economists to study uncertainty and to apply that framework in order to explain various regularities observed when decisions are made without complete information, to examine the empirical evidence, and to consider policy issues in this area. The course will count toward both the major and a minor in economics.", "prerequisite": "ECON 302", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "421", "credits": "3 Credits", "description": "There are many data sets but the information contained within them for economic analysis is often unclear without substantial investigation. The broad course objectives are 1) to familiarize students with the deficiencies of real-world data and 2) teach students how to address those deficiencies. Specific topics addressed include the reliability of data sources, the ambiguity in variable definitions, the miscoding of variables, and missing data. In addition, truncation and censoring from the data collection methodologies are examined. The econometric methods of linear regressions and instrumental variables are used to analyze the results of a model with and without the data errors. The results are studied to predict how the missing data can alter model outcomes and policy choices. Several economic data sets are examined to illustrate the concepts. Specific examples of datasets include microeconomic data such as industry growth and profits, elasticity and revenue estimates from pricing choices, output of homogenous goods such as gold and oil, consumer subscription rates to services such as cell phone and internet service and discount memberships, and the efficacy of new drugs in tests. Macroeconomic data topics include discussions regarding unemployment and job data forecasts and how this can relate to future monetary and fiscal policy. Other topics discussed include sample bias and low response rates to surveys, in which the numerical values of dataset itself were not manipulated, but gathered from samples which will give an inaccurate result. These issues can affect polling and predictions in elections. This course is an applied course in the field of econometrics and will seek to provide students with the analytical methods for understanding the economic content of data. The instructional and educational objectives are to expose students to the practical details of analyzing economic data in the context of an advanced seminar. The course will count toward both the major and minor in economics.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "422", "credits": "3 Credits", "description": "This course provides a framework for the analysis of monetary history. The course objectives are to introduce students to the theoretical framework used by economists to study monetary theory, and to apply that framework in order to explain various monetary systems that have existed in the past. We will examine the empirical evidence, and also consider policy issues in this area. There is scope for re-examining existing analyses of many of those historical systems. Topics discussed in the course include the Federal Reserve control of the money stock, the demand for money, money as part of economic activity, economic indicators and monetary policy, the Lucas critique, interest rates and the frequency at which they are changed, the creation and purpose of central banking, and private banking regulations. Historical monetary events to be discussed include monetary policy before and during the Great Depression, monetary policy during the Great Recession of 2007 - 2009, the gold standard monetary system, the Bretton Woods system, and the termination of these standards. Among all topics, both current and historical, we will examine the incentives of individuals, firms, banks, borrowers, and lenders, and governments as responses to monetary policy changes. Finally, advances in monetary theory based on macroeconomic events, both national and global, will be analyzed. The course will count toward both the major and minor in economics.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "422W", "credits": "3 Credits", "description": "Monetary history is examined.  Special attention is paid to commodity-based systems, private money, and government monopolies on currency.  ECON 422W Applying Monetary Theory to Monetary History (3)This course provides a framework for the analysis of monetary history. In the past, there have been many advances in monetary theory. Some of the advances are directly inspired by the varieties of monetary systems that have existed in the past - for example, systems in which private banks issue currency (bank-notes). There is scope for reexamining existing analyses of many of those historical systems in the light of advances in monetary theory. The course objectives are to introduce students to the theoretical framework used by economists to study monetary theory, and to apply that framework in order to explain various monetary systems the have existed in the past. We will examine the empirical evidence, and also consider policy issues in this area.", "prerequisite": "ECON 451", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "424", "credits": "3 Credits", "description": "Inequality and poverty in the United States, measurement problems, determinants of inequality, arguments for and against equality, impact of redistributive policies.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "425", "credits": "3 Credits", "description": "Analytic and policy aspects of public expenditure decisions; applications from areas of contemporary public interest.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "427", "credits": "3 Credits", "description": "Energy economics studies topics related to the supply, energy markets, and environmental impacts of energy use.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "428", "credits": "3 Credits", "description": "Environmental pollution, the market economy, and optimal resource allocation; alternative control procedures; levels of environmental protection and public policy.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "429", "credits": "3 Credits", "description": "Analysis of public revenue and expenditure structure primarily at the federal level; federalism; fiscal policy and public debt.", "prerequisite": "ECON 323", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "430", "credits": "3 Credits", "description": "Analysis of personal and industrial location decisions, regional economic growth, migration patterns, and regional policy; emphasis on tools and techniques.", "prerequisite": "ECON 102"}, {"department": "ECON", "number": "432", "credits": "3 Credits", "description": "Theories and methods for economic analysis of such urban problems as housing, segregation, government services, and transportation.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "433", "credits": "3 Credits", "description": "Causes/consequences of trade; effects of tariffs and quotas; strategic trade policy; political economy of trade restrictions and other topics.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "434", "credits": "3 Credits", "description": "Trade balance movements, exchange rate determination; monetary and fiscal policies in open economies; international policy coordination; the world monetary system.", "prerequisite": "ECON 304", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "436", "credits": "3 Credits", "description": "Analysis of the economic characteristics of women and minorities; with examination of race and sex discrimination and related government policies.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "436W", "credits": "3 Credits", "description": "Analysis of the economic characteristics of women and minorities, with examination of race and sex discrimination and related government policies.  ECON 436W Economics of Discrimination (3) (US) (BA) This course meets the Bachelor of Arts degree requirements.This course constitutes an examination of the economics of discrimination. More precisely, the course will focus on economic theories of discrimination and on efforts by economists to measure the extent of labor market discrimination. An important objective of the course is thus to learn how economists conceptualize and study discrimination. This, in turn, requires that we examine how economists view and study economic differences by race, ethnicity, and gender (these are the types of discrimination that will be focused on in the course, although we will also consider other types of discrimination). Following the existing economic literature, much of our emphasis will be on labor market discrimination, but we will also consider discrimination in education and in housing. The first substantive section of the course outline below involves examination of data on the economic characteristics of women and blacks in relation to white males, considering both the current situation and recent trends. Data on Hispanics will also be presented. This work will be done by the students, working in groups. We will look at how mainstream economists conceptualize economic differences by gender and by race/ethnicity, respectively. Then we will focus on formal models of discrimination and empirical issues in attempting to measure discrimination, and we'll also examine an alternative approach to understanding economic inequality. The concluding section of the course will examine public policy issues related to discrimination. The course will count toward either a major or a minor in economics, and will meet the writing requirement for students in economics.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"department": "ECON", "number": "437", "credits": "3 Credits", "description": "Globalization entails many dimensions: trade, migration, FDI, offshoring, cross-border licensing of technologies.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "437W", "credits": "3 Credits", "description": "This course will focus on trade, multinationals and offshoring, and explore their implications for the U.S. and developing countries.  ECON 437W Multinationals and the Globalization of Production (3)This seminar examines the international economy and the effects of multinational activity on globalization. Some of the key questions that will be examined include: Is globalization really a new phenomenon? Is it irreversible? What are the effects on wages and inequality? What are the effects on production and innovation? These questions will be addressed through a careful reading of the historical timeline, an extensive analysis of capital flows, multinational enterprises and development. Students are expected to synthesize their findings into a final paper and present what they have learned to the class. The Economics Department seeks to provide students with a series of seminar courses in each of seven broad fields in the discipline; this is a course in the field of Trade.", "prerequisite": "ECON 433", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "438", "credits": "3 Credits", "description": "Globalization, US, International, Trade, Finance, Growth, Labor, Industrial Organization, Political Economics.", "prerequisite": "ECON 306"}, {"department": "ECON", "number": "438W", "credits": "3 Credits", "description": "The economic effects of globalization on individuals, governments, nation- states and business.  ECON 438W Winners and Losers from Globalization (3)This seminar explores the various effects of globalization on individuals in the United States and abroad. It integrates material from a variety of sub-disciplines in economics, including international trade, international finance, growth theory, labor economics, industrial organization, and political economy. Discussion of each core topic is model-based and informed by empirical evidence from the recent economic literature. The objectives of the course are to (1) deepen students' understanding of the basic forces at play as globalization takes place, and their implications for individuals' well-being; (2) sharpen students' ability to critically evaluate policy issues, both theoretically and empirically; and (3) develop students' ability to craft tightly reasoned economic reports. This course is an applied seminar in international economics. The impact of globalization is explored from a cost-benefit perspective. Winners and losers are identified using the tools and framework of economics. The instructional and educational objectives are to provide in-depth analysis of the consequences of globalization in the context of an advanced seminar. The course objectives are to analyze the winners and losers from globalization. This is a course in the field of international economics. The course will count toward both the major and minor in economics.", "prerequisite": "ECON 433", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "442", "credits": "3 Credits", "description": "Application of economic theory to managerial decision making; risk, uncertainty; models and statistical techniques.", "prerequisite": "ECON 102"}, {"department": "ECON", "number": "443", "credits": "3 Credits", "description": "An economic analysis of property rights, contractual arrangements, illegal activities, and regulation; competitive problems due to externalities and market failure.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "444", "credits": "3 Credits", "description": "Coordination and incentive issues within a corporation. Topics include employment contracts, performance incentives and pricing of financial assets.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "445", "credits": "3 Credits", "description": "Economic analysis of U.S. health care system; planning, organization, and financing; current public policy issues and alternatives.", "prerequisite": "ECON 302", "other": ["Cross-listed with: HPA 445", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "445W", "credits": "3 Credits", "description": "Economic analysis of U.S. health care system; planning, organization, and financing; current public policy issues and alternatives.  ECON (H P A) 445W Health Economics (3)The healthcare sector comprises a set of markets that differ in some significant ways from the textbook model. In the US, this sector performs well in some respects and questionably in others. Notably, there has been sustained improvement over time in life expectancy and other indicators of the effectiveness of health care for most people, but the resources devoted to producing this improvement have been growing considerable faster than GDP. The goal of this course is to examine several broad questions raised by these facts. The course begins with an overview of evidence on wealth, health expenditure, and life expectancy across countries, and then examines increasing life expectancy and medical expenditures in the US and their causes. Issues in measuring the value of medical expenditures are addressed, and an overview of the industrial organization of health care is provided. A major component of the course covers the economics of health insurance, and the course also examines medical R&D and the pharmaceutical industry as well as issues in the financing of medical care for the elderly. The course seeks to introduce students to the economic analysis of health care. It is in the area of applied microeconomics, and deals with issues relating to labor markets and public finance, in particular. This writing-intensive course will be one of several 400-level W seminars that the Economics Department is seeking to establish, with the broad objective of exposing our advanced undergraduate students to economic analysis in a seminar setting requiring significant writing by the students. The course counts toward the major and the minor in economics, as a 400-level course, In addition, it also counts toward a 'module' (area of concentration) in human resource and public economics. Student performance in the course will be evaluated based on three papers.", "prerequisite": "ECON 302", "other": ["Cross-listed with: HPA 445W", "Writing Across the Curriculum"]}, {"department": "ECON", "number": "446", "credits": "3 Credits", "description": "Dynamics of industry evolution; empirical evidence and theoretical modeling of firm entry, growth, and exit; entrepreneurship; investment and strategic behavior.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "446W", "credits": "3 Credits", "description": "Dynamics of industry evolution; empirical evidence and theoretical modeling of firm entry, growth, and exit; entrepreneurship; investment and strategic behavior.  ECON 446W Economics of Industry Evolution (3)Industries are not static entities. They continually evolve as new products and production techniques are developed. In response to changes in demand and technology, new firms enter while existing firms grow, decline, and exit. This course studies the dynamics of industry evolution using both empirical tools and theoretical models of firm decisions to analyze the following broad questions: How does a new entrant establish a foothold in an industry? How does the entry process differ between industries built around new products versus industries for well-established products? What is the role of entrepreneurship and human capital? How do firms affect their growth and survival prospects by investing in R&D and other types of innovation? How does the life-cycle of high-tech industries differ from consumer products or capital-intensive manufacturing or services? The roles of antitrust policy and regulation in affecting firm turnover and industry evolution are also addressed. This course will seek to provide students with both theoretical and empirical methods to analyze the economic forces underlying the evolution of industries. Students will develop analytical and writing skills in the course. This course is one of a series of advanced, writing-intensive seminars in each of seven broad fields in economics; this is a course in the field of industrial organization. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 444", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "447", "credits": "3 Credits", "description": "Topics in sports; demand, owners, ticket resale, leagues, markets, efficiency, antitrust, discrimination, collegiate sports.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "447W", "credits": "3 Credits", "description": "Examination of economic issues pertaining to professional and collegiate sports, including analysis of industrial organization, labor markets, and local economies.  ECON 447W Economics of Sports (3)Sports play a pervasive role in life in these United States, and this course examines a wide-ranging set of issues in considering the economics of sports. Students will learn about various aspects of sports in the United States, including the 'players' (players, owners, fans), the institutional settings (sports leagues), and the effects of sports on the cities in which they are played. Students will develop the skills to analyze a wide variety of issues in sports economics. The course will touch on aspects of three distinct fields in economics: labor economics, industrial organization, and urban economics. This course proposal is one of a series of 400-level seminars, many of them writing-intensive, for advanced students in economics in each of seven broad areas of the discipline. This writing-intensive seminar is in the area of applied microeconomics. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "ECON", "number": "448", "credits": "3 Credits", "description": "Theoretical and empirical analyses of auctions and procurements; different modeling environments; econometric analysis of auction and procurement data.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "448W", "credits": "3 Credits", "description": "Theoretical and empirical analyses of auctions and procurements; different modeling environments; econometric analysis of auction and procurement data.  ECON 448W Economics of Auctions and Procurements (3)This course provides the basic framework for theoretical and empirical analyses of auctions and procurements. The course begins with the foundations of game theory. Both complete and incomplete information models are emphasized. The main auction and procurement modeling environments are then covered. Included among these are the independent private value model, common value model, affiliated private value model, and basic forms of asymmetry. Several data sets are provided for discussion and analysis including FCC spectrum auction data, timber auction data, and road procurement data. Empirical models are proposed for the econometric analysis of the auction and procurement data. This course seeks to provide students with the analytical methods of both the theoretical and empirical analysis of auctions an procurements. Students should develop their analytical skills pertinent to the economics of auctions and procurements, and they will also develop their skills in writing in economics. This course is part of a series of advanced writing-intensive seminars in each of seven broad fields in economics. This is a course in the field of applied microeconomics. The course will count toward both the major and a minor in economics.", "prerequisite": "ECON 402", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "449", "credits": "3 Credits/Maximum of 3", "description": "Collusion, Bidding Rings, Antitrust, Price Fixing, Incentives, Law", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "449W", "credits": "3 Credits", "description": "Theoretical and empirical analysis of collusion among firms, case studies of cartel behavior, bidding behavior at auctions and procurements.  ECON 449W Economics of Collusion (3)Collusion by firms -- the explicit suppression of interfirm rivalry -- is profitable. However, it is often difficult to accomplish meaningfully. This course provides frameworks to analyze interfirm interactions, both theoretically and empirically. In addition, several case studies of cartel behavior in the U.S., Europe, and elsewhere are presented. Bidder behavior at auctions and procurements will also be examined to understand some of the underlying issues of collusion. Following an introductory section, the course examines first the law regarding collusion and then the history of collusion, focusing on notable cases in the U.S. and Europe. Economic models of collusion are then reviewed, along with the distinction between tacit and explicit collusion. The final substantive section of the course examines issues encountered in prosecuting collusion. The broad objective of the course is to use the tools of economics to analyze the interactions of firms in settings where collusion may occur. Educationally, then, the course seeks to expose students to the application of economic analysis in a context with major economic and legal implications. This is an advanced undergraduate course in the field of Industrial Organization (IO), and hence will add to our offerings in the IO field (our beginning IO course is ECON 342). Econometrics (ECON 490) is also a prerequisite because of the empirical analyses that will be an important component of the course. The course is one that may be used to satisfy requirements for the major and the minor in economics, as a 400-level course. It may also be used to complete a module (area of specialization) in the Economics of Business and Law. And it will serve as one of the Economics Department's writing-intensive 400-level seminars. Student performance will be evaluated via two midterm exams and a substantial term paper. The exams will each count for 15% of the overall course grade, and the term paper will count for the remaining 70% of the course grade.", "prerequisite": "ECON 302", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "451", "credits": "3 Credits", "description": "Monetary and income theory; monetary and fiscal policy.", "prerequisite": "ECON 304", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "452", "credits": "3 Credits", "description": "This course studies the economics of financial crises with special emphasis on 2008.", "prerequisite": "ECON 304"}, {"department": "ECON", "number": "452W", "credits": "3 Credits", "description": "Examination of causes and consequences of financial crises; asset pricing theory, market efficiency, speculative bubbles; policy considerations.  ECON 452W Financial Crises (3)This course focuses on the causes and consequences of financial crises. We study famous crashes from the South Sea Bubble to Long-Term Capital Management, as well as international financial crises such as the Asian Crisis of 1997-98 and the Argentine Crisis of 2001. We examine both the history of the crises and the economic factors that are the fundamental causes, in part with a view to determining if these crises were the inevitable outcome of speculative markets, or the result of regulatory error. The instructional and educational objectives of the course are to provide students with the opportunity to explore financial crises in a small, advanced seminar setting. The course objectives are to provide students with a theoretical framework for examining financial crises, to examine evidence on historical and more recent financial crises using that theoretical framework, and to consider policies aimed at avoiding and/or alleviating the effects of financial crises in light of the theoretical framework and the empirical evidence. The course is part of a curriculum overhaul of 400-level courses in economics, in which advanced seminar courses are being created in seven broad areas of economics. This seminar is in the area of macroeconomics. This course may be used to meet major or minor requirements.", "prerequisite": "ECON 451", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "454", "credits": "3 Credits", "description": "It is not uncommon for two separate and distinct corporate entities within an industry to merge and become one firm. This course includes topics that examine the economics of mergers as well as economic policy with regard to mergers. There often are both pro-competitive and anti-competitive effects of mergers. In the U.S. the Federal Trade Commission has primary responsibility for assessing the balance between effects. Along with the FTC, the antitrust division of the department of justice can analyze potential mergers using economic data and forecasts with tools such as the HHI and four-firm concentration ratio. Legality of non-competitive markets and mergers is also analyzed using the Clayton and Sherman antitrust acts. Topics discussed related to pro-merger economic effects include reduction in the duplication of costly capital, economies of scale, reducing costs by cutting management, human resources, payroll, and other jobs not directly related to production of output. Further, some firms may contend that they are non-viable as a small business, but can survive as a larger competitor as the result of a merger. Finally, mergers may have positive implications for shareholders who effectively own the company. Negative effects of mergers topics are discussed, including a reduction in the number of competing firms, increase in market power, higher prices, reduction in consumer choice, and increased lobbying power of larger firms. This course examines unilateral effects and coordinated effects as identified in the horizontal merger guidelines. Vertical mergers are analyzed as well, where multiple parts of the production process of a final good come under the same ownership. Econometric issues associated with the measurement of unilateral and coordinated effects are discussed. The course concludes with ex-post merger reviews. This course is an applied microeconomics seminar in the field of industrial organization and will seek to provide students with the analytical methods of both the theoretical and empirical analysis of mergers. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "455", "credits": "3 Credits/Maximum of 3", "description": "Economics of the Internet; electronic commerce and network economics; pricing issues; intellectual property.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "455W", "credits": "3 Credits", "description": "Economics of the Internet; electronic commerce and network economics; pricing issues; intellectual property.  ECON 455W Economics of the Internet (3)The Internet has become an important part of the economy in the United States and worldwide. Often we think of the information available on the Internet as a free good, much like the air we breathe. However, the Internet is an active marketplace with unique characteristics. Internet access providers sell keywords and advertising space by means of special auction and exchange mechanisms. Intellectual property is an important and evolving concept within the Internet, especially given its worldwide application. This course is an applied microeconomics course and will seek to provide students with the analytical methods of both the theoretical and empirical analysis of the economics of the Internet. The course will count toward both the major and minor in economics. This proposal is part of a broader curriculum overhaul to 400-level economics courses. The Economics Department seeks to provide students with a series of advanced seminar courses in each of seven broad fields in the discipline; this is a course in the field of applied microeconomics.", "prerequisite": "ECON 302", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "457", "credits": "3 Credits", "description": "Consumers, Firms, Utility Maximization, Profit Function, Equilibrium, Firm Distribution.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "457W", "credits": "3 Credits", "description": "An advanced course in the economics of organizations.  The focus is on coordination, incentives, contracts, and information in corporations.  ECON 457W Economics of Organizations (3)An advanced course in the economics of organizations. The focus is on coordination, incentives, contracts, and information in corporations. The goal of the course is to analyze coordination, incentives, contracts, and information in corporations. The formal tools used in the course will be drawn from game theory, contract theory, mechanism design, and information economics. All students are required to have taken Strategy prior to enrollment.", "prerequisite": "ECON 302", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "460", "credits": "3 Credits", "description": "Economic analysis of professional and collegiate sports: organization, input and output markets, the public sector, decision-making, and public policy.  ECON 460 Issues in Sports Economics (3) This course is designed to provide students the opportunity to examine and understand the sports industry. The course integrates the perspectives of various economic areas (i.e., industrial organization, managerial economics, labor economics, public economics) with those of marketing, finance, and accounting into a single approach to industry analysis. It provides students with an appreciation for the unique realities of the professional and amateur sports enterprise. Case studies and assignments are developed so students can apply theoretical and statistical concepts to real sports activities and/or policies. Students have the opportunity to complete case analyses in teams, present their results and suggestions to the class, and respond to questions and critical reviews by their peers.", "prerequisite": "ECON 102"}, {"department": "ECON", "number": "465", "credits": "3 Credits", "description": "Econometrics, simultaneous equations, discrete choice, sample selection.", "prerequisite": "ECON 106"}, {"department": "ECON", "number": "466", "credits": "3 Credits", "description": "Random and fixed effects, endogeneity, balanced and unbalanced panels, censoring of spells, differences in differences, applications.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "466W", "credits": "3 Credits", "description": "Random and fixed effects, endogeneity, balanced and unbalanced panels, censoring of spells, differences in differences, applications. ECON 466W Panel Data Models (3) Panel data sets, consisting of repeated interviews over time of a panel of individuals (in effect, a time series of cross-sectional data on the same individuals) offer multiple opportunities for sophisticated econometric analyses, while at the same time posing some unique problems. This course will cover advanced econometric techniques for dealing with panel data. Random- and fixed-effects models are addressed initially, followed by consideration of endogeneity, balanced and unbalanced panels, censoring of spells, and differences in differences. The concluding part of the course will focus on applications.The objective of the course is to provide students with exposure to models and techniques designed to deal with panel data (e.g., data on a set of individuals at various points in time), and to equip them with the skills to utilize those techniques in practical applications of data analysis.In particular, students will learn to exploit the panel nature of a data set to allow for individual-specific heterogeneity (e.g., random and fixed effects). They will learn how to address endogeneity problems, which can arise for various reasons including forward-looking behavior of individuals. Because data are often not available for the same set of (e.g.) individuals at all points in time, care must be taken to deal with such unbalanced panels, especially when such data are absent because of actions of the individuals.In addition, since this is a writing-intensive course, an additional objective is to provide students with the opportunity to develop their skills in writing in economics.This course is one of a series of 400-level seminars, many of them writing-intensive, for advanced students in each of seven broad areas of economics. This writing-intense seminar is in the area of econometrics. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 302", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "470", "credits": "3 Credits", "description": "Economic analysis of why nations trade, barriers to trade, the international monetary system, and macroeconomic policy in an open economy.", "prerequisite": "ECON 102", "other": ["International Cultures (IL)"]}, {"department": "ECON", "number": "471", "credits": "3 Credits", "description": "Problems of capital formation, institutional considerations, theories of economic growth.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "472N", "credits": "3 Credits", "description": "Russia is the largest country on earth. It has had a major influence on world events, especially during the Soviet period. The Soviet period represents the greatest economic experiment ever undertaken. Russia has had a vast imperial experience, and its economy has proven capable of producing nuclear weapons and space exploration. Yet, its economy remains dependent on natural resources. Russia is a literary, nuclear and geopolitical superpower but not an economic superpower. This juxtaposition is unique. The aim of the course is to provide a review of Russian economic history together with main concepts explaining the peculiarities of economic and institutional development of the country. The course combines historical narrative with formal economic analyses. We will utilize both an economics and a history perspective. We will explore the development of the Russian economy in the Tsarist period, the abolition of serfdom and Russian industrialization before the Russian Revolution, and we will explore the economic history of the Soviet period. We will also explore the interaction of economic history with social history. The course will conclude by examining the myriad economic and social difficulties encountered in transitioning from a socialist to capitalist economy.", "prerequisite": "ECON 102", "other": ["Cross-listed with: HIST 402N", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ECON", "number": "474", "credits": "3 Credits", "description": "experimental methods and experimental design and uses this framework to inform a careful examination of the strengths and limitations of economic theory in explaining actual human behavior in economic situations. When economic theories do not seem to fit the data the course draws on findings from other social sciences such as psychology and sociology to explore reasons for divergence of theory and practice. The content begins with a brief history of experiments in economics. Then it outlines key features of experimental design and an introduction to the basics of game theory, which are commonly utilized in experiments. After establishing the basics, the course investigates decision making under uncertainty and compares how various theoretical explanations predict actual human decisions. We then discuss bargaining experiments and bargaining theory. The course concludes with a description of common behavioral influences and biases in judgment and decision making. There is a common theme throughout the course showing how theory and experiments can be used in conjunction to improve of understanding of economic behavior.", "prerequisite": "ECON 102"}, {"department": "ECON", "number": "475", "credits": "3 Credits", "description": "Human Capital Approach to Migration; Economics of Family Migration; Evidence: Micro and Macro Perspectives; Migration Policies.", "prerequisite": "ECON 306"}, {"department": "ECON", "number": "475W", "credits": "3 Credits", "description": "Human Capital Approach to Migration; Economics of Family Migration; Evidence: Micro and Macro Perspectives; Migration Policies.  ECON 475W Migration and Development (3)This course introduces students to migration in the developing world. What factors influence such migration, and how does migration affect economic development? The course provides a theoretical framework for examining migration (a human capital approach), and takes into consideration aspects specific to migration in the developing world, family considerations, and different types of migration. Immigration and remittances are also considered. The course examines empirical evidence on migration, and considers public policies that seek to influence migration and development. The course objectives are to provide students with a theoretical framework for examining human mobility and economic development, to examine evidence on migration using that theoretical framework, and to consider policies aimed at influencing migration and development in light of the theoretical framework and the empirical evidence. The integration of these three activities will develop student's skills in economic analysis and the writing aspect of the course will enhance their writing skills. This course is one os a series of writing-intensive seminars in seven broad areas of economics. This seminar is in the area of economic development, with relevance as well to labor economics. This course may be used to meet major or minor requirements.", "prerequisite": "ECON 471", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "477", "credits": "3 Credits", "description": "In the system of economic development, labor markets emerge and evolve. While some elements of standard labor market analysis, such as the emphasis on demand for labor and supply of labor, remain most relevant here, there are also institutional aspects that are specific to developing countries. The course begins with a short review of the traditional labor market variables (labor force participation, employment and unemployment, earnings) before viewing specific topics relevant to developing countries. These topics include rural vs. urban labor markets and the factors that influence individuals in each setting, industry regulation by national and international law, efficiency wages in growing industries, worker safety, compensating wage differentials, and comparative advantage. Particular emphasis will be placed on the unique aspects that each of these issues may face in developing countries compared to developed countries. These unique issues include microloans, mercantilism, economic nationalism, the effects on conflict on economic growth, growth models exhibiting high marginal productivity of capital and technology, growth indicators, sector-specific growth, industrialization and deindustrialization, balanced growth theory (Ragnar Nurkse), foreign investment, trade barriers, tariffs, and exchange rates. The course is an advanced seminar in the broad area of development economics. The course objectives are to enable students to learn about labor markets in developing countries, how they are different from as well as similar to those in industrialized countries, and the problems and policy issues that pertain to these labor markets. Students will develop their analytical skills in this area. Students will study these topics and learn with theory and case studies why some countries become industrialized why others remain in developing status. The course will count toward both the major and the minor in economics.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "479", "credits": "3 Credits", "description": "There are many resource allocations that are not unilateral decisions but instead require approval from two sides of the market. This course provides the theoretical constructs for the analysis of matching in market environments. Following a review of game theory, the course develops the theory of matching. The topic at large is introduced by the seminal paper in matching \"College Admissions and the Stability of Marriage\" by Gale and Shapley. Other peer-reviewed literature on the topic will be discussed. Topics that follow include economic applications in the areas of employment, marriage, college admissions, human organ donations, medical residents, and other current topics. Within each of these topics, analysis is performed to study the following questions: 1) What are the preferences and incentives of all of the market participants involved in the matching market? 2) What was the method in which matching occurred? 3) Is this end result Pareto efficient and stable? 4) If the result isn't Pareto efficient, could another method or algorithm be used to improve efficiency? 5) Does the efficient outcome yield equal (or near equal) gains to all market participants involved, or is there a large discrepancy in the utility of the participants post-matching? For example, in a marriage matching algorithm, do women end up much happier than men? In medical residencies, do hospitals end up with larger gains than the doctors? Within certain topics, specific models are also discussed, including the Beveridge curve, Cobb-Douglas matching functions, labor market frictions, Nash bargaining games, feasibility sets, disagreement points, egalitarian and non-egalitarian bargaining solutions, and risk aversion. This course is an applied economics course with relevance to the areas of microeconomics, macroeconomics, and labor economics. The course objective is for students to learn the analytical methods for understanding the economics of matching. Students will develop skills in applying matching models and analysis to practical situations. The course will count toward both the major and minor in economics.", "prerequisite": "ECON 302"}, {"department": "ECON", "number": "479W", "credits": "3 Credits", "description": "Economic application of matching to employment, marriage, organ markets, and medical residents.  ECON 479W Economics of Matching (3)There are many resource allocations that are not unilateral decisions but instead require approval from two sides of the market. Examples include employment and marriage. This course provides the theoretical constructs for the analysis of matching in market environments. Two applications of current interest - human organ allocations and medical resident employment - are given special attention. Following a review of game theory, the course develops the theory of matching. This is followed by economic applications, in the areas of employment, marriage, human organs, and medical residents. This course is an applied economics course with relevance to the areas of microeconomics, macroeconomics, and labor economics. The course objectives is for students to learn the analytical methods for understanding the economics of matching. Students will develop skills in applying matching models and analysis to practical situations. The course is one of a series of 400-level writing-intensive seminars in each of seven broad fields in economics; this is a course with relevance to microeconomics, macroeconomics, and labor economics. The course will count toward both the major and minor in economics.", "prerequisite": "ECON 402", "other": ["Writing Across the Curriculum"]}, {"department": "ECON", "number": "480", "credits": "3 Credits", "description": "Mathematical techniques employed in economic analysis; formal development of economic relationships.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "481", "credits": "3 Credits", "description": "A survey of contemporary business forecasting techniques, with emphasis on smoothing, decomposition, and regression techniques.", "prerequisite": "SCM 200"}, {"department": "ECON", "number": "483", "credits": "3 Credits", "description": "Forecasting time series, using linear regression models and econometric software; useful forecasting models; financial and seasonal time series; trends.  ECON 483 Economic Forecasting (3)This course is an applied econometrics course, and will seek to provide students with hands-on experience in forecasting. The goal of this course is to teach the students how to forecast time series, using econometric software, and what kinds of models are useful for that purpose. Topics to be covered include a review of regression analysis, with applications to forecasting; introduction to an econometric software package; introduction to time series regression analysis, with applications; the Box-Jenkins approach to time series modeling and forecasting; modeling and forecasting seasonal time series; deterministic and random trends, and how to distinguish them; and modeling and forecasting volatility of financial time series. The course will count toward both the major and the minor in economics. This course is one of a series of 400-level seminars in each of seven broad areas of economics; this is a seminar in econometrics.", "prerequisite": "ECON 306"}, {"department": "ECON", "number": "485", "credits": "3 Credits", "description": "Applying statistical techniques to test and explain economic relationships; integration of economic theory with observed economic phenomena.", "prerequisite": "ECON 102"}, {"department": "ECON", "number": "489M", "credits": "1-6 Credits/Maximum of 6", "description": "No description.", "prerequisite": "ECON 302", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors", "Writing Across the Curriculum"]}, {"department": "ECON", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "494A", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"department": "ECON", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Full-Time Equivalent Course"]}, {"department": "ECON", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "ECON", "number": "499", "credits": "2-6 Credits/Maximum of 6", "description": "Study in selected countries of economic institutions and current economic problems.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}]