[{"department": "EDPSY", "number": "10", "credits": "3 Credits", "description": "This course is an overview of the major theories and significant research on the development and explanation of individual differences and how those differences affect the education of school-age children. Specific topics include physical, cognitive, language, social-emotional, and cultural development in children and youth ages 3-20.  By its very nature, the course will include a diversity focus, with special attention to ethnic, cultural, and gender issues as well as the needs of special populations. Within each topics area, the course will pay special attention to theoretical and empirical work on how and why variations occur, how they are to be interpreted and measured, and the implications those variations have for society, especially for schooling. Traditional and alternative practices in schools will be examined to see which approaches best meet the needs of in increasingly diverse American society. The course will also address cross-cultural comparisons to identify similarities and differences in developmental patterns, what these patterns tell us about development, and the societal impacts of these patterns.  While the course will focus on individual differences in education it will not be exclusively oriented toward future teachers. The course will also help parents ( or future parents) and citizens understand the nature of development and individual differences of students as they progress through the educational system.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EDPSY", "number": "11", "credits": "3 Credits", "description": "EDPSY 11 is a course about individual differences in learners that may stem from biological and environmental influences on development and wellness. This course addresses the ways in which we consider these differences as we design environments for learners in early and middle childhood. Course content includes cognitive, language, social-emotional, moral and physical development of students in pre-elementary through middle school settings. Content also includes understanding and promotion of health and wellness in educational settings; as well as individual differences that stem from gender, ethnic, racial, and other forms of diversity in children and youth. Both primary and secondary sources serve as foundational readings for the course. Readings share research on how and why variations occur, how to measure and interpret them, and what implications such variations have on traditional and non-traditional educational environments with emphasis on developmentally appropriate and individually appropriate educational practice. Specific applications for teacher certification are included. Within each topic area, the course will pay special attention to theoretical and empirical work on how and why variations occur, how they are to be interpreted and measured, and the implications those variations have for social policy and ethical dilemmas with particular attention to educational settings. Traditional and alternative practices in schools will be examined to see which approaches best meet the needs of an increasingly diverse American society. While the course will focus on individual differences in education, it will not be exclusively oriented toward future teachers. The course will also help students understand how course content relates to parents (or future parents) understand the nature of development and individual differences of children and the students as they progress through the educational system.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EDPSY", "number": "14", "credits": "3 Credits", "description": "This introduction to educational psychology provides students with an understanding of the major concepts, principles and theories, and related research of learning and teaching. The research on learning and teaching is a primary emphasis, with clear connections made to diverse real-world contexts such as home, family life, informal and formal teaching and learning settings, as well as the influence of mass media and digital technologies on the learning process.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "EDPSY", "number": "14H", "credits": "3 Credits", "description": "Psychology of human learning applied toward the achievement of educational goals; evaluation of learning outcomes.  EDPSY 014H Learning and Instruction (3) This course is designed to give honors students an applied introductory course in learning and instruction, particularly for students who may work in an educational setting. The honors section is designed to give students a more in-depth look at content in learning and instruction and the principles underlying learning theory and effective instructional processes. The class uses a seminar approach to discuss readings related to topics in learning theory, classroom management, effective instruction, student motivation, and applied assessment. Class discussions will focus on deeper understanding of the principles of learning and instruction with a focus on how one would apply those principles in teaching others.", "other": ["Honors"]}, {"department": "EDPSY", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "EDPSY", "number": "101", "credits": "3 Credits", "description": "This course is an introduction to quantitative methods in educational and social science research emphasizing the interpretation of frequently encountered statistical procedures. Students will learn both conceptual and technical aspects of common approaches to understanding score interpretation and ranges, relationships among variables, and hypothesis testing and group comparisons. Students will learn how to use these approaches to interpret findings and draw conclusions from quantitative data.", "other": ["Bachelor of Arts: Quantification", "General Education: Quantification (GQ)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "EDPSY", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "EDPSY", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "EDPSY", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "EDPSY", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "EDPSY", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "EDPSY", "number": "400", "credits": "3 Credits", "description": "The foundations of statistical techniques used in educational research; distributions, central tendency, variability, correlation, regression, probability, sampling, hypothesis testing."}, {"department": "EDPSY", "number": "406", "credits": "3 Credits", "description": "This course introduces evidence-based decision making in education and the social sciences. The topical focus is on descriptive and inferential statistical concepts and procedures applied to univariate distributions including central tendency, variability, confidence intervals, error, p-values, mean differences, correlation, and the general linear model. Students will also gain experience with the use of statistical software to analyze and interpret data.", "prerequisite": "EDPSY 101"}, {"department": "EDPSY", "number": "408", "credits": "3 Credits", "description": "A major objective of this course is for students to be able to develop or modify instructional plans that reflect evidence based practices for adapting for the needs of English Language Learners (ELL) with special needs. The course has been developed to fulfill Pennsylvania Department of Education requirements and in recognition of the growing number of ELLs in the general population and thus, in special education settings. This course covers (1) theory and research on the instructional needs of ELLs and (2) the knowledge base on effective instruction for students with special needs and assists students in bringing these two areas of research together. Major topic areas include principles and issues in second language acquisition; ELLs characteristics including linguistic and cultural factors that affect second language acquisition; techniques and methods of research-based instruction for ELLs with special needs; lesson planning and instructional modifications for ELLs with special needs; and appropriate assessment practices for ELLs with special needs.", "prerequisite": "EDPSY 14", "other": ["Cross-listed with: SPLED 408"]}, {"department": "EDPSY", "number": "421", "credits": "3 Credits", "description": "This course covers the major theories used to explain learning across educational settings. Students will learn foundational assumptions and concepts in each theory with a primary focus on the principles that have been forwarded to explain learning. The emphasis in this course is on how these principles can be understood in applied settings and how knowledge of these principles can inform learning and instruction. This course is appropriate for students who are interested in understanding students' learning processes.", "prerequisite": "EDPSY 14"}, {"department": "EDPSY", "number": "450", "credits": "3 Credits", "description": "This is an introductory course about properties of test scores such as reliability and validity. In addition, the course focuses on the construction and evaluation of measurement instruments used in educational and psychological settings and may include topics such as test development, score reporting, and interpretation. Basic statistics are introduced throughout the course to interpret the psychometric properties of scores.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: PSYCH 404", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "EDPSY", "number": "475", "credits": "3 Credits", "description": "This is an introductory course about research methods used in educational research. Students will learn how to evaluate research in educational and applied settings and acquire knowledge needed to design a research study. Overall goals are that students will appreciate the value and limitations of research and continue to seek research articles related to their interests or expertise throughout their careers. The course offers a general survey of research methods commonly used in education and other social sciences; the primary emphasis focuses on various stages of quantitative research with less time spent on qualitative or mixed methods research.", "prerequisite": "EDPSY 101"}, {"department": "EDPSY", "number": "493", "credits": "1-3 Credits/Maximum of 3", "description": "This course serves as the capstone experience for students enrolled in the Child Maltreatment and Advocacy Studies minor.", "prerequisite": "CMAS 258N", "other": ["Cross-listed with: CMAS 493"]}, {"department": "EDPSY", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "EDPSY", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]