[{"department": "EET", "number": "2", "credits": "1 Credits", "description": "Introduction to engineering technology and the use of computer methods for analyzing and solving engineering technology problems; microcomputer fundamentals, word processing, spreadsheet, and database software packages.  EET 2 Introduction to Engineering Technology (1) The primary objective of this course is to teach basic computer skills and the use of basic computer word processing and spreadsheet applications, as well as the fundamentals of formal report writing. More specifically, students learn to use Microsoft Word (word processing) and Excel (spreadsheet) for the preparation of laboratory reports and business documentation. In addition to these applications, the course should also address as many of the following topics as possible: * Windows operating system * Selection of a personal computer * Communication through electronic mail (e-mail) * Use of the World Wide Web * Preparation of professional letters and reports * Use of an HTML editor to create web pages and use of File Transfer Protocol * Integration of drawing, image, and spreadsheet files into word processing documents * Technical problem solving The course should also provide the student with an introduction to the field of engineering technology, with a discussion of job and educational opportunities in the field. Homework and other exercises should, wherever possible, allow the student to investigate the different aspects of engineering technology, or to interact with other faculty, students, or professionals involved with engineering technology.", "other": ["First-Year Seminar"]}, {"department": "EET", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "EET", "number": "100", "credits": "3 Credits", "description": "AC and DC circuits; machinery; controls; and introduction to electronic devices, circuits, and instrumentation. EET 100 Electric Circuits, Power, and Electronics (3) Electric Circuits, Power, and Electronics is a course for non-major students who will be working with electronic equipment in industry.  This course starts with basic knowledge of DC and AC components and concepts used in industrial electrical work. Topics such as circuits, electromagnetism, sources, energy conversion and electrical instruments prepare students to continue with topics in electronics. Beginning with the basics of semiconductors and moving through diodes and transistors, the student is prepared to learn the concepts of rectification and amplification. These form a foundation for the completion of the course with a look at understanding the concepts and use of analog and digital circuitry found in Programmable Logic Control (PLC) systems used in industry today.", "prerequisite": "MATH 82"}, {"department": "EET", "number": "101", "credits": "3 Credits", "description": "Fundamental theory of resistance, current, and voltage; capacitance, inductance.  Direct current and alternating current concepts through series/ parallel circuits.  EET 101EET 101 Electric Circuits I (3)Electric Circuits I has been designed to accomplish several related goals. A basic understanding of voltage, electric current and resistance is established early in the course. Then resistance becomes a focal point of the course as resistance of copper and other materials is examined. Resistance as a function of temperature is also considered. Efficiency, electric energy and electric power concepts are developed. A considerable effort is devoted to resistors in series, parallel and series parallel arrangements. Voltage sources in series and parallel are also considered. Resistive circuits with one voltage source are considered. Branch circuit analysis using Kirchhoff's Voltage Law (KVL) and Kirchhoff's Current Law (KCL) receives considerable attention. The basic nature of Capacitance and Inductance is examined in great detail. Transient analysis of resistive- capacitive circuits and resistive - inductive circuits is covered. Sinusoidal waveforms, frequency and phase relations are introduced. Complex and polar numbers are introduced, as tools for AC circuit analysis. AC circuits with resistance, capacitance and inductance are explored. Power factor and power in AC circuits also receive considerable attention. Throughout the course, computer software is utilized for circuit analysis and evaluation."}, {"department": "EET", "number": "105", "credits": "3 Credits", "description": "Introduction to the study of electrical systems, with a focus on applications in our society. EET 105 Electrical Systems (3)  is an introductory course in electrical systems and circuits. It is an entry level course intended to give students the big picture of the electrical technology spectrum. The course will cover the fundamentals circuit analysis such as: Kirchoff's laws, parallel and series circuits, and superposition. The course then applies this knowledge to various commonplace electrical systems (toaster, electric toothbrush, fan, etc.). The course also gives students a broad, limited exposure to the breath of electrical systems by including components and topics such as resistors, capacitors, inductors, switches, relays, fuses, amplifiers, transformers and motors. Topics covered include: - Electrical Safety and House Wiring - Electrical Science - Electrical Generation and Utilization - Electrical Circuits and Analysis - Electrical Instrumentation and Measurements - Electronics - Electrical Systems - Electrical Machines The course will emphasize the basic concepts, principles, and analytical models used by engineers and technologists to design, develop and test electrical systems The course does so from a top down, non-detailed systems perspective. Upon competition of this course, students will have a broad perspective of the electrical technology spectrum as they gain a deeper focused knowledge in subsequent courses. Lectures will be supported by laboratory exercises in which the student learns about electrical instrumentation and performs electrical measurements on circuits and systems. Students will also be required to complete an electrical system project of their choosing. Students will be required to prepare written laboratory reports outlining the laboratory activity. Reports will be graded based both on their technical quality and their grammatical and professionalism. Students in EET 105 will be required to use computers in both class and laboratory exercises to simulate electrical circuits and systems and also produce high quality laboratory reports.", "prerequisite": "MATH 21"}, {"department": "EET", "number": "109", "credits": "1 Credits", "description": "Use of basic electrical instruments to measure AC and DC voltage, current, power, resistance.  Introduction to report writing. EET 109 Electric Circuits Laboratory I (1) Electric Circuits Laboratory I provides a variety of experiences building electric circuits and utilizing voltmeters, ammeters, ohmmeters and oscilloscopes to take electrical readings. Emphasis is placed on using computer spreadsheet software and computer analysis software. Throughout the course, technical writing is utilized to describe electrical experiment results. Concepts presented in EET 101 are utilized through this course.Experiments related to resistor color code, the ohmmeter and Ohm's Law provide a elementary understanding of resistance as well as the measurement of voltage, electric current and resistance. Experiments with resistors in series, parallel and series-parallel arrangements provide experience with electric circuit construction and electric circuit analysis in a laboratory situation. Kirchhoff's Voltage Law (KVL) and Kirchhoff's Current Law (KCL) receive considerable attention. Capacitors are studied in charging and AC circuits. The oscilloscope and signal generator are introduced and utilized in later experiments. AC resistive- capacitive circuits and resistive - inductive circuits are built and analyzed."}, {"department": "EET", "number": "114", "credits": "4 Credits", "description": "Direct and alternating current circuit analysis including Thevenin and Norton Theorems, mesh, node analysis.  Capacitance, inductance, resonance, power, polyphase circuits.  EET 114 ELECTRICAL CIRCUITS II (4) Electrical Circuits II is the second of two circuit courses aimed at developing fundamentals of electrical circuit operation and analysis. It covers topics in graphical analysis of circuit operation; capacitive, inductive, and magnetic circuits; and sinusoidal excitation and AC reactance due to inductors and capacitors.EET 114 is normally taken in the second semester of the freshman year concurrently with a coordinated lab course, EET 118. Completion of EET 114 provides a student with all the circuit analysis fundamentals that will be needed for later courses in electronics and AC machinery.", "prerequisite": "EET 105"}, {"department": "EET", "number": "118", "credits": "1 Credits", "description": "Use of basic electrical instruments to measure AC and DC voltage, current, power, resistance, and lab reporting.  EET 118 Electrical Circuits Laboratory II (1) Electrical Circuits Laboratory is typically taken concurrently with EET 114. The course is a 1 credit course that meets for one 2-hour session each week. Exercises in the lab guide are coordinated with materials being covered in the EET 114 course. All lab exercises involve hands-on work with equipment, and many of the labs are supported by computer activities that help the student collect and interpret data. The computer exercises are coordinated with the lab guide materials. Students are required to submit formal, written lab reports for many of the exercises.Material covered in the EET 118 lab include exercises in graphical circuit solutions, charging and discharging characteristics of capacitors, reactance and impedance measurements in AC circuits, and circuit resonance. The EET 118 lab is the first lab in which students get significant exposure to the oscilloscope, function generator, and other more sophisticated laboratory equipment.", "prerequisite": "EET 105"}, {"department": "EET", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "EET", "number": "212W", "credits": "4 Credits", "description": "Analysis and design of amplifier, rectifier, filter, comparator, oscillator, and other practical circuits using op amps and integrated circuit devices.  EET 212W Op Amp and Integrated Circuit Electronics (4)EET 212W provides students with a basic understanding of the operation and functions of general-purpose linear and non-linear electronic circuits typically found in industrial applications. The course provides background on the basic operating characteristics of key semiconductor devices (diodes, transistors, FETs, etc.); however, the emphasis is on the operation, analysis, design, and application of circuits that use op-amp's and various linear integrated circuit devices to perform typical electronic functions. Topics covered include:- Open- and closed-loop amplifier operation and feedback concepts - Inverting, non-inverting, differential, and instrumentation amplifiers - Summers, comparators, clippers, clampers, and function generator circuits - Integrators and differential circuits - Filter and oscillator circuits - Rectifier and regulator circuits The course will emphasize the concepts, principles, procedures, models, and computations used by engineers and technologists to analyze, select, specify, test, maintain, and design modern electronic systems. Particular emphasis will be given to circuits and applications prevalent in modern instrumentation and control systems. Modeling detail and the sophistication of mathematical analyses will emphasize the application of standard methods with the aid of computers. Lectures will be supported by laboratory exercises in which students will investigate actual operating characteristics of devices and circuits explained in the classroom. Lab activities will emphasize comparisons of theoretical and actual performance. Students will also be expected to develop proficiency making electronic circuit measurements using standard laboratory instruments. Laboratory activities will also form the basis for the 'W' designation assigned to this course. Students will be required to use standard analysis and reporting tools to prepare formal, written laboratory reports for a substantial portion of all laboratory activities undertaken in the class. Reports will be graded based both on their technical and grammatical quality and on their professionalism. A complete understanding of the electronic circuits covered in this course requires the use of computers. Thus, students in EET 212W will be required to use computers in both class and laboratory exercises to model and simulate the relevant performance of circuits studied.", "prerequisite": "EET 114", "other": ["Writing Across the Curriculum"]}, {"department": "EET", "number": "213W", "credits": "5 Credits", "description": "AC and DC machinery principles and applications; introduction to magnetic circuits, transformers, and electrical machines including laboratory applications. EET 213W Fundamentals of Electrical Machines Using Writing Skills (5) EET 213W is devoted to the study of ac and dc electrical machines and power conversion equipment. The course teaches fundamental concepts of electromagnetic circuits as they relate to the physical forces that act on electrical conductors moving in magnetic fields, and the electrical currents and voltages induced in those conductors by that same motion. The course covers characteristics of magnetic materials and how they influence the operation of electrical machines, and investigates how these properties and principles are used to develop simple yet practical models of various electromotive and power conversion devices. Presentation of principles and theory will be relatively rigorous; however, the level of modeling detail and the sophistication of mathematical analyses of machine operation will be limited to first order (i.e., linear) and some simple second-order (non-linear) approximations. Students in EET 213W should gain a sound understanding of how and why ac and dc motors and generators, and single phase ac transformers work as they do. The understanding should extend to cover most types of motors, generators, and transformers commonly used in industry today. Students should also understand and be able to apply the basic mathematical and electrical models developed in the course to determine the power requirements, power capability, efficiency, operating characteristics, control requirements, and electrical demands of these machines when used in typical applications. Students will also gain a general knowledge of how motors, generators, and transformers are constructed, and understand the reasons behind the various construction techniques that are used. EET 213W is also a 'writing-intensive' course, which means one of the course objectives is to teach students to prepare formal, written documents about technical subjects. Thus, students will be required to do a significant amount of writing in the course.", "prerequisite": "EET  114 , EET  118 , ENGL 015", "other": ["Writing Across the Curriculum"]}, {"department": "EET", "number": "214", "credits": "3 Credits", "description": "Fundamental operating principles, characteristics, and analysis of electric machines, transformers, and power systems.  EET 214 Electric Machines and Energy Conversion (3)The purpose of EET 214 is to introduce students to the electromechanical energy conversion components associated with power system generation, utilization, transmission, and distribution. The course teaches fundamental concepts of electromagnetic circuits as they relate to the induced voltages and physical forces acting on electrical conductors within magnetic fields. The course covers characteristics of magnetic materials and how they influence the operation of rotating electrical machines and transformers, and investigates how these properties and principles are used to develop simple yet practical models of various power conversion devices. Basic control of AC motors, such as starting, reversing, plugging, and variable speed operation using volts per hertz is discussed in the course. Following the study of the basic components of the power system (motors, generators, and transformers), the course will provide an introduction to power systems engineering. This introduction shall include any the following topics: power distribution fundamentals and protection, power flow, analysis and load flow studies of small power systems, and computer solutions for larger power system studies. Topics covered include:- Magnetics: energy conversion principles, motor and generator action- Transformers: Single-phase, 3-phase, and autotransformers; per-unit representation- Induction Machines: construction, operation, modeling, characteristics, and basic control methods- Synchronous Machines: construction, operation, modeling, characteristics, motor and generator operation, power factor control, power delivery- Power System Representation- Power System Analysis Presentation of the principles and theory will be relatively rigorous; however, the level of modeling detail and the sophistication of the mathematical analyses of machine operation will be limited to first order (i.e. linear) and some simple second-order (non-linear) approximations. Students in EET 214 should gain a sound understanding of electrical machines and transformers and their models, and this knowledge should be extended so that the models are used in the analysis of power systems. Students should be able to apply the basic mathematical and electrical models developed in the course to determine power requirements, power capability, efficiency, operating characteristics, and electrical demands of these components when used in typical applications. The course will require that students apply basic knowledge of electric circuit analysis, electric machines, and engineering concepts to analyze and solve technical problems, using the assistance of computer tools as necessary.", "prerequisite": "EET 114"}, {"department": "EET", "number": "214H", "credits": "3 Credits", "description": "Fundamental operating principles, characteristics, and analysis of electric machines, transformers, and power systems.  EET 214 Electric Machines and Energy Conversion (3)The purpose of EET 214 is to introduce students to the electromechanical energy conversion components associated with power system generation, utilization, transmission, and distribution. The course teaches fundamental concepts of electromagnetic circuits as they relate to the induced voltages and physical forces acting on electrical conductors within magnetic fields. The course covers characteristics of magnetic materials and how they influence the operation of rotating electrical machines and transformers, and investigates how these properties and principles are used to develop simple yet practical models of various power conversion devices. Basic control of AC motors, such as starting, reversing, plugging, and variable speed operation using volts per hertz is discussed in the course. Following the study of the basic components of the power system (motors, generators, and transformers), the course will provide an introduction to power systems engineering. This introduction shall include any the following topics: power distribution fundamentals and protection, power flow, analysis and load flow studies of small power systems, and computer solutions for larger power system studies. Topics covered include:- Magnetics: energy conversion principles, motor and generator action- Transformers: Single-phase, 3-phase, and autotransformers; per-unit representation- Induction Machines: construction, operation, modeling, characteristics, and basic control methods- Synchronous Machines: construction, operation, modeling, characteristics, motor and generator operation, power factor control, power delivery- Power System Representation- Power System Analysis Presentation of the principles and theory will be relatively rigorous; however, the level of modeling detail and the sophistication of the mathematical analyses of machine operation will be limited to first order (i.e. linear) and some simple second-order (non-linear) approximations. Students in EET 214 should gain a sound understanding of electrical machines and transformers and their models, and this knowledge should be extended so that the models are used in the analysis of power systems. Students should be able to apply the basic mathematical and electrical models developed in the course to determine power requirements, power capability, efficiency, operating characteristics, and electrical demands of these components when used in typical applications. The course will require that students apply basic knowledge of electric circuit analysis, electric machines, and engineering concepts to analyze and solve technical problems, using the assistance of computer tools as necessary."}, {"department": "EET", "number": "215", "credits": "1 Credits", "description": "Laboratory study of electric machine applications, transformers, and power systems.  EET 215 Electric Machines and Energy Conversion Laboratory (1)The purpose of EET 215 is to provide students with practical experience with electromechanical energy conversion components associated with power system generation, utilization, transmission, and distribution. The laboratory experiments in this course will demonstrate empirically the concepts introduced in the companion lecture course, EET 214. Topics covered include: -Magnetics: energy conversion principles, motor and generator action -Transformers: single-phase, 3-phase, autotransformers; per unit representation -Induction machines: operation, modeling, characteristics, basic controls -Synchronous machines: motor, generator, power factor control -Power system representation and analysis Laboratory activities will require that students apply basic knowledge of electric circuit analysis, electric machines, and engineering concepts to analyze and solve technical problems, using the assistance of computer tools as necessary. Students will be expected to develop proficiency in instrumentation using standard lab equipment, and will be required to use standard analysis and reporting tools to prepare formal laboratory reports and oral presentations.", "prerequisite": "EET 114"}, {"department": "EET", "number": "215H", "credits": "1 Credits", "description": "Laboratory study of electric machine applications, transformers, and power systems.  EET 215 Electric Machines and Energy Conversion Laboratory (1)The purpose of EET 215 is to provide students with practical experience with electromechanical energy conversion components associated with power system generation, utilization, transmission, and distribution. The laboratory experiments in this course will demonstrate empirically the concepts introduced in the companion lecture course, EET 214. Topics covered include: -Magnetics: energy conversion principles, motor and generator action -Transformers: single-phase, 3-phase, autotransformers; per unit representation -Induction machines: operation, modeling, characteristics, basic controls -Synchronous machines: motor, generator, power factor control -Power system representation and analysis Laboratory activities will require that students apply basic knowledge of electric circuit analysis, electric machines, and engineering concepts to analyze and solve technical problems, using the assistance of computer tools as necessary. Students will be expected to develop proficiency in instrumentation using standard lab equipment, and will be required to use standard analysis and reporting tools to prepare formal laboratory reports and oral presentations."}, {"department": "EET", "number": "275", "credits": "3 Credits", "description": "Principles of industrial control, programming, interfacing, input/output devices, and applications. EET 275 Introduction to Programmable Logic Controls (3)Introduction to Programmable Logic Controls is a required course for sophomore-level students in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program.  Programmable Logic Controllers are one of the fastest growing multi-billion dollar segments of industry. This course provides an in-depth introduction to these devices and their use in modern process industries. Starting with an overall look at the block and modular type PLC, digital inputs, digital outputs and devices such as pushbuttons, pressure switches, motors, and indicators demonstrate the elementary application and system design to which they are applied. Ladder logic programming techniques encompass gate logic, contact/coil logic, timers, counters, arithmetic functions and number comparisons. An introduction to analog input and output applications, along with study of the Proportional+Integral+Differential (PID) process function, and PLC communication networks prepare the technologist for advanced courses on these topics. The lab component of this course provides live experience with all these concepts along with industrial problem solving experience by using indicating and actuating real-time positional and process applications.", "prerequisite": "CMPET 117"}, {"department": "EET", "number": "280", "credits": "1 Credits", "description": "Schematic design, circuit board layout and fabrication, mechanical housing fabrication.", "prerequisite": "EET 212W"}, {"department": "EET", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "EET", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "EET", "number": "310", "credits": "5 Credits", "description": "EET 310 provides an introduction to basic electrical principles and covers the DC and AC circuit analysis techniques necessary for most upper-level EET courses. The course covers DC and AC sources, capacitors and inductors, impedance, mutual inductance, ideal transformers, phasor diagrams, power and energy calculations in DC and AC Circuits, signal and energy transfer, and an introduction to three-phase systems. It also introduces ideal amplifier models and ideal operational amplifiers and their use in performing mathematical operations on analog signals. Circuit analysis techniques covered include nodal analysis, mesh analysis, linearity, superposition, source transformation, and one-port networks (Thevenin's and Norton's Theorems) and two-port networks (Z, Y, h, and T) as equivalent circuits. Topics covered in the course are supported by weekly hands-on laboratory experiences."}, {"department": "EET", "number": "311", "credits": "4 Credits", "description": "EET 311 Alternating Current Circuits (4) EET 311 is intended to provide competency in analysis of circuits and application of basic electrical principles including equivalent circuits and models, power and energy, and signal/energy transfer. The course will introduce ideal amplifier models, ideal op-amps and ideal transformers as circuit elements and one-port networks (Thevenin, Norton, and driving point impedance), and two-port networks (Z, Y, H, G, T, and T-l) as equivalent circuits. Since this is the first required course taken by all upper division electrical engineering technology students, ethics and professionalism will be discussed by and expected of the students. This course requires calculus through integral and differential calculus of transcendental functions. It provides the circuit analysis skills required in almost every other EET course and is a specific prerequisite for analysis of signals and systems (EET 312) and understanding semiconductor models and electronic circuits (EET 330).", "prerequisite": "EET 114"}, {"department": "EET", "number": "312", "credits": "4 Credits", "description": "EET 312 Electric Transients (4) This course is designed to provide students with a strong foundation in transient circuit analysis in addition to introduction to signals and systems. The primary objective of the course is to reinforce continuous-time system fundamentals in order to prepare the students for more advanced work in a broad range of areas including communications, control, signal processing and image processing. The topics covered in this course include: Applied differential equations; Transient analysis of RC, RL, and RLC circuits, using differential equations; Complex frequency; Network functions; Bode plots and frequency response; Filter networks and resonant circuits; Laplace transform pairs and their applications in circuit analysis; Fourier analysis techniques and their applications in circuit analysis; State-variable circuit analysis. This course is a required course in the Electrical Engineering Technology BS curriculum and is intended to be taken by students who have completed their first circuits course requirements", "prerequisite": "EET 311"}, {"department": "EET", "number": "315", "credits": "3 Credits", "description": "Introduction to the principles and operation of linear and discrete systems.  EET 315 Linear and Discrete System Analysis (3) Linear and Discrete System Analysis is a required course for junior-level students in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program. The purpose of the course is to introduce the students to linear system analysis, primarily using Laplace transforms. Students learn the concept of a transfer function, and are able to analyze both the transient and steady state response of a system. Students then learn about discrete time systems, including z-transforms, difference equations, and basic digital filters. Laboratory exercises reinforce concepts developed in lecture.", "prerequisite": "CMPET 301"}, {"department": "EET", "number": "320", "credits": "3 Credits", "description": "Basic circuit theory applied to DC/AC circuits containing resistors, inductors, capacitors; magnetic circuits; power; control; electronic applications.  EET 320 Industrial Electricity and Electronics (3) This course is designed to offer non-electrical students the opportunity to become familiar with the theory and operation of electrical, electronic, and electromechanical devices that are widely used in practice. The course concentrates on the most important concepts, rather than in-depth treatment of any individual area. The number of units covered depends on the class background. The topics covered in this course include:1. Introduction 2. DC Networks 3. AC Networks 4. Magnetics 5. DC & AC Machinery 6. Selected topics depending on class background (if time permits): Basic electronic devices and their applications; Integrated circuits and their applications; Power Distribution; Transducers & signal conditioning; Control Systems Electronic Instrumentation.", "prerequisite": "MATH 140"}, {"department": "EET", "number": "330", "credits": "3 Credits", "description": "Wireless communications technology, transceivers, modulation techniques, serial communications, and applications.  Personal area networks, local area networks, RFID systems. EET 330 Wireless Communications Systems (3) Wireless Communications Systems is a required course for junior-level students pursuing the Electrical Engineering Technology (EET) option in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program. The course provides a foundation in spectrum analysis, filtering, serial communications, analog modulation and demodulation, and digital modulation and demodulation. The course discusses applications utilizing infrared (IR) and radio frequency (RF) technologies. Applications for wireless networking include the development of personal area networks (PAN) and local area networks (LAN). The course also introduces radio frequency identification (RFID) systems and applications. Laboratory exercises reinforce concepts developed in lecture.", "prerequisite": "EET 341"}, {"department": "EET", "number": "331", "credits": "4 Credits", "description": "Analog/Digital and Digital/Analog Converters; advanced and nonlinear Op-Amp circuit design; noise analysis; Active Filters and Waveform Generators.  EET 331 Electronic Design (4)E E T 330 is intended to provide competency in the application of basic electronic principles to design with operational amplifiers and integrated circuits. The course will include analog-to-digital and digital-to-analog conversion techniques; introduction to the feedback principles and non-ideal aspects of operational amplifiers including noise - needed for advanced design with op-amps; some nonlinear op-amp circuits - including comparators, Schmitt triggers, pulse width modulation, and ideal rectifiers, active filter design and waveform generator design. Grades will be based on 3 or 4 exams including a final exam (65%), laboratory work, computer projects requiring the use of circuit simulation software, spreadsheets, and math packages, and homework (30%), and student professionalism (5%). The IEEE code of ethics and the Penn State policy on academic integrity will be applied in the instructor's judgment of student professionalism. This course requires calculus through integral and differential calculus of transcendental functions, advanced circuit analysis techniques (E E T 311, E ENG 354, or E ENG 352), and knowledge of frequency response analysis techniques (E E T 312). It provides the electronic circuit analysis and design skills required in the Electronics, Systems, and Technical Electives in the General Electrical Engineering Technology Option and the Applications and Technical Electives in the Computer Engineering Technology Option.", "prerequisite": "EET 311"}, {"department": "EET", "number": "341", "credits": "3 Credits", "description": "Measurement concepts, transducers, electronic-aided measurement, mechanical and electrical measurements. Intended for electrical engineering technologists. EET 341 Measurements and Instrumentation (3) Measurements and Instrumentation is a required course for junior-level students in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program.  The purpose of the course is to understand the principles of measurement systems.  The course enables students to design software for programming PC-based data acquisition (DAQ) systems, understand various sensors, design signal conditioning circuits for interfacing sensors to DAQ systems, and design  various types of measurement systems.  Laboratory exercises reinforce concepts developed in lecture.", "prerequisite": "CMPET 117"}, {"department": "EET", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required."}, {"department": "EET", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "EET", "number": "402", "credits": "4 Credits", "description": "This course provides students in Electrical Engineering Technology with fundamentals of high frequency (RF and microwave) circuit design concepts. The main objective is that students gain familiarity with the high frequency circuits design topics including but not limited to: limitations of lumped elements at high frequencies, parasitic effects, transmission line and distributed circuits, Smith Chart, impedance matching, resonators and filters, scattering parameters, multiport networks, power divider and combiners, directional couplers, and RF and microwave circuit modeling through computer aided design (CAD). The lab portion of the course provides the students with the opportunity to learn the operation of high frequency test equipment such as network analyzer and spectrum analyzer, and be able to build and test high frequency and transmission line based circuits. The course topics are supported by weekly CAD or experimental labs.", "prerequisite": "EET 312"}, {"department": "EET", "number": "408", "credits": "4 Credits", "description": "This course is for students in Electrical Engineering Technology to gain understanding of the fundamental concepts and components of communication systems, supported by hands on experiments. Fundamentals of communication systems are covered and include signal analysis, noise, main building blocks and circuit components, effect of nonlinearities, signal generation, concepts of modulation and demodulation, analog modulation schemes such as AM, DSB, SSB, FM, and PM, transmitter and receivers architectures, and, if time permits, an introduction to digital communication schemes. After overviewing basic terminology and concepts such as signal spectrum, bandwidth, filtering, harmonics, power, and signal to noise ratio in communication systems, this course, in two parts, will expose students to two distinct aspects of communication technology. In the first part, the students will learn about the main components such as filters, resonators, amplifiers, mixers, oscillators, and phase locked loops. The second part will cover the main amplitude and angle modulation schemes and familiarize the students with modulator and demodulator circuits for those schemes. Topics covered in the course are supported by hands on labs performed each week during a lab session.", "prerequisite": "EET 312"}, {"department": "EET", "number": "409", "credits": "4 Credits", "description": "This course will help students to understand power generation units, transmission lines, distribution systems and load flow. The main power system elements will be studied in detail. These elements include: generators (to generate electricity), transformers (to step up/down voltage levels for transmission purposes), transmission lines (in order to transmit the power from one location to another with minimum dissipation), and distribution systems (in order to distribute the transmitted power to customers). The course also helps students to learn the concept of fault analysis, the effect of line length on transmission lines, and the calculation of losses in synchronous generators. The basic theory of complex numbers will be used to simplify the analysis and calculations. Students will understand the typical operating principles for different types of power plants including: nuclear, coal, gas, wind, and solar.", "prerequisite": "EET 312"}, {"department": "EET", "number": "410", "credits": "4 Credits", "description": "Power System Analysis II follows up the material from Power System Analysis I with more details on the analysis and calculation during faults or transients. Students will understand symmetrical faults such as three-phase and single-phase short circuits. Next, symmetrical components in power system will be introduced and impedance loads, series impedances, three-phase transmission lines, rotating machines, and transformers will be modeled. This course (Power System Analysis II) helps students to understand unsymmetrical faults such as single line to ground, double line to ground, and line to line faults. Furthermore, students will understand how to analyze the power system components under different fault conditions. Protection and relaying play an important role in a power system. Having equipment such as generators or transformers in power grids, engineers and power system planners should protect these expensive devices from faults or any transients. Relays and breakers are the best tools for protection. Relays sense the currents/voltages in multiple locations. If the measured current/voltage is not within the limit, they send the command to the breakers to disconnect the circuit and protect the equipment. Students in Power System Analysis II will analyze the protection devices and operation principles of relays. The last topic in this course is the transient stability of synchronous machines using equivalent dynamic model and generator control. This course will help students to model the generators in power systems and apply various control mechanisms such as: voltage, frequency, or power control to the synchronous generator model.", "prerequisite": "EET 409"}, {"department": "EET", "number": "413", "credits": "4 Credits", "description": "Principles and applications of optoelectronics including sources, detectors, imagers, transmitters, fiber optics, systems and integrated optics. This course is designed as an elective course for the EET senior undergraduate students. This course introduces some critical components that are needed in fiber optic communication systems. This includes optical transmitters (Light emitting diode, and laser diodes), optical receivers (i.e., photodetector), modulators and demodulators, optical couplers (how to connect more than two fibers together), and optical amplifiers (including the basic principle of erbium doped fiber optic amplifiers). The topics covered in this course include Optics Review, Lightwave Fundamentals, Measuring Light, Optical Waveguides, Light Sources and Detectors, Couplers and Connectors, Noise and Detection, and System Design. Relevant laboratory experiences are used to reinforce the topics covered in class.", "prerequisite": "EET 312"}, {"department": "EET", "number": "414", "credits": "4 Credits", "description": "Introduction to transducers and circuits used to detect and process medical physiological data with focus on cardiovascular and respiratory systems.", "prerequisite": "EET 312"}, {"department": "EET", "number": "416", "credits": "3 Credits", "description": "Introduction to basic electrical engineering technology concepts and applications of thermodynamics, heat transfer, and fluid power in electrical/ electronic systems.  EET 416 Fluid and Thermal Design in Electrical Systems (3) Fluid and Thermal Design in Electrical Systems is a required course for senior-level students pursuing the electrical engineering technology (EET) option in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program. The purpose of the course is to teach principles of thermal sciences with an emphasis on electrical/electronic system applications. The course enables students to understand fundamental principles of thermodynamics, heat transfer, and fluid mechanics as they apply to thermal management of electronic systems. These principles include the first law of thermodynamics, the continuity equation, basic principles of system pressure loss and fans, the three modes of heat transfer, resistance analogy for heat flow, and the finite difference method for analyzing two-dimensional heat flow. Specialized CFD software is used to analyze temperatures in electronic systems. Laboratory exercises reinforce concepts developed in lecture.", "prerequisite": "EET 315"}, {"department": "EET", "number": "419", "credits": "1 Credits", "description": "This course is required for all senior students in the Bachelor of Science in Electrical Engineering Technology (BSEET) program. It is the first course in a two-semester sequence that comprises the capstone design experience. In this course, students work in teams to develop an idea for an innovative product or system, including the determination and weighting of customer requirements, design constraints, applicable standards, engineering specifications, a functional decomposition (block diagram), work breakdown structure (WBS), project schedule, and proposed project budget. The culmination of the course is a proposal that guides the project into the second semester, which is the implementation phase. In the proposal, students will also provide background information on the history of relevant technologies, state of the practice in similar products and the life cycle of related products. Weekly presentations focus on important components of the proposal and drafts of these components are submitted for review on a regular basis.", "prerequisite": "ENGL 202C"}, {"department": "EET", "number": "420W", "credits": "3 Credits", "description": "Design, construction, and testing of a project either selected by the students with approval or assigned by the instructor.  EET 420W Electrical Design Project (3) This course is designed with the following goals and objectives: 1. The students will enter the course with a well-defined project proposal and a timeline for which the first task will be to write the specifications. Upon the specifications' approval, the student teams will begin designing and building the project. 2. Each student will maintain a laboratory notebook that documents the day-to-day activities of the project in a style that could be used for patent documentation. 3. Team members will provide short oral and written reports every week for the first five to six weeks, and then every two weeks until the end of the semester. 4. The students will incorporate engineering standards and constraints, i.e., consideration of economic, environmental, sustainability, manufacturability, ethical, safety, etc., in their project and final report. 5. A draft copy of the final report will be collected, critiqued, and returned to students with comments and suggestions for changes. 6. A final project oral report (20-25 minutes) will be given by the project team during the last week of the semester. 7. An extensive, well-written report describing the project that has been designed and built is the major outcome of the project course.Grades for the course will be based on: Weight Factor a. Written specifications for the project b. General conduct in the laboratory including lab notebook c. Oral and written progress reports including question-and-answer sessions d. Final oral and written reports including question-and-answer sessionsThis course is a required course in the Electrical Engineering Technology BS curriculum and is intended to be taken by seniors as the capstone course of the major. As such, the course integrates materials from many of the undergraduate electrical courses in addition to related math, engineering technology, and science courses. This course should be taken during the last semester (prior to graduation).", "prerequisite": "EET 312", "other": ["Writing Across the Curriculum"]}, {"department": "EET", "number": "431", "credits": "4 Credits", "description": "Applications of analog and digital integrated circuits; introduction to analog and digital communication techniques.", "prerequisite": "EET 331"}, {"department": "EET", "number": "433", "credits": "4 Credits", "description": "Classical and modern control analysis and design approaches, such as Laplace and state-space, aided by analog and digital computers.", "prerequisite": "EET 312"}, {"department": "EET", "number": "440", "credits": "3 Credits", "description": "Analysis and design of analog and digital feedback control systems.  EET 440 Applied Feedback Controls (3) Applied Feedback Controls is a required course for senior-level students pursuing the electrical engineering technology (EET) option in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program. The purpose of the course is to teach principles of feedback control systems. The course enables students to understand different elements of a feedback control system. System stability is determined, including phase and gain margin, through the use of Bode analysis techniques. Different control schemes are investigated, with emphasis on PID control. Laboratory exercises, including the construction of various control systems, reinforce concepts developed in lecture.", "prerequisite": "EET 315"}, {"department": "EET", "number": "456", "credits": "4 Credits", "description": "Introduction to robotic systems and automation.  Emphasis includes robot motion, control, and components, as well as programming PLCs.  EET 456 Automation and Robotics (4) The objective of this course is to use a hands-on approach to introduce the basic concepts in robotics, focusing on mobile robots and illustrations of current state of the art applications. The course is offered at the senior undergraduate level with emphasis on kinematics, dynamics and control of robot arms. Course materials are tied to lab experiments in which students will work in teams to build and test mobile robots (such as LEGO-based robots).", "prerequisite": "EET 331"}, {"department": "EET", "number": "461", "credits": "3 Credits", "description": "Fundamentals of power electronic circuits, semiconductor power devices, power conversion equipment. Circuit topologies, closed-loop control strategies, equipment design consideration.  EET 461 Power Electronics (3) Power electronics is a technical elective for senior-level students in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program. The course introduces students to the different topologies used to convert electrical power via the use of solid state switching. Specifically, the course presents ac-dc, ac-ac, dc-dc and dc-ac converters. The different switching devices used (diodes, SCRs, MOSFETs, etc.) are discussed. Laboratory exercises complement the lecture material. Relevant topics such as power quality, EMI and applications of power electronics are presented.", "prerequisite": "EET 212W"}, {"department": "EET", "number": "475", "credits": "3 Credits", "description": "Application of programmable logic controllers (PLCs) to data acquisition, automation and process control.  EET 475 Intermediate Programmable Logic Controllers (3) Programmable logic controllers (PLCs) are the workhorse of the automation and process control industry. Their rugged design and ease of programming enables PLCs to operate in almost any manufacturing environment. PLCs are employed wherever measurement equipment and computers are needed to control large electrical equipment such as motors and actuators. In this course, students apply their knowledge of basic PLC programming to see how the PLC can be used to communicate with other equipment, sense and react to external stimuli, and provide both open loop and closed loop system control.", "prerequisite": "EET 275"}, {"department": "EET", "number": "478", "credits": "4 Credits", "description": "Discrete signal analysis, A/D conversion, digital modulation techniques, encoding, decoding, data communication, noise.", "prerequisite": "CMPET 403"}, {"department": "EET", "number": "480", "credits": "1 Credits", "description": "Concepts of career development; project management; engineering design documentation; industrial design examples.  EET 480 Electrical and Computer Systems Senior Seminar (1) Electrical and Computer Systems Senior Seminar is a required course for senior-level students in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program. The purpose of the course is to introduce students to the practices associated with managing an industrial-based project. Student teams begin working on a capstone project. Project definition, specification development, scheduling, engineering constraints, and budgeting of both time and money are discussed. Other issues of career development are presented, such as interviewing, resume preparation, and career opportunities. Ethical issues related to the discipline are discussed. Engineering economy is introduced.", "prerequisite": "EET 341"}, {"department": "EET", "number": "490W", "credits": "3 Credits", "description": "Individual or group design projects in electrical and computer engineering technology.  EET 490W Electrical/Computer Senior Design Project (3) The Electrical/Computer Senior Design Project is a required course for senior-level students in the Electrical and Computer Engineering Technology (ECET) baccalaureate degree program. The purpose of the course is to have teams of senior students continue the senior design project they had started the prior semester in their Senior Seminar. The course focuses on project-based work where teams design, build, test and document the results of their senior design project effort. The course integrates and applies prior knowledge learned throughout the curriculum.", "prerequisite": "EET 480", "other": ["Writing Across the Curriculum"]}, {"department": "EET", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experience, practica or internships.  Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor", "other": ["Full-Time Equivalent Course"]}, {"department": "EET", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "EET", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]