[{"department": "EGT", "number": "60", "credits": "1 Credits", "description": "Supplemental course designed to improve spatial skills through the use of interactive hands-on activities, such as clay modeling and multi-media software.  EG T 060 3D Visualization and Spatial Development (1) The ability to visualize objects and situations in one's mind, and more specifically the ability to manipulate those visualizations is an important skill for those in the engineering field. For example, EG T 120 Introduction to Graphics and Solid Modeling requires strong visualization skills to create orthographic (2D) and isometric (3D) representations of mechanical parts. Students must also be able to sketch an object 3-dimensionally from a 2D drawing and vice-versus. Strong visualization skills are also essential to successfully model 3D parts in a solid modeler, such as Pro/ENGINEER. In addition, research has shown students with poorly developed spatial skills, especially women, tend to become discouraged and drop out of engineering altogether if they are struggling in their very first 'engineering' course. EG T 060 is designed to improve these spatial skills through the use of interactive hands-on activities, such as clay modeling (building a 3D object from a 2D drawing), snap cubes, and multi-media software specifically designed to improve these skills."}, {"department": "EGT", "number": "102", "credits": "1 Credits", "description": "A first course presenting an intensive study utilizing a computer assisted drafting and design system to obtain graphic solutions."}, {"department": "EGT", "number": "114", "credits": "2 Credits", "description": "Spatial relations of applications in engineering technology with more advanced functionality of computer-aided drafting and design systems.  EG T 114 Spatial Analysis and Computer-Aided Drafting (2)The EG T 114, Spatial Analysis and CAD course is a continuation of CADD (Computer Aided Drafting and Design) and an introduction to CAE (Computer Aided Engineering) with an emphasis on the state-of-the art 2-D drawing and 3-D solid modeling techniques commonly used in mechanical design and analysis of structural systems. This course is also designed to cover spatial relations of applications in engineering technology, with more advanced functionality of computer-aided drafting and design systems. Building on the knowledge and experience of Engineering Design from prior courses, the student will be able to: understand, create and interpret more advanced 2-D Engineering drawings; understand, create and manipulate 3-D solid models; use these two techniques in practical Engineering Design problems. Having an understanding of computer systems, students will become proficient in the use of computers for the simulation of mechanical systems, design documentation, network storage and retrieval, and presentation technologies.With a basic understanding of 2-D drawing software, the student will also be able to understand, create and interpret more advanced 2-D Engineering drawings, which may include auxiliary views and working drawings. Finally, having an understanding of the Engineering Design process and a basic understanding of solid modeling software, the student will be able to understand, create and manipulate 3-D solid models and assemblies to aid in the design and documentation of simple mechanical systems.", "prerequisite": "EDSGN 100"}, {"department": "EGT", "number": "119", "credits": "2 Credits", "description": "Introduction to computer-aided drafting (CAD) for Electrical and Computer Engineering Technology students with a focus on three dimensional assemblies.  EG T 119 Introduction to CAD for Electrical and Computer Engineering (2) This course is intended to teach Electrical and Computer Engineering Technology students to use a 3-D CAD software package to communicate their ideas so that they may transfer their ideas to others including engineers, designers, and lay people.Students will successfully create 3-D objects such as rectangular solids, spheres, and cylinders. Those 3-D objects will then be employed to create actual samplings of electrical and electronic components (such as resistors, capacitors, transformers, etc), as well as electro-mechanical components (such as relays, motors, solenoids, etc), enclosures (chassis), and operator interfaces (knobs, buttons, displays, etc) and similar items. Students will successfully create 3-D assemblies. Students will successfully create working drawings of components and assemblies.The designated course outcomes are as follows: visualize mechanical part(s) 2-D to 3-D and vice versa; incorporate design intent into solid models using extrusions, revolves, shells, ribs, chamfers and rounds; construct datum references (e.g. planes and axes) to facilitate solid modeling; properly execute duplicating operations to create circular and linear patterns of features and mirrored features; use mathematical relations to drive solid models; create a detail drawing of a mechanical part; create 3-D assemblies.", "prerequisite": "MATH 81"}, {"department": "EGT", "number": "120", "credits": "3 Credits", "description": "Development of visualization skills; introduction to parametric solids modeling techniques with constrained and unconstrained geometry, and assemblies."}, {"department": "EGT", "number": "121", "credits": "3 Credits", "description": "Creation of working drawings from solid models; dimensioning, GD&T, fastener, weld and finish symbols, layouts and bill of materials.", "prerequisite": "EGT 120"}, {"department": "EGT", "number": "201", "credits": "2 Credits", "description": "Application of the principles of engineering graphics; preparation of working drawings; details, examples, and bill of material using CAD.  EG T 201 Advanced Computer Aided Drafting (2)Professional parametric solid modeling software will be applied to produce complete, industry-typical and standard working drawings, including part detail drawings and various types of assembly drawings; to implement the appropriately toleranced design of interfacing components; and to explore advanced productivity-enhancing add-in modules. Additionally, students will be introduced to the variety and relative precedence of specifications for feature tolerances and to the basic differences between form and size tolerancing. Topics that will be covered in the course include: Unilateral, bilateral and symmetric size tolerances, Form control and tolerances, Calculations for critical fits, Specification precedence for tolerances, e.g., stock size vs. size directly specified in the drawing field vs. title block tolerances vs. drawing notes, etc. The following laboratory assignments will include: Part drawing with standard three orthographic views, complete dimensions, and a Section View, Part drawing with complete dimensions and a Broken View, Part drawing with complete dimensions and a Primary Auxiliary View, Part drawing with complete dimensions and a Secondary Auxiliary View, Part drawing with complete dimensions and removed Detail View(s), Detail drawing with correct limit tolerances on features which are critical for fit and function, Assembly file with separate sub-assemblies, Assembly Drawing (with part identification balloons and a bill-of-material) which uses Sectional Views to expose fine internal detail and part interrelationships, Assembly Drawing (with part identification balloons and a bill-of-material) which is based upon an Exploded View, Assembly Drawing of a tooling fixture (with part identification balloons and a bill-of-material) which shows the subject workpiece tranparently with phantom lines, Configured part file with tabulated drawing, Welding of an assembly using advanced software capabilities and production of a welding drawing with correct symbols, Production of an injection mold cavity from the subject part file, Exploration of the functionality of sheet metal modules, Applications of Top Down Design and Layout Sketches, Application of motion-simulating modules and functionality. The differences between coordinate tolerancing and geometric tolerancing are included in the course. The American Society of Mechanical Engineers Y14.5M will be referenced. The following are among the topics that will be covered: Eight key GD&T terms, GD&T modifiers and symbols, Rule #1 and #2, Concepts of GD&T, Introduction to the flatness control, straightness control, circularity control, perpendicularity control, angularity control, parallelism control, concentricity control, symmetry control, The datum system (planar datums, Introduction to datum targets, FOS datum specifications (RFS), FOS datum specifications (MMC).", "prerequisite": "EDSGN 100"}, {"department": "EGT", "number": "205", "credits": "1 Credits", "description": "Supplemental course designed to introduce students (primarily transfer) to a solid modeling program.  EG T 205 Transition From 2-D CAD to Solid Modeling (1) This is a one credit course in parametric solid modeling. Students will learn how to do basic geometry creation as well as how to create and use reference geometry such as points and planes. Duplicating features though the use of patterns and mirroring will be covered. More advanced geometry creation such as sweeps and blends are introduced, as well as the use of top-down as well as bottom-up modeling techniques. Assembly modeling and detailing topics are covered. Evaluation is done through both weekly homework assignments and a final, comprehensive project. This course is designed to bring students (especially transfer students who already have taken EG T 201) up to a base level of proficiency on the specific CAD package used in MET 306.", "prerequisite": "EGT 201"}]