[{"department": "ENGL", "number": "2", "credits": "3 Credits", "description": "This course provides fundamental skills of textual analysis in the context of literary texts written in English, drama, and poetry (from the Middle Ages to the twentieth century) that address large questions of ethical and social value. Course reading includes English-language texts from around the world. Students learn to speak and write clearly about the ideas generated by the texts as they consider interpretive issues found in their assigned readings and participate actively in the various forms of critical thinking required to address those issues.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "2H", "credits": "3 Credits", "description": "This course provides fundamental skills of textual analysis in the context of literary texts written in English, drama, and poetry (from the Middle Ages to the twentieth century) that address large questions of ethical and social value. Course reading includes English-language texts from around the world. Students learn to speak and write clearly about the ideas generated by the texts as they consider interpretive issues found in their assigned readings and participate actively in the various forms of critical thinking required to address those issues.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "4", "credits": "3 Credits/Maximum of 6", "description": "Intensive practice in writing sentences and paragraphs and instruction in grammar, usage, and punctuation. Designed for students with deficient preparation. This course may not be used to satisfy the basic minimum requirements for graduation in any baccalaureate degree program."}, {"department": "ENGL", "number": "5", "credits": "1 Credits", "description": "Tutorial instruction in composition and rhetoric for students currently enrolled in ENGL 4 or ENGL 15. This course may not be used to satisfy the basic minimum requirements for graduation in any baccalaureate degree program."}, {"department": "ENGL", "number": "6", "credits": "1-8 Credits/Maximum of 8", "description": "Required one hour a week meeting time; readings, professional development, advising, community-building.  ENGL 006 Creative Writing Common Time (1 per semester/maximum of 8) This course is to be required of all B.F.A. in Creative Writing majors at Penn State Erie as long as they are students in that degree program. This means that every semester they are working toward the B.F.A. in Creative Writing they must sign up for this course, and they must complete it successfully. Successful completion is based on regular attendance at the various functions, all held at the same one hour time period each week. The purpose of this course is to provide students with the necessary experience of listening to the writers of national stature brought to campus through The Smith Series, to provide them with lectures by both faculty and outside experts to help them develop professionally as writers, to allow for essential group advising for successful completion of the major, and to foster a sense of community among the student writers in the program.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "10", "credits": "1 Credits/Maximum of 2", "description": "Course Description: ENGL 10 is a one-credit course that provides group tutorial instruction in writing for students currently enrolled in ENGL 15. It is not a replacement for composition classes or individual conferences with the ENGL 15 instructor. Rather, ENGL 10 offers the opportunity to learn about and practice writing in a collaborative, group setting and to become an active part of the writing community at Penn State. Throughout ENGL 10, students work directly with texts and assignments from their ENGL 15 course."}, {"department": "ENGL", "number": "15", "credits": "3 Credits", "description": "ENGL 15 is an intensive, rhetorically based experience in reading and writing that will prepare you both to understand the communications that surround you and to succeed in your own communication efforts. Thus, in this course, we will focus specifically on analyzing verbal and visual texts (our reading) as well as on producing such texts (our writing), always in terms of rhetorical principles. Even if the term rhetoric isn't familiar to you, you bring a good deal of rhetorical skill to this class: you already know how to gauge the way you perceive and produce language according to the speaker, the intended audience, and the purpose. You may not always gauge perfectly, your perception may not always be accurate, and your production may not always be successful, but you still often try to interpret and choose language that is appropriate to the rhetorical situation. When you do not succeed, you often try again. The goal of ENGL 15, then, is to help you build on what you already know how to do as you become a more confident reader and writer. You will become more attuned to your goals as a writer, more aware of the ongoing conversation surrounding the topic, and more resourceful in terms of the appropriate delivery of your information, the rhetorical appeals at your disposal, and the needs and expectations of your audience. You will also learn to research and synthesize multiple outside sources in order to support your arguments effectively and ethically. In other words, we hope you'll come to write with skill, conviction, sophistication, and grace, if not immediately, then soon. In the process, you'll learn how to read more critically as well.", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "15A", "credits": "3 Credits", "description": "English 15A is an intensive, rhetorically based experience in reading and writing that will prepare you both to ENGL 15A is a version of ENGL 15 with an added emphasis on culture and diversity. The term diversity can have multiple definitions. During this class, you will sharpen your argumentation skills by exploring the many layers of this term as well as how it relates to issues of social justice, race, class, gender & sexuality, higher education, and more. By focusing on diversity and rhetoric & composition, you can become critical citizens inside and outside the university by using writing as a tool to engage actively and influentially with the communities you belong to and as an act of inquiry. This course attempts to emphasize diversity in a safe and yet provocative learning environment where you can develop sophistication as both a producer and consumer of knowledge as you explore and respect the diverse perspectives and backgrounds of your classmates. Major writing assignments for this course typically deal with issues of diversity in some form. understand the communications that surround you and to succeed in your own communication efforts. Thus, in this course, we will focus specifically on analyzing verbal and visual texts (our reading) as well as on producing such texts (our writing)-always in terms of rhetorical principles. Even if the term rhetoric isn't familiar to you, you bring a good deal of rhetorical skill to this class: you already know how to gauge the way you perceive and produce language according to the speaker, the intended audience, and the purpose. You may not always gauge perfectly, your perception may not always be accurate, and your production may not always be successful-but you still often try to interpret and choose language that is appropriate to the rhetorical situation. When you do not succeed, you often try again. The goal of English 15A, then, is to help you build on what you already know how to do as you become a more confident reader and writer. You will become more attuned to your goals as a writer, more aware of the ongoing conversation surrounding the topic, and more resourceful in terms of the appropriate delivery of your information, the rhetorical appeals at your disposal, and the needs and expectations of your audience. You will also learn to research and synthesize multiple outside sources in order to support your arguments effectively and ethically. In other words, we hope you'll come to write with skill, conviction, sophistication, and grace-if not immediately, then soon. In the process, you'll learn how to read more critically as well.", "other": ["United States Cultures (US)", "General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "15E", "credits": "3 Credits", "description": "ENGL 15E Enhanced prepares students to understand the functions of and produce a variety of texts for public and academic audiences. Class size is limited to 18 (as opposed to the regular 24) and provides individualized instruction, regular engagement with peers, and weekly online tutorials. The combination of these resources helps familiarize students with conventional genres and practices of usage and style written discourse. The course is cohort-based and paced, which means that there is an established start and end date, and that students will have weekly deadlines to meet throughout the term.", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "15S", "credits": "3 Credits", "description": "English 15S is an intensive, rhetorically based experience in reading and writing that will prepare you both to understand the communications that surround you and to succeed in your own communication efforts. Thus, in this course, we will focus specifically on analyzing verbal and visual texts (our reading) as well as on producing such texts (our writing)-always in terms of rhetorical principles. Even if the term rhetoric isn't familiar to you, you bring  good deal of rhetorical skill to this class; you already know how to gauge the way you perceive and produce language according to the speaker, the intended audience, and the purpose. You may not always gauge perfectly, your perception may not always be accurate, and your production may not always be successful-but you still often try to interpret and choose language that is appropriate to the rhetorical situation. When you do not succeed, you often try again. The goal of English 15S, then, is to help you build on what you already know how to do as you become a more confident reader and writer. You will become more attuned to your goals as a writer, more aware of the ongoing conversation surrounding the topic, and more resourceful in terms of the appropriate delivery of your information, the rhetorical appeals at your disposal, and the needs and expectations of your audience. You will also learn to research and synthesize multiple outside sources in order to support your arguments effectively and ethically. In other words, we hope you'll come to write with skill, conviction, sophistication, and grace-if not immediately then soon. In the process, you'll learn how to read more critically as well.", "other": ["First-Year Seminar", "General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "30H", "credits": "3 Credits", "description": "English 30H is an intensive, rhetorically based experience in reading and writing that will prepare you both to understand the communications that surround you and to succeed in your own communication efforts. Thus, in this course, we will focus specifically on analyzing verbal and visual texts (our reading) as well as on producing such texts (our writing)-always in terms of rhetorical principles. Even if the term rhetoric isn't familiar to you, you bring a good deal of rhetorical skill to this class: you already know how to gauge the way you perceive and produce language according to the speaker, the intended audience, and the purpose. You may not always gauge perfectly, your perception may not always be accurate, and your production may not always be successful, but you still often try to interpret and choose language that is appropriate to the rhetorical situation. When you do not succeed, you often try again. The goal of English 30, then, is to help you build on what you already know how to do as you become a more confident reader and writer. You will become more attuned to your goals as a writer, more aware of the ongoing conversation surrounding the topic, and more resourceful in terms of the appropriate delivery of your information, the rhetorical appeals at your disposal, and the needs and expectations of your audience. You will also learn to research and synthesize multiple outside sources in order to support your arguments effectively and ethically. In other words, we hope you'll come to write with skill, conviction, sophistication, and grace-if not immediately, then soon. In the process, you'll learn how to read more critically as well. As an honors section, ENGL 30H is enriched by more rigorous requirements (longer papers, additional research component where the student is required to cite and engage critical sources and conversations). Participation requirements are also enhanced, making for a richer honors experience.", "other": ["General Education: Writing/Speaking (GWS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "30T", "credits": "3 Credits", "description": "English 30T is an intensive, rhetorically based experience in reading and writing that will prepare you both to understand the communications that surround you and to succeed in your own communication efforts. Thus, in this course, we will focus specifically on analyzing verbal and visual texts (our reading) as well as on producing such texts (our writing)-always in terms of rhetorical principles. Even if the term rhetoric isn't familiar to you, you bring a good deal of rhetorical skill to this class: you already know how to gauge the way you perceive and produce language according to the speaker, the intended audience, and the purpose. You may not always gauge perfectly, your perception may not always be accurate, and your production may not always be successful-but you still often try to interpret and choose language that is appropriate to the rhetorical situation. When you do not succeed, you often try again. The goal of English 30T, then, is to help you build on what you already know how to do as you become a more confident reader and writer. You will become more attuned to your goals as a writer, more aware of the ongoing conversation surrounding the topic, and more resourceful in terms of the appropriate delivery of your information, the rhetorical appeals at your disposal, and the needs and expectations of your audience. You will also learn to research and synthesize multiple outside sources in order to support your arguments effectively and ethically. In other words, we hope you'll come to write with skill, conviction, sophistication, and grace-if not immediately, then soon. In the process, you'll learn how to read more critically as well. As an honors section, ENGL 30T is enriched by more rigorous requirements (longer papers, additional research component where the student is required to cite and engage critical sources and conversations). Participation requirements are also enhanced, making for a richer honors experience.", "other": ["First-Year Seminar", "General Education: Writing/Speaking (GWS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "50", "credits": "3 Credits", "description": "If you enjoy writing to express yourself creatively - you will be at home in this course. You will also be at home here if you are an avid reader of fiction, poetry, and nonfiction, but have never tried your hand at writing it. In ENGL 50 you will explore the genres of nonfiction, fiction, and poetry by reading published essays, short stories, and poems and by writing personal essays, sketches, scenes, and poems. We'll discuss the relationship between the genres and also discuss what makes each a distinct art form. You'll hand in regular writing assignments in addition to completing longer writing projects. You'll share some of your creative work to discuss in class.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "50H", "credits": "3 Credits", "description": "This course provides students with an introduction to, and extensive practice in, creative writing in the three genres of fiction, nonfiction, and poetry. The course includes instruction in principles of composition in each genre, as well as techniques of literary composition that cross and interlink those genres. If you enjoy writing to express yourself creatively--you will be at home in this course. You will also be at home here if you are an avid reader of fiction, poetry, and nonfiction, but have never tried your hand at writing it. In English 50H you will explore the genres of nonfiction, fiction, and poetry by reading published essays, short stories, and poems and by writing personal essays, sketches, scenes, and poems. We'll discuss the relationship between the genres and also discuss what makes each a distinct art form. You'll hand in regular writing assignments in addition to completing longer writing projects. You'll share some of your creative work to discuss in class. This is an honors course.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "Honors", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "83S", "credits": "3 Credits", "description": "Each section of the course will focus on a well-defined body of scholarship that is topical in the discipline, such as \"Ethical Dilemmas in Literature,\" \"Individual Freedom and Social Constraint in Literature,\" \"Global Cultures, Local Identities,\" \"American Landscapes, American Literatures,\" \"Shakespeare,\" \"Vital Rhetorics,\" and \"Turning 2000: Nostalgia and Popular Culture at the Turn of the Century.\" In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them, including the opportunity to develop relationships with faculty and other students who share their academic interests. Each section of 83S will require active class participation from all students and a minimum of three substantial written assignments. Each of these written assignments will take one of the following forms: essay, essay exam, or a semester long reading journal. The course fulfills a General Education humanities requirement or a bachelor of arts humanities requirement.", "other": ["Bachelor of Arts: Humanities", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "88", "credits": "3 Credits", "description": "Australian and New Zealand cultural and social perspectives, with emphasis on the historical development of intellectual, aesthetic, and humanistic values. ENGL 88 Australian/New Zealand Cultural Perspectives (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. Students are expected to learn fundamental skills of close textual analysis in the context of the study of a variety of works by authors from Australia and New Zealand. Studying a range of novels, poems, plays, and works of non-fiction, students will discuss the development of Australian and New Zealander literatures in historical context and gain understanding of the historical development of societal values in nations other than the U.S.A. The course aspires to relate geography and history to emerging social and cultural developments as the state and status of the two countries changed during the nineteenth and twentieth centuries, and to track their increasing separation from the \"Mother Country\"; (i.e. Great Britain) as they developed a sense of themselves as different and separate from European societies. The process was neither comfortable nor easy, nor steadily progressive, but the record of it is an often fascinating story of human endeavor and struggle, very frequently against great odds and disappointments, which in turn affected the development of national character if such a thing can be said to exist.The literatures reflect some of the attitudes and qualities that emerged as the two societies were coming into being and forging their own unique identities.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "ENGL", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "98", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "100", "credits": "3 Credits", "description": "An examination of English sounds, words, and syntax using traditional, structural, and transformational grammar.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "101", "credits": "3 Credits", "description": "In ENGL 101 students will study a wide variety of forms of literature --- poetry, novel, short story, drama, graphic novels --- from different time periods and cultures to gain a better understanding of how literature explores human values and issues. Throughout the course, students might use the texts to ask such questions as: of what value is a play, a novel, a poem, or a short story? Is literature worthwhile for its ability to tell a good story or for its questions that do not lend themselves to easy answers? Can literature improve our lives, individually and collectively? The course may also take advantage of literary events occurring on campus each semester--such as poetry readings, dramatic performances, even films relating to the course --- to enrich the experience both of literature and of campus life.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "103", "credits": "3 Credits", "description": "Fred Lewis Pattee's career at Penn State marks the beginning of a heyday for the study of American literature. By the 1930s, prominent American critic Granville Hicks hailed what he dubbed \"the great tradition of American literature\" as a series of key themes in American writing, including folk traditions, politics, business, labor, social critique, fugitives, and flight. Since Hicks's time, literary scholars have contested the very notion of any \"great tradition,\" because so many different authors have always participated in the American literary scene. This course examines American literature by looking at the dynamic and varied literary productions that, across time, have comprised the American literary canon, even as it calls into question the notion of whether America ever had a single literary canon, whether historically or in the present day. Students will learn how access to educational institutions, to writing equipment, and to printed and graphic materials all influenced who might become an author, and who, a reader. They will also learn how changing political and cultural institutions influenced writers' literary production and literary achievements. With text selection at the instructors' discretion, students will study poetry, fiction, non-fiction, oratory, and drama, and they will examine many of the most enduring themes in American literature: religion; moral and ethical ideals; the lure of mobility, especially upward mobility (or absence of it); gender dynamics; enslavement, abolitionism, and emancipation; race and ethnicity; the lure (and social complications) of the American West; American pragmatism; love and loss; hope and despair. Students will be asked to take up such questions as the following: Who has had a voice in American literary history? Why are some writers more frequently studied than others? Who determined what should be considered \"great\" literature inside the academy? In what ways does the study of American literary history uphold American values of freedom and freedom of expression? Who had access to publication, when, and under what circumstances? How does the publishing marketplace influence readers' choices regarding \"great\" American literature? How do educational institutions influence readers' choices? The course aims to provide a foundation for further study of American literature by equipping students with an understanding of the American literary past and its complex relationship to American culture and to American educational, political, and marketing institutions. Instructors might examine one or two key themes in the tradition, or they might ask students to learn about sweeping literary movements across time.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "104", "credits": "3 Credits", "description": "This course examines the literature of the Bible. Throughout this course, students will study the language, thought, images, and structures of the book that has arguably proved the central text of Western literature. Students will also actively explore the ways in which the Bible has shaped the literature of English-speaking cultures around the world. Students will read substantial portions of the Old and New Testaments, learning to read critically and to interpret the Bible as they would any other literary text. They will also learn about the historical construction of the Bible, some history of its translation, and contemplate the competing versions of existing Biblical texts. Accordingly, reading the Bible as literature by necessity requires critical engagement with different international cultures from different historical periods.", "other": ["Cross-listed with: JST 104", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "105", "credits": "3 Credits", "description": "AMST 105 / ENGL 105 offers a survey of popular culture and folklife in America's past and present. The course synthesizes a broad scope of materials from areas such as literature, movies, television, sports, amusement parks, music, media, and advertising. While selected topics for readings, lectures, and discussion vary from class to class, all courses focus on a critical examination of a variety of popular and folk cultures in order to produce an enriched understanding of America, its past, its diverse cultures, its evolving values and traditions, and its inhabitants. To meet this goal, popular and folk cultures will be examined from a variety of perspectives, including race, gender, and class. AMST 105 may be taken by students pursuing the American Studies major; for them, the course provides preparation for more advanced courses in American folklore, American literature, and American cultural history. Non-American Studies students may use this course to fulfill the general education requirement (GH). Students will receive the US designation for this course, and it meets the Bachelor of Arts degree requirements.", "other": ["Cross-listed with: AMST 105", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "106", "credits": "1 Credits/Maximum of 3", "description": "This course is offered in tandem with The Lynd Ward Graphic Novel Prize, sponsored and administered by Penn State University (the first prize of its kind in the United States). The Lynd Ward Prize is awarded annually to the best graphic novel, fiction or non-fiction, published in the previous calendar year by a living U.S. or Canadian citizen or resident. The course provides background for the history of the graphic novel in the United States, with a focus on Lynd Ward's woodcut novels from the 1930s. Students also study the winning book, attend the award ceremony and public talk from the creator(s), and meet with the creator(s) to discuss their work. This is a one-credit course with limited meetings."}, {"department": "ENGL", "number": "110", "credits": "2 Credits/Maximum of 6", "description": "Practice in writing and editing articles for the campus newspaper.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "111", "credits": "2 Credits", "description": "This course familiarizes students with the range of professional possibilities offered by the English major."}, {"department": "ENGL", "number": "112", "credits": "3 Credits", "description": "This course introduces the variety of literature that has been written and published by Pennsylvania authors from the colonial era through the present day. This course explores how the literature written in Pennsylvania relates to historical developments within the Commonwealth, and to literary, cultural, and historical developments across the United States and throughout the world. Toward that end, the course provides a chronological survey of developments in the literature of Pennsylvania through readings from the work of Pennsylvania authors whose work illuminates developments in literary history and exemplifies important aspects of Pennsylvania history and culture.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "115N", "credits": "3 Credits", "description": "This course will familiarize students with expressions of love in Western arts and literature. Students will analyze the artistic, philosophical and literary representations of courtship, friendship, homoeroticism, sexuality, marriage, adultery, and familial bonds and explore how the preceding phenomena are inflected by gender roles, race and miscegenation, and class and religious differences. We will also trace the way particular narratives about love have been adapted by different artistic media. Love is a universal human experience and its study transcends disciplinary boundaries. It is a linchpin of human existence, uniting and enriching nearly any subject worthy of serious study.", "other": ["Cross-listed with: ARTH 115N", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "120", "credits": "3 Credits", "description": "This course explores representations of identity and community in early literature, from classical traditions through the early modern era. How did early literature engage issues of cultural contact, conflict, and/or exchange, such as those created through trade, warfare, religious conflict, migration and/or travel? How did early writers conceive of and represent difference, and to what ideological and/or aesthetic end? Additionally, students will consider how these early representations have influenced later cultural productions and events, from modern politics (nationalism, neo-paganism) to popular entertainments (films, video games, graphic novels).", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "124", "credits": "3 Credits", "description": "This course explores intersections between literature and law, with attention to issues of social justice. How are social concepts and procedures of law and justice represented in different texts and media over time, both fictional and nonfictional? How have texts worked to define and justify the law and its application at different historical moments in the United States? Course content includes select literary works with legal content and themes, and the ways in which those texts represent different forms of justice, crime, and punishment. Students may also analyze legal writing (judicial decisions, jurisprudence, statutes); examples of the 'true crime' genre (visual and textual); memoir; and/or essay writing.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "128N", "credits": "3 Credits", "description": "This class studies how art, literature, film, and other media can help us to gain a perspective on one of the most horrific events in human history, the Holocaust: the genocidal murder of more than six million men, women, and children (mostly Jewish) under the Nazi regime during World War II. We will also examine the theoretical questions involved in any attempt to capture what appears to be beyond our comprehension, in terms of moral outrage and the sheer scale, inhumanity, and bureaucratic efficiency. To this end we will study literary works, such as Primo Levi's Survival in Auschwitz, films such as Steven Spielberg's Schindler's List, Roman Polanski's The Pianist, and Roberto Benigni's Life is Beautiful, as well as photographs, poems, artworks, installations, museum architecture, the design of monuments and other artifacts. We will also examine questions of memorialization (Holocaust museums and memorials), national guilt, survivor's guilt, stigmatization, and the ethics of historical representation.", "other": ["Cross-listed with: CMLIT 128N, GER 128N, JST 128N", "Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "129", "credits": "3 Credits", "description": "English 129 constitutes a broad introduction to Shakespeare's dramatic works from a variety of thematic, historical, formal, and/or generic vantages. Students practice close reading Shakespeare's language while also learning how his plays reflect upon the social and theatrical conventions of the historical period in which they were written and performed. The class will consider issues such as gender, social class, politics, sexuality, and race, as students learn how early modern perspectives on these issues may differ from their own. In order to analyze how Shakespeare's plays continue to be adapted and transformed around the world, the class may also nvolve the study of modern stage and film performances of Shakespeare. This class prepares students for advanced courses in early modern literatures as well as other academic courses that engage in the verbal and written analysis of complex written texts.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "129H", "credits": "3 Credits", "description": "English 129H constitutes a broad introduction to Shakespeare's dramatic works from a variety of thematic, historical, formal, and/or generic vantages. Students practice close reading Shakespeare's language while also learning how his plays reflect upon the social and theatrical conventions of the historical period in which they were written and performed. The class will consider issues such as gender, social class, politics, sexuality, and race, as students learn how early modern perspectives on these issues may differ from their own. In order to analyze how Shakespeare's plays continue to be adapted and transformed around the world, the class may also involve the study of modern stage and film performances of Shakespeare. This class prepares students for advanced courses in early modern literatures as well as other academic courses that engage in the verbal and written analysis of complex written texts.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "130", "credits": "3 Credits", "description": "READING POPULAR TEXTS explores a variety of popular texts across various media with the goal of enabling students to sharpen their ability to interpret the social, political, and cultural significance of such texts in the contemporary world. Since these texts are primarily examples of popular culture-pervasive, selfreplicating, commercialized artifacts of the contemporary scene-they are familiar to the general student outside the classroom. Too often, however, students have not seen such texts subjected to the same kind of critical readings more elite cultural forms (e.g., canonized literature, art, and music). The purpose of the course is fulfilled if such students come away from it with a sharpened awareness of the role that pupular texts play in their daily lives and the means to discuss and explain their influence-in short, to read their culture more crirically.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "131", "credits": "3 Credits", "description": "This course surveys the long tradition of literature that depicts the intrusion of supernatural forces into social order. The fantastic or horrific elements of these tales might be their best-known traits, but such literature can also express social desires and fears, as well as ruminate on personal and political history. The supernatural, in other words, works to reveal those individuals and institutions that face it. This course explores a range of horror writing, investigating issues raised by individual texts and considering possible connections between them.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "132", "credits": "3 Credits", "description": "This course will provide an introduction to Jewish American literature through a historical survey of the tradition's key texts, figures, and themes. The course will focus on the defining aspects of the literature and on what the literature \"thinks\" about Jewish American culture and identity. But rather than assuming a unity to Jewish-American culture, this course will use Jewish literature to seek ways of articulating and representing both the points of cohesion and the points of divergence that characterize Jewish life in America. The United States has absorbed large numbers of Jewish immigrants hailing from many parts of the world, holding many different ideas about Jewish practice, and affiliating themselves with many different political, social, and cultural traditions. Moreover, Jews have settled and made homes in a wide variety of American communities. This course aims to explore Jewish American culture's marked diversity by offering a literary window onto the major fault-lines running through Jewish American culture: lines demarcated by gender, by political affiliation, by geography, by pre-immigration community by religious practice, by attitude toward world Jewry, by national allegiance, and by minhag (or custom), to name just a few. The class therefore provides an opportunity to consider the constitution, origin, and development of Jewish American's identity and social formations by looking at how that identity and those social formations exist and what they \"do\" in literature written by and about Jews in America. Materials will consist predominantly of primary texts, including prose fiction and nonfiction, poetry, drama, and film. Course methodology will emphasize the close reading of these texts. The course complements offerings in Jewish Studies and English, and it will satisfy the GH and US requirements. Most obviously, the course will offer students of Jewish literature, world literature, and American literature an opportunity for contextualization. It enables students in Jewish Studies to study the rich literature of American Jews, and it adds to courses covering Jewish American history, religion, and culture. The course offers students in English a valuable, sustained introduction to an important U.S. and world sub-culture.", "other": ["Cross-listed with: JST 132", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "133", "credits": "3 Credits", "description": "ENGL 133 Modern American Literature to World War II (3) (GH)(BA)(US) This course meets the Bachelor of Arts degree requirements. ENGL 133 will constitute a wide ranging study of modernist American literature, and may include novels, short stories, poems, plays, and non-fictional prose, written roughly between the turn of the 19th century and the end of the Second World War. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Topics under consideration will vary from class to class, but may include a chronological introduction to the development of modernist American literature, a consideration of a principle theme or themes common to modernist American literature through a number of works from across the period, a consideration of a number of modernist works in the context of historical events central to the period, such as the American participation in the First World War and/or the effect on American literature of the ensuing world-wide economic depression. This class will prepare students for advanced courses in modernist literatures as well as other academic courses that engage in the verbal and written analysis of complex written texts. The course may be used as English Major elective credit or as credit towards the English Minor. Non-English majors may use this course to fulfill a general education, U.S. cultures, or Bachelor of Arts/Humanities requirement.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "134", "credits": "3 Credits", "description": "ENGL 134 serves as a survey of and introduction to strands of American comedy and satire from its eighteenth- and nineteenth-century roots through its many directions in the twentieth century. Students will read works from multiple literary genres-poetry, novel, short story, drama, and essay, for instance. The course will help students to understand how both formal and contextual considerations shape American comedy through the centuries. Authors under consideration will vary from class to class, but selected texts will represent many variations of comedy embodied in American literature and present across an evolving media landscape. ENGL 134 is a General Education course in the General Humanities domain. ENGL 134 can also be used as a requirement for the English major and minor.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "135", "credits": "3 Credits", "description": "English 135 considers literature from diverse backgrounds (for example, Latinato, African-American, Asian-American, Native-American, Jewish, Muslim, working-class, lesbian, gay, or women's literature, or any other configuration that expresses an alternative literary heritage to traditionally canonized texts). Course content will subsequently vary.", "other": ["Cross-listed with: AMST 135", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "136", "credits": "3 Credits", "description": "This course considers the contemporary graphic novel (also known as graphic fiction, comics, or sequential narrative) as a literary medium that joins image and text. Course texts engage issues such as contemporary identity, alienation, ethnicity, sexuality and history (personal, family, and national). The course explores the aesthetic of sequential narrative, its formal properties and generic range, its methods of production and consumption, and its place in a contemporary culture of reading.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "137H", "credits": "3 Credits", "description": "Rhetoric and Civic Life (RCL) is a year-long honors course offering comprehensive training in oral, written, visual, and digital communication. It unites these various modes under the flexible art of rhetoric and uses rhetoric both to strengthen communication skills and to sharpen awareness of the challenges and advantages presented by oral, written, visual, and digital modes. This portion of the course, CAS/ENGL 137 focuses particularly on two critical academic capacities: analyzing and contextualizing. In this semester, students learn to rigorously examine the rhetoric surrounding them, compellingly present their findings in various modes, and thoughtfully contextualize their research. In this course, students will: -Develop a rich understanding of rhetorical concepts -Practice application of concepts and terms in expressing understanding of effectiveness of rhetoric through analysis and contextualization of existing texts -Enhance communication skills by practicing and applying in a variety of communication modes (written, oral, digital)", "other": ["Cross-listed with: CAS 137H", "General Education: Writing/Speaking (GWS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "138T", "credits": "3 Credits", "description": "This course builds rhetorical skills in oral, written, visual, and digital contexts and introduces deliberation and advocacy in civic and disciplinary spheres. CAS (ENGL) 138T Rhetoric and Civic Life II (3) (GWS)ENGL/CAS 138T, Rhetoric and Civic Life II, expands knowledge and aptitudes built in ENGL/CAS 137H by asking students to use rhetorical skills and principles to develop strategies for persuasion and advocacy in the context of civic issues. The course continues the multimodal emphasis-the focus on oral, written, visual, and digital communication-used in 137H and adds new components as well. Students will develop a repertoire of communication skills through hands-on practice at composing and delivering speeches and essays, and they will work with digital media to create multimedia texts, podcasts, and websites. Students will reflect on these different modes as themselves rhetorical choices. The course's civic and ethical components take center stage as students learn how to deliberate important public issues thoughtfully and with civility and respect. They will learn the difference between persuasion and advocacy and develop strategies for both in the context of pertinent local, national, and global issues. They will participate in a public deliberation forum on topics they generate and vote on. The forum will be organized to allow small deliberative action groups as well as large forum-style meetings. The course focuses on ethics in many contexts, e.g., community action and public deliberation; ethics of persuasion; ethical controversies in the disciplines. Students will be encouraged to explore percolating disciplinary interests and to share knowledge in online disciplinary communities. Students will work throughout the semester to design and build a final electronic portfolio that represents their academic work with an eye to their imagined professional futures. The portfolio assignment offers students an opportunity to reflect on their work, assessing the merits and themes of inquiries, and to curate and present their work to both targeted and broad online audiences.", "prerequisite": "ENGL 137H", "other": ["Cross-listed with: CAS 138T", "First-Year Seminar", "General Education: Writing/Speaking (GWS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "139", "credits": "3 Credits", "description": "This course offers an introduction to African American literature from the early writings of slavery and freedom to the works of present-day African American authors. We will explore the major themes, literary traditions and narrative strategies that merge and shape this body of literature, considering, for example, the influence of double-consciousness, questions of authenticity and performance, representations of blackness and whiteness, the significance of place, and the persistent presence of folklore and vernacular traditions. Our analyses of texts will be attentive to the intersections of race, class, gender, and sexuality, and by the end of the course you will be able to discuss fluently several literary techniques and strategies including irony, satire, narration, voice, characterization, imagery, style and setting. We will situate texts in their various historical and cultural contexts, and you will be introduced to key literary concepts and terms that should inform your reading and writing about these texts. You will learn how to analyze literature, do close and careful readings of texts and write persuasively about literary works. Students will engage in thoughtful, creative and open-minded class discussions, analyze literature and do close and careful readings of texts.", "other": ["Cross-listed with: AFAM 139", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "140", "credits": "3 Credits", "description": "Writers such as Baldwin, Beckett, Bellow, Ellison, Gordimer, Lessing, Lowell, Mailer, Naipaul, Pinter, Plath, Pynchon, Rushdie, and Walker.  ENGL 140 Contemporary Literature (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. ENGL 140 will constitute a wide-ranging study of contemporary literature written in English, including novels, short stories, poems, plays, and prose, written roughly between the end of the Second World War and the present. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Baldwin, Beckett, Bellow, Ellison, Erdrich, Delillo, Kingston, Lee, Pynchon, Gordimer, Lessing, Lowell, Mailer, Naipaul, Pinter, Plath, Rushdie, Silko, and Walker. Topics under consideration will vary from class to class, but may include a chronological introduction to the development of contemporary literature, a consideration of a principle theme or themes common to contemporary literature through a number of works from across the period, a consideration of a number of contemporary works in the context of historical events central to the period, a consideration of a number of contemporary works in the context of formal or aesthetic elements common to those works and their various effects. Time allotted for the study of the works under consideration will vary. This class will prepare students for advanced courses in post-modern and contemporary literatures as well as other academic courses that engage in the verbal and written analysis of complex written texts. Students will be evaluated by means of essays written in and out of class, essay exams, term-long reading journals, and class participation. Students should expect to complete a minimum of three written assignments in the course of the term. The course may be used as English major elective credit or as credit towards the English minor. Non-English majors may use this course to fulfill a General Education or Bachelor of Arts/Humanities. The course will be offered once a year with 60 seats per offering.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "140H", "credits": "3 Credits", "description": "ENGL 140H offers a wide-ranging study of contemporary literature written in English across different forms and/or media. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors and texts under consideration will vary by instructor. Topics under consideration will likewise vary from class to class, but may include a chronological introduction to the development of contemporary literature, a consideration of a principle theme or themes common to contemporary literature through a number of works, a consideration of a number of contemporary works in the context of historical events central to the period, a consideration of a number of contemporary works in the context of formal or aesthetic elements common to those works and their various effects.", "other": ["General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "141N", "credits": "1-3 Credits/Maximum of 6", "description": "This course will allow students to study African American literature, culture, history, and arts in connection with an annual public event, the African American Read-In (AARI). The AARI, promoting literacy and appreciation of African American literature, is a national event established in 1990 under the auspices of the National Council of Teachers of English. It has become a regular feature of Black History Month celebrated by community, neighborhood, and church groups as well as schools and institutions of higher education throughout the United States and elsewhere on a given Sunday and Monday in February attracting more than a million participants annually. This course offers students an engaged learning experience in which they will produce original intellectual and artistic content to be presented publicly at an AARI event on campus. Students will study texts from a range of historical periods and/or genres, and thus gain a solid introduction to the African American literary tradition. At the same time, the primary organizing principle of the course will be a particular theme that both allows a broad and coherent overview of a significant cultural or historical topic and engages issues of cultural diversity in the United States. The specific theme, thus, will bring the study of African American literature into a broader interdisciplinary context that intersects with African American culture, history, identity, and the struggle for equality. Students will study texts that relate to this annual theme and participate in a relevant field trip (museum, theater, cultural site, library, etc.) to deepen their understanding of the significance and contexts, social, historical, cultural, artistic of these materials and this theme. They will then develop this knowledge through creative and critical engagements into exhibitions, presentations, or performances to communicate their insights about a particular author, text, or topic in in the African American literary tradition. As shapers of the AARI program on their campus, class members will also have a voice in designing and planning the AARI as well as a stake in its overall success. As this course necessarily spans semesters, students who enroll in the Fall course will be expected to enroll in the Spring course in order to present their projects at the AARI in February. Only students who were enrolled in the Fall course will be permitted to enroll in the Spring, as it is the culmination of the same course.", "other": ["Cross-listed with: AFAM 141N, INART 141N", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "142N", "credits": "3 Credits", "description": "The course explores two streams in parallel. Students will examine selected historic landmarks in science (e.g. evolution, atomic energy/weapons, climate change, biotechnology), with a focus on common misconceptions about the facts and practice of science. The course will also examine the development of literary and popular portrayals of science and scientists in their political, economic, social and cultural contexts, paired to these particular scientific developments. By considering past and current scientific problems, students will refine their quantitative and analytical skills. By considering scientific writing, novels, short stories, graphic novels, cinema, poetry, and other forms, students will refine their critical and reflective writing and speaking about both the rhetorical and discursive practices of science writing, and the social and cultural impact of literature in popular understandings of science.", "other": ["Cross-listed with: SC 142N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "145", "credits": "3 Credits", "description": "Students will learn about Irish literature in the twentieth century and beyond; focus on the interplay of poltical, social, and cultural forces brought to bear on Irish literature, history, and politics from the early twentieth century to the present. The course will begin with the socio-political implications of the Home Rule movement and the important figures associated with the rise of the Irish Literary Renaissance. Instructors will spend much of the course focusing on canonical figures of modern Irish Literature (such as Joyce, Yeats, Synge, Beckett, Shaw,O'Casey,O'Flaherty, and Lady Gregory). The course will introduce students to the political context and themes of Irish Literary Renaissance (Irish Literary Renaissance), including cultural nationalism. Instructors may draw upon contemporary literary critics, such as Declan Kiberd, Seamus Deane, and Terence Brown, by way of introduction to the ILR. The class will then move on to Post-World War II Irish Literature. In this component of the course, instructors will select literature from writers who began publishing in the Post-War era. These authors may be examined as they follow the legacy of the ILR, or as they challenge it and forge new courses for Irish literature. In other words, these authors can be writing within or against the traditions and themes of ILR artists' or, more likely, doing both things at once. This component of the course will help students see the enduring legacy of the themes and forms of the ILR, as Irish authors continually reckon with its massive political and cultural inheritance. The course fulfills IL requirements in its emphasis on postcolonial relationships between Irish identity and culture and issues of British colonial occupation and the influence of American popular culture in the later twentieth century. The interpretive framework of postcolonial studies will inform the instructor's approach to the literature. Postcolonial studies seeks to examine the conditions and tropes of colonial and post-colonial writers and peoples. While postcolonial studies offers broad theories and concepts that can be applied to any postcolonial scene, the movement nonetheless has an interest in studying and honoring the regional particularities and the specific reaction of its writers to the postcolonial moment. This interplay of the unifying, international experience of colonialism with the particularity of individual nations and writers helps students to become sensitive to ideas of nation, unity, and difference. More so, the tropes of postcolonial literature, and Irish literature especially--focus on concepts of hybridity, the Other, contact zones, modernity vs. tradition, national identity, and personal identity, all on which seek to understand the self and others within an intercultural context. The literature of the IRL also explores the corrosive effects of British imperialism, which helps students to consider whether might makes right; and interrogate various forms of cultural imperialism, then and now. The literature of the IRL also promotes themes of intercultural understanding, featuring examples of reconciliation and compromise between tradition and modernity, and, more importantly, between Irish, American, and British characters. Assignments will help students focus on issues of identity construction, and social and political conflicts within and between cultures (Ireland in relationship to British and American culture and influence) within a post-colonial context.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "161N", "credits": "3 Credits", "description": "When Thomas Jefferson elevated one pursuit to stand with life and liberty as inalienable rights, he eschewed others. The Declaration of Independence features the pursuit of happiness rather than that of amusements, consumer goods, status, money, or ease. Happiness carried a history of deeper meanings in philosophy and religion. In 1776, \"happiness\" peppered discussions of individualism, rights, civilization, economics, and government, and echoed Ancient Greek dialogues about virtue and civil society. In America, \"happiness\" joined the religious language of salvation, rapture, and joy to define states of grace. By the twentieth century, happiness became suspect as the term frequently represented a superficial type of enjoyment in needless consumption manipulated through marketing. As happiness came to be twined with wealth and goods, so too did it align increasingly with success in all pursuits. Happiness became a form of winning and a status marker whose overt pursuit was as likely to lead to psychological and social problems as to health. We open with ancient philosophers and modern positive psychologists. The pursuit of happiness reached zenith speed in the history of American literature. From transcendentalists, to pragmatists, self-help, children's fantasy, psychoanalysis, or post-modernism, genres fell out of themselves in the pursuit to merely understand happiness. Novels, poems, memoirs, films, popular psychology, medical literature, memes, and blogs addressed happiness from nearly every conceivable angle to explore strategies such as choosing positive thoughts; stilling thoughts; cultivating enriching interests and habits; influencing our moods and emotions; and optimizing strategies for securing the resources, skill-sets, possessions, and relationships that encourage happiness. Some of these achievements aligned with health and economic benefits and introduced limitations in access or cultural relevance. Bio-behaviorists are exploring correlation vs. causation and ways of assessing social and individual well-being. Bringing modern bio-behavioral methodologies into the chronological narrative creates unprecedented opportunities for integrative study. Experiential elements of wellness fulfill goals of General Health and Wellness, identifying \"wellness as a positive state of well-being, not merely the absence of disease.\" Students will learn the most promising research on generating tangible, healthful benefits in individuals and communities and be introduced to sources for further learning, continuing to learn and pursue long-term happiness.", "other": ["Cross-listed with: HIST 162N", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "162N", "credits": "3 Credits", "description": "Communicating Care ENGL 162N / SOC 162N / CAS 162N What do we talk about when we talk about health? Our states of well-being and illness are topics that, like the weather, drive our daily conversations, but we rarely have time to study and practice these vital exchanges. Spoken in emergency rooms or on long-distance calls, by medical professionals, family members, or strangers making small talk, the languages we use to share pain and recovery require our knowledge of long-established scripts and our willingness to improvise. By exploring how these encounters draw from and work as textual and dramatic performances, this course will guide students to achieve a new level of literacy in the most essential communicative art of caring. Students will analyze health conversations in literary texts, such as short stories, poems, memoirs, and graphic novels. They will explore real-life scenarios drawn from their own experiences, fieldwork, social science theories, and published case studies. Developing skills in the humanities (GH), they will see how subjective, often individual experience, historical perspectives, and creative expression help people to communicate about health and care. Developing their abilities in the social and behavioral sciences (GS), they will see how theory provides insights to predict and understand health and practices of care, investigate objective perspectives and recognize the contributions of fieldwork and data-driven studies to analyzing and improving communication when health is a main concern. They will integrate these methodologies especially to pursue these fields' common goals of making beneficial connections between individuals and groups, and managing private and public life.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "163N", "credits": "3 Credits", "description": "Is it possible to comprehend the mind of another species? Can humans communicate with other animals? Do they have anything to say? In 1859, the publication of Darwin's The Origin of Species set the stage for the scientific investigation of animal minds. This course studies both scientific and non-scientific approaches to the study of thinking and emotion in animals. Students contemplate what researchers, artists, philosophers, writers and filmmakers learn by investigating the minds of animals, focusing on breakthroughs as well as misconceptions. Students conduct their own research on such topics as animal cognition and intelligence, animal language, anthropomorphism, animal testing and bioethics. Examples will be drawn from a range of disciplines in an effort to answer the central question: what is an animal, and what is a human?", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "165N", "credits": "3 Credits", "description": "If you get a job out of college, work eight hours a day, fifty weeks a year, and retire at age 65, at that point you have will spent roughly one third of your adult, waking life at work. And that is just paid work. Add in housework, childcare, and other forms of unpaid labor and the share of your waking hours devoted to work creeps closer to one half. And those calculations may actually underestimate the influence work has over your life. What you do will determine where you live, how you live, and, perhaps, whether you believe you have ultimately done something meaningful with your life. With work playing such an outsized role in a life, you may as well understand it as best you can. Hence this class. In it, we approach the question of work from the perspective of two disciplines: labor and employment relations and literature. The field of labor and employment relations asks about the social and economic forces-markets, compensation, globalization, immigration, etc.-that shape work. By contrast, the discipline of literature takes a more subjective approach to the question of work. Very broadly speaking, it shows how the forces that shape work play out in individual lives. In short, it shows how individuals feel about the work they do or, in the case of the unemployed, they do not do. Together, the two disciplines provide a global and personal perspective on one of the most important parts of our lives. Students registering for the course will read representative selections from both domains, engage in course discussions, take exams, and write essays as they explore the variety of ways both labor and employment relations and Literature can prepare them for their work lives and help them understand the place of work in culture and society.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "170N", "credits": "3 Credits", "description": "This course introduces the verbal and nonverbal genres of folklore that have influenced literature, economics, politics and culture in North America. Approaching folklore as traditional patterns, practices, and performances, the course explains folklore to be fundamental to human cultural life, and therefore an intimate part of the identities and values that Americans express in contemporary society. It will explore these identities and values on various levels: the individual, the family, the community, the region, the nation, and the world. Folklore, you will discover, is not something confined to the past, but all around us in the present, and is continually emerging anew. Students will read and discuss a number of folk genres, including folk speech, narratives, beliefs and religious experiences, use of space, and material culture. Students will learn strategies for researching, \"reading,\" and understanding the verbal and nonverbal folklore of diverse communities. The class may include readings on cultural traditions drawn from Native American, Latinx, African American, and immigrant cultures, as well as other folk groups defined by social identities such as age, occupation, gender, sexuality, or religion. By the end of the course, students will be able to recognize the cultural, political, and historical implications of such traditions. Assignments will include a fieldwork project; involving first-hand interviews, site observations, and archival research; to document, annotate, and analyze oral traditions. Students will be evaluated on the basis of class discussion, oral presentation and group exercises, in-class examinations, and the fieldwork portfolio.", "other": ["Cross-listed with: AMST 170N", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "179", "credits": "3 Credits", "description": "\"Exploring the Literature of Food: Current Trends in American Food Writing and Environmentalism\" begins by demonstrating the deep history of environmentally-minded agriculture in American thought. In the sample course, an understanding of the relationship between environmentalism and farming is developed through a consideration of thinking about food and food production in texts from the seventeenth through nineteenth centuries. These texts might touch on the importance of notions about the political importance of yeoman farmers, thoughts on the blending of cultivation and wildness, and late-nineteenth-century critiques of cruel and unsanitary industrial food production. The class might then turn to texts that argue for a return to sustainable agriculture in terms of Jeffersonian democracy and the ideal of the citizen-farmer. The topics raised in the first portion of the course include environmentalism, the role of labor in America, and the history of the industrialization of farming in the post-World War II era. From these origins, the course progresses into a consideration of the contemporary moment. It is clear that a great deal of change has occurred since mid-twentieth century critiques, and students are encouraged to trace the development of topics from the first portion of the syllabus in the later material. For example, the development of organic food standards by the FDA has resulted in a new system of organic industrial agriculture, which is compared to small scale agriculture by Michael Pollan, and Eric Schlosser updates muckraking investigations of labor and sanitation by turning to modern investigative journalism into the production of meat and the standards of uniformity set by fast food chains. The course ends with a consideration of the future of food as writers have imagined it. With a recommended experiential component, students are learning about the history of food production and writing about it while they encounter farmers who practice sustainable agriculture. Ideally, students learn from both the literature and from the farmer how something as practical as the production of food can be informed by philosophy and literature.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "180", "credits": "3 Credits", "description": "This course is an introduction to literature that takes as its subject the natural world. Students will practice the methods of ecologically oriented literary analysis (eco-criticism) and they will learn to contextualize the major historical periods, movements, and arguments for the necessity of literature about the natural world as it intersects with environmental studies. The course can cover anything considered \"literature,\" but namely fiction, poetry, nonfiction, and drama. Students will examine not only strategies of description, but also literature's unique ability to showcase conflict, reflection, and insight when it comes to protecting our environment. The course should include literature that addresses the human impact on nature. Students should learn about familiar environments and unfamiliar environments. Students should also come to understand the motivations of the authors.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "181A", "credits": "4.5 Credits", "description": "Examines the interconnection of culture and nature in the Chesapeake Bay region through the literature of the region.  ENGL 181A Adventure Literature: Exploring the Chesapeake Bay (4.5) The course focuses on a specific place--the Chesapeake Bay and its watershed--that has generated a distinctive regional identity and literature from its natural and social context. The course begins consideration of the concept of watershed, both as a geographical concept and a literary metaphor, before turning to an examination of the culture(s) and nature of the largest and most important tributary of the Bay, the Susquehanna River. Students will read texts associated with the history and the development of the Susquehanna, with some emphasis on logging, rafting, mining, and hydropower development. Readings here should aim at helping students see how a regional cultural identity has evolved from the river's geography and economics. Focus on the Bay itself, students can learn similar lessons. We begin by looking at the rich native cultures that occupied the region before the advent of Europeans and then move to initial European exploration and settlement. The class might then focus on development (agricultural, cultural, and industrial) of the Bay and Bay Region generally, through readings that might include regional histories and literary works like James Michener's Chesapeake: A Novel. Significant attention should be devoted to the sub-culture of the Chesapeake waterman, a regional identity that has generated its own mythology and folklore and has been the focus for numerous writers. Texts might be chosen to show the role nostalgia plays in conceptions of the Bay or the ways in which issues of race, class, and gender are raised by examining representations of the waterman culture. What students should see is how literature and culture are transformed over time, while resonances of former place identities remain. Finally, the course will turn to the Bay as it is today and how the representation of place and regional identity in literature has changed over time.This course was designed to include out-of-the-classroom educational experiences on the Susquehanna River and other tributes of the Bay and on the Chesapeake Bay itself. The trips should provide students opportunities to fully understand the interconnections of nature and culture in the Bay region. They should also allow students the chance to travel in the footsteps of the writers they read in venues throughout the region. The goal is to both see how a distinctive culture derived from the natural circumstances of the Chesapeake and to understand how that culture might continue (or not) into the future.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "181B", "credits": "4.5 Credits", "description": "Examines the interconnection of culture and nature on Cape Cod through considerations of texts in various literary genres that have contributed to development of a distinctive regional identity and culture.  ENGL 181B Adventure Literature: Exploring Cape Cod (4.5) The purpose of this course is to teach students how natural and cultural contexts contribute to the production of meaning in literary texts. In this case, the locality that serves as the focus of study is Cape Cod, arguably the most written-about locale in the United States. The course begins with classes devoted to the Cape's natural history its formation and the ever-present effect of wind and water and then moves to its early human history. Readings in the first part of the course will focus on the period just before and after European settlement and readings could include selections from William Bradford's Of Plymouth Plantation or Mourt's Relation, both contemporaneous accounts of the Pilgrim's landing on and exploration of the Cape and appropriate chapters from Paul Schneider's history of the Cape, The Enduring Shore, and Nathaniel Philbrick's excellent account of the Pilgrim adventure, Mayflower. These readings could be enhanced with selections on the European settlement of the Cape in Robert Finch's anthology of writing about the Cape, A Place Apart. This introductory material will lead to the major part of the course, which will be devoted to reading and study of classic literature about the Cape, such as Thoreau's Cape Cod, Henry Beston's The Outermost House, Wyman Richardson's The House on Nauset Marsh, and John Hay's The Great Beach, as well as selections of poetry poets associated with the Cape. Each of these works, in its time, represents the writer's attempt to somehow capture and come to terms with the landscape and natural exigencies of the Cape. The focus will then turn to representations of the Cape in the work of contemporary writers, and might include work by Michael Cunningham, Annie Dillard, David Gessner, Cynthia Huntington, and Mary Oliver among others. The course ends with a brief look at Cape Cod's literary and natural future as it has been imagined over the last 140 years.This course was designed to include an out-of-the-classroom education experience on Cape Cod. The trip to the cape should include experiences related to the cultural and natural history of the region, and it should provide students the opportunities to walk in the footsteps of William Bradford, Thoreau, Beston, and Hay, as well as opportunities to see for themselves how the natural features that have inspired the classic and contemporary writers of the Cape will continue to inspire future generations of artists.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "181C", "credits": "4.5 Credits", "description": "ENGL 181C -\"The Beach: Exploring the Literature of the Atlantic Shore\"-begins with some exploration of the dynamic forces at work on the barrier beach, with special attention to the ways in which great literature has taken what is described in the scientific literature and turned it into art. Examples for discussion are drawn from the work of such writers as Rachael Carson and Henry Beston. The general concerns of the course then move to environmental ethics, specifically as ethical questions are embodied in literature's representation of the human relationship with the other-than-human world, from such difficult-to-personify species as starfish, snakes, and spiders. General ethical questions then lead to specific treatments of human and wild animal interaction by various writers. The point is to explore how writers represent the optimal sort of relationship humans can have with the wild world, and what such representation might mean to the ways we personally interact with nature. From these opening considerations, the course turns to an examination of the way in which writers who focus on a specific region of the coast--South Atlantic barrier islands, for example-- establish a sense of the place in their writing. The course then narrows its focus even more, moving from a consideration of a regional cultural identity to that of specific towns or narrowly defined areas within the general region. This narrowed subject is explored in specific detail, beginning with pre-European cultures, the first explorers and settlers and then moving on to other aspects of the American culture history that make the subject area distinctive. For example, a course on the Low Country of South Carolina might start with the accounts of John Lawson, who published his journal of his own trip up the Santee River in 1701, move to accounts of the rice culture so important to the region in the nineteenth century and to the an examination of the Gullah Geechee culture established by West African slaves on Low Country plantations, and then move to writing from more recent writers, all of which help to define the area¿s distinctive cultural and particularly its literary identity.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "181D", "credits": "3 Credits", "description": "The purpose of ENGL 181D -\"Exploring the Literature of American Wilderness\"-is to study the literature and ideas associated with American wilderness in an experiential context; that is, the heart of this course should be an extended backpacking trip into a federally protected wilderness preserve. So the basic assumption on which this course is founded is that our understanding of literature and other cultural concerns can be enhanced by knowledge of and experience in a place. To achieve its purpose, this course will expose students to the following: - The history of wilderness in American culture, including the ongoing political debate about the meaning, value, and place of wilderness/wildness in that culture. - A representative sampling of the writing that has been directly inspired by wilderness experience. - Philosophical ideas directly associated with wilderness experience. - The rudiments of safe and low-impact backcountry travel and the manner in which to engage in that travel most ethically. - The direct experience of legally protects wilderness itself. - An opportunity, however briefly, to experiment with the Thoreavian notion of \"living deliberately.\" To accomplish this purpose, students will be asked to accomplish some reading and writing (of various types). In a version of this course previously offered, the exploration of the literary representation of wilderness over time-from Puritan historians and Enlightenment philosophers; to Thoreau, John Muir, and Theodore Roosevelt; to contemporary poets, novelists and literary journalists-is framed by reading Roderick Nash's standard history of wilderness in the United States, Wilderness and the American Mind", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "182", "credits": "3 Credits", "description": "This course examines literature written in English from countried that were once part of the British Empire or some other European empire. The class will approach this literature from a variety of thematic, historical, and/r generic perspectives. Topics under consideration will vary, but the course will often discuss matters of colonialism, race, and ethinicity, as well as matters of religion, gender, sexual orientation, and global contexts. The principle emphasis of the works in this course will be the consideration of non/European/ non-American societies and the differences between their culture and that of Europeans or Americans. This class will accordingly prepare students to consider social and culteral problems from a variety of cultural perspectives. This course meets the Bachelor of Arts degree requirements. This course may be used as English Major elective credits or as credit towards the English Minor.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "ENGL", "number": "182A", "credits": "3 Credits", "description": "Literature written in English from countries that were once part of the British Empire or some other European empire., e.g., India, Canada, South Africa, and others. ENGL 182A Literature and Empire (3) (GH;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. English 182A will constitute a wide ranging study of literature written in English, including novels, short stories, poems, plays, and prose, from countries that were once part of the British Empire or some other European empire. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Chinua Achebe, Buchi Emecheta, Alan Paton, David Malouf, Robertson Davies, Ngugi Wa Thiongo, J. M. Coetzee, R. K. Narayan, Amitabha Ghosh, Salman Rushdie, Christina Stead, Thomas Keneally, Jill Ker Conway, V. S. Naipaul, Wilson Harris, and Michael Ondaatje. Topics under consideration will vary from class to class, but the course will often discuss matters of race and ethnicity, as well as matters of religion, gender, sexual orientation and global context, where appropriate. The principle emphasis of the works in this course will be the recognition of non-European/non-American societies and the differences between their culture and that of Europeans or Americans. The conflicts generated by clashing cultures will drive the choice of readings. By the end of the course, students will have studied works from a minimum of five different cultural perspectives. This class will also prepare students to consider social and cultural problems from a variety of cultural perspectives. The course may be used as English Major elective credit or as credit towards the English Minor.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "182C", "credits": "3 Credits", "description": "Literature written in English from countries that were once part of the British Empire or some other European empire., e.g., India, Canada, South Africa, and others. ENGL 182C Literature and Empire (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. ENGL 182C will constitute a wide-ranging study of literature written in English, including novels, short stories, poems, plays, and prose, from countries that were once part of the British Empire or some other European empire. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Chinua Achebe, Buchi Emecheta, Alan Paton, David Malouf, Robertson Davies, Ngugi Wa Thiongo, J. M. Coetzee, R. K. Narayan, Amitabha Ghosh, Salman Rushdie, Christina Stead, Thomas Keneally, Jill Ker Conway, V. S. Naipaul, Wilson Harris, and Michael Ondaatje. Topics under consideration will vary from class to class, but the course will often discuss matters of race and ethnicity, as well as matters of religion, gender, sexual orientation and global context, where appropriate. The principal emphasis of the works in this course will be the recognition of non-European/non-American societies and the differences between their culture and that of Europeans or Americans. The conflicts generated by clashing cultures will drive the choice of readings. By the end of the course, students will have studied works from a minimum of five different cultural perspectives. This class will also prepare students to consider social and cultural problems from a variety of cultural perspectives. Students will be evaluated by means of essays written in and out of class, essay exams, term-long reading journals, and class participation. Students should expect to complete a minimum of three written assignments in the course of the term. The course may be used as English Major elective credit or as credit towards the English Minor and will be offered once a year, when staffing restrictions permit, with 35 seats per offering.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "ENGL", "number": "183N", "credits": "3 Credits", "description": "The course will focus on the history and politics of the Cold War and its depiction in literature and film, especially in British and American literature, but also in that of other countries. Students will read political science and history texts, novels, short stories, and poetry, and view films. Students will analyze the reasons that the Cold War has been and continues to be a major inspiration for literary production and a transformative influence on literary style. Students will be encouraged to explore alternative methodologies for research on cold war topics including the use of primary sources, for ex. documents from the intelligence community archives that have since been declassified. In addition to a class field trip, students will be encouraged to make additional site visits to appropriate institutions in U.S. intelligence history. They'll be making a series of visits to relevant sites.", "other": ["Cross-listed with: PLSC 183N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "183Z", "credits": "3-4.5 Credits/Maximum of 12", "description": "Adventure Literature (ENG 183Z) students not only read Thoreau, but like him, they travel to the mountains, the river, or the seashore; they hike, climb, and/or kayak; they interview residents with a stake in the area; and they synthesize their experiences through writing. In this course, students analyze works of fiction, poetry, and nonfiction (including scientific and historical texts) that interrogate human relationships with a specific natural environment or region. As part of the course, students visit the region that inspires that literature they explore its wild places on foot and/or by water, and meet authors, activists, and experts invested in its continued legacy. The course combines physical adventure with intellectual rigor; students of all majors will hone their writing and close reading abilities, enhance their analytical and integrative thinking skills, and gain unique insight into diverse US values, traditions, beliefs, and customs rooted in place and environmental practice. This linked course is listed concurrently and must be taken with KINES 1Z/RPTM 1Z (Outdoor Pursuits) in the same semester.", "prerequisite": "ENGL 15", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "General Education - Integrative: Linked", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "184", "credits": "3 Credits", "description": "This course is designed to introduce students to the art of the short story and to acquaint them with some of its most talented writers. During the semester we will read short stories from various cultures and countries, ranging from stories written in the early nineteenth-century to those written within the last few years. Readings will include works from authors like Hawthorne, Melville, Tolstoy, Dostoevsky, Gogol, Bierce, Chekhov, Kafka, Chopin, Crane, Gilman, James, Cather, Joyce, Woolf, Faulkner, Hemingway, Lawrence, Orwell, O'Connor, Baldwin, Olson, Silko, Erdrich, Ondaatje, Barth, Barthelme, Atwood, Mukherjee, Walker, Tan, Calvino, Garcia Marquez, and Cortazar. All readings will be in English. This course is intended to help one learn how to read fiction, how to understand it, and how to talk about it. The desire to tell stories and to be told stories is one of the most basic human needs, and all cultures have been defined in part by the stories they hear and the stories they tell. We are not born knowing how to read the short story or any fiction for that matter. Rather it is a skill that one acquires, and the more one does it, like playing tennis or any other activity, the better one becomes at it, for we learn what to look for. We will explore the historical development of the short story genre, and examine how historical contexts relate to the content and style of the stories under discussion. We will become familiar with how stories are put together and with the vocabulary that is used to discuss fiction--terms such as plot, narrative, character, tone, language, closure, irony, imagery. and so forth. CMLIT/ENGL 184 is not required for the CmLit major but may be selected to fulfill one of the course requirements for the major or the World Literature Minor. This course also fulfills the General Education Humanities requirement, the Bachelor of Arts Humanities requirement, and International Cultures requirement.", "other": ["Cross-listed with: CMLIT 184", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "185", "credits": "3 Credits", "description": "Development of the modern novel in the last century (outside the British Isles and the United States); lectures, discussions, readings in translation. CMLIT 185 / ENGL 185 The Modern Novel in World Literature (3) (GH) (BA) This course meets the Bachelor of Arts degree requirements. In this course, students will read examples of the modern novel from around the world. Focusing on novels written outside of America and England, this class will explore the development of the modern novel as a genre across a number of world cultures. As an example, moving from the beginnings of literary modernism (the late nineteenth century) through the early and mid twentieth century, the course will consider works by writers such as the following: Chinua Achebe, Italo Calvino, Albert Camus, Simone deBeauvior, Fyodor Dostoevsky, Isak Dinesen, Marguerite Duras, Natalia Ginzburg, Herman Hesse, James Joyce, Thomas Mann, Gabriel Garcia Marquez, Kenzaburo Oe, and Marcel Proust. This course will address the ways in which the world novels under consideration constitute examples of various literary forms and styles. The class will examine the differences and distances between literary movements such as social realism and magical realism, modernism and postmodernism. The goals of this course will be to hone students' critical reading and writing skills while granting them the ability to think about the modern novel as a distinct genre in a comparative global context. This course will help students to develop the analytical skills necessary to analyze complex written texts..", "other": ["Cross-listed with: CMLIT 185", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "189", "credits": "3 Credits", "description": "CMLIT (ENGL) 189 The Founders of Modern Drama (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. CMLIT/ENGL 189 will constitute a wide-ranging study of plays by authors often credited with the making of modernist drama. The class will approach these plays from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Ibsen, Strindberg, Chekhov, Shaw, Wilde, Galsworthy, O'Neill, Beckett, and Yeats. Important works by Asian, African, and Latin American playwrights will be considered, too. Topics under consideration will vary from class to class but may include a chronological introduction to the development of modern drama, a consideration of a principal theme or themes in modern drama through a number of plays, or a consideration of plays in the context of historical events or formal or aesthetic elements. Time allotted for the study of the works under consideration will vary. This class will prepare students for advanced courses in dramatic literature as well as other academic courses that engage in the verbal and written analysis of complex written texts. The course may be used as an English or Comparative Literature major credit or as credit toward the English or Comparative Literature minor.", "other": ["Cross-listed with: CMLIT 189", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "190Q", "credits": "3 Credits", "description": "In English 190Q / INART 203Q students will gain an understanding of medievalism, defined by Leslie J. Workman in 1987 as \"the study of the Middle Ages, the application of medieval models to contemporary needs, and the inspiration of the Middle Ages in all forms of art and thought.\" As this definition suggests, understanding medievalism and, thus, the popular works students know, such as Game of Thrones and Lord of the Rings' benefit from learning something about the Middle Ages and the reach of its re-mediation across various kinds of expression. Therefore, ENGL 190Q / INART 203Q begins by introducing students to medieval works and a few of the forms that characterize it. More particularly, the medieval works to be studied are those combining more than one genre, media, and/or form. For example, students will read and listen to (or sing!) medieval lyrics, read and perform short medieval plays such as Robin Hood, be introduced to manuscripts of the bestiary with its illuminations, historiated letters, and scribal copying. They also will be introduced to Romanesque and Gothic architecture The first medievalist remediations--works adapted in other media--to be examined will be Book I of Spenser's Faerie Queene, with the woodcut of the Redcrosse Knight and Dryden/Purcell's King Arthur, which will introduce students to Early Modern English medievalism and how it reflects prevailing values in new combinations of old and new artistic forms. Still greater emphasis will be placed on the English Medieval Revival of the nineteenth century, including John Ruskin and the PreRaphaelites poetry, paintings, and essays, as well as William Morris's poetry, painting and Arts and Crafts Movement. Then, as now, medievalism served multiple purposes, including aesthetic, political, and social. To put into practice what students learn and to engage their creativity, one assignment involves hand crafting an art project to be accompanied by an artist statement. In the last part of the course, the focus shifts to contemporary medievalist arts and theory. In keeping with the contemporary direction, another assignment asks students to remediate their handcrafted medievalist work, or to create a new one, using digital resources to engage both their creativity and understanding of key medievalist concepts.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "191", "credits": "3 Credits", "description": "As a genre of literature, science fiction enables human beings to model themselves as a cosmic species, a life form that imagines and inhabits an entirely new scale of being. No longer confined to a tribe, nation or tradition, science fiction narrates and explores the galactic magnitudes of both the external world of astronomical exploration (billions and billions of stars) and the inner world of subjective reality and imagination (billions and billions of neurons). This course introduces students to the surprisingly long history of science fiction as a way of exploring both the microcosm and the macrocosm, mapping a species imagining themselves into the future.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "192", "credits": "3 Credits", "description": "Perhaps more than any other genre of speculative fiction, fantasy is richly varied. This course examines the development of literary traditions in fantasy literature from their earliest origins in mythology and folklore, through the historical development of classic fantasy works, into the books, movies and other fictions of the modern day. The course specifically considers how the fantasy genre has incorporated a range of international traditions. The course also explores different critical and theoretical approaches to the student of fantasy literature and related artistic traditions, as surrealism and magical realism.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "193N", "credits": "3 Credits", "description": "This course combines the literary analysis of comics and graphic novels with the creative practice of making comics. Students will learn through an integrated and ongoing process of interpreting select comics texts and also making their own work in that same medium. Students will gain a technical vocabulary for discussing and assessing comics, which they will then apply to formal analysis of compositional and narrative elements in select assigned texts. This analysis will occur first in class discussion, facilitated by the instructors, and then through a sequence of individual written assignments. At the same time, students will receive formal instruction in making comics as they create their own work over the course of the semester, workshopping with peers and instructors as a way of gaining further insight into the creative and technical processes of the studied texts. Formal analysis and creative work will be coordinated and progressive across the course of the semester. The culmination of this collaborative learning would be an integrated understanding and appreciation of comics art.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "194", "credits": "3 Credits", "description": "Short stories, novels, poetry, drama, and essays by English, American, and other English-speaking women writers. ENGL (WMNST) 194 Women Writers (3) (GH;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. English 194 will constitute a wide ranging study of works by American, British, and other English-speaking women writers, including novels, short stories, poems, plays, and prose. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Bradstreet, Wollstonecraft, C. Rosefti, M. Shelley, Austen, C. Bronte, E. Bronte, G. Eliot, D. Wordsworth, Dickinson, Wharton, Stowe, Freeman, Jewett, Fuller, H.D., Moore, Sitwell, Bishop, Brooks, Plath, Cather, Woolf, Stein, Lessing, Bowen, O'Connor, Welty, Porter, Oates, Olsen, Sarton, Gordimer, Atwood, Morrison, Kinkaid, McCarthy, and Churchill. The course seeks to make students aware of the extensive body of literature written by women through the analysis, evaluation, and appreciation of specific works by women writers. The course also seeks to help students understand the female perspectives-the varying values and interests of women--reflected in the texts at hand and to position these perspectives within wider social, historical, and political contexts. The course also seeks to make students aware of the special problems faced by both women writers and the female inhabitants of the societies they describe in their work. As a course in women's literature, ENGL/WMNST 194 concerns itself with questions of gender. In so far as some of these women writers are black or women of color, it concerns itself with questions of race and ethnicity. In as far as the course looks at women's literature in the context of men's literature, it is concerned with the inter-relationship between dominant (male) and non-dominant (female) culture in the United States as well as in Britain. In so far as the course covers lesbian writers, it is concerned with sexual orientation. Topics under consideration will vary from class to class, but may include a chronological introduction to the development of women's literature, a consideration of a principle theme or themes common to women's literature through a number of works from across a number of historical periods, a consideration of a number of women's works in the context of historical events central to their creation, a consideration of a number of women's works in the context of formal or aesthetic elements common to those works and their various effects. This class will prepare students for advanced courses in women's literature as well as other academic courses that engage in the verbal and written analysis of complex written texts.", "other": ["Cross-listed with: WMNST 194", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "194H", "credits": "3 Credits", "description": "English 194H will constitue a wide ranging study of works by American, British, and other English-speaking women writers, including novels, short stories, poems, plays, and prose. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Bradstreet, Wollstonecraft, C. Rosetti, M. Shelley, AUsten, C. Bronte, E. Bronte, G. Eliot, D. Wordsworth, Dickinson, Wharton, Stowe, Freeman, Jewett,  Fuller, H.D., Moore, Sitwell, Bishop, Brooks, Plath, Cather, Woolf, Stein, Lessing, Bowen, O'Connor, Welty, Porter, Oates, Olsen, Sarton, Gordimer, Atwood, Morrison, Kinkaid, McCarthy, and Churchill.  The course seeks to make students aware of the extensive body of literature written by women through the analysis, evaluation, and appreciation of specific works by women writers. The course also seeks to help students understand the female perspectives-the varying values and interests of women-reflected in the texts at hand and to position these perspectives within wider social, historical, and political contexts. The course also seeks to make students aware of the special problems faced by both women writers and the female inhabitants of the societies they describe in their work. This class will prepare students for advanced courses in women's literature as well as other academic courses that engage in the verbal and written analysis of complex written texts.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "194S", "credits": "3 Credits", "description": "Short stories, novels, poetry, drama, and essays by English, American, and other English-speaking women writers.  ENGL 194S Women Writers (3) (GH;US;IL;FYS)(BA) This course meets the Bachelor of Arts degree requirements. English 194 will constitute a wide ranging study of works by American, British, and other English-speaking women writers, including novels, short stories, poems, plays, and prose. The class will approach this literature from a variety of thematic, historical, and/or generic vantages. Authors under consideration will vary from class to class, but may include writers such as Bradstreet, Wollstonecraft, C. Rosefti, M. Shelley, Austen, C. Bronte, E. Bronte, G. Eliot, D. Wordsworth, Dickinson, Wharton, Stowe, Freeman, Jewett, Fuller, H.D., Moore, Sitwell, Bishop, Brooks, Plath, Cather, Woolf, Stein, Lessing, Bowen, O'Connor, Welty, Porter, Oates, Olsen, Sarton, Gordimer, Atwood, Morrison, Kinkaid, McCarthy, and Churchill. The course seeks to make students aware of the extensive body of literature written by women through the analysis, evaluation, and appreciation of specific works by women writers. The course also seeks to help students understand the female perspectives-the varying values and interests of women--reflected in the texts at hand and to position these perspectives within wider social, historical, and political contexts. The course also seeks to make students aware of the special problems faced by both women writers and the female inhabitants of the societies they describe in their work. As a course in women's literature, ENGL/WMNST 194 concerns itself with questions of gender. In so far as some of these women writers are black or women of color, it concerns itself with questions of race and ethnicity. In as far as the course looks at women's literature in the context of men's literature, it is concerned with the inter-relationship between dominant (male) and non-dominant (female) culture in the United States as well as in Britain. In so far as the course covers lesbian writers, it is concerned with sexual orientation. Topics under consideration will vary from class to class, but may include a chronological introduction to the development of women's literature, a consideration of a principle theme or themes common to women's literature through a number of works from across a number of historical periods, a consideration of a number of women's works in the context of historical events central to their creation, a consideration of a number of women's works in the context of formal or aesthetic elements common to those works and their various effects. Time allofted for the study of the works under consideration will vary. This class will prepare students for advanced courses in women's literature as well as other academic courses that engage in the verbal and written analysis of complex written texts. Students will be evaluated by means of essays written in and out of class, essay exams, term-long reading journals, and class participation. Students should expect to complete a minimum of three written assignments in the course of the term. The course may be used as English Major elective credit or as credit towards the English Minor and will be offered once a year with 60 seats per offering.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "First-Year Seminar", "General Education: Humanities (GH)"]}, {"department": "ENGL", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "197Z", "credits": "3 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest. Linked Course", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "General Education - Integrative: Linked"]}, {"department": "ENGL", "number": "198", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "199", "credits": "3-6 Credits/Maximum of 6", "description": "Studies in English language and/or literature.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "200", "credits": "3 Credits", "description": "Responses to a variety of literary texts written in English that evoke different approaches.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "200H", "credits": "3 Credits", "description": "Responses to a variety of literary texts written in English that evoke different approaches.", "other": ["Honors"]}, {"department": "ENGL", "number": "200W", "credits": "3 Credits", "description": "Responses to a variety of literary texts written in English that evoke different approaches.  ENGL 200W Introduction to Critical Reading (3)(BA) This course meets the Bachelor of Arts degree requirements. When we read a work of literature, how do we determine what it means? Why do readers and critics come up with different interpretations of the same work? How do we decide if a literary work is valuable or not? This course addresses these and other questions by introducing students to the variety of literary questions on which critics and scholars base their interpretations of literature. Each theory poses different questions about a literary text's meanings and focuses our attention on different aspects of a text's language and background. We will examine the theory and practice the application of the following schools of criticism: formalism, psychoanalytic criticism, new historicism, Marxism, and feminism. We will apply different methods to particular literary texts, and students will practice different types of approaches in in-class writing assignments as well as in four papers (4-5 pages each). At the end of the semester, each student will put together a portfolio containing careful revisions of three of those papers as well as an introductory commentary of 1-2 pages.", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "201", "credits": "3 Credits", "description": "ENGL 201 What is Literature acquaints students with theory and practice relevant to studies of narrative, lyric poetry, and drama. This course meets the Bachelor of Arts degree requirements. English 201 will familiarize students with theories and practices that are foundational for thinking about literature, and for studying narrative fiction, poetry, and drama. The course will pose such questions as what is narrative fiction?; what is poetry?; what is drama?; It will introduce students to how conventions of literary genres operate, how they generate meaning, and how they require and manipulate reader's responses. English 201 will also encourage students to explore whether or not literary discourse, as instanced in the genres that have been named, can be distinguished from other written or spoken discourses. While asking such questions, the course will acquaint students with technical vocabularies used by literary scholars and literary historians, and will provide students with sample scholarly rationales for hypothesizing the singularity of literary discourse, for constructing literary history, and for understanding literature's relation to life. It will teach students close analytic practices of reading, both those that have shaped the discipline of English studies and those emerging currently. The course will be required of all English majors and will be a part of their 36 credit degree requirement.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "201H", "credits": "3 Credits", "description": "ENGL 201H will familiarize students with theories and practices that are foundational for thinking about literature and for studying narrative fiction, poetry, and drama. The course will pose such questions as \"what is narrative fiction?\" \"what is poetry?\" and \"what is drama?\" It will introduce students to how conventions of literary genres operate, how they generate meaning, and how they require and manipulate readers responses. English 201H will also encourage students to explore whether or not literary discourse, as instanced in the genres that have been named, can be distinguished from other written or spoken discourses. While asking such questions, the course will acquaint students with technical vocabularies used by literary scholars and literary historians, and will provide students with sample scholarly rationales for hypothesizing the singularity of literary discourse, for constructing literary history, and for understanding literature's relation to life. It will teach students close analytic practices of reading, both those that have shaped the discipline of English studies and those emerging currently. As an honors course, ENGL 201H will introduce students to how conventions of literary genres operate, how they generate meaning, and how they require and manipulate readers' responses. English 201H will also encourage students to explore whether or not literary discourse, as instanced in particular genres, can be distinguished from other written or spoken discourses. While asking such questions, the course will acquaint students with technical vocabularies used by literary scholars and literary historians, and will provide students with sample scholarly rationales for hypothesizing the singularity of literary discourse, for constructing literary history, and for understanding literature's relation to life. It will teach students close analytic practices of reading, both those that have shaped the discipline of English studies and those emerging currently. Students can expect to take a highly engaged role in seminar-style discussion, including prepared presentations intended to provide a basis for that session's discussion, and which may both draw on, and emerge from, written work for the course.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "202A", "credits": "3 Credits", "description": "ENGL 202A introduces students to the types of writing that social scientists typically do in the workplace, including research proposals, proper citation practices, literature reviews, and research reports. In discussing writing and writing activities, this class will focus on some of the more common forms of social science research - among them, experiments, interviews, observations, and surveys. Students will learn to formulate ideas and create coherent pieces of writing from the research they have conducted and read about. In short, this course will introduce students to a variety of writing and research strategies from which they can begin to develop their own identity as a social scientist. (A student may take only one course for credit from ENGL 202A, 202B, 202C, and 202D.)", "prerequisite": "ENGL 15", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "202B", "credits": "3 Credits", "description": "Instruction in writing persuasive arguments about significant issues in the humanities. (A student may take only one course for credit from ENGL 202A, 202B, 202C, and 202D.) ENGL 202B Advanced Writing in the Humanities encourages students to develop professional writing skills most likely required in humanities careers. These writing modes include professional materials and then a wider range of writing projects that may include a professional narrative, analysis of a controversy, argumentation, persuasion, and synthesis. Students may analyze a wide-variety of texts - both verbal, digital, and visual -  to learn skillful argumentation with advanced writing techniques.", "prerequisite": "ENGL 15", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "202C", "credits": "3 Credits", "description": "Writing for students in scientific and technical disciplines. (A student may take only one course for credit from ENGL 202A, 202B, 202C, and 202D.) ENGL 202C is an advanced writing course designed to help students in science and engineering develop the writing strategies that they will need to communicate successfully on the job and to help them understand why those strategies are appropriate and effective. A key emphasis will be on the rhetorical principles of effective communication, including context analysis and defining clear, actionable purposes. Students will gain experience with a wide range of technical writing genres, including reports, descriptions, definitions, procedures, job application documents, emails, memos, and web applications. Students will also learn about the importance of document and graphic design, including how best to design communications to maximize their potential for success.", "prerequisite": "ENGL 15", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "202D", "credits": "3 Credits", "description": "Writing reports and other common forms of business communication. (A student may take only one course for credit from ENGL 202A, 202B, 202C, and 202D.) ENGL 202D is an advanced writing course designed to help students develop the writing strategies that they will need to write successfully on the job and to help them understand why those strategies are appropriate and effective. A key emphasis will be on rhetorical principles of effective communication, including audience analysis and defining clear, actionable purpose. Students will gain experience with a wide range of business writing genres, including reports, letters, job application documents, emails, memos and web applications like business blogs, online articles, social media profiles and personal branding. Students will also learn about the importance of document design, including how best to utilize headings, page layout, graphics and other visuals to maximize the potential for communication success.", "prerequisite": "ENGL 15", "other": ["General Education: Writing/Speaking (GWS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "202H", "credits": "3 Credits", "description": "ENGL 202H teaches the distinctive features of professional and scholarly writing across disciplines, while inviting students to develop their professional identities. Unlike existing 202 versions 202H is designed for students in all majors, with assignments that address more area-specific expectations while highlighting commonalities and the need to communicate with non-specialist audiences. 202H is intended as rigorous preparation for third-year students preparing for an honors thesis or project, by examining how to identify and develop a topic, how to contextualize it within wider scholarship, and how to convey its significance within and beyond the field.", "prerequisite": "ENGL 15", "other": ["General Education: Writing/Speaking (GWS)", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "205", "credits": "3 Credits", "description": "As a child, what you read, or what is read to you, forms your first and foundational experience with literature. Moreover, what you read, and what is read to you, introduces you to the values that your culture holds dear. Despite its importance to individuals and their culture, we-instructors, students-only rarely approach children's literature with the same seriousness that we approach other works of literature. This course sets out to correct that. It assumes that texts like Alice's Adventures in Wonderland, Harry Potter and the Sorcerer's Stone, or Don't Let the Pigeon Drive the Bus! reward the kind of close and careful study that scholars and students usually reserve for more canonical works of literature. Students who take this course will leave it with a sense of the history and development of children's literature in English, the methods of studying children's literature, and, most of all, an understanding of how children's literature reproduces and occasionally challenges the values of the culture that produces and disseminates it. Its overall premise is that you can learn a lot about a culture-how it feels about childhood, race, gender, work, religion, and so on-by what that culture does and does not offer its children to read.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "206", "credits": "3 Credits", "description": "For many people, literature and business could not have less to do with each other. According to this view, literature escapes from reality to the imaginative, while nothing could be more focused on the real than business and its buying and selling of commodities and services. The problem is that no one told literary writers of this mutual incompatibility. For centuries, writers have peered into the world of business and brought back stories intended to document, inspire, and warn. True, writers have often, and sometimes unthinkingly, condemned business and those who follow it, but they have just as often had genuine insights into its workings. In this course, we will follow the relationship between literature and business over the course of modern history. Although one version of the course would begin with literature that dates back to the invention of capitalism in (more or less) the sixteenth century, our course will begin at the turn of the nineteenth century, with the Industrial Revolution in England and the United States, and follow the literature of business up to the present. Our aim in reading is not just to understand how writers have represented business and those who pursue it, which, it has to be admitted, has often been with contempt. But, rather, in reading more sympathetic works, to understand the drama of business, why those who pursue it find it so invigorating, and why those who have historically been excluded from it-women, African Americans, colonial subjects-have been so eager to join it. Money, of course, is one answer to those questions, but it is neither the only nor the most important one.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "208N", "credits": "3 Credits", "description": "The Beatles are the most significant musical group in the history of popular music. Their songs are derived from diverse sources, such as rhythm 'n' blues, rock 'n' roll, country 'n' western, Motown, soul, folk music, folk rock, the British Music Hall, and European and Indian classical music traditions. Two ideas define their work: an emphasis on freedom, and how song texts can be interpreted in different ways. The Beatles had a great impact not only on American popular music during their heyday in the 1960s but also on the country' s popular culture in which they were considered philosopher kings. Beatle albums mirrored changing trends in the culture, from the pre-Vietnam War youthfulness of A Hard Day's Night, to the psychedelia of Revolver and Sgt. Pepper, to the countercultural mindset of The White Album. This inter-domain course will focus on how the Beatles influenced American popular culture from the 1960s to the present day. It will examine how the Beatles were a part of a mid-twentieth-century British youth subculture that was shaped by the cultural attitudes of American rock 'n' roll. The course will then turn its attention to the seismic shift initiated by the Fab Four in both music and pop culture in the US from 1964 to 1970, demonstrating how it has permeated the popular culture of the 1970s to the present day. The course will enhance the appreciation of the Beatles and their music through its interdisciplinary focus, contextualizing the Fab Four's work in order to show how both popular music and culture can influence one another. One way the course will facilitate this goal is through the inclusion of selected readings from English literature and popular culture upon which students will write reflection essays.", "other": ["Cross-listed with: MUSIC 209N", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "209", "credits": "1-6 Credits/Maximum of 8", "description": "A practicum in the editing and publishing of a magazine or journal.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "210", "credits": "3 Credits", "description": "Examination of the relation between fiction and nonfiction; practice in principles common to all writing.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "211", "credits": "3 Credits", "description": "This course introduces students to the most salient issues and theories in writing studies.  Students explore contemporary theories and issues about writing in order to understand writing as a skill and a complex object of study in various professional contexts."}, {"department": "ENGL", "number": "211W", "credits": "3 Credits", "description": "This course introduces students to the most salient issues and theories in writing studies.  Students explore contemporary theories and issues about writing in order to understand writing as a skill and a complex object of study in various professional contexts.  ENGL 211W Introduction to Writing Studies (3)Most students know that writing is something one does; they are less aware that writing is something one studies, and that doing so is a challenging and fascinating intellectual endeavor. In this class, students explore the multifaceted nature of writing. As the list of major topics indicates above, students study a broad range of contemporary theories and issues, from the socially-constituted self in the act of writing, to plagiarism as it is variably defined in professional settings, to the role of the writer in social change. The course is designed for both breadth and depth. Breadth is achieved through the many topics described above. The exams are designed to encourage students to make connections from one topic to another, to see how each builds on and intertwines with others. For example, early semester study on a writer&rsquo;s individual agency is later complicated by issues of power determined by race, class, and gender. Writers&rsquo; ethical choices are made more challenging when confronted with questions of ideology and social justice. Depth is achieved through the written essays. Each essay requires that students examine a narrow topic in depth, building on an assigned reading with limited and manageable primary and secondary research. For example, students may study their own writing as intertextual, drawing conclusions about originality and creativity in the process. Throughout the course, students are encouraged to apply issues and theories to real-world situations, in such realms as professional settings, politics, media, and social justice. Several speakers come to class throughout the semester to expose students to the many kinds of writing professional writers do, the expectations and standards required of professional writers, and the avenues to success as professional writers.", "other": ["Writing Across the Curriculum"]}, {"department": "ENGL", "number": "212", "credits": "3 Credits", "description": "English 212 is a course for students who want to try writing fiction for the first time and for more seasoned writers who are ready to develop greater courage for expression, complexity of craft, and skills for analysis and revision. You will find new sources of inspiration and sharpen your senses for observation. You will master the core components of fiction, such as character, setting, point of view, dialogue, and plot, and you will learn to improve your writing by sharing and reworking it. The course typically involves short exercises designed to help you strengthen key areas of your writing; analysis of published short stories and essays for examples and advice; and, centrally, workshop settings, where you will gain experience giving and receiving generous, useful criticism. You will complete at least one longer, cohesive work of fiction, such as a short story or section of a novel. You will learn to take up the writing life with a spirit of adventure and play, even as you get serious about the disciplined work and vital stakes of making fiction. By inspiring the production, analysis, and appreciation of creative arts, this course satisfies Bachelor of Arts and General Education requirements for Arts.", "other": ["Bachelor of Arts: Humanities", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "213", "credits": "3 Credits", "description": "Written exercises in the components and techniques of poetry writing in conjunction with selected readings.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "214", "credits": "3 Credits", "description": "Introduces lyric and narrative forms in memoir writing and the personal essay.  ENGL 214 Introduction to Creative Nonfiction Writing (3) Creative nonfiction borrows techniques from fiction and poetry while adhering to but also sometimes questioning notions of truth. It stretches the bounds of literary or narrative journalism by asking the reader to consider it as art, primarily, versus as testimony, fact, or information-delivery. Students taking this course will explore the genre's influences in fiction, research, and poetry; critical analyses will complement this exploration, and formal experimentation will prepare students to imagine novel relationships between form and content. Discussing traditional storytelling technique, the course introduces students to story rudiments including the inciting episode, rising and falling action, climax and denouement and the so-called swerve ending. The course also introduces students to the possibilities of the nonlinear \"lyric essay\" as outlined in Seneca Review and elsewhere, as well as to the \"modular\" essay; uses of blank space for communicating the unsayable; and how poetic style can circle elusive meaning.In exploring issues of nuance and implied or glanced-at meaning, the course also discusses the place of truth in nonfiction - differing constructions and conceptions of truth; reader expectations for factuality in a work of nonfiction; and the complications of unreliability when the fallibility of memory or a multiplicity of perspectives color testimony.Finally, the course examines the role of nontraditional structure in conveying a postmodern understanding of subjectivity, for instance by looking at the use of multiple voices and personae in the works of certain contemporary authors. While ENGL 215 teaches skills for the journalist in developing feature-style journalism and narrative personal essays, ENGL 214, alternatively, will explore and exploit the influence of fiction, poetry, and other lyric forms. Students in this course will produce writing more appropriate to a literary journal than a news magazine; their writing will concern broad, sometimes disjunctive themes, and stray away from the nut-graf, news-hook, or even an obvious narrative focus.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "215", "credits": "3 Credits", "description": "Written exercises in, and a study of, the principles of article writing; practice in the writing of specific articles.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "221", "credits": "3 Credits", "description": "Introduction to literary history and analysis; Beowulf and writers such as Chaucer, Shakespeare, Donne, Milton, Swift, Pope, and Fielding.  ENGL 221 British Literature to 1798 (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. Focusing on major writers and their cultural contexts, English 221 surveys British literature to 1798. A remarkable amount of important work was produced over this period. Students will read major texts like Beowulf, Romeo and Juliet, and Tom Jones; learn about renowned authors such as Chaucer, Shakespeare, and Fielding; and be introduced to influential literary forms, such as the epic, the revenge tragedy, and the picaresque novel. The tradition of British literature evolved over periods of significant upheaval and change. Students will also learn about the shifting historical and ethical orientations that energized this tradition, from the Heroic Ethos to Christian Humanism to Neoclassicism. As an introductory survey of British literature, English 221 welcomes non majors: no previous course in literature is required. By reading and discussing some of the best-known works in British literature, students will sharpen their skills of interpretation while surveying an important literary tradition.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "221W", "credits": "3 Credits", "description": "Focusing on major writers and their cultural contexts, ENGL 221W surveys British literature to 1798. A remarkable amount of important work was produced over this period. Students will read major texts like Beowulf, Romeo and Juliet, and Tom Jones; learn about renowned authors such as Chaucer, Shakespeare, and Fielding; and be introduced to influential literary forms, such as the epic, the revenge tragedy, and the picaresque novel. The tradition of British literature evolved over periods of significant upheaval and change. Students will also learn about the shifting historical and ethical orientations that energized this tradition, from the Heroic Ethos to Christian Humanism to Neoclassicism. As an introductory survey of British literature, English 221W welcomes non majors: no previous course in literature is required. By reading and discussing some of the best-known works in British literature, students will sharpen their skills of interpretation while surveying an important literary tradition.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "222", "credits": "3 Credits", "description": "Focusing on major writers and their cultural contexts, ENGL 222 surveys British literature from 1798 to the present. A remarkable amount of important literature was produced during this period. Students will read major texts like Pride and Prejudice, Hard Times, and Jane Eyre; learn about renowned authors such as William Blake, Charles Dickens, and Virginia Woolf; and be introduced to influential literary forms, such as the dramatic monologue, the gothic novel, and stream-of-consciousness narrative. The tradition of British literature since 1798 evolved over periods of significant political and cultural upheaval and change. Thus students will also learn about the shifting historical and ethical orientations that energized this tradition, from rising industrialization and changing class and gender relations as manifested in Romanticism, Modernism, and Postmodernism. As an introductory survey of British literature, ENGL 222 welcomes non majors; no previous course in literature is required. By reading and discussing some of the best-known works in British literature, students will sharpen their skills of interpretation while surveying important literary traditions and gaining crucial critical insight into an international culture that literally influenced-through its imperial reach-countries around the world.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "222W", "credits": "3 Credits", "description": "Focusing on major writers and their cultural contexts, ENGL 222W surveys British literature from 1798 to the present. A remarkable amount of important literature was produced during this period. Students will read major texts like Pride and Prejudice, Hard Times, and Jane Eyre; learn about renowned authors such as William Blake, Charles Dickens, and Virginia Woolf; and be introduced to influential literary forms, such as the dramatic monologue, the gothic novel, and stream-of-consciousness narrative. The tradition of British literature since 1798 evolved over periods of significant political and cultural upheaval and change. Thus students will also learn about the shifting historical and ethical orientations that energized this tradition, from rising industrialization and changing class and gender relations as manifested in Romanticism, Modernism, and Postmodernism. As an introductory survey of British literature, ENGL 222W welcomes non majors; no previous course in literature is required. By reading and discussing some of the best-known works in British literature, students will sharpen their skills of interpretation while surveying important literary traditions and gaining crucial critical insight into an international culture that literally influenced--through its imperial reach--countries around the world. This is a WAC course", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "223N", "credits": "3 Credits", "description": "This course will explore the relation between literary analysis and both film and theatrical performance by asking students to approach a limited set of plays from multiple perspectives, using texts, film, and theatrical performance from around the world to integrate these methodologies. Students will work closely with Shakespearean texts, practice textual and poetic analysis, and will also examine critically different forms of international performance: film and live theatre. In particular, the course will explore the interrelation of these elements, revealing a deeper imaginative understanding of works that continue to influence English-speaking literature and culture.", "other": ["International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "224N", "credits": "3 Credits", "description": "This course explores the many links between modern art and literature, including fiction about artists, illustrations of fiction and poetry, efforts to write in the styles associated with modern art, and practices of ekphrasis (the evocation of visual art in language). These links between authors and artists have exerted a formative influence on the development of modern fiction and poetry as authors and artists in various avant-garde groupings collaborated and competed to generate modes of artistic expression appropriate to modernity. This course examines those interactions. Course objectives are to bring together for comparative examination: * Formal or generic relationships between texts and images at particular historical moments; under this rubric we will consider issues such as ekphrasis. * Creative collaboration and cross-pollination between writers and artists, which have been crucially important in the history of literature and poetry; examples include Pre-Raphaelite poetry and painting, Virginia Woolf and Post-Impressionism, Gertrude Stein and Cubism * Conceptions of creativity as these have been expressed by writers using the figure of the artist; texts in this category range from Balzac's The Unknown Masterpiece, through Hawthorne's The Marble Faun, to Paul Auster's appropriation from the performance artist Sophie Calle This course explores the ways knowledge of literature and skills in critical reading can be rewardingly brought to bear on the visual arts, and considers how visual art can illuminate the workings of literature both for individual readers and in the classroom.", "other": ["Cross-listed with: ARTH 224N", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "225N", "credits": "3 Credits", "description": "ENGL 225N / ARTH 225N / WMNST 225N Sexuality and Modern Visual Culture (3) (GA;GH) An examination of the visual expression of gender and sexual identities in English-speaking cultures since the late nineteenth century. The terms \"feminist\" and \"homosexual\" were invented by the Victorians and reflect profound shifts in conceptions of identity. Another invention of the nineteenth century was the idea of the literary and artistic \"avant-garde\" as a minority contingent with politically and/or aesthetically advanced views. These ideas of minority culture were deeply enmeshed with one another, and have exerted profound influence ever since. This course explores that history with the objectives of expanding students' knowledge of modern art and literature, and of fostering more sophisticated understandings of how evolving socio-political ideas affect our sense of who we are and how we relate to texts and images. The course is relevant to students of American and English studies, art, art history, and women's, gender and sexuality studies.", "other": ["Cross-listed with: ARTH 225N, WMNST 225N", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "226", "credits": "3 Credits", "description": "English 226 will constitute a wide-ranging examination of contemporary texts (1960-present) central to the construction of contemporary Latino/a culture.  ENGL 226 Latina and Latino Border Theories (3) (GH;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course focuses on contemporary Latina/o cultural production, placing it in historical context and analyzing it through the framework of borders. We make connections between Latina/o groups, showing both similarities and differences. We examine the politics of representation, asking how artistic texts define community and individual identities that are coherent yet also embody the complexity of these identities. The texts cross and claim borders- cultural, sexual, gender, geographical, generational, spiritual, and institutional. We will ask how these art forms work to claim border spaces: How are cultural differences retained without constructing hierarchies of exclusion? What models of identity do these artists propose in response to structures of domination? We'll read novels, short stories, poems, history, and theoretical essays; we will also watch several films. Throughout the course, we will attend to particular histories and cultures of Latina/o groups; it is crucial to both maintain the specificity of each culture (Chicana/o, Puerto Rican, Cuban-American, and Dominican-American) and their connections to each other as Latinas/os in the U.S. Inquiring into these intersections leads one to ask the following: how can Latinos unite against the assault on immigrants and bilingual education without erasing very important differences among Latina/o populations? How can Latinas unite against ongoing sexism and homophobia within their communities and the U.S. in general? How should we view the marketing category \"Hispanic\" and/or \"Latino\" and how do artists offer alternative conceptions of group identity?", "other": ["Cross-listed with: LTNST 226", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"department": "ENGL", "number": "227", "credits": "3 Credits", "description": "ENGL 227 Introduction to Sexuality Studies (3) (GH;US) This course focuses on the body of critical writings known as queer theory in order to analyze issues of sexuality and gender since 1969. The course interrogates sexual norms and their deviations, with a particular focus on the relationships between sexuality, imagination, and ethics in the making of sexual communities and fostering activism around sexuality and gender. We will study how class, race, and gender have been shaped, and themselves shape, the production of and resistance to sexual norms. Queer Theory engages issues \"queer space\" and \"queer time,\" related concepts that relate bodies and environments to history and memory, and to fantasy, imagination, and utopianism. We will also explore the ways marginalization, shame, and criminalization have been transformed into visionary acts of \"world-making\" that have changed contemporary understandings of bodies, identities, social formations, literature and visual culture. Throughout, our focus will be on the relationships between sexuality and ethics, and how both shape the history of queer culture and activism.", "other": ["Cross-listed with: WMNST 227", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "228", "credits": "3 Credits", "description": "ENGL 228 provides a humanities-based interdisciplinary introduction to Disability Studies. This is one of two paired introductory courses developed as required courses for the Disability Studies minor. (The other is RHS 100.) Students will have wide exposure to both the lived experiences of disability, past and present, and to the unstable cultural norms that have traditionally stigmatized disability. The course explores valuable varieties of human embodiment and mindedness; it also asks central questions about what counts as \"normal,\" and who gets to say why. Making use of historical tracts, novels, poetry, movies, plays, art exhibits, memoirs, youtube clips, and activist documents, ENGL 228 offers important new dimensions and challenges to traditional accounts of human value and political agency.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "229", "credits": "3 Credits", "description": "This course will introduce students to concepts, methods, and resources for digital studies, meaning both the study of culture using digital means and the study of digital culture and digital cultural objects in themselves. In some cases, digitization and digital production enrich existing approaches to English studies; in other cases, they present new paradigms and practices, requiring the cultivation of new analytic and theoretical approaches along with new technical skills. Accordingly, the course will emphasize both that enrichment of existing approaches to English studies, in the use of computers to present and analyze English-language materials preserved in the past, and the application of computing to the creation of expressive cultural artifacts unique to networked and programmable media (at the instructor's discretion, the creation of such artifacts may be incorporated into the course). Working in this balance of modes, students will also acquire familiarity with the intellectual history of digital studies and its key debates. Topics to be covered may include the fundamentals of the digital representation of linguistic, visual, and other cultural data; differences between language and code, including the difference between human languages and artificial languages, including computer programming languages; data storage methods and media; electronic archiving and digital preservation, both personal and institutional; issues and debates in electronic publishing, including intellectual property and open access; computer-assisted methods of cultural analysis; the history of creative and expressive computing, from video games to electronic literature, code poetry, glitch culture, esoteric programming languages, etc.; data privacy and security issues; differences between the traditional qualitative approaches of humanities research and the quantitative approaches to the study of writing and language preferred by some social sciences, and what is at stake in blending these approaches.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "231", "credits": "3 Credits", "description": "This course offers students a broad introduction to key moments and authors in the literary traditions that shaped US literature up to 1865. While individual authors and works discussed in class will vary, the course addresses the overall development of literatures in the United States by time periods and genres that may range from pre-Columbian oral traditions to American fiction and poetry published until the end of the Civil War. The class may feature the study of representative examples of both oral traditions and written works. In addition to highlighting enduring literary voices, the class may also highlight the development of specific genres (such as slave narratives), literary movements (such as Transcendentalism), periods of literary production (such as the American Renaissance) or other groupings of authors (such as the Fireside Poets) over the course of US literary history. Likewise, the class may include works both by authors who were popular at the time when they published their works (and thus able to impact American literature and culture during their lifetime) and those whose contributions to literary history were recognized only later. While it should be expected that no version of this course will be able to cover all authors whose works emerged before 1865, selected authors and works might include the following: examples of Native American, African American, and other oral traditions; excerpts from works by authors such as Anne Bradstreet, Edward Taylor, Cotton Mather, Phillis Wheatley, Samson Occom, Benjamin Franklin, Washington Irving, James Fenimore Cooper, Harriet Beecher Stowe, William Cullen Bryant, Henry Wadsworth Longfellow, John Greenleaf Whittier, James Russell Lowell, Oliver Wendel Holmes, Frederick Douglass, Harriet Jacobs, Edgar Allan Poe, Nathaniel Hawthorne, Henry David Thoreau, Ralph Waldo Emerson, Margaret Fuller, Herman Melville, Walt Whitman, or Emily Dickinson.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "231Y", "credits": "3 Credits", "description": "This course offers students a broad introduction to key moments and authors in the literary traditions that shaped US literature up to 1865. While individual authors and works discussed in class will vary, the course addresses the overall development of literatures in the United States by time periods and genres that may range from pre-Columbian oral traditions to American fiction and poetry published until the end of the Civil War. The class may feature the study of representative examples of both oral traditions and written works. In addition to highlighting enduring literary voices, the class may also highlight the development of specific genres (such as slave narratives), literary movements (such as Transcendentalism), periods of literary production (such as the American Renaissance) or other groupings of authors (such as the Fireside Poets) over the course of US literary history. Likewise, the class may include works both by authors who were popular at the time when they published their works (and thus able to impact American literature and culture during their lifetime) and those whose contributions to literary history were recognized only later. While it should be expected that no version of this course will be able to cover all authors whose works emerged before 1865, selected authors and works might include the following: examples of Native American, African American, and other oral traditions; excerpts from works by authors such as Anne Bradstreet, Edward Taylor, Cotton Mather, Phillis Wheatley, Samson Occom, Benjamin Franklin, Washington Irving, James Fenimore Cooper, Harriet Beecher Stowe, William Cullen Bryant, Henry Wadsworth Longfellow, John Greenleaf Whittier, James Russell Lowell, Oliver Wendel Holmes, Frederick Douglass, Harriet Jacobs, Edgar Allan Poe, Nathaniel Hawthorne, Henry David Thoreau, Ralph Waldo Emerson, Margaret Fuller, Herman Melville, Walt Whitman, or Emily Dickinson.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "232", "credits": "3 Credits", "description": "Focusing on major writers and their cultural contexts, English 232 surveys American literature from 1865 to the present. A remarkable amount of important literature was produced during this period. Students will read major texts like The Great Gatsby, The Grapes of Wrath, and Beloved; learn about renowned authors such as Ernest Hemingway, Flannery O'Connor, and James Baldwin; and be introduced to influential literary forms, such as the imagist poem, the modernist novel, and New Journalism. The tradition of American literature since 1865 evolved over periods of significant upheaval and change. Students will also learn about the shifting historical and ethical orientations that energized this tradition, from Naturalism to Modernism and Postmodernism. As an introductory survey of American literature, English 232 welcomes non majors: no previous course in literature is required. By reading and discussing some of the most important works in American literature, students will sharpen their skills of interpretation while surveying an important literary tradition.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "232Y", "credits": "3 Credits", "description": "Focusing on major writers and their cultural contexts, ENGL 232Y surveys American literature from 1865 to the present. A remarkable amount of important literature was produced during this period. Students will read major texts like The Great Gatsby, The Grapes of Wrath, and Beloved; learn about renowned authors such as Ernest Hemingway, Flannery O'Connor, and James Baldwin; and be introduced to influential literary forms, such as the imagist poem, the modernist novel, and New Journalism. The tradition of American literature since 1865 evolved over periods of significant upheaval and change. Students will also learn about the shifting historical and ethical orientations that energized this tradition, from Naturalism to Modernism and Postmodernism. As an introductory survey of American literature, ENGL 232 welcomes non majors: no previous course in literature is required. By reading and discussing some of the most important works in American literature, students will sharpen their skills of interpretation while surveying an important literary tradition.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "233N", "credits": "3 Credits", "description": "This pedagogically innovative course will be team taught by an instructor from the English department and one from the Chemistry department. Both instructors will be present in the classroom throughout the semester, providing joint presentations and leading discussions. The integration of humanities and natural sciences domain content will encourage students from humanities and natural science backgrounds, as well as other interested students, to take the course and learn how to integrate these two domains of knowledge in their education and their lives after leaving Penn State. This course teaches both basic concepts of chemistry and their cultural elaboration in literature, and it models a critical assessment of the implications of chemistry and literature emerging from a shared cultural field, rather than autonomously from two separate cultures. The course seeks to provide students with a nuanced understanding of how literature and science inform each other and negotiate cultural, religious, and political tensions. Understanding the origin and development of these ideas, perspectives, and discoveries is an essential component of science and scientific achievement, but too often our methods of teaching science focus almost exclusively on   teaching facts and theories at the expense of the historical discovery, creation, and development of those facts and theories. This courses teaches both the scientific facts and theories and the contexts of their production in order to sharpen students' abilities at critical evaluation of facts. The literary and scientific focus will vary from class to class, but may include writings by literary authors such as Mary Shelley, Edward Bulwer-Lytton, Bram Stoker, H. G. Wells, Garrett Serviss, Aldous Huxley, Roald Hoffmann, Carl Djerassi, Don DeLillo, William Butler Yeats, Arthur Machen, D.H. Lawrence, A. E. Waite, Aleister Crowley, Arthur Conan Doyle, Camille Flammarion, and Rachel Carson, and scientific texts by scientists such as T.H. Huxley, William Crookes, William Ramsay, Frederick Soddy, Ernest Rutherford, Wilhelm Conrad Roentgen, Henri Bequerel, J.J. Thomson, Niels Bohr, and Marie  Curie. Key concepts of environmental chemistry. The specific focus of this class will vary from class to class, but all sections will spend approximately 40% of the class on units specifically devoted to key concepts in basic chemistry, 40% of the class on literary interpretations of and influences upon concepts in chemistry in specific historical periods, and 20% of the class on significant methods of theorizing the boundaries between and interrelationships of science and culture., and on the concept of the \"culture of science.\" However, these subjects will be interwoven throughout the semester. Indeed, the pedagogy of the course depends upon the literature and the science not being neatly separated from each other. Instead, students will learn up-to-date science while exploring the origins, development, and cultural dimensions of that science, and will learn to integrate their understanding of the domains of science and the humanities through the course. The course will be offered once every year with approximately 20-35 seats per offering.", "other": ["Cross-listed with: CHEM 233N", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "234", "credits": "3 Credits", "description": "A passing glance at a newspaper sports page is enough to confirm how ethically fraught the sports world is. This course explores the ethical issues that arise in a culture of competition, and it uses a variety of literary texts to ground that exploration. It seeks to provide students with a nuanced understanding of how dependent sports are on narratives, and how a variety of ethical issues underwrite existing narratives about sports. With a focus on \"the big three\" (baseball, basketball, and football), the course has a U.S. focus but also has opportunities for students to write about other sports and in non-U.S. contexts. The course connects issues in literature to issues that arise in real time as the semester unfolds. Through the readings, students will develop a heightened awareness of how different a sport can look from the \"inside,\" as an athlete or coach. The literature, that is, develops ethical imaginations and helps students think in a more complicated way about one of the most talked-about phenomena in American culture: athletics, at all levels. Units on baseball, basketball, and football focus on issues specific to those sports (e.g., the basketball unit features texts and discussions about Title IX and gender equity in sport; football on violence, injury, and athlete expendability. The course seeks to equip students to have more sophisticated conversations about sports issues, and to be more discerning as spectators and consumers of sports.", "other": ["General Education: Humanities (GH)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "235", "credits": "3 Credits", "description": "The origins, forms, and function of the oral folk tradition of African Americans. ENGL 235 / AFAM 235 From Folk Shouts and Songs to Hip Hop Poetry (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. This course contemplates connections between African oral traditions and contemporary trends in Black poetry including hip-hop and spoken word poetry. The central objective of the course is to examine the degree to which the most contemporary forms of African American poetry continue to function as folk expression; it provides an opportunity for students to examine the oral roots of African American literature in general and contemporary hip-hop and spoken word poetry, in particular. Music, particularly the Blues and Jazz, will be a prominent feature of this class as we try to discover the peculiarities of Black poetry. Students will begin by comparing African and African American folk forms such as proverbs and epic poetry, continue with early African American poets such as Phyllis Wheatley, George Moses Horton, Frances Ellen Watkins Harper, and Paul Laurence Dunbar, and continue through the 20th century with the poetry of the Harlem Renaissance and Black Arts Movement to contemporary Hip-Hop and Spoken Word, including Def Poetry Jam recordings. Background readings will include important essays (such as James Weldon Johnson's \"Preface to the Book of Negro Poetry\" and Langston Hughes's \"The Negro Artist and the Racial Mountain\") that reveal the kinds of aesthetic issues African American artists faced in crafting their art in the face of a dominant culture that consistently questioned their capacity for artistic production. Students will listen as Margaret Walker reads her famous poem, \"For My People,\" and they will consider the importance of the Black Arts Movement, its poets and critics to the development of contemporary hip-hop and spoken word poetry. Other course materials will include videotaped interviews and poetry readings. Readings would come from an appropriate anthology and/or a combination of other appropriate texts selected by the instructor.", "other": ["Cross-listed with: AFAM 235", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "236N", "credits": "3 Credits", "description": "The Cubists were a group of painters including George Bracques, Pablo Picasso, working in Paris in the 1910s who, in addition to other painterly innovations, depicted objects not from one perspective but from multiple perspectives simultaneously. The final painting could sometimes look like a blur, but, or so the theory went, such multiplicity of perspectives could offer a truer, more complete representation of reality than any single perspective. In this class, we shall adopt a Cubist strategy of taking multiple perspectives. But instead of a guitar or a nude, our object of study will be inequality, and the multiple perspectives will not be different angles of seeing but different disciplines: economics, sociology, education, philosophy, and literature. How does each discipline define inequality? What does each have to say about it? And what does each argue, if anything, should be done about it? The class will mostly focus on economic inequality, but as you will discover, discussions of economic inequality quickly involve discussions of other forms of inequality (principally race and gender) besides economic inequality, and we shall consider those as well.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "237N", "credits": "3 Credits", "description": "You've probably heard of documentary photographs and documentary films, but you may not be familiar with documentary poetry. In this course, we will discuss how poets can use letters, diaries, transcripts, and other materials to create poems that capture historical events and everyday life in order to bear witness to particular moments in time. An important element of the course will be the role of documenting our world in terms of social justice and ethical responsibility. Whether focusing on public education, poverty, race, class, disability, gender, environmentalism, or other subjects, documentary poets personalize issues that are typically represented with broader brushstrokes. As Paul Metres observes, documentary poets invite \"the real life outside the poem\" into the poem itself, thereby \"testing\" the boundaries of what Wallace Stevens called \"the pressure of reality.\" We will begin by viewing and discussing documentary poetry within the context of photography and filmmaking. Next, we will read and discuss documentary poems, including persona, collage, and erasure poems. These readings will also include interviews with select documentary poets about their processes. An overview of poetry terminology, research methods, and the ethics of documentary art will provide you with the basis for composing your own documentary poems. The last third of the course will be spent writing and workshopping your original documentary poems.", "other": ["United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "240", "credits": "3 Credits/Maximum of 6", "description": "The examination of specific literary traditions in English-language texts and an inquiry into the question of tradition itself.  (Section subtitles may appear in the Schedule of Courses.)", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "245", "credits": "3 Credits", "description": "An introduction to the dominant themes in Lesbian, Gay, Bisexual, Transgender, and Queer Studies, with an emphasis on both literary & cultural studies. This course explores the history of modern, western ideas about sexual identity as manifested in literature, theater, film, and other narrative forms of popular culture. Drawing on the substantial body of \"queer theory\" generated by scholars in the humanities since the 1990s, this class examines sexuality not as a \"natural\" or consistent phenomenon, but as a set of beliefs that have changed over time and manifest themselves differently in different cultural and historical contexts. Starting in the late nineteenth century, scientific and medical authorities began categorizing individuals into sexual types based on their manifestations of gendered characteristics and their erotic attractions and practices. This medical typing corresponded with the development of subcultures associated with deviance from sexual norms; these subcultures produced a rich variety of texts, images, performances, and social forms, many of which became central to both popular and high culture. This course explores this rich archive, moving among media. It investigates constructions of sexual conformity and how sexual nonconformists positioned themselves in relation to cultural and medical group identities. It examines how distinctions between gendered, raced, and classed bodies were historically produced and culturally contested. It considers what commonalities gay identities may - or may not -- share with lesbian identities and how transgender and other identities have altered perceptions of sexual identity. The course also explores the relationship of the avant-garde to the mass media and how sexual subcultures have shaped literary and other cultural forms of expression. Comparative study of issues of sexual mobility beyond and between the borders of the United States expands the course's critical scope beyond dominant forms of western culture. This course does not propose definitive answers to the questions of identity it addresses. Instead it negotiates the ways sexualities have enabled individuals to articulate -- and disarticulate -- themselves within social bodies past and present. This course, therefore, has wide relevance for students interested in how group identities come into being and transform over time in dynamic relation to other historical forces. Exploring a wide variety of cultural forms associated with the history of sexual identity as well as a variety of interpretations of that history, this course opens students to an archive of literature, theater, film, and other narrative arts with the potential to inform and enrich their understandings of many kinds of challenges to regimes of normativity today.", "other": ["Cross-listed with: WMNST 245", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "250", "credits": "3 Credits", "description": "Introduction to theories and skills of successful peer tutoring in writing. Provides tutoring experience in a writing center.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "260", "credits": "3 Credits", "description": "Students will consolidate and extend their critical understandings of the creative process within their own writing and in relation to the works of other screenwriters. Through the course, students will build on the ideas, concepts and issues discussed in class and in assigned readings and viewings, to explore new theoretical orientations, extend knowledge, and refine their skills in script analysis and creative writing. The course will help students navigate through foundational theories so that they may build upon them.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "261", "credits": "3 Credits/Maximum of 6", "description": "What is genre and why does it matter to the study of literature? This course takes up the question of genre - what it is and why it matters - using a particular literary form (the early novel, epic poetry, episodic drama, memoir detective fiction, etc.) as its focus. Students will examine specific genre iterations across time and media, with attention to how conventional forms can both value tradition and incorporate innovation.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "262", "credits": "3 Credits", "description": "ENGL 262 examines the critical, theoretical, and practical issues that readers face when reading fiction. Students will examine critical concepts ranging from fundamental analytical concerns such as plot structure, characterization, and themes, to broader ethical, philosophical, social, and political questions raised by fiction. As a genre course, ENGL 262 will pay special attention to the critical issues and problems raised by reading fiction, as opposed to reading poetry, drama, or non-fiction. Authors might include the following: Defoe, Richardson, Fielding, Walpole, Burney, Sterne, Smollett, C.B. Brown, Austen, J.F. Cooper, Hawthorne, Melville, Child, Chopin, Shelley, the Brontes, G. Eliot, Dickens, Hardy, Thackeray, James, Joyce, Woolf, Bellamy, Faulkner, Hemingway, Morrison, Delillo, Reed, Barthe, Coover, Ellison, Nabokov, Wright, Welch, Erdrich, and others.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "ENGL", "number": "263", "credits": "3 Credits", "description": "English 263 will take up the questions, problems, and delights involved in reading poetry in British, American, and other English-language traditions. Examining the fundamental tools of reading poetry (meter, rhyme, image, diction, poetic forms, figurative language, and other rhetorical devices), students in English 263 will pay special attention to the critical issues and problems raised by reading poetry, as opposed to reading fiction, drama, non-fiction, or social texts. Authors under consideration will vary from class to class, but may include writers such as Chaucer, Shakespeare, Marvell, Herbert, Donne, Jonson, Milton, Pope, Blake, Coleridge, Wordsworth, Byron, Shelley, Keats, Tennyson, Clare, Browning, Hopkins, Rossetti, Wheatley, Melville, Whitman, Dickinson, Poe, Dunbar, Justice, Frost, Stevens, Williams, Pound, Eliot, Moore, Loy, H.D., Cummings, Crane, Robinson, Yeats, Hughes, Cullen, Olson, O'Hara, Creeley, Duncan, Auden, Lowell, Plath, Ginsberg, Lorde, Atwood, Brooks, Baraka, GlOck, Doty, and many others. The course may be taught in a number of different ways, for instance, simply by breaking the course down into relatively equally weighted units on particular formal aspects of poetry (rhyme, meter, genre-epic, dramatic, lyric, and various sub-genres-fixed forms, and the like) and then moving on to units designed to explore how poetry addresses specific social, cultural, and historical contexts.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGL", "number": "265", "credits": "3 Credits", "description": "Reading Nonfiction will provide students with a historical context and the reading skills necessary for this \"fourth genre\" of creative writing, with an emphasis on memoirs and the essays that have defined the genre across different eras. Biographies, autobiographies, travel narratives, science writing, and political writing could be included along with hybrid nonfiction such as graphic memoir and the video essay. As a reading (not writing) class, content will focus on the implicit contract of truth between the writer and the reader, with discussions to focus on the impact of a \"true story\" told creatively. What must the writer accomplish on the page in order for a reader to become engaged with this genre? The course will bring to the table questions of ethics and morals when applied to our latest understanding of the fallibility or reliability of memory and how authors use their memories to write nonfiction. Later weeks in the course will examine publishing trends in nonfiction and identify career paths for students wishing to further explore the scholarship of nonfiction.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENGL", "number": "268", "credits": "3 Credits", "description": "Reading Drama is a course that will cover elements of drama including plot, character, dialogue, staging, and dramatic forms in primarily British, American, and other English-language traditions. Students will explore different techniques for reading drama through a literary lense, including the overlap of reading for history, reading for theory, reading for pleasure, and reading as a preparation for the eventual staging of drama. Students can expect to encounter a range of drama presented in such a way that learning outcomes explore historical trends, artistic movements, critical reception, and drama's effect on culture, society, politics, and art. Students will by the end of the course have a solid foundation in comparing and contrasting styles of drama and will also be able to engage in the scholarly dialogue of analyzing dramatic literature to a depth that goes beyond appreciating the entertainment value of a good play.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "ENGL", "number": "281", "credits": "3 Credits", "description": "An introduction to the writing of scripts for television production.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "282", "credits": "3 Credits", "description": "This creative writing course will further explore the specialized techniques and requirements of television script writing. Students will complete a first draft of a pilot episode (begun in ENGL281) and then revise the draft, focusing especially on the main character's story arc, plot structure, adding multiple narrative lines, scene and dialogue revision, and developing larger narrative lines for future episodes. Through script readings, discussions, writing exercises, and workshopping, students will come to understand the revision process and develop skills that can be applied to future scriptwriting.", "prerequisite": "ENGL 281"}, {"department": "ENGL", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Individual or small group instruction.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "310H", "credits": "3 Credits", "description": "Research paper or creative project on a topic approved by the Departmental Honors Committee. Departmental approval required (for more special information please refer to the notes section in LionPATH).", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "ENGL", "number": "312", "credits": "3 Credits", "description": "This course examines contemporary fiction that reflects on globality and globalization, most often from contexts where planetary crisis registers as linguistic or narrative disturbance: war, empire, economic underdevelopment, state repression, diaspora, immigration, or major historical shifts. Anglophone writings will be read alongside works in translation to track the common-or uncommon-conditions of humanity that results from economic and political globalization. The course pays special attention to questions of violence and justice, the principal preoccupations of human rights discourse.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "312H", "credits": "3 Credits", "description": "This course examines contemporary fiction that reflects on globality and globalization, most often from contexts where planetary crisis registers as linguistic or narrative disturbance: war, empire, economic underdevelopment, state repression, diaspora, immigration, or major historical shifts. Anglophone writings will be read alongside works in translation to track the common-or uncommon-conditions of humanity that results from economic and political globalization. The course pays special attention to questions of violence and justice, the principal preoccupations of human rights discourse. This Honors section is enriched by more rigorous requirements (longer papers, and a research component to each paper where the student is required to cite and engage critical sources and conversations). Participation requirements are also enhanced, making for a richer honors experience.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "399", "credits": "3-6 Credits/Maximum of 6", "description": "Advanced studies in English language and/or literature.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "400", "credits": "3 Credits/Maximum of 6", "description": "Styles, cultural milieus, critical perspectives toward particular English- language authors and/or movements they represent, and the idea of authorship. (Section subtitles may appear in the Schedule of Courses.)", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "401", "credits": "3 Credits/Maximum of 6", "description": "English-language texts exemplifying particular genres, with attention to critical theories, historical development, rhetorical strategies, and social, cultural, and aesthetic values.  (Section subtitles may appear in the Schedule of Courses.)", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "401W", "credits": "3 Credits", "description": "Theories of art and creativity which inform the making of literary works.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "402", "credits": "3 Credits/Maximum of 6", "description": "Texts confronting social, political, technological, or other issues in the English-speaking world.  (Section subtitles may appear in the Schedule of Courses.)  ENGL 402 Literature and Society (3)(BA) This course meets the Bachelor of Arts degree requirements. One variation will focus on Literature and Censorship by first considering general arguments for and against censorship and then by examining texts by writers who sought publication in their own country but whose books were censored or banned. The course will consider such questions as, Are there ever legitimate grounds for censorship? How do standards of censorship differ between countries? What is the relation between censorship on political and on moral grounds? What does artistic merit have to do with concern about moral or political subversion? Works from England, South Africa and the United States will be read and discussed, and where available, excerpts from trial transcripts will be read in order to examine arguments for and against publication. Readings will include works by Milton, D. H. Lawrence, Alan Paton, Nadine Gordimer, Athol Fugard, Eugene O'Neill, Henry Miller, and Alan Ginsberg.Another variation will focus on war and gender in 20th century American literature by examining the ways male and female authors write about war. Texts will vary from battlefield experiences to repercussions of war to the symbolic implications of war. Questions will be raised about literary authority: Does one need to be combatant to write about war? If not, how does one find the authority to speak, particularly as a woman? How does race and/or ethnicity complicate one's perceptions of American participation in war? Readings will include works by Ernest Hemingway, William Faulkner, Joseph Heller, Cynthia Ozick, Leslie Marmon Silko, Norman Mailer, Bobbie Mason, Tim O'Brien, and Toni Morrison.Another variation will focus specifically on the writings which emerged from the postwar African-American struggle for civil rights. The course will include not only fiction and poetry but also those speeches, sermons, editorials, and other forms of discourse to have emerged from the era. The emphasis will be both traditional literary concerns as well as on the various rhetorical strategies involved in each work. Ideally, the course would make visible to students the difficulties attendant upon any attempt to separate the concerns of rhetoric and persuasion too firmly from the concerns of literature. The course could conclude with a look at some of the various biographies, autobiographies, and histories written over the last twenty-five years, which attempt to shape our national memory.Other variations include literature as a response to Newtonian science or to Darwinism or to the American Depression or to postwar technology or to new dystopias or to AIDS or, as in the sample outline, the Civil Rights movement.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "403", "credits": "3 Credits/Maximum of 6", "description": "Historical, theoretical, and practical issues within cultural studies in relation to English-speaking texts.  (Section subtitles may appear in the Schedule of Courses.)  ENGL 403 Literature and Cultural Studies (3)(BA) This course meets the Bachelor of Arts degree requirements. Topics covered in this course will vary from semester to semester, but a broad framework will be to introduce students to literary and other texts read in relation to cultural studies. Individual instructors may take up different historical periods, while other versions may suggest ways cultural studies draws on different theoretical discourses such as rhetoric, deconstruction, feminism, or the New Historicism for its problems. All Reading Culture courses should serve as an introduction to cultural studies, moving from theoretical to practical readings of literature and culture. In any case, a common goal would involve examining cultural studies as constituted by plural theories and ends.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "404", "credits": "3 Credits/Maximum of 6", "description": "Ethnicity, gender, class, race with reference to theoretical inquiry into identity, difference, and place in English-language literatures.  (Section subtitles may appear in the Schedule of Courses.)", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "405", "credits": "3 Credits", "description": "Students experience a Shakespeare play as a text to be explicated and as a script to be performed.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "406M", "credits": "3-12 Credits/Maximum of 12", "description": "This advanced Honors Seminar in literature, rhetoric, and cultural studies allows students to explore and research a topic related to recent literary culture. Topics will vary depending on the course instructor but may include the study novels, poetry, drama, theory, film, nonfiction, or rhetoric. Recent topics have included Alfred Hitchcock, contemporary novels, prison narratives, authors and artists, and apocalyptic fiction. Assignments will include extensive primary and secondary reading, participation in class discussion, and a substantial paper or final project. Departmental approval required (for more special information please refer to the notes section in LionPATH).", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Honors", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "407", "credits": "3 Credits", "description": "This course provides an accessible overview of the English language from its earliest beginnings as an insular language to its current place as a global language. One central issue will be the ways in which the external history (culture, political power, geography) of the language has impacted its internal history (spelling, pronunciation, dialect) over time. In the process, we will examine several representative English texts which illustrate significant moments in this long process of language change. Other topics will include the traces of early English vocabulary and structures in modern English, sound changes and pronunciation, English's heavy lexical borrowing from other languages, the politics of language and language use, longstanding debates over what constitutes standard English, the impact of prescriptive language guides, varieties of spoken and written English, the English language and colonialism, English as a global language, and the influence of technologies.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "408M", "credits": "3-12 Credits/Maximum of 12", "description": "This advanced Honors Seminar in literature and literary and cultural history allows students to explore and research a topic related to post-18th century literary culture. Topics will vary depending on the course instructor but may include the study 19th- or 20th-century novels, poetry, drama, theory, film, nonfiction, or rhetoric. Recent topics have included critical medical humanities, historical novels, Victorian underground literature, spiritual biography, and the 1890s. Departmental approval required (for more special information please refer to the notes section in LionPATH).", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Honors", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "409", "credits": "3 Credits", "description": "An overview of the theory and practice of writing for teachers, with emphasis on the writing process.  ENGL 409 Composition Theory and Practice for Teachers (3)(BA) This course meets the Bachelor of Arts degree requirements. ENGL 409 is intended to help teachers improve their writing instruction by immersing them in composition theory and providing them with the opportunity to learn the writing process through personal experience. On completion of the course, participants will be able to: � Articulate and test composition theory in written works � Work through each phase of the writing process in assigned essays � Develop strategies for writing effectively in various genres and styles, including journal writing � Produce written works which demonstrate an awareness of audience � Implement recommendations for effective revisions � Provide responsive feedback to peers' written work � Develop a precis for a model lessonEvaluation: Students will be evaluated on their knowledge and understanding of instructional objectives, demonstrated in written assignments, class discussions and other projects.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "411M", "credits": "3-12 Credits/Maximum of 12", "description": "Advanced Seminars in Creative Writing focus on a particular genre and/or topic. Genres include poetry, fiction, graphic novel, memoir, creative non-fiction, essay, or drama. Topics vary. Students work as apprentice writers, reading the work of published and expert authors, experimenting within the genre, engaging in structured peer review and group workshops, and preparing texts for publication and contest submission. Students discuss a number of issues relevant to the practice of creative writing and the production of literature, such as innovation and circulation, and numerous techniques, including the establishment of voice, creation of character plot development, pacing, and principles of prosody. Students may also consider the responsibilities of literary citizenship and the ethics of artistic representation. The courses offer an intense investigation of creative writing craft. Students develop skills in close, critical reading through the examination of exemplary works of contemporary literature and craft analysis, often reading an entire book per week. They also learn to read analytically and practically in workshop critiques of peer writing. In workshop discussion, students engage in a range of critical and editing tasks from close reading to broad conceptualization; they develop the ability to communicate ideas clearly and extemporaneously, and to negotiate meaning with others. Students experiment with and hone various writing techniques by executing focused exercises and drafting and developing pieces for final submission. They apply critical and analytical reading skills to revise and strengthen their own writing. The final project may include drafts and polished versions of two to three stories or essays, and up to a dozen poems.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Honors", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "412", "credits": "3 Credits/Maximum of 12", "description": "Advanced study of the techniques of fiction writing; regular practice in writing the short story; group discussion of student work.", "prerequisite": "ENGL 212", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "413", "credits": "3 Credits/Maximum of 12", "description": "Advanced study of the techniques of poetic composition; regular practice in writing poetry; group discussion of student work. ENGL 413 Advanced Poetry Writing (3 per semester/maximum of 6)(BA) This course meets the Bachelor of Arts degree requirements. Students enrolled in the Advanced Poetry Workshop will have successfully completed ENGL 213, Introduction to Poetry Writing. In the advanced course, they continue their study of prosody through the close reading of published poems, including entire volumes of poetry by a single author. Students will also study articles and books that discuss various elements of craft. They can expect to prepare written reading responses and formal classroom presentations on the assigned readings. They will also draft approximately one new poem or revision each week, in addition to completing various writing exercises in or outside of class. All students will prepare for and engage in the workshop critiques; participation in these conversations is essential and subject to assessment. The writing, revision, and workshop process prepare the student to compile a portfolio of 8-10 poems, which they will submit as a final project for the course.", "prerequisite": "ENGL 213", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "414", "credits": "3 Credits", "description": "Writing of biography and autobiography, character sketches, \"profiles,\" and literary portraits; analysis and interpretations of source materials.", "prerequisite": "ENGL 214", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "415", "credits": "3 Credits/Maximum of 12", "description": "Advanced study of the principles of nonfiction; substantial practice in writing and submitting magazine articles for publication.", "prerequisite": "ENGL 212", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "416", "credits": "3 Credits/Maximum of 6", "description": "Prepares scientists and writers to gather, interpret, and present scientific information to the layman with clarity and accuracy.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "417", "credits": "3 Credits", "description": "The process of editing from typescript through final proof.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "418", "credits": "3 Credits/Maximum of 6", "description": "Preparing and editing professional papers for subject specialists and for others interested in careers as writers or editors.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "419", "credits": "3 Credits", "description": "Preparing and editing reports and presentations common to business, industry, and government.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "420", "credits": "3 Credits", "description": "Analysis and composition of informative, persuasive, and \"creative\" Web texts, based on rhetorical principles; no prior Web writing experience required.  ENGL 420 Writing for the Web (3)(BA) This course meets the Bachelor of Arts degree requirements. This course, designed for writers and potential writers, will explore the unique opportunities and constraints of writing for the Web. As a writing course, it should appeal to students in the Humanities; however, because of the growing importance of Web texts in fields such as business and the social sciences and given the opportunity to compose/construct a variety of fictional and non-fictional &quot;creative&quot; and informative/persuasive Web texts, this course should be of value to students across the college.In this course, students will survey a wide variety of Web texts--webs, electronic journals and books, learning to analyze these as to their efficacy in light of each text's rhetorical situation. As students learn to compose and construct such texts themselves, rhetorically based principles of audience awareness and persuasive appeal will be emphasized. Rather than focusing on writing html codes and java scripts, this course will build on the rhetorical principles taught in first-year writing courses, teaching students how to apply those principles to more sophisticated, multi-sensory, multi-media hyper textual writing.The course will be taught primarily in a hands-on workshop environment-in a PC computer lab or laptop-equipped classroom. Although no prior Web writing experience is required, some experience with Web navigation and computer word processing will be helpful. Students will be evaluated on the basis of their participation/attendance in the course's workshop environment, written web analyses, and constructed web texts.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "421", "credits": "3 Credits", "description": "Develops skill in writing expository essays, with particular attention to style. Intended for liberal arts majors.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "422", "credits": "3 Credits/Maximum of 6", "description": "Practice and criticism in the composition of the short story and the novel.", "prerequisite": "ENGL 412", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "423", "credits": "3 Credits/Maximum of 6", "description": "Extensive practice in writing poetry; consideration of contemporary poetic forms; selected readings.", "prerequisite": "ENGL 413", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "424", "credits": "3 Credits", "description": "Creative writing workshop focused on the environment and related issues.  ENGL (ENVST) 424 Creative Writing and the Natural World (3) American literature includes a long and rich tradition of writing that focuses on the natural world. From the oral stories of indigenous people to the journals of the first European settlers, many have looked for a way to understand their own place in the world based upon their relationship to the earth and its creatures. While Puritans often discerned the pleasure or wrath of God in the environmental changes they experienced, Transcendentalists like Henry David Thoreau and Ralph Waldo Emerson sought out moments of spiritual enlightenment by immersing themselves in the natural order. More recently, such poets as Galway Kinnell, James Wright, and Robert Bly have attempted to connect with the depths of collective unconsciousness by exploring the natural world, while others, like Mary Oliver, Dan Gerber, Jim Harrison, Gary Snyder and Wendell Berry, have used transcendental thought and melded it with Christian and Buddhist insights. Still others, like Gary Paul Nabhan, Rachel Carson, and Alison Hawthorne Deming have brought science to bear upon the riches that nature, art, and scientific exploration may offer when joined in the pursuit of a deeper understanding of, and relationship with, the natural world. This course will acquaint students with the tradition of American nature writing, as well as contemporary nature writing, in the genres of nonfiction, poetry and fiction. Students will be introduced to issues of style, philosophy, and content, as they produce their own essays, poems, and stories. The course culminates in the production of a portfolio of nature writing. Much of this work will begin in class with specific assignments, which will include field work, and feedback from other students in the class. As a workshop course in creative writing, the emphasis will be upon the production of literary texts that interact with the natural world and upon the revision of those texts.", "prerequisite": "ENGL 50", "other": ["Cross-listed with: ENVST 424"]}, {"department": "ENGL", "number": "425", "credits": "3 Credits/Maximum of 6", "description": "Extensive writing of nonfiction for publication; an introduction to the principles of writing the nonfiction book.", "prerequisite": "ENGL 415", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "426", "credits": "3 Credits/Maximum of 3", "description": "An in-depth study of Chicana/Chicano literature, film, and music from the inception of the Chicano Movement (1965-1975) to the present.  ENGL 426 Chicana and Chicano Cultural Production: Literature, Film, and Music (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. ENGL 426 will constitute an in-depth study of Chicano/a literature, film, and music from the inception of the Chicano movement (1965-1975) to the present. In addition to primary aesthetic texts, students will read historical, political, and theoretical essays designed to situate the Chicano/a cultural texts in historical and political context.The aim of the course is to give students a better understanding of Chicano/a cultural production by situating these works of art against other U. S. artistic traditions and within wider historical and political movements. Authors and artists under consideration in this class will vary, but will likely include Luis Valdez, Tomas Rivera, Estella Portillo Trambley, Oscar Zeta Acosta, Corky Gonzales, Gloria Anzaldua, Norma Alarcon, Cherrie Moraga, Richard Rodriguez, Dagoberto Gilb, Rolando Hinojosa, Alfredo Vea, Charlie Trujillo, Diego Vasquez Jr., Joe Rodriguez, Tomas Almaguer, Jose Esteban Munoz, Manuel Ramos, Lucha Corpi, Rudolfo Anaya, Michael Nave. This class will prepare students for advanced courses in Latin/a literatures as well as other academic courses that engage in the verbal and written analysis of complex texts. Students will be evaluated by means of essays written in and out of class, essay exams, group projects, term-long journals, and class participation. Students should expect to complete a minimum of three written assignments in the course of the term. The course may be used as ENGL major elective credit or as credit towards the ENGL minor and will be offered once a year with 40 seats per offering.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: LTNST 426", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "427", "credits": "3 Credits/Maximum of 9", "description": "An in-depth examination of important themes, writers, and/or historical developments in Jewish Literature of the United States.  ENGL (J ST) 427 Topics in Jewish American Literature (3) This course will provide sustained examination of major themes, texts, and figures in the Jewish American literary tradition. The course will focus on depth rather than breadth in its analysis of the defining aspects of the literature and on what the literature reveals about Jewish American culture and identity. The United States has absorbed large numbers of Jewish immigrants from many parts of the world, holding many different ideas about Jewish practice, and affiliating themselves with many different political, social, and cultural traditions, and moreover Jews have settled and made homes in a wide variety of American communities. Close analysis of literature will therefore provide an opportunity to consider the constitution, origin, and development of Jewish America's wider cultural, political, and social contexts. Materials will consist predominantly of primary texts, including prose fiction and nonfiction, poetry, drama, and film, and the methodology will emphasize the close reading of these texts. The course complements offerings in Jewish Studies, English, and Comparative Literature. Most obviously, the course will offer students of Jewish literature, world literature, and American literature an opportunity for contextualization. It enables students in Jewish Studies to study the rich literature of American Jews, and it adds to courses covering Jewish American history, religion, and culture. The course offers students in English and Comparative Literature a valuable, sustained introduction to an important U.S. and world sub-culture and -literature.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: JST 427"]}, {"department": "ENGL", "number": "428", "credits": "3 Credits/Maximum of 6", "description": "A seminar on the literatures and cultures of Asian America, with attention to forms of geographic, historical, and ethnic diversity.", "other": ["Cross-listed with: AAS 428", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "429", "credits": "3 Credits", "description": "New media literary genres; critical discussion of creative works in digital media.", "other": ["Cross-listed with: CMLIT 429", "Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "430", "credits": "3 Credits", "description": "Studies in the works and the interrelationships of writers such as Emerson, Hawthorne, Poe, Thoreau, Whitman, Melville, and Dickinson. The course will cover Transcendentalism and the authors who contributed to this movement, many of whom lived in Concord, MA. Though the class will feature the works of Emerson, Hawthorne, and Thoreau, it can also branch out to address other authors such as Margaret Fuller, Jones Very, and Elizabeth Peabody. Departing from Concord, the course will explore Walt Whitman and Emily Dickinson, both of whom read and were inspired by Emerson. Finally, the course will include works by Herman Melville, who formed a friendship with Hawthorne prior to writing Moby-Dick. Though literature constitutes the center piece of this course, iterations of the course may bring in other parts of the cultural, social, and political landscape: slavery, abolitionism, Jacksonian Democracy, western settlement, art, science, and technology.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AMST 470", "Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "431", "credits": "3 Credits/Maximum of 6", "description": "A particular genre or historical period in the development of Black American literature. ENGL 431 / AMST 475 Black American Writers (3) (US) A study of a particular genre or historical period in the development of Black American literature. This course will allow faculty and students to focus a semester's study on a particular genre, theme, or problem in African-American literature. The flexibility of the course will allow faculty a forum in which to share current scholarship or to relate issues in African-American literature to larger school-wide themes in a classroom environment. Because of the potential variety of topics and faculty members, specific evaluation methods will be determined by the instructor and specified in the syllabus. The course will be offered once every two years with an expected enrollment of 25 students. The course satisfies the \"area\" requirement in culture for American Studies majors.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AMST 475", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "432", "credits": "3 Credits", "description": "Such writers as Hawthorne, Melville, Stowe, Mark Twain, James, Crane, Chopin, and others.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "433", "credits": "3 Credits", "description": "Such writers as Wharton, Dreiser, Cather, Fitzgerald, Faulkner, Hemingway, Hurston, Wright, and others.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "434", "credits": "3 Credits/Maximum of 99", "description": "Focused study of a particular genre, theme, or problem in American literature. (May be repeated for credit.) ENGL 434 / AMST 472 Topics in American Literature (3) This course will allow faculty and students to focus a semester's study on a particular genre, theme, or problem in American literature. The flexibility of a topics course will allow faculty a forum in which to share current scholarship or to relate issues in American literature to larger school-wide themes in a classroom environment. Because of the potential variety of topics and faculty members, specific evaluation methods will be determined by the instructor and specified in the syllabus. The course will be offered once every two years with an expected enrollment of 25 students. The course satisfies the \"area\"requirement in culture for American Studies majors.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "435", "credits": "3 Credits", "description": "Development of the short story as a recognized art form, with emphasis on major writers.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "436", "credits": "3 Credits", "description": "Study of novels and short fiction written in the United States since World War II, with attention to different movements, traditions, and genres.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "437", "credits": "3 Credits", "description": "American poets such as Bradstreet, Taylor, Poe, Emerson, Whitman, Dickinson, Frost, Eliot, Stevens, Hughes, Brooks, Moore, Williams, Plath, Rich, Lowell.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "438", "credits": "3 Credits", "description": "Development from the colonial period to playwrights such as O'Neill, Wilder, Hellman, Miller, Williams, Albee, Shepard, Norman, Wilson, and others.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "439", "credits": "3 Credits", "description": "Major prose writers such as Franklin, Emerson, Thoreau, Fuller, Henry Adams, Mailer, Baldwin, McCarthy, Dillard, Didion, Angelou, and others.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "440", "credits": "3 Credits", "description": "Focused study of a single genre, topic, or critical approach to selected plays by Shakespeare and contemporaries.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "441", "credits": "3 Credits", "description": "This course surveys the literary career of Geoffrey Chaucer, perhaps the most celebrated English-language poet of the medieval ear. The course primarily examines Chaucer's own writings, with consideration of the several international authors and traditions that informed his own literary productions. Selections may vary, but students will read texts from across Chaucer's career, including from major works like Troilus and Criseyde and The Canterbury Tales. Readings from Chaucer's sources and models may include translated selections from Boethius's Consolation of Philosophy or from Guillaume de Lorris and Jean de Meun's Romance of the Rose, and/or examples from relevant literary genres such as romance, fabliaux, beast fable, sermon, tragedy, and exemplum. Accordingly, students will develop a knowledge and appreciation of how Chaucer shaped (and was shaped by) his continental influences and the ways in which he developed a poetic tradition in English that proved deeply influential for many centuries.", "prerequisite": "ENGL 15", "other": ["International Cultures (IL)"]}, {"department": "ENGL", "number": "442", "credits": "3 Credits", "description": "Study of major works and genres of medieval English literature, exclusive of Chaucer.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "443", "credits": "3 Credits", "description": "Study of different early modern texts and traditions, with attention to poetry, drama, fiction, and nonfiction.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "444", "credits": "3 Credits", "description": "Selected tragedies, comedies, and histories.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "445", "credits": "3 Credits", "description": "Selected plays by Shakespeare's major predecessors and contemporaries: Kyd, Marlowe, Jonson, Webster, Marston, Middleton, and others.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "446", "credits": "3 Credits", "description": "Analysis of principal poems and their background.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "447", "credits": "3 Credits", "description": "Study of different English writers and traditions from the neoclassical age (1660-1776), with attention to poetry, fiction, romance, and drama.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "448", "credits": "3 Credits", "description": "Study of different writers and traditions in the early English novel.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "449M", "credits": "3-12 Credits/Maximum of 12", "description": "This course offers honors students the opportunity to explore in depth a period of early English literature before 1800. Topics will vary from year to year, but may include Beowulf and Anglo-Saxon literature and culture, late medieval authors such as Chaucer, Gower, and Langland, sixteenth-century lyric poets, Shakespeare, Shakespeare and film, Elizabethan dramatists, authorship and book history, early women authors, seventeenth-century writers such as Donne, Herrick, Wroth, and Bacon, writers of the English Revolution, Milton, and eighteenth-century writers such as Pope, Dryden, and Swift. Assignments will include extensive primary and secondary reading, participation in class discussion, and a substantial paper or final project. Departmental approval required (for more special information please refer to the notes section in LionPATH).", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Honors", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "450", "credits": "3 Credits", "description": "Writers of the British Romantic period (roughly 1790 to 1832) often made sweeping claims for the power of poetry and imagination. Percy Bysshe Shelley contended that \"poets are the unacknowledged legislators of the world,\" while John Keats declared that \"beauty is truth, truth beauty.\" Against the background of political revolution in France, the rise of industrialization and empire, and increasing social instability, Romantic writers turned to nature as a source of the self and looked back to childhood as a site of both innocence and ambivalence. Others turned their efforts to the supernatural and the gothic, hoping to inspire what Samuel Taylor Coleridge called \"that willing suspension of disbelief for the moment which constitutes poetic faith.\" This course is designed to provide an introduction to the richness and diversity of Romantic-era literature. It is not intended to be an exhaustive overview of the entire period, but rather an introduction to the best known Romantic ideas' many of which still influence the way we think about art and literature in the present day as well as an invitation to further study and engagement. In that spirit, we will not work from a predetermined definition of \"romanticism,\" but instead will build a collective, working understanding of the concept.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "451", "credits": "3 Credits", "description": "Survey of literary modernism in English and English translation in a variety of genres, including poetry, fiction, and drama.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "452", "credits": "3 Credits", "description": "Poets such as Tennyson, Browning, Arnold, and Hopkins; also prose by writers such as Carlyle, Mill, Ruskin, and Arnold.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "453", "credits": "3 Credits", "description": "Study of texts and traditions in the nineteenth-century English novel.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "454", "credits": "3 Credits", "description": "From Wilde and Shaw to the present season.  ENGL 454 Modern British and Irish Drama (3)(BA) This course meets the Bachelor of Arts degree requirements. ENGL 454 will introduce students to some of the most exciting playwrights and important trends in modern British and Irish drama from the late nineteenth century to the present. The course will examine a number of plays, exploring not only how they work formally, but also how changing cultural and historical contexts helped to shape the plays and British and Irish drama more generally. Authors under consideration will vary from class to class, but may include writers such as Oscar Wilde, George Bernard Shaw, John Synge, Lady Gregory, William Butler Yeats, Sean O'Casey, Samuel Becket, Denis Johnston, Brendan Behan, Brian Friel, Tom Murphy, Martin McDonagh, Noel Coward, John Osborne, T. S. Eliot, Robert Bolt, Harold Pinter, Caryl Churchill, and Tom Stoppard. The course will explore such topics as the role of drama in the Irish Revival, nationalism, and the revolution, the use of myth and folklore in drama, the emergence of realism, the function of Wilde and Shaw's humor in their plays, drama's response to the decline of the British empire, the modernist verse drama, post-modernism in drama, issues of stagecraft and performance, and the political function of such theaters as the Abbey Theatre or the Field Day Company. Students will write at least two papers on particular plays, and can expect to take a mid-term exam and a final exam.The course may be used as English Major elective credit or as credit towards the English minor, and will be offered once a year with 40 seats per offering.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "455", "credits": "3 Credits/Maximum of 99", "description": "Focused study of a particular genre, theme, or problem in British literature. (May be repeated for credit.)  ENGL 455 Topics in British Literature (3)(BA) This course meets the Bachelor of Arts degree requirements. This course will allow faculty and students to focus a semester's study on a particular genre, theme, or problem in British literature. The flexibility of a topics course will allow faculty a forum in which to share current scholarship or to relate issues in British literature to larger School-wide themes in a classroom environment. Offering such focused studies under a British literature umbrella will allow majors to apply these offerings to their upper-level British literature requirement. Because of the potential variety of topics and faculty members, specific evaluation methods will be determined by the instructor and specified in the syllabus.This course will be offered once every two years, with an expected enrollment of 20-25 students.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "456", "credits": "3 Credits", "description": "Study of writers and traditions in British short fiction and novels, 1900-1945.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "457", "credits": "3 Credits", "description": "Readings in British fiction since World War II.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "458", "credits": "3 Credits", "description": "Study of poetry written in English during the twentieth and twenty-first centuries, with attention to different writers, forms, and traditions.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "460", "credits": "3 Credits/Maximum of 3", "description": "An investigation into how writers and the cultures in which they write have represented business and those engaged in it. For many people, literature and business could not have less to do with each other. According to this view, literature escapes from reality to the imaginative, while nothing could be more focused on the real than business and its buying and selling of commodities and services. The problem is that no one told literary writers of this mutual incompatibility. For centuries, writers have peered into the world of business and brought back stories intended to document, inspire, and warn. True, writers have often, and sometimes unthinkingly, condemned business and those who follow it, but they have just as often had genuine insights into its workings. In this course, we will follow the relationship between literature and business over the course of modern history. Although one version of the course would begin with literature that dates back to the invention of capitalism in (more or less) the sixteenth century, our course will begin at the turn of the nineteenth century with the Industrial Revolution in England and the United States and follow the literature of business up to the present. Our aim in reading is not just to understand how writers have represented business and those who pursue it, which, it has to be admitted, has often been with contempt. But, rather, in reading more sympathetic works, to understand the drama of business, why those who pursue it find it so invigorating. Money, of course, is one answer to that question, but it is neither the only nor the most important one. Texts may vary, but they are almost certain to include Charles Dickens's Dombey and Son (1847); Herman Melville's \"Bartleby the Scrivener\" (1853); the \"Economy\" chapter of Henry David Thoreau's Walden (1854); Anthony Trollope's The Way We Live Now (1875); Thorstein Veblen's Theory of the Leisure Class (1899); George Bernard Shaw's Major Barbara (1905); Theodore Dreiser's The Financier (1912); Sinclair Lewis's Babbitt (1922); Edwin Lefevre's Reminiscences of a Stock Operator (1922); James M. Cain's hardboiled masterpiece Mildred Pierce (1941); F. Scott Fitzgerald's unfinished novel The Love of the Last Tycoon (1941); Arthur Miller's Death of a Salesman (1949); Sloan Wilson's The Man in the Gray Flannel Suit (1955); Ayn Rand's Atlas Shrugged (1957); Ken Kesey's Sometimes a Great Notion (1962); Joseph Heller's Something Happened (1974); William Gaddis's J R (1975); David Mamet's Glengarry Glen Ross (1984); Michael Lewis's Liars Poker (1987); and Richard Powers' Gain (1998).", "prerequisite": "ENGL 15"}, {"department": "ENGL", "number": "461", "credits": "3 Credits", "description": "The relationship between oral tradition and literary texts and the double consciousness of African American voice in \"print.\"", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "462", "credits": "3 Credits", "description": "This course examines intersectional identity and its representations of gender, class, race, sexuality, and cultural difference in texts by black American women. The course also identifies analyzes major issues concerning the discovery and development of a black feminist tradition and the ways in which that tradition has engaged issues of racism, sexism, class exploitation, and/or heteronormativity.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: WMNST 462", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "463", "credits": "3 Credits", "description": "The African American literary quest for identity and its adaptation to Euro-American culture and autobiographies.  ENGL 463 African American Autobiography (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. Starting with the slave narratives which initiate the literary quest of African Americans for identity, this upper-division course will examine the trope of writing (the &quot;talking&quot; book) as the (w)rite of passage into the dominant Euro-American culture. The course will identify, describe, and analyze how the major elements of the &quot;quest&quot; found in the slave autobiographies have been adapted as textual strategies by many contemporary African American writers of autobiography, semi-autobiography, and fictional autobiography. Authors under consideration will vary from class to class, but may include writers such as Frederick Douglass, Harriet Jacobs, W. E. B. Du Bois, Ida B. Wells, Richard Wright, Zora Neale Hurston, Maya Angelou, Martin Luther King, Alex Haley, Harriet E. Wilson, James Weldon Johnson, and Ernest Gaines. Topics explored will vary from class to class, but will likely consider slave narratives, the role of autobiography in the fashioning of identity and self, gender issues, genre questions, and the historical development of the genre and its shifting preoccupation from slave times through the early twentieth-century, the pre-Civil Rights era, the Civil Rights Movement, the Black Power Movement, and the present. The course will prepare students for other courses that engage in the verbal and written analysis of complex written texts, and will also prepare students to consider the social and cultural issues involved in the role of race in American history. Students will be evaluated by means of essays written out of class, essay and short answer exams, a term-long reading journal reflecting upon issues of the student's own &quot;autobiography,&quot; an oral class presentation, and class participation. The course may be used as English Major elective credit or as credit towards the English Minor and will be offered once a year, with 40 seats per offering.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AFAM 463", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "464M", "credits": "3-12 Credits/Maximum of 12", "description": "This advanced Honors Seminar in multicultural literature, rhetoric, and cultural studies allows students to explore and research a topic related to race, gender, ethnicity, sexuality, queer theory, post-colonialism, disability, minority literature, women's literature, world rhetorics, or other literatures reflecting the diversity of cultures and perspectives important to the English major. Topics will vary depending on the course instructor. Recent topics have included disability and literature, post-racial America, revolutionary writing, cognitive disability in literature, and early modern women authors. Department approval required (for more special information please refer to the notes section in LionPATH).", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Honors", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "466", "credits": "3 Credits", "description": "This course examines the origins of the African American novel and follows the genre's evolution into the early twentieth century, outlining the relationships among the texts that form the body of African American narrative as well as the relationships of those texts to the constantly shifting cultural and political realities surrounding their writing. From the earliest novels, written during the period of slavery, through the Reconstruction era, the nadir of Black Codes and Jim Crow Supreme Court decisions, and into the Renaissance heralded by Alain Locke and others, course readings encompass a broad range of styles and genres, from early proto-documentary modes, through the realism and naturalism of a later time. The course takes up Robert S. Levine's claim that \"the history of the early African American novel is not fixed or stable\" by mapping the genre's early history and by developing an understanding of the novel as genre according to both early African American authors and later scholars. It addresses the fact that this history continues to be updated and that some texts whether in part or in whole remain lost. Authors covered in the course might include William Wells Brown, Frederick Douglass, Frank J. Webb, Julia C. Collins, Hannah Crafts, Martin Delany, Frances Ellen Watkins Harper, Charles Chesnutt, Pauline Hopkins, Paul Laurence Dunbar, Sutton Griggs, James Weldon Johnson, Oscar Micheaux, Nella Larsen, Jessie Fauset, and others. Scholarly readings accompany primary texts in order to give students a sense of the critical work that has gone into and continues to go on in the study of African American literature. Course topics may include the issue of firsts; the challenges of publication and the attendant realities of early African American print cultures; questions of tradition and influence; and the political, social, religious, and philosophical aims of early African American novels. Readings and discussions also attend to questions of form, specifically regarding intertextuality and generic blurring and hybridity. The study of early African American novels necessarily includes attention to issues of race, identity, nation, diaspora, and the question of authenticity, and each is taken up in turn. Course assignments and discussions engage students in critical work that demands careful attention to both content and context in order that all students might strengthen their close reading capabilities and engage with course figures and materials within their historical milieus.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AFAM 466", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "467", "credits": "3 Credits", "description": "This course examines the African American novel, its forms, and its traditions starting during the Harlem Renaissance. It follows the genre's evolution into the twenty-first century, outlining the relationships among the texts that form the body of African American narrative as well as the relationships of those texts to the constantly shifting cultural and political realities surrounding their writing. From the Renaissance heralded by Alain Locke, through the Civil Rights and Black Power Movements -and their attendant Black Arts Movement- and into the era of the Movement for Black Lives, course readings encompass a broad range of styles and genres, from realism, naturalism, and naturalist primitivism, through the experimental forms, magical realism, and \"postrace aesthetics\" of later times. The course invites students to think critically about the African American novel as a socially and politically engaged form, and to identify and analyze the long tradition of resistance that variously informs its development. Authors covered in the course might include major figures such as Claude McKay, Zora Neale Hurston, Nella Larsen, Wallace Thurman, Richard Wright, Ralph Ellison, Ann Petry, James Baldwin, Ishmael Reed, Earnest Gaines, Alice Walker, Toni Morrison, Toni Cade Bambara, Octavia Butler, Gayle Jones, Samuel Delany, Charles Johnson, John Edgar Wideman, Colson Whitehead, and others. Still, the course gives due attention to lesser known/studied materials from the period, including graphic novels, satire, speculative fiction, performance novels, and various other experimental forms. Course readings and instruction give particular attention to how African American novels of the twentieth and twenty-first centuries variously engage social identity categories, like race, gender, class, and sexuality, and how they engage and resist various literary conventions associated with naturalism, modernism, and postmodernism. The course also traces the development of new thematic and aesthetic interests in a generation of writers whose fiction has been influenced by the explosion of interest in the graphic novel, the popularity of cultural forms such as hip hop, and the ascendancy of the digital age. Scholarly readings accompany primary texts to give students a sense of the critical work that has gone into and continues to go on in the study of African American literature. In this course, students learn how to analyze literature, do close and careful readings of texts, conduct related research, and write persuasively about literary works. Assignments and discussions are designed such that students may engage with course figures and materials within their historical milieus.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AFAM 467", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "468", "credits": "3 Credits", "description": "Meta duEwa Jones argues, \"We cannot afford to continue to treat black poetry and poetics as loose change among the more highly valued paper currency of fiction and nonfiction prose. . . . The myriad aesthetic forms and concomitant political functions of black poetry and poetics should be seriously considered as grounds for broader and more nuanced theoretical and sociocultural claims.\" This course takes as its subject matter these aesthetic forms and political functions of the poetry of black America. It surveys the broad history of African American poetry and poetics, tracing the evolution of formal structures and aesthetics, but also taking a critical view of the reception of African American verse. Whether reading Phillis Wheatley or the contemporary poet Ed Roberson, all the poets included in this course have contended within the writing itself with the racially striated nature of the literary spaces they occupy. Course readings may come from poets including Wheatley, Frances Ellen Watkins Harper, Paul Laurence Dunbar, Alice Dunbar Nelson, Claude McKay, Langston Hughes, Robert Hayden, Melvin Tolson, Gwendolyn Brooks, Amiri Baraka, John Coltrane, Ishmael Reed, Nathaniel Mackey, Rita Dove, Maya Angelou, Audre Lorde, Natasha Tretheway, Sonia Sanchez, Nikki Giovanni, Nikky Finney, Roberson, Claudia Rankine, and others. The course addresses works by many of the key figures of this American literary tradition so that students may develop an understanding of the various contributions and legacies formal, musical, cultural, critical, political of African American poetry from the eighteenth century to today. Scholarly readings accompany primary texts to give students a sense of the critical work that has gone into and continues to go on in the study of African American poetry and poetics. The course surveys early African American poetry through works from the Harlem Renaissance and the Black Arts Movement, and through contemporary movements and formations. Topics will cover a range of thematic and formal issues relevant to individual poets, to major movements and periods, to regions, and to various smaller organizations and collectives. Course assignments, lectures, and discussions engage students in critical work that requires careful attention to form, content, and context such that all students might strengthen their explicatory skills and approach course figures and texts from an informed, analytical perspective.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AFAM 468", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "469", "credits": "3 Credits", "description": "The impact of slavery on the petitions, poetry, slave narratives, autobiographies, and novels of African Americans. ENGL 469 / AFAM 469 Slavery and the Literary Imagination (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. ENGL 469 /AFAM 469 provides an opportunity for undergraduate students to examine African American petitions, poetry, slave narratives, autobiographies, and novels as literary reconstructions of the economics, politics, ethics, and poetics of slavery. Authors under consideration will vary from class to class, but may include writers such as Paul Laurence Dunbar, Phillis Wheatley, F. Harper, James Weldon Johnson, Langston Hughes, Claude McKay, Sterling Brown, Booker T. Washington, Harriet Jacobs, W. W. Brown, Harriet Wilson, Margaret Walker, Arna Bontemps, D. Bradley, S. A. Williams, Toni Morrison, Ishmael Reed, and Charles Johnson. The course will focus on the complex relationship of slavery to the literary imagination of Americans of African descent as they increasingly discovered the limitations and possibilities of reading and writing themselves into freedom, literacy, and wholeness as human beings and American citizens. Topics covered will vary, but will include issues of the legacy of slavery in the west; the political aims and rhetorical conventions of African-American autobiography; the myths and realities of slavery; economic, political, ethical, and aesthetic issues of the representation of slavery; understandings of black consciousness and black culture on the road from slavery to freedom; the rise of African American realism as a response to the legacy of slavery; Black Feminism and issues of slavery; the role of history and memory in the construction of slavery; post-modern configurations of slavery; and the like. This class will prepare students for advanced courses in African American literature, as well as other academic courses that engage in the verbal and written analysis of complex written forms.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AFAM 469", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "ENGL", "number": "470", "credits": "3 Credits", "description": "Application of certain rhetorical principles to problems in composition. Writing exercise. Designed as preparation for the teaching of composition.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "471", "credits": "3 Credits/Maximum of 6", "description": "(Course content may vary by instructor). This class will introduce you to communication theories developed in classical Greece and China. Economic globalization and the increased world travel have brought Americans into direct contact with East Asian peoples and their cultures. At the same time, individuals with an East Asian linguistic and cultural background are making a strong presence in the United States. The urgency to understand East Asian peoples-their cultures, their languages, and their ways of reasoning-is being felt by a majority of Americans. This class will focus on the rhetorical traditions that have grown out of classical Greece and China. We will not only read ancient and modern texts but also watch movies produced in China and the United States to understand their philosophies, literatures, and communication arts. All readings are in English.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "472", "credits": "3 Credits/Maximum of 6", "description": "Investigates models of textual production and reception current within English studies.  (Section subtitles may appear in the Schedule of Courses.)", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "473", "credits": "3 Credits/Maximum of 6", "description": "Practices the criticism of written texts from selected rhetorical perspectives.  (Section subtitles may appear in the Schedule of Courses.)", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "474", "credits": "3 Credits/Maximum of 6", "description": "Examines selected topics in the field of rhetoric and composition.  (Section subtitles may appear in the Schedule of Courses.)", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "475", "credits": "3 Credits", "description": "This course introduces students to the academic field of Comics Studies, that is, the scholarship of comics and graphic novels. The course surveys different methodologies and focuses of comics scholarship, with historical representation of different theorists and critics. In addition to reading widely in comics scholarship, students will also read several comics and graphic novels, for which they will produce their own analyses and criticism. Overall, the course provides a foundation in Comic Studies, with broad reading across primary and secondary texts.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "477", "credits": "3 Credits", "description": "Teaching Children's Literature in light of recent literary pedagogy, the history of childhood, and critical approaches to Children's Literature.  ENGL 477 Teaching Children's Literature (3) This course explores the teaching of Children's Literature. Beginning with students' own interpretations of the children's books we read, we develop critical concepts through which to understand and teach children's literature. The course presumes that books written for children have an intrinsic importance as literary and cultural artifacts and so demand serious consideration. Because this course is offered as an English course, we will concentrate on such things as the formal characteristics of the works we study, the kinds of audiences they seem to solicit, their implied authors, their ideologies, and so forth. The emphasis of the course is on teaching Children's Literature as literature; the course assumes that teaching literature is teaching reading and writing. Students are evaluated according to their participation in class discussion and three required papers-one on the teaching of a particular work of Children's Literature, one on some aspect of the history of childhood, and one that analyzes a children's book.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "478", "credits": "3 Credits", "description": "Grants can do many things. Let's say you are a student who has always dreamed of combining help for food-insecure people with support for the mentally ill homeless. You've written papers about it for classes; you've read lots of research that points to past pitfalls and future innovative possibilities--but now you want to make it real by finding funding for the program you've envisioned. Or maybe you have your sights set on finding an existing non-profit foundation that might serve as a fiscal conduit for grants that will feed the cause you feel passionately about. These scenarios and many others call for finding and winning a grant. Here's what grants can't do: Write themselves. Given that writers of grants do not have one how-to professional manual to rely on, professional grant-seekers must learn to have flexible responses to a variety of writing situations. Every grant proposal is different, as is every population with a problem to solve, and every organization hoping to help with the solution. A successful grant-writer achieves confidence with hands-on practice-confidence earned from mastering the underlying principles of effective research and outreach; feasible and complete content-generation; and the writing of precise, clear, audience-centered prose. English 478 will provide you with the basic knowledge and practice needed to get you on your way to professional confidence. Six Main Learning Goals: * Comprehensive understanding of the grant-writing field * Strategic use of research skills to match program to foundation, need to grant-maker * Beginning mastery of all elements of the basic proposal, including: mission match, objectives that fill a proven need, evaluation strategies that reliably measure outcome, a feasible budget, and proof of capacity and sustainability * Practice of skills most needed in the current economic and political climate, including collaboration, diversified funding, and innovation within an established organization * Practical use of social media and cultivation skills for sustainability of project * Mastery of applied rhetorical style emphasizing clarity and precision", "prerequisite": "ENGL 15"}, {"department": "ENGL", "number": "480", "credits": "3 Credits", "description": "This course explores visual design, non-verbal communication, and software packages used in professional settings to most effectively present written communications.  ENGL 480 Communication Design for Writers (3) ENGL 480 is a course designed to familiarize students with an integrated theory of the roles that visual, verbal, and non-verbal communication play in the production of professional documents using the technologies and software applications most widely used in many organizational settings. To this end, the course will focus on employing non-verbal design elements (color, photographs, graphics, page layout, typography, paper) to develop effective communications tailored to a variety of media, audiences, and purposes using software packages such as Quark XPress, Photoshop, Illustrator, InDesign, Excel. Emphasis will be placed on producing clear, insightful, polished, professional documents, both individually and as part of a team.As part of the course, students can expect to a.) Understand the theories, elements, and principles of visual and non-verbal communication. b.) Appreciate the roles of the audience, purpose, and context in planning and composing documents. c.) Value the role of ethos, pathos, and logos when planning and composing documents. d.) Learn basic skills in a variety of software packages most widely used in the professional world. e.) Design and compose a variety of documents for a variety of audiences that display their writing and design skills. f.) Demonstrate through their documents an understanding of the theories of visual, verbal, and non-verbal communication. g.) Assess their own strengths and weaknesses as writers and designers. h.) Demonstrate the ability to reflect critically on their own and others' discourse practices. i.) Gain an understanding of the role and scope of other professionals and other disciplines in creating professional communications.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "481", "credits": "3 Credits", "description": "Selected topics in the history of literary criticism and theory within the English-language tradition.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "482", "credits": "3 Credits/Maximum of 6", "description": "Contemporary literary theories and their implication for critical practice as applied to British, American, and other English-language literary works.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "482W", "credits": "3 Credits", "description": "Contemporary literary and cultural theories and their implication for critical practice as applies to a variety of texts, e.g. literary, linguistic, visual, multimedia, and/or popular.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "483", "credits": "3 Credits", "description": "Intensive study of one or more recent theoretical approaches as applied to British, American, and other English-language literary works.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "484", "credits": "3 Credits", "description": "Analysis of principal works and their background.", "prerequisite": "ENGL 15"}, {"department": "ENGL", "number": "485", "credits": "3 Credits", "description": "Questions of nationality, identity, gender, race, class, colonialism, and postcolonialism in these literatures.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "486", "credits": "3 Credits", "description": "Studies in the novel, written in English, by writers outside of the United States and Great Britain.  ENGL 486 The World Novel in English (3) (IL) This course examines the nature of the novel as written in English by writers outside of the United States and Great Britain. Such a study necessarily involves both an aesthetic and a political perspective, in that the tradition of the novel in these landscapes so often involves the aesthetic and political suppression of native literary forms and voices. Thus, this course looks at the novel as written both by the colonizer and by the colonized. It considers the politics of the aboriginal author writing in an adopted language, and the ways in which such an adoption bears upon related ethnic and gender matters; it also considers the sorts of artistic and political tensions that emerge in the work of writers who write in what might be called the dominant English tradition. This course also studies the work of what might be called the multi-cultural writer, or the writer perforce extracted from a native, non-English-speaking culture and placed within a larger, colonial, English-speaking culture. Matters of novelistic form, as they are related to ethnic and cultural identity, are also discussed. One intent of the course is to reveal the cultural, racial, and gender diversity that naturally adheres to these particular literary traditions.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "487W", "credits": "3 Credits", "description": "Issues, themes, periods, critical theories, etc., that invite students to use prior English studies, limited to seniors majoring in English.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"department": "ENGL", "number": "488", "credits": "3 Credits", "description": "Study of major traditions and writers in European drama of the early to mid twentieth century.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: CMLIT 488", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "ENGL", "number": "489", "credits": "3 Credits", "description": "A study of selected British women writers.  ENGL (WMNST) 489 British Women Writers (3) This course provides the opportunity to study writing by British Women from a historical perspective and to explore the views these women have of themselves as artists. The course will concentrate on a careful reading of works by a variety of authors. It will address the question of the role gender plays in the selection of literary forms and the development of character, theme, symbols, and rhetorical strategies. It will also explore what particular dimensions British women writers have brought to the British literary tradition.Students will be active learners through keeping reading journals, presenting background reports on the history of women in England, participating in small-group discussions about the texts, and writing 2 shorter essays and one longer research essay for the class. This course focuses on an area of British literature, which more traditionally structured courses tend to obscure. The course will be attractive to students from a variety of programs, including English majors, Women's Studies minors, and Interdisciplinary Humanities students. The course will be offered once every two years. Estimated class size 20.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: WMNST 489", "Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "490", "credits": "3 Credits", "description": "American and British literature written from the perspective of women.  ENGL (WMNST) 490 Women Writers and Their Worlds (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. ENGL/WMNST 490 covers particular aspects of American and British literature written from the perspective of women. The courses stress the diversity of women's authorial worlds, both through time and/or space. The readings and specific focus vary from semester to semester. ENGL/WMNST 490 seeks to make students aware of the extensive body of literature written by women, but, unlike ENGL 194, which is a survey course of women's literature, ENGL/WMNST 490 can be a more intensive course, focusing on selected themes and topics of particular concern to women as reflected in the poetry and fiction of twentieth-century American and British women writers. The class can also be taught in relationship to earlier periods, dealing, for instance, with English women novelists from 1775-1865. In such a class, readings would include fiction by Fanny Burney, Mary Wolistonecraft, Ann Radcliffe, Jane Austen, Mary Shelly, Emily Bronte, Elizabeth Gaskell, and George Eliot. The course would then place each novel in its historical, social, intellectual, and literary context, and explore the various ways in which some of England's best writers transformed their female experience of the world into fiction that extended the range and influenced the development of the novel. Regardless of the particular focus, all sections of the course pose the following questions throughout: Do women use the same myths, archetypes, and literary conventions as male writers? Or do they sometimes have to modify the myths, archetypes, and literary conventions originated by their male precursors in order to adapt them to female experience? Is there such a thing as a distinctively female imagination, with a symbolic language of its own? Is there such a thing as a chain of literary influence linking women writers to each other? What are the strategies for coping with the anxieties of authorship? What is the interaction between gender and genre? In what ways are creativity and procreativity modes of defying prevailing ideologies? Does a woman's psychological development have an effect on the plots a woman novelist conceives? How does women's literature reflect the realities of women's lives? As a course in women's literature, ENGL/WMNST 490 concerns itself with questions of gender. In so far as some of these women writers are black or women of color, it concerns itself with questions of race and ethnicity. In as far as the course looks at women's literature in the context of men's literature, it is concerned with the inter-relationship between dominant (male) and non-dominant (female) culture in the United States as well as in Britain. In so far as the course covers lesbian writers, it is concerned with sexual orientation. Students should expect to complete a minimum of three written assignments in the course, two course papers, and an essay final exam in class. The papers each will ask students to choose a text to analyze in relationship to one of the thematic modules the course has chosen, for instance, to discuss how Virginia Woolf s Mrs. Dalloway analyzes the position of upper-middle class women in a particular moment in history when women had achieved the vote, but were still largely constrained by patriarchal social norms. In addition to written assignments, students will be evaluated on class discussion and general participation. The course not only prepares students for taking up literary and cultural analysis in English classes, but also in any other class that engages in the verbal and written analysis of complex written texts, and in other classes in Women's Studies or in other Penn State departments that address the social, cultural, or ethical issues of gender. The course may be used as English Major elective credit or as credit towards the English Minor; it may also be used in the Women's Studies major and minor. It will be offered once a year with 40 seats per offering.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: WMNST 490", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "ENGL", "number": "491", "credits": "3 Credits", "description": "This culminating course for Professional Writing majors concentrates on reflective analyses, design, and presentation of documents in the development of professional portfolios.", "prerequisite": "ENGL 15", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "492", "credits": "3 Credits", "description": "A study of selected American women writers. ENGL 492 / AMST 476 / WMNST 491 American Women Writers (3) A study of selected women writers, this course provides the opportunity to study writing by American women from an historical perspective and to explore the views these women have of themselves as artists. The course will concentrate on a careful reading of works by a variety of authors. It will raise the question of the role that gender--as well as other differences such as race, class, and ethnicity--play in the selection of literary forms and the development of character, theme, symbol, and rhetorical strategy. It will also explore the dimensions American women have brought to the American literary tradition. The course satisfies the area requirement in culture for American Studies majors and is open to all majors meeting the prerequisite requirements. The course will be offered once every two years and enrollment is 25.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: AMST 476, WMNST 491", "Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "494", "credits": "1-6 Credits/Maximum of 6", "description": "Senior English (ENGL) majors write a thesis arranged with in-charge person and submit it to a faculty committee for appraisal. Departmental approval required (for more special information please refer to the notes section in LionPATH).", "prerequisite": "7th Semester standing", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Honors Senior English (ENGL) majors write a thesis arranged with in-charge person and submit it to a faculty committee for appraisal. Departmental approval required (for more special information please refer to the notes section in LionPATH).", "prerequisite": "7th Semester standing", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "ENGL", "number": "495", "credits": "3-12 Credits/Maximum of 12", "description": "Supervised practicum in fields appropriate to the English major.", "other": ["Bachelor of Arts: Humanities", "Full-Time Equivalent Course"]}, {"department": "ENGL", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "ENGL", "number": "499", "credits": "3-6 Credits/Maximum of 6", "description": "Studies abroad in English language and/or literature.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]