[{"department": "ENGR", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ENGR", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "100", "credits": "1 Credits", "description": "A seminar providing information about different engineering majors, coping with college life, and exploring educational and career goals.  ENGR 100S ENGR 100S Introduction to Engineering (1) (FYS)Engineering 100 is a First-Year Seminar designed as an introduction to the majors available to students in engineering. There are three main goals:1. To introduce students to the areas of study that the college has to offer - this is to assist students in deciding whether engineering is for them. It also helps students decide which major within engineering is for them. This introduction is accomplished through homework exercises and guest speakers - graduates in industry, graduate students, department heads, faculty, and current undergraduates.2. To introduce students to the university in general - what resources are available and what it means to be a student at a university instead of high school. This is accomplished through guest speakers, lectures by your professor, and homework exercises.3. To provide students with an opportunity to interact with faculty members, academic advisers, and other students.The class meets twice a week. All sections meet together once a week to listen to presentations from people representing each major. On the other class day, sections meet separately with their professor for presentations and activities unique to that instructor.", "other": ["First-Year Seminar"]}, {"department": "ENGR", "number": "110", "credits": "3 Credits", "description": "This course focuses on physics content, engineering design principles, and elementary science education pedagogy.", "other": ["Cross-listed with: SCIED 110"]}, {"department": "ENGR", "number": "111", "credits": "1 Credits", "description": "Introduction to theoretical approaches and practical applications of intercultural communications for engineering students.", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "115N", "credits": "3 Credits", "description": "The 20th century was a time of great scientific advancement - advancements that were used both for good and for evil (and for other purposes that lie somewhere in between). Germany and German-speaking scientists played central roles in many of these discoveries. In this course we will take an interdisciplinary approach to discussing key scientific advancements, including the discovery of nuclear fission and the development of the nuclear bomb, the discovery of polymers and the invention of pain medicines such as morphine and oxycodone, learning about the science behind these discoveries alongside the social and historical contexts in which they occurred, and the impact these discoveries had on society. While a majority of the scientific discoveries that we will focus on took place in the first half of the 20th century, we will also discuss the ways in which the long-term consequences of these discoveries are still relevant today, especially as they relate to current issues on sustainability (e.g., the use of plastics) and the ethical considerations that arise more generally when thinking about the relationship between science, technology, engineering and society. This course will count as an interdomain, GH/GN.", "other": ["Cross-listed with: GER 115N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGR", "number": "118", "credits": "3 Credits", "description": "Study of engineering in the context of cultural, historical, societal, political, and environmental considerations to understand the relationship between Chinese culture and engineering projects and policies; brief introduction to the basic engineering principles underlying the engineering projects and their design.  ENGR 118 Impact of Culture on Engineering in China (3) (GS;IL) This summer-session course is delivered in China. Chinese culture, history, society, environment, politics, population, economics, and policies are related to engineering practice, design, manufacturing, processes, engineering education, and transportation. Exposure to Chinese cultural components and how they influence engineering project implementation are presented and demonstrated through site visits and participation in relevant activities. Sites and activities in China are selected to expose students to examples that illustrate the impact of Chinese culture on engineering in an integrated manner. For example, ancient engineering projects, such as the Great Wall, Forbidden City, and Terracotta Warriors, and modern engineering projects, such as the Three Gorges Dam, Hangzhou Bay Bridge, the Shanghai Dongtang Eco-city project, may be selected. In addition to site visits and local cultural and transportation experiences, the course includes guest lectures, documentaries, readings, class discussions, and projects. This course is designed to provide basic understanding of Chinese culture and to relate it to historical and contemporary applications of technology. A program fee is charged for course costs that are not covered by tuition. Students are required to participate in all aspects of the course: scheduled site visits, presentations, lectures, readings, and cultural experiences. An interest in technical applications and not necessarily a technical background is required. However, engineering and technical principles are presented.", "prerequisite": "ENGR 111", "other": ["International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)"]}, {"department": "ENGR", "number": "120N", "credits": "3 Credits", "description": "Design Thinking and 3D Printing in Engineering and Healthcare (ENGR 120N) is an introductory general education interdomain course. The course will introduce basic concepts of design processes, engineering, and medicine. The course will assist students in realizing the power of creativity and imagination as it is applied to the use of emerging technologies to solve design dilemmas at the local, regional, national, and international levels. Students will be encouraged to secure an interdisciplinary and collaborative foundation through an exploration of topics including basic engineering, human anatomy and health, design (proportion, structure, integrity, design, scale, manufacturing, iteration), Design Thinking concepts (empathize, define, create, prototype, and test), problem-solving processes (brainstorming, free thought, think aloud, reverse engineering), 3D production processes, Bioprinting (use of biofilm to create human tissue and organs), Engineering, Medicine, and Microprinting (creating works of art from photos taken from microscope slides). Students will be encouraged to view projects from the User/Patient perspective. Promotion of integrative thinking will be encouraged throughout the coursework with the goal of increasing the incorporation of design, problem-solving, engineering and medicine in the disciplines of study for individual students. Integrative thinking will be assessed through student involvement in online discussions, case studies, class conversations encompassing ethical/legal/financial considerations to design issues, studio time, image production and manipulation, internet file sharing, materials/properties selection, production processes, and interdisciplinary individual and team-based projects encompassing creative expression and science. By the end of the course, students will be furnished with basic knowledge and strategies to evaluate the role of design in the world and to independently act on the information. This course will fulfill 3 credits of the General Education requirements addressing the interdomain fields of Art (GA) and Natural Sciences (GN). No prerequisites are required for the course. This course will serve as an introduction to the basic ideas of design, creativity, imagination and problem-solving to complement development in science disciplines across the university community.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGR", "number": "185", "credits": "1 Credits/Maximum of 4", "description": "This short-term or short-duration internship course allows undergraduate engineering students to be enrolled for credit while working at a professional research, industry, or government agency internship relevant to their major that does not meet the requirements for any other established internship course. Students enrolled in ENGR 185 may earn 1 credit while working fewer than 15 hours per week or fewer than 10 weeks during the semester of enrollment. Credit for this course may not be applied to degree requirements. Students enrolled in ENGR 195B gain real-world experience in a professional setting while learning other needed skills including communication, ethics, and time and project management. Students will complete an End-of-Semester Evaluation (with their workplace adviser) and an End-of-Semester Report at the conclusion of the internship; grading will be PS/FL."}, {"department": "ENGR", "number": "194", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "ENGR", "number": "195", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "195A", "credits": "1 Credits/Maximum of 4", "description": "A supervised work experience in a professionally relevant position in research, industry or government.  ENGR 195A Engineering Internship (1 per semester/maximum of 4) This course provides students the opportunity to apply fundamental skills and academic concepts in a professional laboratory, industry, or government agency setting within the United States. The final grade (SA/UN) will be based on the final report submitted by the student and a mid-term and final evaluation submitted by the employer. This course will be offered fall, spring, and summer semesters, and may be repeated.", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "195I", "credits": "0.5-1 Credits/Maximum of 4", "description": "A supervised work experience in a professionally relevant position in research, industry, government or service sector.  ENGR 195I Engineering International Internship (1 per semester/maximum of 4) (IL) This course provides students the opportunity to apply fundamental skills and academic concepts in a professional laboratory, industry, or government agency setting outside of the United States. The final grade (SA/UN) will be based on the final report submitted by the student and a mid-term and final evaluation submitted by the employer. This course will be offered fall, spring, and summer semesters, and may be repeated.", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "196", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "ENGR", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "ENGR", "number": "197E", "credits": "3 Credits", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain"]}, {"department": "ENGR", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "290", "credits": "0.5 Credits/Maximum of 2.5", "description": "The Millennium Scholars Program prepares undergraduates to enter graduate school. As part of this preparation, each scholar participates in a professional development seminar. Students will be exposed to various professional development topics through lecture, visiting guest speakers and interactive activities. The topics covered include Learning about career development tools; Gain knowledge from peers and professionals in the industry; Learn about summer research and graduate opportunities at other institutions; Learn about Penn State on campus resources; Participate in stress management and self-care exercises; Participate in team building and networking events; Career opportunities for people with graduate degrees. Third- and fourth-year students will be given an opportunity to develop mentoring skills. In addition, students will practice holistic well-being and use their learning to be a productive, empathetic member of their cohort and MSP community."}, {"department": "ENGR", "number": "295", "credits": "1-3 Credits/Maximum of 3", "description": "A supervised work experience where the student is employed in an engineering position in industry or government. (To be offered only for SA/UN grading.)", "prerequisite": "CHEM 110", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "295A", "credits": "1 Credits/Maximum of 1", "description": "ENGR 295A Engineering Cooperative Education (1) This course provides students the opportunity to apply the fundamentals and academic concepts learned in their major classes in a professional laboratory, industry, or government agency setting in the United States. This course is the first in a series that provides progressive semesters of career-related experience in the Cooperative Education Program (defined as two or more work semesters). The final grade (SA/UN) will be based on the end-of-semester report submitted by the student and mid-semester and end-of-semester evaluations submitted by the employer and student. This course will be offered fall, spring, and summer semesters.", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "295I", "credits": "1 Credits/Maximum of 1", "description": "ENGR 295I Engineering International Cooperative Education (1) This course provides students the opportunity to apply the fundamentals and academic concepts learned in their major classes in a professional laboratory, industry, or government agency setting outside of the United States. This course is the first in a series that provides progressive semesters of career-related experience in the Cooperative Education Program (defined as two or more work semesters). The final grade (SA/UN) will be based on the end-of semester report submitted by the student and mid-semester and end-of-semester evaluations submitted by the employer and student. This course will be offered fall, spring, and summer semesters.", "other": ["International Cultures (IL)", "Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "ENGR", "number": "297", "credits": "0.5-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ENGR", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "310", "credits": "3 Credits", "description": "This course develops leadership and entrepreneurial skills using collabora- tive, problem-based projects, with engineering and business students working in teams.  ENGR 310"}, {"department": "ENGR", "number": "312", "credits": "3 Credits", "description": "Three interrelated modules guide students through technical, global/business, and entrepreneurial aspects of sustainable energy.  ENGR 312 Sustainable Energy Entrepreneurship (3) ENGR 312 examines three integrated components of the sustainable energy business: technical adaptability , financial structure , and entrepreneurial. The technical component of the course provides an overview of the concept of energy and sustainable forms of energy, energy auditing process, as well as, the integration between supply, capacity, demand, and usage technology. Technical calculations of the power capacity of sustainable energy systems and the technical limitations, specifications, and feasibility studies of energy systems are also addressed. The business component of the course provides an overview of the market and finance aspect of sustainable energy systems. Students will study the feasibility of sustainable energy systems from a business perspective, as well as perform quantitative cost-benefit analyses that include depreciation of sustainable energy systems and return on investment. Students will also evaluate existing energy business plans. The entrepreneurial component focuses on the skills needed to perform a feasibility study of market opportunities related to sustainable energy, including entrepreneurial risk and sustainability ethics. Government incentives and the impact of policy issues on business decisions for sustainable energy systems will also be addressed. Students will learn how to take a global view in the assessment of market needs and they will gain in-depth knowledge of ways to obtain public and private financing for a prospective venture. A justification of sustainable energy applications, including environmental impact, will also be discussed. The capstone project will link all three components of the course by requiring students to create their own energy business plan for a residential or commercial site of their choice. The energy business plan will focus on the best technical and economic practices in the sustainable energy marketplace.", "prerequisite": "EGEE 102"}, {"department": "ENGR", "number": "320", "credits": "3 Credits", "description": "Measurement and experimental procedures determination of the mechanical properties of engineered materials under deflection, compression, tension, fracture and fatigue conditions.  ENGR 320 Materials Properties Measurement I (3) Materials Laboratory I introduces students to the experimental procedures in determining mechanical properties (elastic modulus, shear modulus, Poisson's ratio, and fracture toughness) of engineered materials. Students gain hands-on experience in strain gage mounting and material properties measurement using strain gages. In conjunction with mathematical modeling software, finite element analysis is used to analyze engineering components subjected to mechanical and thermal loading (static and dynamic). Experiments and lectures are designed to demonstrate the theory and practice of mechanical measurement of material. Students utilize state-of-the-art equipment for experimentation in conjunction with advanced modeling software such as ANSYS to predict and evaluate material behavior under mechanical and thermal loading.", "prerequisite": "EMCH 213"}, {"department": "ENGR", "number": "320Y", "credits": "3 Credits", "description": "ENGR 320Y examines engineering design from a societal perspective by asking the question, \"What are the responsibilities and challenges of designers in considering the needs and welfare of current and future societies, and of specific segments and groups within those societies?\" Students investigate and analyze a diverse range of perspectives on technology and consider and apply those perspectives to actual design projects and case studies.  ENGR 320Y is designed as writing-intensive with the goal of having students practice a variety of writing assignments. Those assignments include short, informal assessments and longer research papers. Also, students will work in collaborative groups on an academically-themed project related to the design intent of this course. Student teams will write proposals for projects that explore the means of environmental improvement. Teams will deliver presentations in class and at related events such as campus Earth Day celebrations.  Beyond the writing-intensive focus, the course has three other stated goals. One is to enhance student understanding by adopting a writing-to-learn approach for course assignments. The second is to help students appreciate and understand the formal design process with a focus on the diversity of the end users of their designs. The third is to have students take responsibility for their design during the process by recognizing the impact of technology on society. Meeting these goals involves readings and critical analyses in the areas of ethics, history, economy, ecology, science, and engineering.", "prerequisite": "ENGL 202A", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"department": "ENGR", "number": "350", "credits": "3 Credits", "description": "Computational Modeling Methods is intended to introduce students to strategies in mathematical modeling of physical phenomena using modern computer simulation software. The course provides theoretical understanding and hands-on experience of the modeling techniques used in current engineering practice and allows students to apply these skills to engineering computational problems. Modeling of engineering processes requires users to have a working knowledge of computer simulation software and modeling techniques such as mesh construction and analysis. This course teaches the principles of mathematical modeling of various physical phenomena and allows students to learn the basic strategies of mathematical modeling and the proper use of computational tools for the analysis of topics involving structural, thermal, and materials engineering.", "prerequisite": "EMCH 213"}, {"department": "ENGR", "number": "390", "credits": "1 Credits", "description": "Millennium Scholars Program (MSP) Third-Year Seminar is a one credit course designed for Third-Year students MSP students. This one credit course is designed to assist scholars in preparing for the graduate school application process. This course will focus on the documents, skills and knowledge needed to apply for graduate school. Additionally, the course will provide resources to help students make decisions about graduate school and opportunities to practice skills like interviewing and presenting research. This section of seminar is unique because only students participating in the Millennium Scholars Program will be enrolled. At the conclusion of the seminar, students should have the foundational elements of a graduate school application completed and a list of ten schools they will apply to in the fall semester. Students will complete a thesis proposal and a timeline for the completing of their undergraduate research thesis. Students will participate in GRE or MCAT preparation according to their goals."}, {"department": "ENGR", "number": "394", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "ENGR", "number": "395", "credits": "1-3 Credits/Maximum of 3", "description": "A supervised work experience where the student is employed in an engineering position in industry or government. (To be offered only for SA/UN grading.)", "prerequisite": "ENGR 295", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "395A", "credits": "1-2 Credits/Maximum of 2", "description": "ENGR 395A Engineering Cooperative Education (1-2) This course provides students the opportunity to apply the fundamentals and academic concepts learned in their major classes in a professional laboratory, industry, or government agency setting in the United States. This course is the second in a series that provides progressive semesters of career-related experience in the Cooperative Education Program. The final grade (SA/UN) will be based on the end-of-semester report submitted by the student and mid-semester and end-of-semester evaluations submitted by the employer and student. This course will be offered fall, spring, and summer semesters.", "prerequisite": "ENGR 295A", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "395I", "credits": "1-2 Credits/Maximum of 2", "description": "ENGR 395I Engineering International Cooperative Education (1-2) This course provides students the opportunity to apply the fundamentals and academic concepts learned in their major classes in a professional laboratory, industry, or government agency setting outside of the United States. This course is the second in a series that provides progressive semesters of career-related experience in the Cooperative Education Program. The final grade (SA/UN) will be based on the end-of-semester report submitted by the student and mid-semester and end-of-semester evaluations submitted by the employer and student. This course will be offered fall, spring, and summer semesters.", "prerequisite": "ENGR 295A", "other": ["International Cultures (IL)", "Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "396", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "ENGR", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "ENGR", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "405", "credits": "3 Credits", "description": "Covers the essential concepts and skills needed to make effective contributions on projects, on time and within budget.  WF ED (ENGR) 405 Project Management for Professionals (3) Professionals in the workplace carry out many different projects every day ranging from somewhat small tasks, e.g.,planning events and designing courses, to big projects, e.g., launching an enterprise wide system. Project Management for Professionals is a practical \"hands-on\" course designed for mid-career adult students and covers the essential concepts and skills needed to make effective contributions and have an impact on the successful accomplishment of projects on time and within budget. Project management principles and techniques are presented with an emphasis on how they are applied to real world workforce development projects. Topics include the project management life cycle and process; techniques for planning, scheduling, budgeting, and controlling project performance; project manager responsibilities and skills; project team development and effectiveness; project communication; and organization structures.", "prerequisite": "4th semester standing. Students with no 4th semester standing need to provide evidence to the instructor of their work experience.", "other": ["Cross-listed with: WFED 405"]}, {"department": "ENGR", "number": "407", "credits": "3 Credits", "description": "Technology innovation coupled with business planning and development.", "prerequisite": "ECON 102"}, {"department": "ENGR", "number": "408", "credits": "3 Credits", "description": "A project-based exploration of theories and principles of engineering leadership applicable to technical careers. This leadership course provides the basic theories, principles, skills, and relevant literature germane to leadership within the engineering discipline in particular. Leadership in an engineering context will be explored. This will range from developing awareness of personal leadership strengths to analysis of corporate mission, vision, values, and strategies. Students will apply these to semester-long team projects. Lectures, assignments, and group projects develop knowledge of the impacts of globalization, different cultural values, traditions, beliefs, and customs to develop leaders ready to impact an international workforce. Students will apply leadership theory to the global engineering industry through the following: - Describe leadership concepts, principles, and theories in the context of global engineering business practices - Demonstrate knowledge of how leadership behaviors impact cross-cultural teams (US) - Analyze their own personal leadership strengths and weaknesses through course projects - Evaluate and critique engineering leadership effectiveness displayed by others through project work and current event analysis - Demonstrate appreciation for life-long learning of leadership and teaming skills Course assignments and projects align with the current nature of a global market and require that students cultivate awareness of social identity such as ethnicity, race, class, religion, gender, physical/mental disability, age, or sexual orientation (US). Students are also evaluated on interpersonal communication through team projects, presentations, and written assignments as they apply to interactions within a culturally diverse team completing a semester-long project (US). Application of learning objectives will occur within a small team environment through the completion of a semester-long project dedicated to developing an engineering leadership solution to a challenging problem. The course will be offered each fall and spring semester.", "prerequisite": "Fifth semester standing or program approval", "other": ["United States Cultures (US)"]}, {"department": "ENGR", "number": "409", "credits": "3 Credits", "description": "Development of leadership skills essential for engineers to guide colleagues or an organization in a productive direction.", "other": ["United States Cultures (US)"]}, {"department": "ENGR", "number": "410", "credits": "3 Credits", "description": "This course provides an applied approach to engineering leadership education. Students will develop a deeper understanding of leading engineering teams through applying coaching techniques designed to foster innovative and creative thinking through a nondirective process. Leader-as-coach theory will be explored and applied to teams in pre-requisite Engineering Leadership courses. The course centers on experiential learning by providing a real-world organizational structure of student teams reporting to their leadercoach on project progress. Students previously completing courses in the Engineering Leadership Minor will be assigned as leadercoaches for students currently completing a pre-requisite course. Leader-coaches will apply coaching techniques to positively impact their teams' progress through a semester-long engineering design project. Coaching through the design process, students in the course will gain experience in motivating and supporting engineers in creative and innovative design solutions. Leader-coaches will spend time critiquing technical solutions and apply coaching skills to support the design thinking process. Students will practice giving feedback to individual students based on observed performance. Upon completion of this course, students will be able to describe coaching skills and their application for effective leadership, recognize appropriate coaching skills for use in various situations, implement coaching techniques to foster creativity and innovation through the design thinking process, prepare clear and informative written performance reviews, conduct effective one-on-one performance reviews focused on individual personal development, and build self-awareness of personal leadership strengths and areas for growth. Course assignments require application of the design process, review of technical concepts, and coaching skills and support personal leadership development.", "prerequisite": "ENGR 408"}, {"department": "ENGR", "number": "411", "credits": "3 Credits", "description": "Three critical entrepreneurship skills are covered for non-business majors: business finance, intellectual property, and marketing.  Untitled Document", "prerequisite": "Three credits in ECON"}, {"department": "ENGR", "number": "415", "credits": "3 Credits", "description": "This course engages students in the processes involved in creating a technology-based product or service. This course will require students to manage, create, build and introduce a product to the market place within a tightly defined time frame. The course will begin with exploring the creative process by factoring out existing products leading to a clearly defined and well researched idea or service. The course will develop to include an overall product design, planning for manufacturing, prototyping, resource allocation, and market identification. Students will be assigned readings, experience guest speakers and engage in activities on topics related to the product development process that includes: project ideation, determining a distinct value proposition and competitive position, technology product design, management, strategic differentiated and integrated marketing techniques, customer identification/sales, sourcing manufacturers domestically and abroad, modeling and prototyping, costing, pricing, assessing start-up costs, calculating cash flow, and intellectual property issues. The product development organization will be examined to include human interactions, reporting guidelines, and financial relationships. Students will be required to maintain a binder that will serve as a measure of progress related to the topics noted. Students will have the opportunity to \"pitch\" their ideas and demonstrate the workings in the form of a competition or be evaluated in a non-competitive setting by a panel of local entrepreneurs, faculty and/or business leaders.", "prerequisite": "ENGR 407"}, {"department": "ENGR", "number": "421", "credits": "4 Credits", "description": "Materials powder characterization, compaction and densification techniques, density measurements, micro structural evaluation, thermal and electrical properties of materials.  ENGR 421 Materials Properties Measurement II (4) Materials property measurement II introduces students to experimental procedures in the determination of thermal properties (heat transfer/conduction and thermal expansion) and electrical properties (resistance and dielectric measurements) of materials through demonstrations and experiments. Lectures provide a theoretical understanding of the characterization techniques and provide information for the design and interpretation of experimental results. This laboratory complements lectures in materials characterization, materials processing and materials design courses allowing students to apply theoretical knowledge to experimental processes. Students gain hands-on knowledge of testing equipment and experience in data acquisition and interpretation. Students gain experience in the processing of material (powder characterization, consolidation, and densification), the analysis of material microstructures and investigations of structure property relationships.", "prerequisite": "ENGR 320"}, {"department": "ENGR", "number": "422", "credits": "3 Credits", "description": "ENGR 422 provides students with the opportunity to develop intercultural engineering collaboration skills. The course focuses on developing leadership competence in cross-cultural teaming through a virtual learning environment. Students will team with students from other countries on completing a project with socially relevant solutions. Students will work virtually with students from other institutions outside the US to complete a project throughout the semester. Students completing this course will: Acquire and apply a theoretical foundation in appropriate engineering design across cultural and international boundaries; Discuss contemporary international engineering development, ethics, and project leadership principles as they relate to intercultural communication in engineering teams; Demonstrate engineering project collaboration and leadership skills in the context of virtual cross-cultural interdisciplinary teams; Assess business and leadership skills displayed by others and critically evaluate current international events and assigned reading material. Students will be evaluated on these learning objectives through a variety of methods such as presentation of a semester long team project, critiques and reflection of relevant literature, papers, and peers reviews. This course is part of the international track within the engineering leadership development minor.", "prerequisite": "ENGR 408", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "422Q", "credits": "3 Credits", "description": "ENGR 422 provides students with the opportunity to develop intercultural engineering collaboration skills. The course focuses on developing leadership competence in cross-cultural teaming through a virtual learning environment. Students will team with students from other countries on completing a project with socially relevant solutions. Students will work virtually with students from other institutions outside the US to complete a project throughout the semester. Students completing this course will: Acquire and apply a theoretical foundation in appropriate engineering design across cultural and international boundaries; Discuss contemporary international engineering development, ethics, and project leadership principles as they relate to intercultural communication in engineering teams; Demonstrate engineering project collaboration and leadership skills in the context of virtual cross-cultural interdisciplinary teams; Assess business and leadership skills displayed by others and critically evaluate current international events and assigned reading material. Students will be evaluated on these learning objectives through a variety of methods such as presentation of a semester long team project, critiques and reflection of relevant literature, papers, and peers reviews. This course is part of the international track within the engineering leadership development minor.", "prerequisite": "ENGR 408", "other": ["International Cultures (IL)"]}, {"department": "ENGR", "number": "425", "credits": "3 Credits", "description": "Via problem-based learning, students define new business ventures to meet current market needs, develop business models, and present to various stakeholders. The goal of New Venture Creation is to better prepare undergraduate students to be leaders in adaptive, globally-minded, technology-savvy organizations. The course is structured so students develop skills that are of high value in any workplace: leadership skills, self-efficacy, creativity and the ability to deal with ambiguity. Upon course completion, students will have a working knowledge of traditional and non-traditional ways for identifying a new product or business opportunity, quantifying the potential, understanding the key competitive factors, researching the audience, and producing a convincing plan for financing and launch. Students who want to augment the skills and knowledge from their major with the ability to develop a new product/service/process, will find New Venture Creation a valuable course. This is a novel problem-based learning (PBL) course, where the learning is student-centered, with faculty acting primarily in the role of facilitators. Active/Experiential learning happens in this course because students develop ownership of their venture concepts and are fully responsible for the genesis of ideas.", "prerequisite": "ECON 102", "other": ["Cross-listed with: IST 425, MGMT 425"]}, {"department": "ENGR", "number": "426", "credits": "3 Credits", "description": "Working with Penn State inventions selected by the Intellectual Property Office, student teams define an optimum commercialization path each technology.  ENGR 426ENGR (MGMT/IST/ENTR) 426 Invention Commercialization (3) The goal of ENGR (MGMT/IST/ENTR) 426 is to have students understand why invention commercialization is complicated and difficult by participating in the process. For example, the inventor rarely has insights into the markets for his/her invention, is often not interested in the details of commercialization, and can be secretive. In addition, the business and financial communities often do not take the time, or have the resources, to understand new technologies and perform complex due diligence. Thus lack of due diligence often leads to rejection of innovation because existing companies often discount new technologies from outside the company as NIH - 'not invented here'. Effective transfer of new invention or innovation to a commercial product requires at least three different functional communities to interface: technical, legal and business. Each uses a different language, comes from different educational and cultural backgrounds, and may have an inherent distrust of the others. These functional barriers are difficult to overcome.This course teaches how these barriers can be broken down as student teams help bridge the perceived chasm between key players in the invention commercialization process. In these teams, students bring the skills and knowledge from their major to develop an invention commercialization recommendation for the Technology Transfer Office and the inventor. For example, business students focus on finance and market opportunity assessment; engineering and IST students focus on design refinements, prototyping support, and (if appropriate) making technology suggestions to the inventor.Upon completing the course, the students will have a working knowledge of different university and corporate technology or invention commercialization processes, important intellectual property management tools for inventions (patents, license agreements, option agreements) source of funding to move inventions toward product development, and delivering top quality presentations which outline the recommended commercialization path. Students who enjoy open-ended projects which involve the interplay of business and invention of who wants to work on interdisciplinary teams with the newest inventions will find this course a valuable course. NOTE: Because the inventions/products are based on Penn State faculty intellectual property, students must sign the Penn State Special Intellectual Property Agreement For Students - For Use When Assigning Intellectual Property to The Pennsylvania State University. The form can be viewed at http://guru.psu.edu/policies/RAG13.htmlThe course will be offered both Spring and Fall semesters with an enrollment of 40 students.", "prerequisite": "ECON 102", "other": ["Cross-listed with: IST 426, MGMT 426"]}, {"department": "ENGR", "number": "450", "credits": "3 Credits", "description": "Engineering design considerations for materials selection, organization of property trends of materials families, materials design strategies and property compatibility.  ENGR 450 Materials Design and Applications (3) ENGR 450 introduces students to the process of materials organization and selection for application needs. Students select materials for applications based on desired properties, materials compatibility, and economic factors and learn how to design materials (composites) to fulfill critical materials requirement of an engineering application. The course facilitates students with the understanding of the engineering design process to make educated decisions on the materials selection and/or design for industry application needs. Students learn to understand trends in property characteristics associated within given families of materials, i.e. metals, ceramics and polymers, and to balance engineering needs and economic considerations with the application design process.", "prerequisite": "ENGR 350"}, {"department": "ENGR", "number": "451", "credits": "3 Credits", "description": "Students develop business models and implementation strategies for social ventures in diverse world regions.  ENGR 451 Social Entrepreneurship (3) Social Entrepreneurship is about pursuing direct action to address a social problem in a manner that leads to a truly sustainable solution. A similar perspective on social entrepreneurship is based on Jean-Baptiste's definition of entrepreneurs as permanent value creators. If the primary objective of value creation is positive social change, then the entrepreneur can be categorized as a social entrepreneur. Sustainability and scalability of the venture to create social change on a larger scale is essential. Metaphorically, while conventional entrepreneurs might pursue the creation of multi-million dollar enterprises, social entrepreneurs strive to create multi-million smile enterprises, while understanding that their ability to expand their social returns bears a dynamic interdependence with their economic bottom line. The mission of the venture must be strongly aligned with the measured outcomes, and this emphasis on measuring social and economic impact is crucial to the efficacy and success of social enterprises.The theory and praxis of social entrepreneurship is constantly evolving within the complex framework of political, economic and social changes occurring at the global, national and local levels in the US and other countries. Students study the dynamics of social challenges, approaches to address them, and the conceptual framework of social innovation and social entrepreneurship from theoretical and practical perspectives. Students explore technology solutions to addressing global social problems with a systems thinking approach. Case studies of successful and failed social ventures from diverse world regions and fields like healthcare, energy, food and agriculture, education, income generation, and access to capital are employed. There is an emphasis on the opportunities and challenges to multi-sectoral collaboration to address social challenges.Students learn how to develop appropriate business models and implementation strategies for a \"sustainable\" social venture. Sustainability, in this regards, refers to ventures that are technologically appropriate, environmentally benign, socially acceptable and economically sustainable. There is a specific emphasis on understanding the customers and their context and economic sustainability of the ventures. The course draws heavily from cases to understand the diverse business structures and execution strategies used by social entrepreneurs and the varied challenges faced by them. Students work in multidisciplinary cross-functional teams to develop a business/implementation model for a social venture in diverse world regions. These are real ventures that are connected to other Humanitarian Engineering and Social Entrepreneurship (HESE) course offerings.", "prerequisite": "Fifth semester standing"}, {"department": "ENGR", "number": "455", "credits": "3 Credits", "description": "This post-fieldwork course focuses on reflection on ethical issues and grassroots diplomacy challenges, and workshops on research dissemination.  ENGR 455 Humanitarian Engineering and Social Entrepreneurship Reflection and Research Dissemination (3) The HESE Reflection and Research Dissemination course provides students an opportunity to reflect and build upon their experiences following the EDSGN 454 class involving travel to the partnering community to advance their HESE venture. There are three intertwined themes. One theme explores the ethical intricacies of conducting research and advancing entrepreneurial ventures in developing communities. The grassroots diplomacy theme delves into the complicated and delicate challenges of working in developing communities in a harmonious and effective manner. The research dissemination theme provides students with just-in-time information and skill-sets necessary for developing their research manuscripts into refereed publications. Post-travel reflection on ethical issues: This theme explores the ethical intricacies of conducting research and advancing entrepreneurial ventures in the context of developing communities. The ethics-related discussions help students reflect on their experience and develop a mindset where they want to make better ethical decisions because they are emotionally engaged and can effectively assess the implications of their actions. Grassroots Diplomacy: During their field experience, HESE students interact with diverse parties including local communities, non-governmental organizations, governmental and UN agencies, religious organizations, political groups, bureaucrats, local industry, US corporations, tourists, etc. Students observe and experience ego and community tensions and dynamics. They might get asked for grease payments or be propositioned for dowry. They might experience conflict or observe other groups, or their own group, compromise the core concept of self-determination. Workshops in the grassroots diplomacy theme delve into the complicated and delicate challenges of working in developing communities in a harmonious and effective manner to catalyze social change with their technology-based ventures. Research Dissemination: HESE students are engaged in an IRB-approved research study related to their venture, for which they gather data during the summer field experience. This workshop series provides students with just-in-time information and skill-sets necessary for developing their research manuscripts. The workshops lower the barriers to the scholarly dissemination of their work. Sharing designs, business/implementation strategies, and lessons learned is extremely important for the praxis of HESE worldwide. For examples, published designs for low-cost greenhouse can help people in many world regions. A paper on the non-technical challenges to the growth of the small-scale wind power industry in Kenya served as a starting point for a windmill venture.", "prerequisite": "EDSGN 454"}, {"department": "ENGR", "number": "460", "credits": "0.5 Credits", "description": "This course prepares students for the responsibilities involved in serving as Teaching Interns in the College of Engineering. Topics addressed in the course include: Individual differences and implication for learning, preparing for and conducting office hours, grading and assessment, instructional design, effective teaching practices, and faculty careers. Findings from research on how people learn and strategies for increasing student engagement are integrated into the course discussions. Issues related to academic integrity and ethical aspects of teaching are addressed as they evolve from in-class discussions."}, {"department": "ENGR", "number": "467Q", "credits": "3 Credits", "description": "This course explores and critically analyzes the growing influence and impact of robots and automation on society. In particular, the course introduces students to the ever widening role that intelligent robots are playing and will come to play in our workplaces, on our battlefields, and in our homes. Emphasis will be placed on understanding and critically analyzing how the technical, computational, and systems role of the machine effect the behavior and values of individuals and segments of society. The course is not technical in its treatment of robots and robotics, rather the focus is on critically investigating how the development of robotic technologies have impacted society in the past, present, and future. This is an honors course.", "prerequisite": "Fifth Semester standing", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENGR", "number": "475", "credits": "1 Credits", "description": "Seminar overviewing the systems engineerng approach as applied to practical space systems.  ENGR 475 Space Systems Engineering Seminar (1) As a requirement for the Space Systems Engineering (SPSYS) Certificate, this course is offered to students in the Certificate and others interested in Space Systems and more broadly in systems engineering. The course exposes students to the systems engineering approach as applied to practical space systems. The goal of this course is to prepare the student to understand and implement the systems approach to designing, building, testing, and flying space systems. The course begins with a series of lectures and discussions on the systems approach to engineering and how it applies to space systems in particular. Students then explore past, present, and future space systems and report on the use of systems principles in their design, fabrication, test, and flight operations-for both successful and unsuccessful space systems.", "prerequisite": "Fifth semester standing or higher"}, {"department": "ENGR", "number": "486", "credits": "2 Credits", "description": "Business principles, leadership and management strategies, accounting fundamentals, engineering and business ethics, creativity, and personal character as a formula for success.  ENGR 486 Business Opportunities in Engineering (2) This course focuses on business principles that will help Engineering students transition from academia to the business world. Engineers can be highly successful and climb the corporate ladder or transition to entrepreneurship. Awareness of what is needed to succeed in business is the key to success. This course opens the horizon to new ideas, business opportunities, and profitability. Fundamental aspects of accounting including budgeting, cash flow, profit-loss statements, job cost ledgers, overhead and fringe computation are examined. Creativity, critical thinking methods, and ethics as applied to engineering and business are studied in conjunction with case studies. Business plan structure and content are analyzed along with case histories of successful companies. Students will learn how to articulate a business viewpoint, create a mission or vision statement, and present a creative idea clearly and concisely using an \"elevator ride\" or \"billboard\" approach via essays, proposals, and business plan preparation and presentation. Students will learn leadership and management strategies that will be applicable immediately.", "prerequisite": "Fifth semester standing or higher. This course is not open to Business students."}, {"department": "ENGR", "number": "486H", "credits": "2 Credits/Maximum of 2", "description": "Business principles, leadership and management strategies, accounting fundamentals, engineering and business ethics, creativity, and personal character as a formula for success.", "other": ["Honors"]}, {"department": "ENGR", "number": "487", "credits": "1 Credits", "description": "Essential elements, development, and presentation of the Business Plan from both an engineering and business point of view.  ENGR 487 Business Opportunities in Engineering: The Business Plan (1) This course focuses on business opportunities in engineering. Students will learn about the essential elements of the Business Plan and the value of, and methods for, developing and presenting a Business Plan to start a business. Topics include The Business, Marketing, Financials, Supporting Material, Writing and Presentation Tips and Practice, and Case Studies. Aspects of creativity, winning business plans, strategies, strengths, competition, litigation, insurance, marketing, distribution, sales, and funding will also be discussed. This course complements Business Opportunities in Engineering that must be taken as a prerequisite or in conjunction with this course."}, {"department": "ENGR", "number": "490W", "credits": "1 Credits", "description": "Analysis of environmental impacts on a design, designing products for the global environment and discussion on engineering ethics and professionalism.  ENGR 490W Senior Design I (1) Senior design I provides students with experience in solving engineering problems independently and/or working in groups on an open-ended design problems. Students refine skills in information gathering, analysis of market and technical considerations, critical thinking of project/design scope and effective communication of project/design objectives. This course builds on previous knowledge and applies it to a global consideration of design criteria to a specific projects provided by relevant faculty. The course is the first installment of a senior capstone program in which students start to understand the global aspects of the engineering design process with respect to individual/group projects. Students gain perspective on project selection and research expectations from faculty and gather the relevant technical knowledge required to initiate the project. Projects are appropriately scoped for undergraduate research and are faculty initiated sponsored by regionally based industry (similar to The Learning Factory Experience at UP). Faculty provides research opportunities and external industry collaborations to students for selection based on common interest.", "other": ["Writing Across the Curriculum"]}, {"department": "ENGR", "number": "491W", "credits": "3 Credits", "description": "Capstone of research projects from conception to prototype through industry sponsored collaboration on common technical interests between faculty and student.  ENGR 491W Senior Design II (3) Senior design I provides students with experience in solving engineering problems independently and/or working in groups on an open-ended design problems. Students refine skills in information gathering, analysis of market and technical considerations, critical thinking of project/design scope and effective communication of project/design objectives. This course builds on previous knowledge and applies it to a global consideration of design criteria to a specific projects provided by relevant faculty. The course is the first installment of a senior capstone program in which students start to understand the global aspects of the engineering design process with respect to individual/group projects. Students gain perspective on project selection and research expectations from faculty and gather the relevant technical knowledge required to initiate the project. Projects are appropriately scoped for undergraduate research and are faculty initiated sponsored by regionally based industry (similar to The Learning Factory Experience at UP). Faculty provides research opportunities and external industry collaborations to students for selection based on common interest.", "prerequisite": "ENGR 490W", "other": ["Writing Across the Curriculum"]}, {"department": "ENGR", "number": "493", "credits": "1 Credits", "description": "Approved individual project or internship for students to practice the leadership skills developed in the Engineering Leadership Development Minor."}, {"department": "ENGR", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "ENGR", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "ENGR", "number": "495", "credits": "1-3 Credits/Maximum of 3", "description": "A supervised work experience where the student is employed in an engineering position in industry or government. (To be offered only for SA/Un grading.)", "prerequisite": "ENGR 395", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "495A", "credits": "1-3 Credits/Maximum of 3", "description": "ENGR 495A Engineering Cooperative Education (1-3 per semester/maximum of 3) This course provides students the opportunity to apply the fundamentals and academic concepts learned in their major classes in a professional laboratory, industry, or government agency setting in the United States. This course is the third in a series that provides progressive semesters of career-related experience in the Cooperative Education Program. The final grade (SA/UN) will be based on the end-of-semester report submitted by the student and mid-semester and end-of-semester evaluations submitted by the employer and student. This course will be offered fall, spring, and summer semesters.", "prerequisite": "ENGR 395A", "other": ["Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "495I", "credits": "1-3 Credits/Maximum of 3", "description": "ENGR 495I Engineering International Cooperative Education (1-3 per semester/maximum of 3) This course provides students the opportunity to apply the fundamentals and academic concepts learned in their major classes in a professional laboratory, industry, or government agency setting outside of the United States. This course is the third in a series that provides progressive semesters of career-related experience in the Cooperative Education Program. The final grade (SA/UN) will be based on the end-of-semester report submitted by the student and mid-semester and end-of semester evaluations submitted by the employer and student. This course will be offered fall, spring, and summer semesters.", "prerequisite": "ENGR 395A", "other": ["International Cultures (IL)", "Full-Time Equivalent Course"]}, {"department": "ENGR", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "ENGR", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ENGR", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]