[{"department": "ENT", "number": "202N", "credits": "3 Credits", "description": "An introduction to the diversity of insects and the ways in which they interact with humans and impact our world. ENT 202N is a Science course that will use an interdisciplinary approach to look at the biology and the interplay between nature and society. Major themes of the course will be illustrated by focusing on the world of Insects and the relationships between society and Insects. Emphasis will be placed on critical analysis of both the costs and the benefits of human activities that impact natural systems. Course Learning Goals : 1. Discuss, describe, and give examples of relevant ecological and evolutionary processes and / or phenomena. 2. Apply content knowledge and understanding in novel contexts and situations. 3. Recognize the implications of the two-way dynamic between human activities and insects and how these dynamics differ in different parts of the world. 4. Make predictions associated with likely impacts of human activities on natural systems, ecosystem services, and insect and human populations. 5. Conduct research of relevant literature and utilize empirical evidence to support claims made in a popular press news story about insects. 6. Discuss, describe, and give examples of the two-way relationship between social issues and scientific discovery. 7. Communicate scientific knowledge to a diverse audience.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENT", "number": "216N", "credits": "3 Credits", "description": "This interdomain, general education course examines the major plagues of human history from both a scientific and societal lens. The course will be co-taught by instructors with biology and political science backgrounds who will help the students to integrate across those disciplines. Each week during a single lecture, students will learn the etiology, mode of transmission and treatment/control measures of a different disease. In parallel, students will also read popular press articles on how these diseases had particular cultural, economic or political impacts. These readings, in conjunction with guide questions, will prepare students for a weekly discussion during the second lecture run by both instructors. During the course, students will develop their ability to think critically about diseases and society and demonstrate this skill by designing a novel response to an emerging pathogen in a particular cultural context. This course will develop student communication skills, both oral and written.", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "ENT", "number": "222N", "credits": "3 Credits", "description": "Among more than 1,000,000 known insect species, honey bees are truly unique. No other insect has been harnessed so effectively to benefit humankind: honey bees provide critical pollination services for agricultural crops, and the wax and honey they produce are valuable commodities. Furthermore, their fascinating social life-style has intrigued individuals from hobby beekeepers to scientists studying complex questions about the evolution of sociality. More recently, documented declines in populations of honey bees and wild bees have stimulated interest in many communities, including policymakers, in improving health outcomes for bees. This course will provide students with a strong understanding of (1) honey bee behavior (particularly their complex and sophisticated social systems), biology, and health, (2) the important contributions honey bees and their pollination services make to maintaining natural ecosystems and increasing productivity of many of our key agricultural crops; and (3) the global history of human interactions with honey bees, including how people from many cultures have managed bees to provide honey, wax, and pollination services (4) the social and political context of addressing bee health issues. The course material will be presented in a series of interactive lectures, videos, and discussions, and also include a field trip to the Pollinator Gardens at the Arboretum at Penn State, a field trip to one of the Penn State apiaries, tracking individual honey bees in an observation hive, and dissections of samples in a laboratory exercise.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "ENT", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ENT", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ENT", "number": "313", "credits": "2 Credits/Maximum of 2", "description": "This course is an introduction to entomology addressing issues of insect diversity, morphology and physiology, and identification of the most common groups of adult and immature insects. This course will highlight the beneficial and detrimental roles insects in human society along with responsible methods of pest management. Other topics such as insects as vectors of disease and the ecological and agricultural impact of exotic insect species introduction and climate change will be discussed.", "prerequisite": "3 credits from AGECO; AGRO; ANSC; ANTH; BIOL; BISC; CHEM; ENT; ERM; FOR; FRNSC; HORT"}, {"department": "ENT", "number": "314", "credits": "1 Credits", "description": "Diagnosis and management of insect pests on shrubs and trees in the landscape or production nursery.", "prerequisite": "ENT  313"}, {"department": "ENT", "number": "316", "credits": "1 Credits", "description": "Laboratory-based approach to identification and management of insect pests of agronomic crops.", "prerequisite": "ENT  313"}, {"department": "ENT", "number": "317", "credits": "3 Credits", "description": "This course will introduce students to a thorough understanding of insects and their relatives, IPM, and control strategies. The course will provide the students the opportunity to review EPA registered turfgrass insecticides and respective Material Safety Data Sheets, the effects of turfgrass insecticides on nontarget organisms, and the Food Quality Protection Act and how this legislation has altered public perception of insecticides. Students will be provided with a fundamental understanding of the ecology, ethology, life history and development of IPM plans for the key surface and subsurface pests of cool- and warm-season turfgrass. Students will be introduced to a wide array of commercial, educational and government web sites to strengthen their understanding of turfgrass entomology. Students also will be encouraged to develop a web based notebook which they can utilize upon completion of the course. Students will be invited to share their experiences with pest problems and methods they deployed to manage turfgrass insect species in the turfgrass environment. Students will be evaluated by the use of class assignments, quizzes, two hour exams and a final exam, refereed journal reading assignment, and an IPM class project."}, {"department": "ENT", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "ENT", "number": "402W", "credits": "3 Credits/Maximum of 3", "description": "An introduction to animal parasitology. Emphasis placed on host/parasite interactions, parasites of zoonotic importance, control programs and taxonomy.  VB SC 402W Biology of Animal Parasites (3) This course provides students an opportunity to obtain an introduction to the field of animal parasitology. Material presented emphasizes life cycle patterns of animal parasites, host-parasite interactions and pathology, disease patterns and zoonotic potential of parasites to human disease, economic importance of parasitic diseases, taxonomy and parasite control programs. Information presented in this course will be useful to students interested in pursuing a career in veterinary medicine or careers dealing with animal care and management. Evaluation of student performance is achieved by 6 quizzes, three examinations and 3 writing assignments. The course is offered each spring semester with an enrollment of 15 to 25 students.", "prerequisite": "BIOL 110", "other": ["Cross-listed with: VBSC 402W", "Writing Across the Curriculum"]}, {"department": "ENT", "number": "410", "credits": "3 Credits", "description": "Integrated physiology and anatomy of insects; emphasis on unique adaptations, genetic regulation of development, insects as model systems, environmental physiology.", "prerequisite": "BIOL 110"}, {"department": "ENT", "number": "419W", "credits": "3 Credits", "description": "This interdisciplinary course explores the basic science of pesticides from biology, chemistry, and ecology perspectives. Students will learn the basic science of pesticides and their impacts on the environment. The first class meeting each week will be given in lecture format. Lectures will cover topics including an introduction to pesticides and integrated pest management (IPM), pesticide exposure and evaluation of toxicity, chemical classification of pesticides and their modes of action, toxicodynamics, pesticide residue, pesticide resistance, the major classes of synthetic pesticides and biopesticides, genetic engineering of pest resistant crops, environmental toxicology and pesticide regulation. The second class meeting each week will be an active learning paper discussion designed to develop their discussion and critical thinking abilities. Students will read classic and/or current literature papers relevant to that week's lecture. Starting from the first week. students will begin work on their class project by choosing their topic of interest associated with pesticides (due on the third week), writing a literature review paper (with clear guidance step by step), and presenting their review in class at the end of the semester (last 2 weeks or more time if enrolled student number is larger than 12), design to help students develop their oral and written communication skills.", "prerequisite": "BIOL 110", "other": ["Writing Across the Curriculum"]}, {"department": "ENT", "number": "420", "credits": "3 Credits", "description": "Principles of population regulation, demographic analysis, modeling of dynamic processes are discussed; laboratories involve the exploration of population growth models.", "prerequisite": "BIOL 110"}, {"department": "ENT", "number": "424", "credits": "3 Credits", "description": "This course provides students an understanding of insect sensory systems contributing to behaviors performed for survival and reproduction.", "prerequisite": "BIOL 110"}, {"department": "ENT", "number": "425", "credits": "3 Credits/Maximum of 3", "description": "Collection and identification of insects and other arthropods in freshwater ecosystems; field study of habitats."}, {"department": "ENT", "number": "432", "credits": "4 Credits", "description": "In this course students learn insect taxonomy, evolutionary history, collection and preservation techniques, morphology, fossils, and natural history.  ENT 432 Insect Biodiversity and Evolution (4) In this course students learn insect taxonomy, evolutionary history, collection and preservation techniques, morphology, fossils, and natural history. Lab work focuses on adult forms, especially of insects found in Pennsylvania. Students learn how to handle specimens, use diagnostic keys, and identify insects by sight. Collecting techniques will be honed during field trips. Upon completion of this course students should be able to: (1) teach others how to collect, preserve, and transport insect specimens, (2) name and sight-identify all insect orders and several common local families, (3) label a generalized insect diagram with external anatomy terms, (4) draw a phylogenetic tree of relationships between insect orders, (5) teach others how to read a phylogenetic tree, what kinds of data are used to estimate trees, how those data are analyzed, and what it means to be monophyletic, (6) describe key innovations and life history strategies of major insect lineages, (7) solve taxonomic problems and describe how species and other taxa are named and described, i.e., understand the fundamentals of taxonomic practice, (8) name and briefly describe the latest developments in insect biodiversity research, (9) describe how hexapods inform us about biodiversity and influence our conservation decisions.", "prerequisite": "ENT  313"}, {"department": "ENT", "number": "440", "credits": "3 Credits", "description": "This course is an introduction to and survey of the major areas of plant-insect interactions. This course explores how plant traits facilitate or deter insect behavior and development, chemical and structural counter-adaption and co-evolution, and how insects can benefit or adversely affect plant growth and survival. We will consider how plant-insect interactions influence insect population dynamics and plant community ecology. We will also investigate the effect of environmental quality on plant-insect interactions. Undergraduate and graduate students who complete the course will also be introduced to new tools and approaches in studying plant-insect interactions at the molecular level utilizing transcriptome data. Undergraduate students who complete the course will have a firm grounding in these areas. They will be prepared for other upper-division or graduate courses in plant biology and entomology. In addition, these students will gain enough knowledge in this area to be able to read and understand primary literature. Upon completion of this course, students will: (1) Demonstrate knowledge and understanding of plant morphology and chemistry as they relate to plant-insect interactions, including plant biochemistry and insect perception semiochemicals, plant protective phytohormone cascades, and plant-induced resistance. (2) Demonstrate intermediate knowledge and understanding of insect morphology, physiology, and behavior as it pertains to plant-insect interactions, including insect diversity, specialization, physiological adaptations, and protection against plant-induced defenses. (3) Demonstrate knowledge and understanding of interactions between plants, insects, microbial pathogens, parasites, and endophytes. (4) Recognize key evolutionary adaptations of plants and insects in co-evolutionary relationships. (5) Demonstrate knowledge and understanding of biotic and abiotic factors affecting plant-insect interactions, herbivore activity as it pertains to the recycling of nutrients in ecosystems, and how small and large scale geographic variability can affect herbivore diversity.", "prerequisite": "BIOL 110"}, {"department": "ENT", "number": "450", "credits": "3 Credits/Maximum of 3", "description": "Transmission of human and animal pathogens by insects, mites and ticks, including emergent pathogens, envenomization, and forensic entomology. This course presents principles of transmission of human and animal pathogens  by insects, mites and ticks. Non-transmission based aspects of medically important arthropods such as envenomization, forensic entomology and genomics will be discussed also. Basic arthropod biology with special attention to biological properties of vectors and their interactions with pathogens will be presented. We will cover basic components of arbopathogen disease cycles and principles of pathogen transmission dynamics. The major groups of arthropod--borne pathogens and vectors will be discussed. Special topics will include  emergent pathogens, vector genetics, traditional and modern disease control strategies and venomous arthropods.", "prerequisite": "ENT 313"}, {"department": "ENT", "number": "457", "credits": "3 Credits", "description": "Integrated study of pest complexes and their management, emphasizing ecological principles drawing on examples from a range of agricultural, forestry and urban systems. This course is designed for sixth, seventh, and eighth semester students and graduate students. AGECO 457 / ENT 457 Principles of Integrated Pest Management (3) The goal of this course is to introduce upper level undergraduates and graduate students to the principles and practices of integrated pest management (IPM). This course addresses IPM issues concerning insects, plant diseases, and weeds in agriculture, natural systems and urban environments. Rooted in ecology, IPM also addresses the influence of human social, economic and regulatory systems in pest management. Emphasis is placed on the basic tactics and tools of IPM including biological, cultural, legal, mechanical and chemical controls, host plant resistance, pest monitoring and decision making. The overarching goals of environmental protection, economic viability and social welfare are considered throughout the course. In addition, students will learn about IPM program implementation both domestically and internationally, including pest population modeling and the use of internet resources to inform decision makers. Several projects will provide real-world examples. These may include field trips and a semester-long project where students research and solve an actual pest management problem.", "prerequisite": "PPEM 405", "other": ["Cross-listed with: AGECO 457"]}, {"department": "ENT", "number": "484", "credits": "3 Credits", "description": "Insects are one of the most ecologically successful and diverse taxonomic groups on the planet, and their success is attributed to the amazing range and complexity of the behaviors they exhibit. This course provides an introduction to fundamental concepts and processes in the study of animal behavior, with an emphasis on insect examples, insect diversity and a theoretical and empirical overview of insect behavior. The course is structured around four complementary categories to study behavior based on their development, adaptive value, function, and evolution. Students will learn how scientists study insect behavior, why insects behave the way they do, what functions these behaviors serve, and how behavior is shaped by the evolutionary forces of natural and sexual selection.", "prerequisite": "BIOL 110"}, {"department": "ENT", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ENT", "number": "496H", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"department": "ENT", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ENT", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Foreign travel, specific locations and activities will vary by instructor", "other": ["International Cultures (IL)"]}]