[{"department": "ENVE", "number": "401", "credits": "1 Credits", "description": "Regulations, management practices, hazard identification, exposure assessment, monitoring, employee protection, and program management for occupational safety and health.  ENVE 401", "prerequisite": "CHEM 301"}, {"department": "ENVE", "number": "411", "credits": "3 Credits", "description": "Water supply, wastewater characteristics, design of unit processes for water and wastewater treatment, sludge processing, and related new technologies.  ENVE 411 Water Supply and Pollution Control (3) Providing safe drinking water to the public and decontamination of wastewater before discharge are the two main functions of municipal water system. Properly designing and operating municipal water and wastewater systems allows safe and sustainable use of this limited resource. This course introduces students to design concepts used in water and wastewater treatment processes. Concepts will be categorized into physical, chemical, and biological processes, and presented through a series of lectures, readings, and problem solving. Subjects covered include: water and wastewater characteristics and flows; unit processes for drinking water treatments, including coagulation, flocculation, sedimentation, water softening, filtration, and disinfection; and unit processes for wastewater treatments, including preliminary headwork, primary sedimentation, secondary treatment, tertiary nutrient removal, final clarifier, and residual digestion and management. After completion of this course, students should have the basic knowledge necessary to select and design water and wastewater treatment processes.", "prerequisite": "C E  370 or graduate standing"}, {"department": "ENVE", "number": "415", "credits": "3 Credits", "description": "Watershed response to rainfall events; hydrologic systems; ground water flow. ENVE 415 Hydrology (3) Hydrology is the study of water's movement over the earth and in the atmosphere, with a particular focus in the class on the processes of precipitation, infiltration and runoff. The general public focuses on hydrology when there either is too much water(flooding) or too little water (drought). Engineers working in the hydrology arena focus on evaluating the timing and location of potential floods,designing structures and sites to minimize the impacts of the site on the hydrologic behavior of an area, and evaluating potential sources of water supply during drought times so that the public impact of a drought is minimal.This course builds on concepts learned in the hydraulic design course in terms of conveyance system design. Course topics include determination of the safe yield of a water supply, calculation of hydrographs in ungaged watersheds, the hydraulics of groundwater wells, and the design of storm water management structures to minimize flooding. The students use currently available models from the U.S. Department of Agriculture, the U.S. EPA and the U.S. Army Corps of Engineers in their watershed evaluations and design of storm water control practices.", "prerequisite": "ENVE 417"}, {"department": "ENVE", "number": "416", "credits": "3 Credits", "description": "Design of treatment facilities for water and waste water based on regulatory requirements and standards.  ENVE 416 Treatment Plant Design (3) This capstone design course will teach students how to integrate various design concepts they have learned from other environmental engineering courses, including ENVE 411 Water Supply and Pollution Control, ENVE 415 Hydrology, ENVE 417 Hydraulic Design,and ENVE 425 Hazardous Waste Management.   Additional design and design related concepts will be introduced through a series of lecturer, seminars, tours, case studies, and design projects.  Subjects covered include unit processes for water and wastewater treatment, hydraulic design, sludge handling and disposal,chemical storage and safety, project bidding and management, plant design and retrofitting, and engineering ethics and society impacts.  After completion of this capstone design course, students should have basic knowledge in selection and design of conventional and modern environmental systems, especially water and waste water treatment processes and application of knowledge they learned from various environmental engineering courses in solving real world engineering problems.", "prerequisite": "ENVE 411"}, {"department": "ENVE", "number": "417", "credits": "3 Credits", "description": "Design of water and waste water conveyance systems and storage facilities.  ENVE 417 Hydraulic Design (3) The delivery of cleandrinking water and the collection of wastewater are two of the fundamentalactivities of municipal or regional governments. Installing new systems orrehabilitating old ones are expensive, large-scale infrastructure projects.Therefore, it is important that these projects be designed correctly andaddress both current population needs and growth projections for the designlife of the project, typically 25 or more years. This course builds on theconcepts learned in fluid mechanics and applies them to the design of municipalwater conveyance systems. Students learn to apply the appropriate pipe flowequation (Darcy-Weisbach, Hazen-Williams, or Chezy-Manning) to the design ofthe conveyance system,e.g ., drinkingwater supply, sanitary sewer collection and storm sewer collection systems.Their projects focus on the design of small conveyance systems and usecurrently available EPA models for water supply, sanitary sewer, and stormwaterpiping design. Students also learn to perform basic population projections,design water storage towers and design appurtenances such as manholes and stormsewer inlet s . Culvert, weir andorifice design also are covered in the class.", "prerequisite": "C E  360"}, {"department": "ENVE", "number": "424", "credits": "3 Credits", "description": "Solid waste collection and disposal techniques; recycling and design optimization; including content analysis, legislation, and planning.", "prerequisite": "C E  335"}, {"department": "ENVE", "number": "425", "credits": "3 Credits", "description": "Overview of regulations, risk assessment, waste minimization and pollution prevention, treatment of hazardous waste, and remediation of contaminated sites.  ENVE 425 Hazardous Waste Management (3)This course covers concepts and techniques for managing hazardous wastes.  Subjects covered include hazardous waste fundamentals (hazardous waste characteristics, regulations, fate and transport, and toxicology), current management practices (environmental audits, and pollution prevention),treatment and disposal methods (physicochemical processes, biological methods, stabilization and solidification, thermal methods, and land disposal) and site remediation (site characterization,and remedial technologies).  Additional hazardous waste management related concepts will be introduced through a series of lectures, tours, case studies,and design projects.  After completion oft his course, students should have basic knowledge in identifying hazardous wastes, understand physical, chemical, and biological factors governing the fate of a compound in the environment, know the fundamental physical, chemical,and biological processes used to treat hazardous wastes.", "prerequisite": "ENVE 411"}, {"department": "ENVE", "number": "430", "credits": "3 Credits", "description": "A course on engineering which uses ecological principles to minimize waste and maximally use input materials.  ENVE 430", "prerequisite": "Permission of program"}, {"department": "ENVE", "number": "460", "credits": "3 Credits", "description": "This course provides a survey of Federal and State environmental laws, including statutory, common and administrative law. May not be taken for graduate credit by Dickinson School of Law students in the concurrent J.D./EPC programs.  ENVE 460", "prerequisite": "senior standing, graduate standing or permission of program."}, {"department": "ENVE", "number": "470", "credits": "3 Credits", "description": "Overview of air quality issues with regard to the sources, measurements, effects, transport and control of potential air contaminants.  ENVE 470 Air Quality (3) The protection of clean air is vital for the health of people. Air pollution has been linked to increased cases of asthma, lung cancer, and other lung diseases. This course, building on concepts covered in the Introduction to Environmental Engineering course, provides an overview of air quality issues with regard to the sources, measurements, effects, transport and control of potential air contaminants. Specifically, the students will learn the fundamental concepts of air pollution generation, modeling and control, plus the impacts of air pollution on human and environmental health and welfare. They will understand the fundamental concepts of acid rain and global climate change. They will learn/be updated on the current regulations that exist to address air quality concerns. Through homework and projects, they will examine and perform preliminary designs on common types of air pollution control equipment. They also will participate in discussions of contemporary air pollution issues (global warming, mobile and stationary air pollution source control, airshed issues in the Chesapeake Bay watershed).", "prerequisite": "C E  370"}, {"department": "ENVE", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "ENVE", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}]