[{"department": "ENVSC", "number": "200", "credits": "3 Credits", "description": "This team-taught course is designed to be the entrance/introduction to major course in Environmental Science. The course consists of seven modules. The first module is an introduction to research methods, and is designed to teach students the fundamentals of searching the primary literature, reading scientific research papers, and accessing and using available environmental databases. Modules 2.6 address various large issues in environmental science. Each of these issues manifests across spatial and temporal scales from local/short-term to global/long-term. Information in each module will be conveyed via assigned readings from a textbook, student presentations of case studies, computer laboratory exercises in which students will access existing databases with the goal of downloading and analyzing some small data set, reviews of 1.2 papers from the primary literature, and discussions of the readings. These modules cover the breadth of environmental science including population growth/control, climate science and climate change, water resources, energy issues, and pollution. The last module specifically addresses communication skills, science-based policy and resource management, and the critical importance of communication between scientists and non-scientists. This module will include writing exercises and presentation skills. At the end of the course, local environmental professionals (lawyers, regulatory personnel, health department officials, urban planners will be invited to participate in a panel discussion of careers options.", "prerequisite": "BIOL 110"}, {"department": "ENVSC", "number": "294", "credits": "1-3 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small group basis."}, {"department": "ENVSC", "number": "296", "credits": "1-3 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ENVSC", "number": "297", "credits": "1-3 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ENVSC", "number": "400W", "credits": "3 Credits", "description": "A writing-intensive environmental science course comprising review and analysis of field, lab, policy, and management aspects; investigative methods; and projects.", "prerequisite": "BIOL 402W", "other": ["Writing Across the Curriculum"]}, {"department": "ENVSC", "number": "457", "credits": "3 Credits", "description": "Industrial hygiene is the discipline devoted to the anticipation, recognition, evaluation, and control of hazards in the workplace. This course provides an overview of the most common industrial hygiene measurement techniques used to evaluate exposure to chemical, physical, and biological agents in the workplace. Topics will include coverage of basic definitions, exposure standards, and guidelines, and an introduction to the different types of sampling equipment and analytical methods used most often in the evaluation of airborne exposure to gases, vapors, and aerosols. Interpretation of quantitative sample results will be an area of emphasis and students will become familiar with different types of exposure distributions, appropriate sampling strategies, and different statistical tools available for making decisions in occupational exposure assessment."}, {"department": "ENVSC", "number": "494", "credits": "1-3 Credits/Maximum of 9", "description": "ENVSC 494 is an experiential course that allows undergraduates to design, complete and present a research project in environmental science.", "prerequisite": "3 credits of 400-level coursework; Junior or senior standing"}, {"department": "ENVSC", "number": "495", "credits": "1-3 Credits/Maximum of 9", "description": "ENVSC 495 is an off-campus internship experience with a local, regional, or national environmental organization, government agency, or private-sector business.", "prerequisite": "3 credits of 400-level coursework; Junior or senior standing"}, {"department": "ENVSC", "number": "496", "credits": "1-3 Credits/Maximum of 9", "description": "Creative projects or specialized coursework, supervised on an individual basis, that falls outside the scope of formal ENVSC coursework.", "prerequisite": "3 credits of 400-level coursework; Junior or senior standing"}]