[{"department": "ESC", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ESC", "number": "120", "credits": "1 Credits", "description": "This seminar, through the utilization of commonly used examples, discusses the engineering principles which are exploited by such designs. ESC 120 Design for Failure (1) (FYS) Although an important facet of engineering design is to minimize the possibility of failure of a system component, there are many devices which actually protect a system by their controlled 'failure'. Further, some components are designed to \"work\" through failure. In the former situation are such devices as: a shear pin in an outboard motor driveline, a fuse in an electrical circuit, a valve actuated by heat in a sprinkler system. In the latter situation, \"tab tops \" allow one to open a beverage can, perforations cause the paper towel to \"tear\" in a prescribed manner, plasticity/elasticity allows stamped parts, such as automobile hoods, to retain their new shape following stamping.", "other": ["First-Year Seminar"]}, {"department": "ESC", "number": "121", "credits": "1 Credits", "description": "Examines the technology predictions of authors in view of the engineering sciences on which the underlying devices of their stories are based.  E SC 121S Science/Engineering Fiction and the Engineering Sciences (1) (FYS) From the times of Jules Verne, books, then movies and TV, have utilized engineering/science and pseudo-engineering, in envisioning devices which were not then available, but perhaps became so in later times. From Verne's nuclear driven submarine to his voyage to the moon; to Mary Shelly's electrically created monster; to Dick Tracy's wrist radio (cell phone); to the warp speed of the Jedi, there are successes and failures as to predictions of what would some day be possible. These are examined and discussed.", "other": ["First-Year Seminar"]}, {"department": "ESC", "number": "122", "credits": "1 Credits", "description": "First-year seminar that surveys the use of novel materials and material systems to create practical devices.  E SC 122S Weird, Wild, and Wonderful Materials and Devices (1) (FYS) There are many materials whose response to a particular stimulus (mechanical, thermal, electrical, etc.) is of a completely different type. For example, if a piezoelastic material is mechanically 'squeezed' (stimulus) the response is the creation of an electrical signal. Birefringent (photoelasticity) materials change their optical properties under mechanical displacement. Thermoluminesent 'remember' their configuration under certain environmental combinations, to which they will abruptly return when these same combinations are repeated. This seminar surveys many classes of such materials and material systems and provides examples of engineers utilizing their behavior for sensors, transducers, and actuators. Examples include acoustic refrigerators, phonograph cartridges, door openers, and stress concentration locators.", "other": ["First-Year Seminar"]}, {"department": "ESC", "number": "123", "credits": "1 Credits", "description": "First-year seminar that explores design deficiencies through the study of case histories of a number of famous failures.  E SC 123S Catastrophic Failures (1) (FYS) Engineered Systems sometimes fail in catastrophic ways. Bridges collapse, buildings bum, airplanes explode, ships break in two, spontaneous combustion occurs, automobiles crash, etc. Virtually all such failures occur because the designers, builders, and or the users have overlooked some unexpected combination of inputs (they seldom fail due to simple overload). For example, a bridge designer may have overlooked (a) the potential danger of aerodynamic loading and mechanical resonance; (b) having a bridge mooring struck by a tugboat; or, (c) the possibility of an earthquake. The ship designer may not have expected a combination of very cold weather and large waves or bad materials, etc. This seminar explores design deficiencies through the study of cash histories of a number of famous failures such as the explosion of the Challenger (modern era) and the sinking of the Titanic that caused catastrophic loss of life. A primary objective of reliving such failures is to alert students to the myriad factors that must be considered for a safe and effective engineering system, and to encourage them to broaden their education so that they will not repeat the mistakes of the past in their own careers.", "other": ["First-Year Seminar"]}, {"department": "ESC", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ESC", "number": "211", "credits": "3 Credits", "description": "Nanotechnology processing equipment and materials handling procedures with a focus on safety, environment, and health issues.  E SC 211 Material, Safety, and Equipment Overview for Nanotechnology (3) This course overviews basic material properties as well as environment, health, and safety (EHS) issues in equipment operation and materials handling in \"top down\" and \"bottom up\" nanofabrication. The chemical and physical materials properties underlying nanotechnology are surveyed. EHS topics arising from the processing and disposal of these materials are addressed including: cleanroom operation, OSHA lab standard safety training, health issues, biosafety levels (BSL) guidelines, and environmental concerns. Specific safety issues dealing with nanofabrication equipment, materials, and processing will also be discussed including those pertinent to wet benches, thermal processing tools, vacuum systems and pumps, gas delivery systems and toxic substance handling and detection.", "prerequisite": "CHEM 101"}, {"department": "ESC", "number": "212", "credits": "3 Credits", "description": "Step-by-step description of equipment and processes needed in top-down, bottom-up, and hybrid nanotechnology processing.  E SC 212 Basic Nanotechnology Processes (3) This course is an overview of the broad spectrum of processing approaches involved in \"top down\", \"bottom up\", and hybrid nanofabrication. The majority of the course details a step-by-step description of the equipment, facilities processes and process flow used in today's device and structure fabrication. Students learn to appreciate processing and manufacturing concerns including safety, process control, contamination, yield, and processing interaction. The students design process flows for micro- and nano-scale systems. Students learn the similarities and differences in \"top down\" and \"bottom up\" equipment and process flows by undertaking hands-on processing. This hands-on overview exposure covers basic nanofabrication processes including deposition, etching, and pattern transfer."}, {"department": "ESC", "number": "213", "credits": "3 Credits", "description": "The processing of materials in nanotechnology as well as the unique material properties available at the nano-scale. ESC 213 Materials in Nanotechnology (3) This course is an in-depth, hands on exposure to the producing and tailoring of the materials used in nanofabrication. The course will cover chemical materials production techniques such as colloidal chemistry; atmosphere, low-pressure and plasma enhanced chemical vapor deposition; nebulization; and atomic layer deposition. It will also cover physical techniques such as sputtering, thermal and electron beam evaporation, and spin-on approaches. This course is designed to give students experience in producing a wide variety of materials tailored for their mechanical, electrical, optical, magnetic, and biological properties."}, {"department": "ESC", "number": "214", "credits": "3 Credits", "description": "Pattern transfer techniques from photolightography to nanoimprinting and nanomolding. ESC 214 Patterning for Nanotechnology (3) This course is a hands-on treatment of all aspects of advanced pattern transfer and pattern transfer equipment including probe techniques; stamping and embossing; e-beam; and optical contact and stepper systems. The course is divided into five major sections. The first section is an overview of all pattern generation processes covering aspects from substrate preparation to tool operation. The second section concentrates on photolithography and examines such topics as mask template, and mold generation. Chemical makeup of resists will be discussed including polymers, solvents, sensitizers, and additives. The role or dyes and antireflective coatings will be discussed. In addition, critical dimension (CD) control and profile control of resists will be investigated. The third section will discuss the particle beam lithographic techniques such as e-beam lithography. The fourth section covers probe pattern generation and the fifth section explores imprinting lithography, nano-molding lithography, step-and-flash, stamp lithography, and self-assembled lithography."}, {"department": "ESC", "number": "215", "credits": "3 Credits", "description": "Applications of nanotechnology including those in medicine, biology, electronics, energy, and materials.  E SC 215 Nanotechnology Applications (3) This course covers the applications of nano-scale devices and systems and the material chemical, physical, biological, or multiple-property requirements necessitated in these applications. Material modifications to meet these requirements will be addressed including structure control, composition control, surface property control, strain control, functionalization, and doping."}, {"department": "ESC", "number": "216", "credits": "3 Credits", "description": "Measurements and techniques essential for controlling device fabrication.  E SC 216 Characterization, Testing of Nanotechnology Structures and Materials (3) This course examines a variety of techniques and measurements essential for testing and for controlling material fabrication and final device performance. Characterization includes electrical, optical, physical, and chemical approaches. The characterization experience will include hands-on use of tools such as the Atomic Force Microscope (AFM), Scanning Electron Microscope (SEM), fluorescence microscopes, and fourier transform infrared spectroscopy."}, {"department": "ESC", "number": "261M", "credits": "3 Credits", "description": "Computational methods for solving engineering problems using C++ and MATLAB. Reports on root finding, systems of algebraid equations.  E SC 261M Computational Methods in Engineering (3) E SC 261M covers programming language fundamentals (organization strategies) and language grammar (syntax) of C++, MATLAB software libraries and packaged tools, and the following numerical methods: root searching techniques, solvers for systems of algebraic equations, curve fitting methods. E SC 261M is taught in a modern technology classroom. E SC 261M is essential for courses on advanced computational methods for engineers, finite element methods, and for all the other engineering courses which rely on computational methods and computer programs to analyze and interpret experimental data.", "prerequisite": "MATH 141", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "ESC", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "ESC", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ESC", "number": "312", "credits": "3 Credits", "description": "The engineering applications of the wave and ensemble pictures of the physical world.  E SC 312 Engineering Applications of Wave, Particle, and Ensemble Concepts (3) This course covers the engineering applications of wave based and ensemble-formulated pictures of the physical world. It begins by discussing criteria for the applicability of geometrical optics and of physical optics and moves into a general discussion of wave phenomena. An introduction to the formalism of physical optics is then given along with examples of its use in engineering applications. The course then moves to discussing the criterion for the applicability of classical mechanics and of quantum mechanics. The parallelism between the geometrical optics/physical optics and classical mechanics/quantum mechanics criteria is underscored. An introduction to the formalism of quantum mechanics is then undertaken followed by a discussion of engineering applications of quantum mechanics. The impact of quantum mechanics on particle, quasi-particle, and cooperative phenomena is discussed. The course then treats the problem of determining the physical properties of ensembles of particles and quasi-particles. Statistical mechanics concepts are introduced and the effects of quantum mechanics on ensemble predictions is covered. Fermi-Dirac, Bose-Einstein, and Boltzmann statistics are developed and discussed. The connection is also made between statistical mechanics and thermodynamics. Engineering applications of statistical mechanics are presented and discussed.The objective of this course is to give engineering students a broad technical picture of physical concepts that will affect much of the engineering advances of this century. Students will be exposed to the duality of the wave-particle picture and to that picture's critical engineering important to the fields of optics and mechanics. They will be taught the influence of quantum mechanics on physical properties and the need for ensemble approaches for predicting the expected values of those properties for many particle systems. The impact of wave and ensemble approaches on engineering applications will be stressed and the students will be given hands-on exposure to this impact in three laboratory experiences.Evaluation methods to be used in this course will be two in-class examinations and one final period examination.", "prerequisite": "PHYS 214"}, {"department": "ESC", "number": "313", "credits": "3 Credits", "description": "Principles, fabrication methods and applications of nanoscale.  E SC 313 Introduction to Principles, Fabrication Methods, and Applications of Nanotechnology (3) This course covets the unique opportunities provided by the nano-scale and focuses on the engineering issues of fabricating and applying structures designed to take advantage of these opportunities. The course begins with defining nanotechnology and nanofabrication. It then moves to the unique features available in nano-scale structures such as large surface-to-volume ratios, quantum size effects, unique chemical bonding opportunities, dominance of physical optics, surface control of reactions and transport, and the creation of structures on the same size scale as basic features in living cells. With this understanding of the uniqueness of the nano-scale, the course progresses into the fabrication methods used in nanotechnology and then into nanostructure applications. The various nanofabrication approaches found in top-down, bottom-up, and hybrid fabrication approaches are explained and discussed in the lecture format. The principles behind the application of structures fabricated at the nano-scale are then addressed in more depth. This section of the course includes an introduction to nano-scale electronic devices, an introduction to nano-scale sensing devices, an introduction to nano-scale optics and optical devices, an introduction to material property modification at the nano-scale, and an introduction to the biology/nano-scale interface. Specific applications of the structures made using various combinations of top-down and bottom-up fabrication techniques are overviewed in various applications including sensors, nano-electronics, molecular electronics, photonics, nano-optics, information storage and computing, materials, nano-mechanics, and nano-biotechnology and medicine. The course concludes with an introduction to the manufacturing issues encountered when fabricating, assembling, and interfacing nano-scale structures as well as with an overview of health, environmental, and societal issues The objective of this course is to give a broad technical picture of nanotechnology to engineering students from various engineering disciplines. In so doing, the course will develop a sound background for making informed judgments concerning the potential of nanotechnology for various technical applications and a sound background for assessing the societal and health issues as well as environmental impact of nanotechnology. The course objectives are to have students be able to consider nanotechnology solutions to technical problems, be able to fabricate these nanotechnology solutions in a manufacturable manner, be able to determine if there are any potential health or environmental issues involved in their solutions, and be able to assess the societal impact of their solutions. The course will require a college-level chemistry and physics background. Evaluation methods to be used in this course will be two in-class examinations and one final period examination.", "prerequisite": "CHEM 110"}, {"department": "ESC", "number": "314", "credits": "3 Credits", "description": "Basic concepts of material structure and their relation to mechanical, thermal, electrical, magnetic, and optical properties, with engineering applications.(E SC 314 is not intended for students in E SC major)  E SC 314 Engineering Applications of Materials (3) This course is intended primarily for Electrical Engineering and Materials Science and Engineering majors, as a core-level exposure to the electron-based properties of materials and their engineering applications. Building upon a basic foundation from early Physics courses, it offers an introduction to the behavior of electrons in crystalline as well as non-crystalline solids, and its impact on properties. A comprehensive treatment of electrons in solids is essential to understand the electronic, optical, thermal, magnetic and other properties of materials and their incorporation in functional devices. The topics are chosen to deal with all the basic facets of electrons in solids and their response to external fields and waves, and lead up to a broad range of elementary device applications. It thaws upon the results of quantum mechanics and band theory of solids that provide the broad umbrella needed for understanding the properties of materials and designing them into practical devices including the new class of nanosystems. The development of the energy band diagram is shown to offer a convenient model for understanding the properties of materials and designing device structures. The overwhelming role of semiconductors as building blocks of modern electronics is emphasized by introducing the key concepts of doping, electron transport by drift and diffusion, and electron-photon interactions. The students are shown the strong link connecting atomic bonding, physical structure and material properties in order that they understand the need for and emergence of artificially synthesized structures and new device phenomena. Along with a detailed coverage of semiconductors due to their widespread applications and their dominance in modern micro- and optoelectronics, a basic introduction to dielectric and magnetic properties is also included. Engineering applications involving sensing and transduction as well as signal amplification and energy conversion will be interspersed in the discussions of properties throughout the course. The role of defects, impurities and interfaces on electrical, optical and other properties are introduced briefly, along with corresponding applications in device structures The devices discussed include p-n junctions, metal-semiconductor contacts, bipolar and field effect transistors, optical detectors and light emitting diodes. The broad topical coverage will prepare students for advanced studies in a variety of fields including micro- and optoelectronics and functional microsystems. The course provides essential background for senior technical electives on semiconductor devices and processing as well as nanotechnology, and also complements courses that deal with atomic structure and mechanical properties of materials.", "prerequisite": "PHYS 212"}, {"department": "ESC", "number": "337", "credits": "3 Credits", "description": "This course will introduce quantum mechanics from the perspective of quantum information science and engineering, focusing on two-level systems and the concepts of entanglement and decoherence. It will educate students on how quantum information can be used in quantum communication and quantum computing, both in theory and experiment. The course covers basic concepts such as two-level systems, Schroedinger equation, Bloch sphere, superposition, entanglement, quantum bits, quantum gates, Bell¿s inequalities, and mixed states. Covering these basic concepts prepare the students for more advanced courses in the minor where they learn in depth about quantum algorithms, physical implementation of different quantum systems, and how to compute with existing quantum computers.", "prerequisite": "MATH 220"}, {"department": "ESC", "number": "386", "credits": "3 Credits", "description": "This course will explore how engineering principles apply to living organisms.  E SC 386 Engineering Principles of Living Organisms (3) This course uses an engineering approach that applies basic physical and mathematical principles to the fundamental problems living organisms encounter. The objectives of the course are to understand the role of scaling in size and construction trade-offs in living organisms, how diffusion shapes and limits cellular processes, the role of electrical fields and concentration gradients in signaling, the statistical mechanics of ion channel and receptor gating, how the dynamics of transcriptional interactions can generate genetic circuits, the role of mechanical amplification in hearing. At the completion of the course, students will have insight into how to use quantitative techniques from engineering and the physical sciences to analyze biological systems.", "prerequisite": "CHEM 110"}, {"department": "ESC", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ESC", "number": "400", "credits": "3 Credits", "description": "Irrotational and solenoidal fields, potentials, vector and scalar field and wave equations, harmonic and wave functions in various coordinates, radiation.  E SC 400H Electromagnetic Fields (3) E SC 400H is a required senior-level course for students pursuing a bachelor's of Engineering Science. At the conclusion of this course, students will be able to: 1. Apply the basic principles of electrostatics, such as Coulomb's Law, electric field intensity, electric flux density, Gauss's Law, the concepts of divergence and gradient, and potential functions to solve basic and applied problems. 2. To compute resistance and capacitance for a variety of geometric configurations. 3. They will apply the basic principles of steady magnetic fields, such as the Biot-Savart Law, Amper6s Circuital Law, magnetic flux and flux density, Stoke's Theorem and the concept of the curl and Maxwell's equations for static electric and steady magnetic fields to solve basic and applied problems. 4. Compute self and mutual inductance for a variety of geometric configurations. 5. Understand the necessary modifications of Maxwell's equations for time varying fields including Faraday's Law and the concept of displacement current and apply these to solve basic and applied problems. 6. Understand the solutions of the reduced wave equation, for time-harmonic excitations, for plane wave propagation in both perfect and lossy dielectrics, the concepts of skip depth and wave polarization, plane wave reflection at planar boundaries, Snell's Law, Brewster's angle, and the concept of standing wave ratio and apply these to solve basic and applied problems. 7. Understand the basic principles of waves on transmission lines and apply these to solve basic and applied problems.Topics include: Vector Analysis; Coulomb's Law and Electric Field Intensity; Electric Flux Density, Gauss's Law, and Divergence; Energy and Potential; Conductors, Dielectrics, and Capacitance; Poisson's and Laplace's Equations; the Steady Magnetic Field; Magnetic Forces, Materials, and Inductance; time-Varying Fields and Maxwell's Equations; the Uniform Plane Wave; Waves at Boundaries and in Dispersive Media. A typical course assessment includes homework assignments, mid-semester examinations and a final examination. The course is offered, in a lecture format, each spring at the University Park Campus. A typical enrollment is 25-30 students. This course is not a prerequisite for other courses.", "prerequisite": "EE 210", "other": ["Honors"]}, {"department": "ESC", "number": "404", "credits": "3 Credits", "description": "Unified application of coordinate transformations; Laplace's, heat, and wave equations to boundary value problems and problems of continua in engineering.", "prerequisite": "MATH 250", "other": ["Honors"]}, {"department": "ESC", "number": "406", "credits": "3 Credits", "description": "Application of complex variable theory, integral equations, and the calculus of variations to engineering problems.", "prerequisite": "ESC 404", "other": ["Honors"]}, {"department": "ESC", "number": "407", "credits": "3 Credits", "description": "Numerical solution of differential equations including fundamentals: roots of single nonlinear and simultaneous (Matrix) equations, least squares fitting and staistical goodness, interpolation, finite differences, differentiation, integration, eigensolutions.  E SC 407H Computer Methods in Engineering Science, Honors (3) The overall objective of this course is the creation of mathematical continuum models in the form of differential equations and the application of numerical methods to solve them. To reach this goral, fundamental methods dealing with numerical approximation, specifically starting with Taylor's series, are covered: differentiation, integration, and root search of single nonlinear equations. Mathematical models are transformed into discrete models using the finite difference method, hence the solution of simultaneous algebraic equations in matrix and iterative forms is also covered. In addition, eigenvalue problems are also covered in order to characterize models, both continuous and discrete. The concept of vector-variable and vector-valued functions are used to form algorithms, cast them into computer code, in a language of student choice, usually Mathematica or MATLAB because graphical output is required in doing assignments. This course relates to programs of study in most engineering disciplines based upon the physics of solids and fluids. Evaluation methods include assessment of written reports, at least one midterm examination and either a final examination or a final report.", "prerequisite": "CMPSC 200", "other": ["Honors"]}, {"department": "ESC", "number": "409", "credits": "1 Credits", "description": "Preliminary identification and planning for the senior year research and design project. ESC 409 Senior Research and Design Project Preparation, Honors (1) is the first of a three-part series of courses that constitute the Engineering Science honors capstone research and design project. Engineering Science students participate in projects in all engineering disciplines and employ design principles before, during, and after analysis, experimentation and/or simulation. The resulting designs of systems, components or processes are then tested and refined by changing material, geometric, stochastic or other parameters, as required. Students will spend the first few weeks of the course investigating various areas of research being conducted at the university. They will then interview key faculty and graduate students in several research groups and ultimately select one area to be the focus of their senior thesis research. After obtaining the agreement of a faculty member to supervise the thesis project, they will spend time familiarizing themselves with the people, equipment, materials, and software available in their selected research group as well as reading and summarizing key literature in preparation for conducting research. As an end product of this 1 credit course, students will develop a detailed set of project objectives and create a timeline for the year-long project. Class time will be spent exposing students to a variety of different research areas. In addition, time will be given for students to support each other through facilitated discussions to share their success stories as well as difficulties encountered in the process of identifying and selecting their research topics. Students will also be given the opportunity to present the preliminary details of their intended research topic. ESC 409 (1 credits) will be followed by ESC 410 (3 credits) where students will conduct their research, subsequently followed by ESC 411 (2 credits) where students will complete their research and prepare a written honors thesis. Through these combined 6 credits, students will integrate the scientific principles of research, design, and analysis and apply them to a particular field of engineering.", "prerequisite": "Fifth Semester standing", "other": ["Honors"]}, {"department": "ESC", "number": "410H", "credits": "3 Credits", "description": "Design and synthesis in the context of a specific design project undertaken during the senior year. ESC 410 Senior Design Project, Honors (3) is the second of a three-part series of courses that constitute the Engineering Science honors capstone research and design project. Engineering Science students participate in projects in all engineering disciplines and employ design principles before, during, and after analysis, experimentation and/or simulation. The resulting designs of systems, components or processes are then tested and refined by changing material, geometric, stochastic or other parameters, as required. ESC 410 is the continuation of ESC 409 and constitutes the core effort in the honors senior research and design project for Engineering Science majors. It is followed by ESC 411. All three courses are required of Engineering Science majors and together they comprise the capstone research and design project, which integrates the scientific principles of research, design, and analysis and applies them to a particular field of engineering. In-class lectures and discussions on a wide range of topics such as design, engineering ethics, international relations, engineering management, safety, government and public policy, environmental issues, workforce preparation and graduate school occur in tandem with the students' development of their individual topics.", "prerequisite": "ESC 409", "other": ["Honors"]}, {"department": "ESC", "number": "411", "credits": "2 Credits", "description": "Design and synthesis in the context of a specific design project undertaken during the senior year. ESC 411 Senior Research and Design Project II, Honors (3) is the third of a three-part series of courses that constitute the Engineering Science honors capstone research and design project. Engineering Science students participate in projects in all engineering disciplines and employ design principles before, during, and after analysis, experimentation and/or simulation. The resulting designs of systems, components or processes are then tested and refined by changing material, geometric, stochastic or other parameters, as required. ESC 411 is the continuation of ESC 409 and ESC 410. All three courses are required of Engineering Science majors and together they comprise the capstone research and design project, which integrates the scientific principles of research, design, and analysis and applies them to a particular field of engineering. In-class lectures and discussions on a wide range of topics such as design, engineering ethics, international relations, engineering management, safety, government and public policy, environmental issues, workforce preparation and graduate school occur in tandem with the students' development of their individual topics.", "prerequisite": "ESC 410", "other": ["Honors"]}, {"department": "ESC", "number": "412", "credits": "3 Credits/Maximum of 999", "description": "Cleanroom based nano/micro fabrication and related environmental health and safety issues. The nanotechnology consumer products market currently has more than 1,000 nanomaterial-containing products varying from makeup, sunscreen, food storage products, appliances, clothing, electronics, computers, sporting goods, and coatings to drug delivery systems. These products exist in the market place and are expanding in number because nano-scale materials and structures can have properties that are very different from larger size-scale versions of the same materials and structures. These property differences at the nano-scale can make nanotechnology products unique and desirable for specific applications. However, the uniqueness of the nano-scale can also affect toxicity and environmental repercussions due to differences in physicochemical properties arising from size but also from shape, chemistry, surface properties, agglomeration, bio-persistence, solubility, and charge, as well as from differences caused by attached functional groups, as outlined in this course. The greater surface-area-to-mass ratio of nanoparticles makes them generally more reactive than their macro-sized counterparts. These properties that make nanomaterials unique and valuable in manufacturing many products also make manufacturing at this scale an endeavor which must be studied and appreciated for its potential safety, health, and environmental impact. Practicing engineering at the nano-scale requires awareness of the nanotechnology safety, health concerns, and environmental issues laid out in E SC 412.", "prerequisite": "Seventh semester standing"}, {"department": "ESC", "number": "414M", "credits": "3 Credits", "description": "Structure and imperfections in engineered materials; their influence on properties, behavior, and processing.  Applications of metals, ceramics, polymers, and composites.  E SC 414M Elements of Material Engineering (3) This course is a junior-level, writing-intensive engineering science course designed to introduce students to the fundamentals of materials science and engineering. In the early part of this honors course, structure property relationships in materials are explored. The student will examine how atomic structure and bonding influence engineering properties such as strength and electrical properties Next, solidification, strengthening mechanisms, and phase diagrams for some common engineering materials are discussed to further examine structure property relationships and to provide the basis for the study of more complex materials The second half of the course introduces properties and attributes of each of the major classes of materials (metals, ceramics, polymers, and composites) to acquaint the student with the wide array of material properties and choices available for design. Next, electrical, optical, and thermal properties of the various classes of materials are introduced Finally, the course closes with an introduction to the topics of materials selection and design Throughout the course, integrated writing assignments allow the student to explore the properties of a specific material or materials process in detail and gain insight the design process.", "prerequisite": "EMCH 213", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "ESC", "number": "417", "credits": "3 Credits", "description": "Electrical conductivity, dielectric properties, piezoelectric and ferroelectric phenomena; magnetic properties of ceramics. ESC 417 / MATSE 417 Electrical and Magnetic Properties (3) is designed to provide students with a fundamental understanding of the different responses a material can have to applied electrical or magnetic fields. Important properties are introduced and correlated with knowledge of material chemistry, crystal structure, and microstructure to provide an understanding of the mechanisms responsible for controlling the observed properties, as well as the ways in which properties can be engineered. Electronic and magnetic properties encompass dielectric, ferroelectric, conductor, superconductor, and ferromagnetic materials. Material properties and structures are related to sensors, energy storage and conversion devices, biomedical devices and electronic components in telecommunications.", "prerequisite": "MATSE 400", "other": ["Cross-listed with: MATSE 417"]}, {"department": "ESC", "number": "419", "credits": "3 Credits", "description": "The course covers the electrical, optoelectronic, dielectric, and other electron-based properties of solids, semiconductors in particular, and their engineering/ device applications.  E SC 419 Electronic Properties and Applications of Materials (3) This course is designed primarily as a Foundation Elective for Engineering Science majors. It covers the electron-based properties of materials and their engineering applications. Building upon the strong foundation of wave, particle and ensemble concepts covered in the prerequisite course (E SC 312), it will offer an advanced introduction to the behavior of electrons in crystalline as well as non-crystalline solids, and its impact on properties. A comprehensive treatment of electrons in solids is essential to understand the electronic, optical, thermal, magnetic and other properties of materials and their incorporation in functional devices. The topics will address many facets of electrons in solids, their interaction with fields, cooperative phenomena and low-dimensional effects, and lead up to a broad range of elementary device applications. It will draw upon the results of quantum mechanics and band theory of solids that will provide the broad umbrella needed for understanding the properties of materials and designing them into practical devices and nanosystems. The importance of structure on material properties will be emphasized, so as to bring forth the importance of artificially synthesized structures and emergence of new phenomena. Along with a detailed coverage of semiconductors due to their widespread applications and their dominance in modern micro- and optoelectronics, dielectric, magnetic and superconducting materials will also be discussed in the course. The role of defects, impurities and interfaces on electrical, optical, dielectric and other properties will be discussed, along with corresponding applications in device structures. The broad topical coverage will prepare students for advanced studies in a variety of fields including micro- and optoelectronics, functional nanosystems and synthesized nanostructures. The course will provide a solid background for senior technical electives such as E SC 481 (Elements of Nano/Micro-electromechanical Systems Processing and Design) E SC 445 (Semiconductor Optoelectronic Devices) offered in ESM, as well as Electrical Engineering and Materials Science and Engineering Courses. It will also complement (and be independent of) E SC 414M that encompasses atomic structure and mechanical properties of materials.", "prerequisite": "ESC 312"}, {"department": "ESC", "number": "420", "credits": "3 Credits", "description": "In recent decades, nanotechnology has received great attention from numerous scientists all around the world. Nanomaterials show interesting properties and have been the subject of many advanced research topics. This course covers several key aspects of the multi-disciplinary field of nanotechnology and nanomaterials. Various topics are discussed in this class including an introduction to nanomaterials, properties of nanomaterials, synthesis procedures, the applications of nanmaterials, characterization techniques of nanomaterials, quantum dots, nanorobots, and nanocomposites. At the end of this course, students have great insight into the principles of nanomaterials and their potential applications in a variety of industries such as biomedical, aerospace, ceramic and electronic industries.", "prerequisite": "MATSE 259"}, {"department": "ESC", "number": "430", "credits": "3 Credits", "description": "This course covers advanced biofabrication processes used in tissue engineering, regenerative medicine and drug testing, and provides fundamental statistical concepts and tools that are required to analyze biofabrication process data. Topics include: Introduction, Review of Basic Statistics, Statistics for Analysis of Experimental Data, Hypothesis Testing with Two Sample, Introduction to Biofabrication, Traditional Manufacturing Processes for Tissue Engineering, Micro-patterning and Molding, Microfluidics in Tissue Engineering, Scaffold-free Tissue Fabrication, Modular Assembly and 3D Printing in Tissue Engineering. The course also includes utilization of software packages, hands-on laboratory homework assignments.", "prerequisite": "Seventh semester standing or higher"}, {"department": "ESC", "number": "433", "credits": "1 Credits", "description": "Hands-on lab experience and exposure to campus-wide interdisciplinary experimental research.  Experimental probability and statistics. Appplications across all Engineering Science disciplines.  E SC 433H Engineering Science Research Laboratory Experience (1) This course provides an introduction to experimental research, including hands-on laboratory experience. In addition, students take part in campus-wide laboratory tours that illustrate the variety of experimental practice, as well as the strongly interdisciplinary nature of contemporary experimental research in Engineer Science. Lab tours involve laboratories in a variety of disciplines, both within the Department of Engineering Science and Mechanics, and in other departments with related interdisciplinary activities. The classroom content focuses on the fundamentals of experimental probability and statistics, including: the experimental process; probability distributions and error; statistical estimators; least squares; and confidence limits and hypothesis testing. Applications of the statistical analysis of experimental data are drawn from across all Engineering Science disciplines and illustrated in the labs and lab tours. There will be three hands-on laboratories. Each lab will include additional introductory lecture material, specific handouts, and readings A report will be required for each lab that represents a significant writing component to the class, and includes both descriptive and analytical components Assessment for the course is based on the laboratory reports, which include analytical and descriptive components, as well as exercises involving the material discussed in lectures.", "prerequisite": "MATH 141", "other": ["Honors"]}, {"department": "ESC", "number": "437", "credits": "3 Credits", "description": "Introduction to the physical implementation of quantum bits (qubits) based on state-of-the-art technologies. The course will consider issues in quantum information technology from an experimental point of view. The various types of qubits that will be discussed include those made with superconducting circuits, atoms (including ions, atoms and molecules), electron spins, and photons. In each case, the goal will be to develop a physical understanding of the various approaches, to get a sense of their strengths and weaknesses, and to learn about the state of the art and future prospects.", "prerequisite": "PHYS 337"}, {"department": "ESC", "number": "445", "credits": "3 Credits", "description": "The course will present the basic engineering science and technology involved in modern semiconductor optoelectronic devices.  E SC 445 Semiconductor Optoelectronic Devices (3) This course deals with the optoelectronic properties of semiconductors and their application in functional devices for detection, emission, amplification and conversion of optical and electrical signals. A comprehensive introduction to the various optical absorption and emission processes in semiconductors is followed by an outline of specific properties of important optoelectronic semiconductors. The physical basis of detectors operating in the visible and near-visible regions is covered with an exploration of various photon detection phenomena present in solids. The devices discussed at length include intrinsic and extrinsic photoconductive detectors, p-n and Schottky detectors, p-i-n and heterojunction devices, avalanche photodiodes and photoemissive detectors, and light emitting and laser diodes Novel structures based on variable gap and superlattice structures are also considered The topical coverage includes basic operating principles, design considerations and performance assessment of each of these devices The course will enable students to apply the physics of optoelectronic devices to applications such as displays, fiber optic communications, imaging, and integrated optoelectronics.The course is offered once every year, and complements related courses on semconductor device offered by the departments of Engineering Science and Mechanics, and Electrical Engineering. Student assessment is from homework, exams and a writing assignment involving a device application note.", "prerequisite": "ESC 419"}, {"department": "ESC", "number": "450", "credits": "3 Credits", "description": "The materials science of applying thin film coatings, etching, and bulk crystal growth; includes materials transport, accumulation, epitaxy, and defects.", "prerequisite": "MATSE 201", "other": ["Cross-listed with: MATSE 450"]}, {"department": "ESC", "number": "455", "credits": "3 Credits", "description": "The objective of the course is to give students hands-on experience in assessing environmental degradation of engineering materials.  E SC 455 E SC 455 Electrochemical Methods in Corrosion Science and Engineering (3)The objective of the course is to give students hands-on experience in assessing environmental degradation of engineering materials. Students will be introduced to a variety of experimental electrochemical methods and will use their training to evaluate corrosion of steel, stainless steel, and aluminum. Techniques that will be used in this laboratory-intensive course include potentiodynamic and potentiostatic polarization, galvanic corrosion measurements, localized corrosion measurements (scratch, critical pitting temperature, and metastable pitting experiments), evaluation of sensitization (double-loop electrochemical potentiokinetic reactivation), cyclic voltammetry, and electrochemical impedance spectroscopy of painted and unpainted specimens.", "prerequisite": "MATSE 259"}, {"department": "ESC", "number": "456", "credits": "3 Credits", "description": "Artificial Neural Networks as a solving tool for difficult problems for which conventional methods are not applicable.  E E (E SC/EGEE) 456 Introduction to Neural Networks (3) This course is in response to students needs to learn Artificial Neural Networks (ANN) as a solving tool for difficult problems for which conventional methods are not available. The objective of this course is to give students hands-on experiences in identifying the best types of ANN, plus developing and applying ANN to solve difficult problems. Students will be introduced to a variety of ANN and will use their training skills to solve their own applications. During this course the students will develop a final project, in which they will apply ANN to widely varied problems.Examples: I) students from E E may be interested in applying ANN to solve control problems; II ) students from Material Sciences may be interested in applying ANN to predict the pitting corrosion of components; III) students from Petroleum Engineering may be interested in applying ANN to characterize the life of a reservoir; IV ) students from Agricultural Engineering may be interested in applying ANN to sort apples automatically, etc.", "prerequisite": "CMPSC 201", "other": ["Cross-listed with: EE 456, EGEE 456"]}, {"department": "ESC", "number": "460M", "credits": "3 Credits", "description": "This course will provide students with the opportunity to learn the design process in the context of an industry- or government-sponsored or service-based design project that demands delivering a working solution. The design projects in this course will be structured for students from two or more different engineering majors, as defined by the project sponsors in collaboration with the instructor and departmental project coordinators. While the projects may be supplied/supported/initiated by industry, topics may be related to the cutting-edge multidisciplinary research areas represented by the strengths and diversity of the Engineering Science faculty, such as nanotechnology, biomaterials, and other areas requiring cross-discipline collaboration. The project sponsor will provide the technical expertise for the project, a clear definition of all project deliverables, and the financial support to cover needed materials and supplies and travel costs. Project sponsors will be invited to attend two key events each semester: Project Kickoff in week 1 of the semester to define the project and answer questions from the students as well as the Design Showcase in week 15 of the semester, when teams present their project results to sponsors, faculty, other students, and the public. The College of Engineering will provide the facilities where the design teams will work together to develop the design concept and prototype solutions. Faculty members in the Department of Engineering Science and Mechanics will administer the course, including reading, evaluating, and grading the final project report, provide lectures on topics including on project management, design, product manufacturing, intellectual property, engineering ethics, societal/global/contemporary/professional issues, and related technical topics, and organize invited technical lectures related to industry projects. In accordance with standard procedures, specific multidisciplinary projects will be selected for this course to provide challenging design experiences for all students. The selection of these projects will be done by the course instructor prior to the start of each semester of the course offering. Multidisciplinary teams are be formed based on specific technical elements of the project and project scope.", "prerequisite": "MATH 250", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "ESC", "number": "460W", "credits": "3 Credits", "description": "This course will provide students with the opportunity to learn the design process in the context of an industry- or government-sponsored or service-based design project that demands delivering a working solution. The design projects in this course will be structured for students from two or more different engineering majors, as defined by the project sponsors in collaboration with the instructor and departmental project coordinators. While the projects may be supplied/supported/initiated by industry, topics may be related to the cutting-edge multidisciplinary research areas represented by the strengths and diversity of the Engineering Science faculty, such as nanotechnology, biomaterials, and other areas requiring cross-discipline collaboration. The project sponsor will provide the technical expertise for the project, a clear definition of all project deliverables, and the financial support to cover needed materials and supplies and travel costs. Project sponsors will be invited to attend two key events each semester: Project Kickoff in week 1 of the semester to define the project and answer questions from the students as well as the Design Showcase in week 15 of the semester, when teams present their project results to sponsors, faculty, other students, and the public. The College of Engineering will provide the facilities where the design teams will work together to develop the design concept and prototype solutions. Faculty members in the Department of Engineering Science and Mechanics will administer the course, including reading, evaluating, and grading the final project report, provide lectures on topics including on project management, design, product manufacturing, intellectual property, engineering ethics, societal/global/contemporary/professional issues, and related technical topics, and organize invited technical lectures related to industry projects. In accordance with standard procedures, specific multidisciplinary projects will be selected for this course to provide challenging design experiences for all students. The selection of these projects will be done by the course instructor prior to the start of each semester of the course offering. Multidisciplinary teams are be formed based on specific technical elements of the project and project scope.", "prerequisite": "MATH 250", "other": ["Writing Across the Curriculum"]}, {"department": "ESC", "number": "475", "credits": "3 Credits", "description": "Fundamentals of processing particulate materials including production, characterization, handling, compaction, and sintering of metal, carbide, intermetallic, and composite powders.", "prerequisite": "EMCH 315", "other": ["Cross-listed with: MATSE 475"]}, {"department": "ESC", "number": "481", "credits": "3 Credits", "description": "Interdisciplinary fundamentals of nano/microelectromechanical systems (NEMS/ MEMS), including design, fabrication and machining of miniature systems. Draws from mechanics, science and materials.  E SC 481 Elements of Nano/Micro-electromechanical Systems Processing and Design (3) The objective of the course is to introduce students to the theory and technology of nanofabrication. This objective is realized via the study of materials and devices for NEMS as well as nano-system's design, manufacture and packaging,. Emphasis on the interrelationships between material properties and processing, device/system structure, and the mechanical, electrical, optical, or (bio)chemical behavior of devices/systems. As taught, the course is multidisciplinary and requires adequate background in materials science, mechanics, and device physics. The course comprises lecture presentations and laboratory demonstrations. Students attending this course come from different engineering majors, physics, and materials science. The students are assessed using a combination of homework assignments, class presentations, group projects, and written quizzes and exams.", "prerequisite": "EMCH 213"}, {"department": "ESC", "number": "482", "credits": "3 Credits", "description": "Principles and applications of Micro-Optoelectromechanical and Nanophotonic devices and systems.  E SC 482 Micro-Optoelectromechanical Systems (MOEMS) and Nanophotonics (3) E SC 482 provides the engineering student with a unifying and multifaceted description of MOEMS and nanophotonics. Students will learn the fundamental principles behind many novel micro- and nanophotonic devices and systems and their practical applications in the fields of communication, sensor and image technology.The course starts with an overview of the fundamental physics of semiconductors with emphases on silicon, III-V and II-V compound semiconductors due to their important applications in MOEMS and active nanooptoelectronic devices. Semiconductor nanostructures, such as epitaxial grown quantum wells and quantum dots, and chemically synthesized nanowires and collodial nanocrystals will be introduced through discussions on their unique electronic structures carrier transport and excitonic dynamics. In addition to inorganic materials, the structures and critical characteristics of electro-optic and light emitting polymers will also be reviewed for their fast-growing applications in display technology, sensory and information processing systems.The general principles for the design and operation of MOEMS and nanooptoelectronic devices will be discussed in the frame of geometrical optics, electromagnetic theory, and semiconductor physics. The reflection of light at dielectric interfaces will be reviewed to reveal the critical features of optical waveguide structures and to introduce the concept of surface plasma waves. In-depth descriptions will be given for the interband-and intraband- electron transition and exciton emission process in semiconductor quantum structures. Important instances of applying the 'quantum confinement' in nanostructures to tailor their optical and optoelectronic properties will be underscored during the mechanism-analysis of laser diodes, detectors and modulators. The new concept of 'photonic crystals' will be introduced through the analysis of parallelism between electron transport in semiconductor lattices and light propagation in periodic dielectric media.Following a brief survey of the state-of-the-art technologies for the fabrication of MOEMs and nanophotonic devices, the course topics will move to their application examples in the fields of communication, sensor and image technology. For each application example, analysis will be carried out on the design, fabrication, and characterization issues of the involved systems/devices. Their merit-of-performance will be linked to the application practice to illustrate how the introduction of MOEMs/nanophotonic devices advances the technology in each specific field. Important topics to be covered in this part include micromachined lightwave systems, microcavity light emitting devices, fiber based biological nanosensors, nanoparticle enhanced surface plasma resonance sensors, microspectrometers, and digital micromirror device (DMD)-based projection display engine.", "prerequisite": "PHYS 214"}, {"department": "ESC", "number": "483", "credits": "3 Credits", "description": "Introduction to computer simulation techniques and their applications at the physical/life sciences interface.  E SC (MATSE) 483 Simulation and Design of Nanostructures (3) Students will learn the simulation techniques and the design rules of nanostructures. Basic concepts of computer modeling will be introduced using quantum and classical approaches. Fundamental physical phenomena encountered in the molecular fields of computational physics, chemistry, and biology will be studied. Applications are drawn from a broad range of fields including soft and condensed matter to build an understanding of nanostructures.The course will assume knowledge and skill developed in the prerequisite courses of PHYS 214 and MATH 230. Students are expected to combine knowledge from other courses with information presented here to develop sophisticated interpretations and understanding of physical and chemical principles of nanostructures and their design rules.Evaluation methods to be used in this course will be two in-class examinations and one final period examination. The course contains a computer code generation and implementation component. Students will use commercial or educational computer codes (e.g. Matlab, Mathematica, AMBER, CHARMM, VASP, etc.) which are available at our high performance computing clusters (http://gears.aset.psu.edu/hpc/)/ Students will use the computing clusters to perform simulations which are accessible from any classroom or laboratory at Penn State.The principal objectives of the course is to learn the fundamental physics of nanostructures and to design them with computer simulations. This approach starts from classical molecular dynamics that apply on the large scale biological and synthetic assemblies and encompasses quantum mechanics for the molecular and atomic sizes. This course will give a broad scientific picture of simulation techniques in the area of nano-science and technology.", "prerequisite": "PHYS 214", "other": ["Cross-listed with: MATSE 483"]}, {"department": "ESC", "number": "484", "credits": "3 Credits", "description": "Advances in biomolecular-based Science and technology at the physical/life sciences interface.  E SC 484 Biologically Inspired Nanomaterials (3) Students will learn the concepts of molecular engineering and the advances in biomolecular-based science and technology at the physical/life sciences interface. Basic concepts of protein structure and function will be introduced. Applications from a broad range of fields, including condensed and living matter to build an understanding of device applications including biologically-inspired molecular-scale devices will be introduced.The course will assume knowledge and skill developed in the prerequisite courses of PHYS 214 and MATH 230. Students are expected to combine knowledge from other courses with information presented here to develop sophisticated interpretations and understanding of physical and chemical principles of molecular structures and their design rules.Evaluation methods to be used in this course will be two in-class examinations and one final period examination. The course contains a substantial writing component. Students will prepare bio-science and technology reports.The principal objective of the course is to learn and analyze molecular engineering technologies at the bio and nano interface. This course will give a broad technological picture of emerging protein technologies in the area of biomolecular materials.", "prerequisite": "PHYS 214"}, {"department": "ESC", "number": "494", "credits": "1-9 Credits/Maximum of 9", "description": "Students must have approval of a thesis adviser before scheduling this course."}, {"department": "ESC", "number": "494H", "credits": "1-9 Credits/Maximum of 9", "description": "Students must have approval of a thesis adviser before scheduling this course.", "other": ["Honors"]}, {"department": "ESC", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "ESC", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]