[{"department": "ETI", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ETI", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ETI", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "ETI", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "ETI", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses offered infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ETI", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ETI", "number": "300W", "credits": "3 Credits", "description": "Organizations utilizing enterprise stack platforms leverage several core components in order to be successful in implementations across system boundaries. Students will draw upon their prior experience in databases, networks, and programming to understand how cloud-based infrastructure solutions are built, the possible choices an analyst will have, and the written communication needed in order to convey these design choices to others. In addition, understanding the development life cycle and workflow needed to create web-based solutions and how they overlap with elastic operations will also be explored. Students will work in teams not only to better understand group collaboration, but to appreciate differences in backgrounds and biases as they relate to solutions development.", "prerequisite": "IST 210", "other": ["Writing Across the Curriculum"]}, {"department": "ETI", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "ETI", "number": "435", "credits": "3 Credits", "description": "Analytics and big data, enabling analytics through information technology, ROI in analytics, leveraging proprietary data for analytical advantage, analytics on the web, analytics of online engagement, applying analytics at production scale, predictive analytics in the cloud, analytical technology and the business user, using analytics for improved organization performance, organizing analysts, engaging analytical talent, analytics governance, and building a global analytical capability, and analytics case studies in healthcare, manufacturing, HR, financial services, etc.", "prerequisite": "IST 210"}, {"department": "ETI", "number": "461", "credits": "3 Credits", "description": "A study of advanced topics in database management systems that are fundamental to effective administration of modern enterprise information systems. The objective of the course is to enable a student to comprehend a range of issues in modern database management and administration. The students will learn advanced SQL, database system development lifecycle topic that include: database planning, requirements and design, database selection and application design, prototyping, implementation, testing operational and maintenance; database performance tuning concepts, monitoring the system for improved performance, and DBMS performance tuning; database transaction management covering transactions and the ACID properties, concurrency control techniques, and database recovery management; query processing and optimization techniques via query decomposition and optimization options; introduction to distributed processing and distributed database concepts, components and characteristics of DDBMS, and distributed database design; web connectivity technologies and XML; introduction to Business intelligence and data warehouses; introduction to Big data, NOSQL and cloud databases; and database security and database administration.", "prerequisite": "IST 210"}, {"department": "ETI", "number": "463", "credits": "3 Credits", "description": "Today, most enterprise databases are no longer a centralized data store that is accessed by thousands of users from multiple locations which may be globally situated. These databases are typically web-based and distributed across multiple sites for availability, low latency and better reliability. This course exclusively focuses on the design and system issues related to such distributed database systems. An initial review of relational DBMS is required in the first week of the course. Students will learn the architectural options and design issues and choices for DDBMSs. Design considerations include fragmentation alternatives (vertical or horizontal), fragment allocation and the data directory. Database integration covers at schema matching, integration, and mapping. Data cleaning is also studied under database integration. Processing distributed queries is challenging, and this topic is studied next by first trying to understand the query processing problem followed by: the objectives for query processing, characterization of query processors and layers of query processing. Query decomposition and localization of distributed data is then studied. The next issue is the problem of optimizing distributed queries using various techniques such as centralized query optimization, join ordering in distributed queries and distributed query optimization using dynamic, static. Semi-join and hybrid approaches. The ACID properties of transactions are studied and different types of transactions, and this is followed by distributed concurrency control using techniques such as locking, timestamps, and optimistic concurrency control algorithms. Deadlock management which is a problem in concurrency control schemes is also studied. Distributed reliability to address failures in DDBMSs is addressed by studying local reliability protocols, distributed reliability protocols, dealing with site failures and network partitioning. Data replication is an important aspect of reliability and various replication update management strategies and replication protocols are studied. Modern databases are web-based and this topic is considered next. Topics studied include: web searches, web querying and distributed XML processing. Many databases have moved to the cloud and cloud data management covers: cloud deployment models, service models SQL data services, and so on.", "prerequisite": "IST 220"}, {"department": "ETI", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "ETI", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "ETI", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses offered infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "ETI", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]