[{"department": "FDSC", "number": "105", "credits": "3 Credits", "description": "This course is an introduction to the central role of food and food production in all areas of human life. The social and technological bases of various food systems are examined from the hunter-gatherer to the agrarian to the modern industrial system and its discontents. The course also considers how different types of food (e.g., meat, milk, cereals, chocolate) are preserved and distributed, examining both the effects of the development of the science and technology on society and vice versa. The roles of various food components (e.g., proteins, carbohydrates, fats, and vitamins) are examined both within the foods as determinants of quality, and also in terms of human nutrition and health. Finally, various other ways food may be considered appropriate or inappropriate will be studied including scientifically based reasons (e.g., safety, taste, adulteration) and non-scientifically based reasons (e.g., ethical, legal, religious).", "other": ["Cross-listed with: STS 105", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "FDSC", "number": "134", "credits": "3 Credits/Maximum of 3", "description": "This course studies the ethical and social issues connected to food, personal and cultural eating habits, body image and ideas of health, and agricultural practices and industrialized food production. We will discuss the following sorts of questions: In what ways are cooking and eating central to our human identity? What do judgments about being anorexic, overweight, or eating unhealthily mean and do? How strong are the arguments for vegetarianism, veganism, or raw-food-ism? Ought we to eat as our Paleolithic ancestors did? If the future holds engineered meat, GMO fruit, and Soylent shakes, what are we to think? Should food-companies be allowed to advertise to children? Is alcohol more like food, like medicine, or like drugs? Students will pursue answers to such food-ethical questions by learning relevant moral and social theory, discussing past and contemporary approaches to these issues, and analyzing case studies. We will pay particular attention to food as a symbol with psychological, social, and spiritual meanings and effects.", "other": ["Cross-listed with: PHIL 134", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "FDSC", "number": "150S", "credits": "2 Credits", "description": "This first year seminar course was designed to facilitate transition into college with a particular emphasis on food sciences. This course is structured into two main modules, (1) general academic requirements (such as expectations) and (2) the field of food science. Topics related to fulfilling academic requirements provides students with resources related to academic advising, time management, student support services, getting to know the college, and student affairs. In the first module, our aim is that (1) students will able to identify and understand opportunities that exist within academic-related support services at Penn State and (2) become familiar with major requirements and understand as well as interpret degree audits. In the first module, our aim is that (1) students understand what food science is, (2) identify and understand extracurricular and curricular opportunities within food science, and (3) identify and understand career opportunities within the food science field. Specific examples of topics related to module two are faculty huddle assignments (series of faculty-driven guest speaker series), hands-on activities related to food microbiology and safety, food engineering, food chemistry, and food choice, and team building challenge tasks (e.g., Chef Microbe and The Food Waste Challenge).", "other": ["First-Year Seminar"]}, {"department": "FDSC", "number": "200", "credits": "3 Credits", "description": "General overview and principles; food constituents and properties; quality and safety; preservation methods; processing animal and plant products.", "prerequisite": "CHEM 110"}, {"department": "FDSC", "number": "201", "credits": "1 Credits", "description": "Demonstration to illustrate actual chemical reactions in food systems and visits to campus and area food processing operations.", "prerequisite": "or concurrent: FD SC200"}, {"department": "FDSC", "number": "205", "credits": "3 Credits", "description": "Organization and administration of food plant sanitation with emphasis on the production and maintenance of safe, wholesome food products.", "prerequisite": "FD SC200"}, {"department": "FDSC", "number": "206", "credits": "3 Credits", "description": "Modern philosophies coupled with practical information on improving product quality, including topics on HACCP, SPC, recall procedures and customer relations.", "prerequisite": "FD SC200"}, {"department": "FDSC", "number": "207", "credits": "2 Credits", "description": "Composition, safety, palatability, preservation, and processing of foods from animals, impact of animal production and handling practices on product properties. FDSC  207 / ANSC 207 Animal Products Technology (2) This course is intended to give students knowledge and understanding of production and processing of foods derived from animals (meat, milk, and eggs). Upon completion of this course students will be able to describe and explain the physical and biochemical characteristics of muscle foods, milk, and eggs. Students will be able to describe and compare harvesting, processing, and preservation procedures used in preparation of animal products for human consumption. Students will be prepared to predict the impact of variations in animal production, handling, harvesting, and product processing on meat, milk, and egg product characteristics. This is one of a group of courses dealing with foods from animals. Related courses offered in Animal Science covers animal growth and development and evaluation of animals and meat products. Related courses in Food Science cover food microbiology, food chemistry, and meat and dairy processing technology. The content of this course is intended to emphasize the connection between animal production and the resulting food products. FDSC  207 / ANSC 207  is intended to be of general interest to people who produce or eat animal products and thus is an integral part of the Animal Sciences major. This course will also be useful for strengthening meat industry knowledge for students in Food Science. FDSC  207 / ANSC 207 will be offered one semester per year. Student performance will be evaluated through written exams, quizzes, and written reports.", "other": ["Cross-listed with: ANSC 207"]}, {"department": "FDSC", "number": "208", "credits": "1 Credits", "description": "Harvesting and processing of foods from animals; hands-on and demonstration exercises; industry procedures for processing meat, milk, and egg products.  FDSC 208 / ANSC 208 Animal Products Technology Laboratory (1) This laboratory is intended to be taken along with or following Animal Products Technology lecture. Providing students with an opportunity to experience the procedures involved in harvesting and processing foods from animals. Upon completion of this course students will be able to describe, demonstrate, and explain procedures commonly used in harvesting and processing of muscle food, milk, and egg products. Students will be able to recognize and predict the impact of incorrect procedures for harvesting and processing muscle food, milk, and egg products. The course includes hands-on exercises and demonstrations that allow students to experience the \"look and feel\" of industry procedures used in harvesting and processing meat, milk, and egg products for human consumption. Focus on issues related to food safety and food quality. Student performance is evaluated through weekly written reports, and a final lab exam.", "prerequisite": "or concurrent: AN SC207", "other": ["Cross-listed with: ANSC 208"]}, {"department": "FDSC", "number": "223", "credits": "3 Credits", "description": "Fermented beverage production has been a driving force for scientific discovery and as such is a wonderful way to introduce areas of scientific knowledge. This course will use beer, wine, and other fermented products, as well as their ingredients to teach core scientific concepts. These concepts will include the biology of fruit development, the microbiology of wine and beer production, the physics of carbonated beverages, and the flavor chemistry induced through fire. Through these areas, students will learn critical thinking skills, as well as apply what they have learned to practical problems including utilizing some of the key mathematical equations used in beer and wine production. Upon completion, students will be expected to be able to understand key elements of fermented beverage production, along with the science behind it, and to be able to apply that knowledge to practical problems.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "FDSC", "number": "233", "credits": "3 Credits/Maximum of 3", "description": "Introduction to the principles of wine production emphasizing basic wine grape biology, fermentation science, wine chemistry, and wine perception. FDSC 233 / HORT 233 provides an interdisciplinary treatment of the science of grape growing, vinification, and wine consumption. Students will learn how viticultural practices translate to wine chemistry, and how key variables associated with that conversion affect consumer perception. The course will cover topics such as basic grapevine physiology, vineyard management practices, vinification, domestic and international wine styles, and consumer interactions with wine (e.g., sensory evaluation, health aspects of wine). Although the course is considered to be introductory, students must have a basic grounding in university-level chemistry and biology. Course material will be primarily transmitted through lectures, reading assignments to be completed outside of class, and brief practical exercises in the Sensory Evaluation Center (Department of Food Science).", "prerequisite": "CHEM 110", "other": ["Cross-listed with: HORT 233"]}, {"department": "FDSC", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "FDSC", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "FDSC", "number": "400", "credits": "3 Credits", "description": "The focus of this course is food macro-components (water, proteins, lipids, carbohydrates) as well as food structure (phase behavior, dispersions). Food micro-components are covered in FDSC 410. Students will enter the class with a basic knowledge of chemistry and leave understanding food as a chemical system. Students will learn the important molecules in foods and how their reactions are influenced by food processing and affect food quality. They will also learn how to select and implement appropriate methods to quantify the composition and reactions of food through chemical analysis. This course has a required laboratory component.", "prerequisite": "FDSC 200"}, {"department": "FDSC", "number": "402", "credits": "1-3 Credits/Maximum of 5", "description": "Theories and experiences of teaching and learning relevant to food science and to the work of a teaching assistant. This course provides an introduction to the ways topics in food science can be effectively taught to diverse populations. Students will serve as a teaching assistant in a food science course and in addition meet regularly as a group to reflect on their experience as learners and teachers in the context of readings from the educational literature. The focus on the class is on the teaching of food science topics, so special attention will be given on laboratory and project based learning as well as teaching to industry short courses and in the context of cooperative extension. This course is only available to students currently serving as undergraduate teaching assistants in food science and enrollment is by permission of the instructor.", "prerequisite": "Junior or senior standing in food science. Permission of"}, {"department": "FDSC", "number": "403", "credits": "3 Credits", "description": "The field of Sensory and Consumer Science is primarily focused on responses of consumers to food products and non-food fast-moving consumer goods (e.g., shampoo). These responses may be sensory/perceptual (i.e., how sweet, how bitter, how smooth) or affective (i.e., liking / preference), with the assumption that the former generally drives the later. Numerous tools have been developed by sensory practitioners over the last 70 years, with additional influences from experimental psychology. The course also addresses contemporary research on pedagogy that indicate applied statistics are best taught in context to the field in which students will apply the statistical concepts. Here, students will gain practice applying introductory statistical topics (t-tests, Analysis of Variance, etc) to sensory and consumer data collected from human participants.", "prerequisite": "STAT 250"}, {"department": "FDSC", "number": "404", "credits": "3 Credits", "description": "Sensory evaluation of food, methods of test analyses, panel selection and training, taste sensation theory, consumer testing methods.  FD SC 404 Sensory Evaluation of Foods (2) This course is designed to demonstrate how the senses function in the perception of tastes, flavors, and textures of foods and how sensory tests are used to measure human perceptions. Students will have the opportunity to design sensory tests and apply statistical methods when interpreting sensory test results. The overall objective of this course is to learn the theories and practical applications of sensory evaluation that will enable students to conduct valid sensory tests and use the test results in the decision making process in food product development.Evaluation will be based on written essay exams, group reports, and written lab reports in which they will be expected to demonstrate their understanding of theoretical issues regarding sensory testing and how to use statistical procedures to effectively interpret the test results. This course is a support course for the Food Science major.", "prerequisite": "STAT 250"}, {"department": "FDSC", "number": "405", "credits": "3 Credits", "description": "Engineering principles of importance to food manufacturing, including units, dimensions, mass and energy balance, fluid flow, rheology, heat transfer, and psychrometrics.  FD SC 405 Food Engineering Principles (3)Food engineering will discuss the principles of the various unit operations used in the food processing and manufacturing industry. Topics covered will include: units, dimensions, mass and energy balance, fluid flow, rheology, heat transfer, psychrometrics. Through lectures, the student will learn the principles of fluid flow, heat transfer and mass transfer as applied to food processing and manufacturing operations. Through practicum sessions, the student will be exposed to practical applications in the above three areas. Additionally, they will learn to analyze experimental data, organize and communicate thoughts in a logical fashion through cooperative and collaborative learning strategies, and to write effective lab reports. Through practicum sessions, they will also learn numerical problem solving and to size and select equipment for fluid flow, heat transfer and drying operations within the food industry. Student evaluation within this course will be conducted through weekly quizzes, home works, lab write-ups and three exams. This is a required course for the food science major. This course serves as a prerequisite for several 4th year required courses within the food science major.", "prerequisite": "MATH 110"}, {"department": "FDSC", "number": "406W", "credits": "3 Credits", "description": "Physiological mechanisms involved in thirst and appetite, digestion, absorption, utilization of nutrients, respiration, and body temperature regulation.", "prerequisite": "FD SC 200, FD SC 201, B M B  211  CONCURRENT: FD SC 200; FD SC 201", "other": ["Writing Across the Curriculum"]}, {"department": "FDSC", "number": "407", "credits": "3 Credits", "description": "Food Toxins focuses on natural and synthetic toxins that are relevant to the food system including those produced by food plants; those introduced by contamination of foods by microbes, non-food plants, or environmental/agricultural chemicals. The course provides an overview of basic principles of toxicology and the approaches used to study the potential toxicity of a compound. Using this foundational information, the course explores the sources, biological effects, and mechanisms of action of various classes of food-relevant toxins including: plant defense molecules, agricultural chemicals (pesticides/herbicides), industrial chemicals, environmental contaminants, microbial toxins, and process-induced toxins. Student knowledge will be assessed using a combination of exams, projects, and in-class discussion activities.", "prerequisite": "BMB 211"}, {"department": "FDSC", "number": "408", "credits": "3 Credits", "description": "Food Microbiology focuses on the application of microbiological principles to foods and food ingredients. Topics covered include: potential for microbial growth in a particular food or food ingredient based on the following parameters - biological structure, nutrient composition, naturally occurring inhibitors, pH, water activity, oxidation reduction potential, temperature, atmosphere conditions and humidity; choice of appropriate microbial detection methods for groups of organisms and foodborne pathogens; identification of types and the consequence of growth of pathogens and non-pathogens associated with particular commodities; evaluation of the effect of different processing conditions on the destruction, survival and growth of spoilage and pathogenic microorganisms; identification of significant factors affecting the association of pathogens with food and food ingredients, events leading to infection and/or intoxication, and prevention and control of foodborne illness; comprehension of the importance of food microbiology in everyday living. Student knowledge will be evaluated through examinations and other class activities", "prerequisite": "MICRB 201"}, {"department": "FDSC", "number": "409", "credits": "2 Credits/Maximum of 2", "description": "Methods of isolation, detection of spoilage, pathogenic microorganisms in foods; effects of processing and preservation on survival of food microorganisms. FD SC 409W Laboratory in Food Microbiology (3) Food Microbiology Laboratory is intended to demonstrate microbiological concepts through the appropriate use of equipment and laboratory procedures. The laboratory focuses on the practical application of microbiological principles to foods and food ingredients based on the following experiences: development of proficiency in using selected microbiological techniques currently employed in regulatory, quality control and research laboratories; performance of specific microbiological analyses of foods to assess numbers and kinds of spoilage organisms or foodborne pathogens; evaluation of the effects of several processing methods on growth and survival of microorganisms. The course emphasizes problem solving and critical thinking as manifested by communication skills (such as writing); scientific analysis of data, including statistics where applicable; and usage of primary scientific sources in the food microbiology literature. Practical laboratory skills are assessed through measurement of proficiency Evaluation will be conducted via projects and examinations throughout the semester. this course is required for Food Science majors. Practical laboratory skills are assessed using written lab reports, projects, and examinations.", "prerequisite": "MICRB 202"}, {"department": "FDSC", "number": "410", "credits": "3 Credits", "description": "The focus of this course is food micro-components (enzymes, allergens, secondary metabolites, contaminants, etc.) as well the major chemical reactions occurring in foods (lipid oxidation, thermal reactions). They will also learn how to select and implement appropriate methods to quantify the composition and reactions of food through chemical analysis. This course has a required laboratory component. This is the second part of a two-course sequence with food macro-components and structure being covered in the pre-requisite, FDSC 400.", "prerequisite": "FDSC 200"}, {"department": "FDSC", "number": "411", "credits": "3 Credits/Maximum of 3", "description": "Principles and applications of Hazard Analysis Critical Control Points. Statistical tools for the control and improvement of food quality. FD SC 411 is an introduction to organizational and HACCP concepts related to quality food production. FD SC 200, FD SC 201, STAT 250 and FD SC 408 are the prerequisite courses for FD SC 411. It is expected that students will have a understanding of the following statistical concepts: measures of central tendency and variability, use of histograms, discrete probability distributions (binomial, Poisson), random variables, continuous probability distributions (the normal distribution), the Central Limit Theorem, confidence interval estimation, means comparison, correlation, simple linear regression, use of scatter diagrams, intrinsic and extrinsic factors governing microbiological growth, the basis of food preservation techniques, knowledge of specific food-borne pathogens and the products they are commonly associated with, and basic microbial testing procedures. The course will include practice in the form of problem sets and \"mini-labs\" and provide time for recitation. In addition, it will allow the students to pursue the following topics: root cause analysis (1 period), design of experiments (5 periods), and shelf life determination (4 periods).", "prerequisite": "STAT 250"}, {"department": "FDSC", "number": "413", "credits": "3 Credits/Maximum of 3", "description": "Investigate the physical and chemical behavior of plant-based raw materials and ingredients, with emphasis on parameters influencing finished product quality.  FD SC 413 Science and Technology of Plant Foods (3) This course focuses on the unique importance of foods produced from plants to human health and wellness. The influence of cultural practices, harvesting and handling methods and processing technology on quality and safety of whole, fresh and processed food products using minimal processing and fermentation to preserve food products from plant sources will be emphasized.", "prerequisite": "FD SC 200, FD SC 201.  And at least 2 of the following 400 level courses:  FD SC 400; FD SC 405; FD SC 408; FD SC 410"}, {"department": "FDSC", "number": "414", "credits": "3 Credits/Maximum of 3", "description": "Investigate the physical and chemical behavior of dairy-based raw materials and ingredients, with emphasis on parameters influencing finished product specifications.  FD SC 414 Science and Technology of Dairy Foods (3)FD SC 414 provides students with information about the composition, properties and physiochemical aspects of milk and milk products and an understanding of the changes that occur in milk during processing into a variety of dairy products. Laboratory exercises are held weekly and complement the topic being addressed in lecture. A semester-long group project is conducted during the course to help students integrate knowledge gained throughout the Food Science Curriculum. The project focuses on a \"real life\" product development problem and requires students to develop problem statements, design experiments, design formula and processing schemes, obtain ingredients and actually manufacture a product. Time is allotted in the laboratory schedule for some group activities; other are scheduled outside of class.", "prerequisite": "FD SC 200, FD SC 201.  And at least 2 of the following 400 level courses:  FD SC 400; FD SC 405; FD SC 408; FD SC 410"}, {"department": "FDSC", "number": "415", "credits": "3 Credits/Maximum of 3", "description": "Investigate the physical and chemical properties of muscle food commodities, with emphasis on muscle-based ingredients in formulated foods.  FD SC 415 Science and Technology of Muscle Foods (3)This course applies food science and technology to the processing, storage and handling of red meat, poultry, and seafood products. The course includes two lectures and one lab session each week. The laboratory sessions are conducted in the Meat Laboratory located on Porter Road. Student performance is evaluated based on exams, lab reports, and homework exercises. Course objectives are set to: 1. help students understand the nature and importance of structure, compositional and quality differences among muscle food ingredients and their impact on product manufacturing, 2. inform students of the basic steps of primary processing for livestock, poultry and seafood species and their impact on meat properties, 3. give students first-hand experience with typical manufacturing steps and processes for fresh, cured, smoked, fermented, dried or cooked meats and help them understand how variations in processing will affect finished product properties, and 4. give students practice in applying the scientific method in answering questions or solving problems that may arise during the manufacture of muscle foods products. Course activities draw on the students' prior knowledge of food chemistry, food engineering, food microbiology and food analysis, applying concepts from those disciplines in the manufacture and evaluation of meat products. Course topics cover the range from meat science through technical and practical aspects of meat product manufacture including product quality, safety, profitability and regulatory issues. There is emphasis on meat industry practices including traditional and recent technology. Through laboratory exercises and independent group projects students gain experience in application of the scientific method for solving product development problems.", "prerequisite": "FD SC 200, FD SC 201.  And at least 2 of the following 400 level courses:  FD SC 400; FD SC 405; FD SC 408; FD SC 410"}, {"department": "FDSC", "number": "417", "credits": "3 Credits", "description": "This course provides a perspective to the principles and practice of food law and regulation as they impact the work of a food scientist. Food law will be discussed with reference to the roles of politics, culture, ethics (including social justice issues), science and business. The learning approach to this course uses case studies, problem solving, class discussions, and review of current topics. While some examples will be globally relevant, the focus of the course is on the regulation of food in the US.", "prerequisite": "FDSC 200"}, {"department": "FDSC", "number": "422", "credits": "1 Credits", "description": "This course provides opportunities to develop effective communication skills within the context of scientific research. Students participating in independent studies with faculty mentors will use their independent research projects as the subject of a series of exercises that will enhance their abilities to share scientific ideals and findings with a variety of audiences including grant writing, poster presentations, and both technical and non-technical oral presentations about research topics. This course will prepare students for graduate school and, importantly, provide students with a set of skills that would be applicable to any career.", "other": ["Cross-listed with: AG 422"]}, {"department": "FDSC", "number": "430", "credits": "3 Credits", "description": "Thermal processing, refrigeration, freezing, dehydration, and concentration in the food industry, including effects on food quality; food packaging; waste management.  FD SC 430 Unit Operations in Food Processing (3)Unit Operations in Food Processing will discuss major unit operations used in the food processing and manufacturing industry. Topics covered will include: thermal processing, microwave heating, extrusion, food packaging and waste management. Through lectures, the student will learn the principles of selected unit operations in food manufacturing, and the effects of input and operational parameters on performance and food quality. Through practicum sessions, the student will be exposed to practical applications in the above areas. Additionally, they will learn to analyze experimental data, organize and communicate thoughts in a logical fashion through cooperative and collaborative learning strategies, and to write effective lab reports. Through practicum sessions, they will also learn numerical problem solving and to size and select equipment for food manufacturing operations. Student evaluation within this course will be conducted through weekly quizzes, home works, lab write-ups and two exams. This is a required course for the food science major.", "prerequisite": "FD SC405 , FD SC400 , FD SC408"}, {"department": "FDSC", "number": "444", "credits": "3 Credits", "description": "The food science major seeks to educate students in the sciences and technologies important in the industrial manufacture of food and food scientists tend to value foods in this context. Food is good if it can be manufactured at scale, distributed and sold at a profit. The qualities of the food can be defined in largely physical terms (e.g., price and costs, free from pathogens, certain levels of defined nutrients, good sensory scores, stability, and uniform and predictable properties). However, deservedly or not, food attracts more ethical attention than other goods.  For food scientists to fail to appreciate the different values, theirs and others, that impact arguments about food is harmful for (i) the food scientists themselves who may feel conflicted if they cannot resolve their personal preferences for food (perhaps local and organic) with the value set of their profession. (ii) the quality of the public conversation around food if scientists and technicians cannot usefully contribute their perspectives and (iii) the food companies that employ the scientists and who seek to make and sell products acceptable to a set of consumers. The first part of the course will focus on some foundational ideas useful to all controversies. A background in toxicology (or, if most of the projects are around the healthfulness as opposed to the risks of food, nutrition), epistemology in science, critiques of sciences, science as a social construct, ethics. The second part of the course will use current controversies to examine the ways different values combine with empirical scientific facts to create arguments about foods. Students are not taught to 'win' arguments but rather examine how they are structured and why they are appealing to different people. Students will use concepts from social science and philosophy (ethics, epistemology) to critique the strong normative opinions of guest speakers and readings. Throughout the course they will work in groups around projects on specific current controversies related to the formulation or manufacture of foods. They will collect and critique the scientific facts available and then respond to the speakers/readings by generating multiple different arguments reflecting the different perspectives ('how might the speaker think about my case?').", "prerequisite": "FDSC 200"}, {"department": "FDSC", "number": "450", "credits": "3 Credits", "description": "This course provides upper-level undergraduate students in the Food Science major with project-based learning experience in food innovation and product design. Working in small groups, students will use their foundational and technical knowledge in food science to address a new product challenge of interest to the food industry sponsor or an equivalent client. Student groups will complete their new product design experience based on one of the challenges provided. They will design and produce an actual new product prototype that will be evaluated by the course instructor, industry sponsor and qualified individuals as appropriate. While a large percentage of the work will be performed in a laboratory setting (students will spend an average of 3 hours/week in laboratory engaged in product design-focused projects assigned by company sponsors in the Department of Food Science Wet Pilot Plant), all students enrolled in FDSC 450 will also meet as a group with the course instructor twice per week (two 50 min session). Weekly discussion topics will address themes such as project and team management, market trends, effective team work, concept and prototype development, experimental design, recipe management and shelf life as well as what it is like to work in product development in the food industry. Final project reports are due during finals week.", "prerequisite": "FDSC 200"}, {"department": "FDSC", "number": "460", "credits": "1 Credits/Maximum of 3", "description": "FDSC 460 / INTAG 460 is designed to give food science undergraduate and graduate students an appreciation of how food is produced and processed abroad. Students participate in a number of production facility tours, interact with local food scientists and food technologists, and gain valuable international experience. A major point of emphasis for the course is comparing and contrasting food production norms in the U.S. and the host country or region. The course consists of pre-trip lectures and meetings and culminates in a faculty-guided embedded study tour. Prior to the travel component of the course, students work in small groups to research a specific food product that is of economic and cultural importance to the country or region of interest, then write reports to be presented in-country before a tour of the related product's production facility. The course integrates and builds upon core concepts in food chemistry and food microbiology; as such, FDSC 460 / INTAG 460 is targeted towards upper-level food science undergraduate students, as well as food science graduate students.", "prerequisite": "FDSC 200", "other": ["International Cultures (IL)"]}, {"department": "FDSC", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study directed by a faculty supervisor that culminates in the production of a Food Science honors thesis.", "prerequisite": "junior or senior status in the Schreyer Honors College and   permission of the Food Science honors advisor", "other": ["Honors"]}, {"department": "FDSC", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of acitvity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Full-Time Equivalent Course"]}, {"department": "FDSC", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "FDSC", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "FDSC", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]