[{"department": "FORT", "number": "100", "credits": "1 Credits", "description": "A general introduction to forest ecology, history, management, and practices.", "other": ["First-Year Seminar"]}, {"department": "FORT", "number": "105", "credits": "3 Credits/Maximum of 3", "description": "FORT 105 is a first year, three credit course required for the completion of the associate degree in Forest Technology. The course covers the techniques, procedures, and equipment used to measure tree and forest parameters, including various forest products. The course also covers statistical concepts and sampling and includes the use of current computer software. The course includes lectures and students improve their skills in weekly field lab exercises. The course objectives include that students learn the principles, techniques, tools, and technologies used in forest measurements, the use of statistics as related to forest measurements, to prepare and write comprehensive, professional reports, and to work cooperatively as a crew member under field conditions by always performing accurate, safe work, and by following directions and assignments of the instructor."}, {"department": "FORT", "number": "110", "credits": "3 Credits", "description": "Application of forest mensuration, mapping, GIS, sampling, and statistical analysis to the inventory of forest resources.  FORT 110 Forest Inventories (3) FORT 110 is a 3-credit, field-lab-oriented course that is a continuation of FORT 105 (Forest Mensuration) and builds upon other forestry, math, and English courses. Students will apply the principles of tree measurements to the inventory of forest resources. The major inventory systems will be covered as well as sampling techniques and statistical analysis of data.The management and stewardship of forest resources depends upon the collection, analysis, and conveyance of quantitative and qualitative data that describe forest resources. The data is used to make informed, science-based management decisions concerning the growth, health, and/or volume of forest resources. The basis of the course is learning how to plan, conduct, coordinate, and summarize forest inventories.The course objectives are for students to develop an understanding of sampling techniques and statistical analysis in the inventory of forest resources, learn how to use forest inventory systems currently used in natural resource management, conduct inventories that are cost-efficient and that meet predetermined sampling standards, learn to accurately and efficiently process and compute inventory data by hand and computer, learn to prepare and write comprehensive, professional cruise, and inventory reports for supervisors and/or clients, and learn to work well as a member of an inventory crew under field conditions. Conducting accurate and safe work, following directions, and the assignments of supervisors and instructors is imperative.Course grades will be based on lecture exams, a cumulative final, quizzes, lab reports, assignments, and class attendance and participation.", "prerequisite": "FORT 105"}, {"department": "FORT", "number": "140", "credits": "3 Credits/Maximum of 3", "description": "Plane surveying for forestry applications using compass, survey equipment, and GPS; topographic map reading, deed research, and land descriptions.  FORT 140 Forest Surveying (3) FORT 140 is a three-credit, field-lab-oriented course that reinforces the skills gained in FORT 130 (Forest Mapping Systems) and MATH 081 (Technical Mathematics). Students will apply the principles of mapping and mathematics to land surveying techniques used by forest technicians and foresters.The course objectives are for students to learn to measure horizontal and vertical angles and distances in the field, perform boundary, topographic, and road surveys, use USGS topographic maps, and become proficient with deed and boundary research.Course grades will be based on exams, quizzes, lab reports, assignment,s and class attendance and participation.", "prerequisite": "MATH 021"}, {"department": "FORT", "number": "150", "credits": "3 Credits", "description": "Taxonomy, identification, ranges, and uses of important U.S. timber species and lesser vegetation of a regional nature.  FORT 150 Dendrology (3) FORT 150 is a first-semester, 3-credit course for students in the Forest Technology program as well as interested students in other academic programs. It is a field course that is focused on taxonomy, nomenclature, ecology, and silvics of common forest plant species. Students are exposed to native and introduced to plant species in south central Pennsylvania. Scientific names, common names, geographic ranges, and economic importance are taught. Students learn to identify plants by key characteristics: arrangement, bark, buds, flowers, fruits, general form, and leaves. Basic plant biology as well as ecological relationships are covered. Information learned in this course serves as the foundation for future courses, including FORT 110 (Forest Inventories) and FORT 160 (Silvicultural Practices).Course objectives are for students to gain an understanding of the rules of scientific nomenclature, to know the meanings of scientific terms used in dendrology, to identify 100-plus different woody plant species, to know ranges and site requirements for major species, and to know and be able to spell correctly the common and scientific names (family, genus, and species) of plants.Grading and course structure will be based on daily field quizzes, a mid-term examination, and field and written final examinations."}, {"department": "FORT", "number": "160", "credits": "3 Credits", "description": "Principles and techniques of forest establishment, culture, and regeneration systems.  FORT 160 Silvicultural Practices (3) FORT 160 is a second- semester, three-credit course in the Forest Technology program. It builds upon the knowledge of silvics introduced in FORT 150 (Dendrology). It combines the tools of FORT 105 (Forest Mensuration) with basic ecology and enables students to understand the processes and management alternatives in the forest ecosystem. This is a lecture class supplemented with weekly field laboratory sessions. The lab sessions allow students to experience silvicultural practices through design and implementation.The course objectives are for students to develop an understanding of silvics of North American forests, to understand silvicultural relationships, and to be able to write and administer silvicultural prescriptions.Course grading will be based on lecture exams, a cumulative final, lab reports, assignments, and attendance and participation.", "prerequisite": "FORT 150"}, {"department": "FORT", "number": "170", "credits": "3 Credits", "description": "Forest harvesting and intermediate operations: forest worker safety, hand and power tools, harvest planning, and best management practices.  FORT 170 Forest Harvesting and Operations (3) FORT 170 is a three-credit, applied field-oriented course in the Forest Technology curriculum. The course is offered in the four-week summer intersession following completion of the second semester. Students will be introduced to woods safety and the identification of hazards; the safety and use of hand and power tools used in forest harvesting and intermediate operations; and logging equipment safety, maintenance, and operation. Axes, crosscut saws, chain saws, heavy logging equipment including logging skidder, bulldozer, and woods tractor will be used.Students will work in crews to complete a forest harvest or thinning operation from beginning to end including: forest inventory and stand analysis; the use of best management practices; the development of an erosion and sedimentation plan; harvest planning and layout; forest stand marking; and the harvest of the marked forest stand.Daily performance is evaluated based upon safety, effort, and motivation, skill improvement, cooperation, and attendance. Course grades will be based on quizzes, assignments, and daily performance.", "prerequisite": "FORT 110"}, {"department": "FORT", "number": "175", "credits": "1 Credits", "description": "Field tour of local and regional forest products industries.  FORT 175 Forest Products Industry Tour (1) FORT 175 is a 1-credit, field-based course in the Forest Technology curriculum. The course is offered in the 4-week summer intersession following completion of the second semester. It provides students with the opportunity to visit and tour forest products industries. Tours of sawmills, pulp and paper facilities, plywood factories, and other manufacturing industries are incorporated into a 3-to 4-day field trip in the Mid-Atlantic region. This course provides a basic understanding of forest products industries for FORT 250 (Forest Management Practices).The course objectives are for students to develop an understanding of general industrial and manufacturing sectors of forestry and to learn and apply basic concepts of business, economics, and management in relation to forest products.Course grades will be determined by the level of participation at each forest products industry visited and by the quality of trip reports.", "prerequisite": "FORT 110"}, {"department": "FORT", "number": "200", "credits": "1 Credits", "description": "Anatomy of wood and bark; cell wall formation and composition; and identification of wood by gross and microscopic qualities.  FORT 200 Wood Identification and Properties (1) FORT 200 is a third-semester, one-credit course at Mont Alto. It will introduce students to the basic concepts of the anatomical properties of wood and bark cells. Students taking this class will learn: basic information on tree form and structure; basic information on cell wall chemical composition, formation, and structure. A significant part of the course will be learning to identify and differentiate selected hardwood and softwood species from gross and microscopic characteristics.The course objectives are for students to gain an understanding of wood formation and structure and to be able to identify assigned wood samples from gross and/or microscopic characteristics.Grades will be determined from weekly quizzes in wood identification and exams on lecture material."}, {"department": "FORT", "number": "210", "credits": "3 Credits", "description": "Selection, planting, care, and maintenance of woody ornamental plants and shade trees grown in urban, suburban, and rural landscapes.  FORT 210 Arboriculture (3) FORT 210 is a third-semester, three-credit forestry elective in the Forest Technology curriculum. The course is recommended for students who have a basic knowledge of tree/plant identification and forestry but with the instructor's permission is open to third-semester-standing students interested in arboriculture. A significant portion of the course includes labs where tree-climbing skills are taught using climbing saddles, ropes, and applicable hardware.Course objectives include an understanding of the importance of the urban-community forest, the importance of trees and woody plants, how they grow and how to care for them. Students will gain the basic knowledge and experience needed for employment in the field of urban forestry and arboriculture.Course grades will be based on assignments, lecture exams, a final examination, lab performance, and reports and quizzes.", "prerequisite": "second-year standing"}, {"department": "FORT", "number": "220", "credits": "4 Credits", "description": "Principles and concepts involved in managing the forest ecosystem in regard to fires, insects, and diseases.  FORT 220 Forest Ecosystem Protection (4) FORT 220 is a third-semester, four-credit course that builds upon information learned in FORT 150 (Dendrology) and FORT 160 (Silvicultural Practices). This course will provide students with tools to identify and understand the effects of insects, disease, and fire on individual trees, forests, and ecosystems. They will learn signs and symptoms of insects and disease, integrated pest management principles, tactics of fire suppression, and will complete the PA-130 wildland fire training course. Emphasis is placed on recognition, prevention, and control of insects and pathogens. A case-study approach is used for the major pest problems of the northeastern United States.Course objectives include development of assessment and diagnostic skills for major plant pests, recognition of signs and symptoms of abiotic and biotic disease, knowledge of integrated pest management, basic fire behavior and control techniques, and development of verbal and written communication skills.Course grading will be based on scheduled lecture exams and quizzes, a final comprehensive examination, lab reports, and participation."}, {"department": "FORT", "number": "230", "credits": "2 Credits", "description": "Remote sensing technologies applied to forest resource analysis and management.  FORT 230 Introduction to Remote Sensing (2) FORT 230 is a third-semester, two-credit course that explores the applications of aerial photography in forest and natural resource management. Both black-and-white and infrared photographs at diverse scales will be used. Photographic measurements of distance, area, and elevation will be studied. The use of aerial photos in ecological classification, forest vegetation mapping, and forest inventory will also be covered. Lab exercises will include forestry operations such as logging road layout, timber harvest mapping, and property boundary mapping. Linkages with global positioning system (GPS) and geographic information systems (GIS) will be stressed.The course objectives are for students to develop skills in interpreting and using aerial photos for forest resource management.Grading will be based on tests, quizzes, lab exercises, and student participation.", "prerequisite": "GEOG 160"}, {"department": "FORT", "number": "240", "credits": "3 Credits", "description": "The study of forest soils and hydrology, especially as they are affected by forest management activities.  FORT 240 Forest Soils and Hydrology (3) FORT 240 is a fourth-semester, three-credit course in the Forest Technology program. The course includes the study of soils and forest hydrology, especially as they are affected by forest management activities. Land reclamation activities in the reclamation and re-vegetation of disturbed sites found in the coal mining areas of Pennsylvania are also considered. This course uses outdoor and indoor labs to reinforce material discussed in lectures.Course objectives are for students to develop an understanding of the physical, chemical, and organic properties of soils, of forest hydrology, and the impacts of forest management activities of the reclamation process and activities, and of the importance of soil and water resources and their conservation.Course grades will be based on scheduled quizzes, lab reports, assignments, lecture exams, a cumulative final, and attendance and participation.", "prerequisite": "second-year standing"}, {"department": "FORT", "number": "250", "credits": "3 Credits", "description": "Practical techniques for implementing management plans for forest stands under various ownerships and management regimes.  FORT 250 Forest Management Practices (3) FORT 250 is a capstone course in the forest technology program taught in the fourth semester. It will give students the opportunity to use the various skills they have learned in other courses to develop management plans for forests managed with varying objectives. Concepts of valuation, timber procurement, and discounted cash flow will be covered. Regulatory, management certification, public sector, and private sector management issues will also be explored. The skills will be applied as students work on a semester-long management plan of a selected forest tract.The objective of the course is for students to develop skills in creating and executing forest management and timber harvesting plans in forest stands.Course grades will be based on quizzes, homework, laboratory exercises, management plans, and exams.", "prerequisite": "FORT 110"}, {"department": "FORT", "number": "260", "credits": "3 Credits/Maximum of 3", "description": "Geographic Information Systems technology including mapping and GIS data management procedures with emphasis on natural resource management applications.  FORT 260 GIS for Natural Resources Management (3) In this course, students will acquire the basics of spatial data analysis using geographic information systems technology. The course will cover acquiring data, manipulating databases, and displaying the results to solve spatial analysis problems. Problems will come largely from natural resources sciences and forest management. GIS is rapidly becoming a standard technology in many disciplines that use data having a spatial component. Students with knowledge and experience in GIS may improve their job prospects significantly.", "prerequisite": "GEOG 160"}, {"department": "FORT", "number": "295", "credits": "1-4 Credits/Maximum of 4", "description": "Supervised field experience related to the student's major.", "prerequisite": "Permission of program"}, {"department": "FORT", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "FORT", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest"}, {"department": "FORT", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]