[{"department": "FR", "number": "1", "credits": "4 Credits", "description": "Grammar, with reading and writing of simple French; oral and aural work stressed. Students who have received high school credit for two or more years of French may not schedule this course for credit, without the permission of the department.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "FR", "number": "2", "credits": "4 Credits", "description": "Grammar and reading continued; oral and aural phases progressively increased. Students who have received high school credit for four years of French may not schedule this course for credit, without the permission of the department.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "FR", "number": "3", "credits": "4 Credits", "description": "Grammar, reading, composition, oral and aural exercises.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "FR", "number": "51", "credits": "3 Credits", "description": "Intensive introduction to French: first half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  FR 051 Elementary Intensive French I for Graduate Students (3)This is the first in a series of three courses designed to give students an intensive introduction to French. This is the first half of elementary sequence in reading, writing, speaking, listening, and cultural contexts. Students will learn the French vocabulary and will learn to create simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"department": "FR", "number": "52", "credits": "3 Credits", "description": "Intensive introduction to French: second half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  FR 052 Elementary Intensive French II for Graduate Students (3)This is the second in a series of three courses designed to give students an intensive introduction to French. This is the second half of graduate intensive sequence in elementary reading, writing, speaking, listening, and cultural contexts. Students will learn the French vocabulary. Lessons are taught in an authentic cultural context.", "prerequisite": "FR   051 or equivalent, and graduate standing"}, {"department": "FR", "number": "53", "credits": "3 Credits", "description": "Continued intensive study of French at the intermediate level: reading, writing, speaking, listening, cultural contexts.  FR 053 Intermediate Intensive French for Graduate Students (3)This is the third in a series of three courses designed to give students an intermediate intensive knowledge of French. Continued intensive study of French at the intermediate level: reading, writing, speaking, listening, and cultural contexts. Lessons are taught in an authentic cultural context.", "prerequisite": "FR   052 or equivalent, and graduate standing"}, {"department": "FR", "number": "83", "credits": "3 Credits", "description": "Critical approaches to the dimensions and directions in French/Francophone literatures and cultures.  FR 083S First-Year Seminar in French (3) (GH;FYS;IL)(BA) This course meets the Bachelor of Arts degree requirements. Through the reading of texts, discussions (in-class, study groups, listservs), debates, and collaborative research projects, students are introduced [a] to French/Francophone literatures and/or cultures; [b] to the humanities and to the nature of research and scholarship; [c] to cross-cultural issues (international); and [d] to scholarly conduct and responsibilities. Students develop international competence by cultivating curiosity about and empathy for other cultures; by recognizing that social variables, such as age, gender, social class, religion, ethnicity, race, sexual orientation, and place of residence, affect the way people view the world, behave, and communicate; and by developing the ability to locate, organize, and evaluate information about he culture(s) from a variety of sources (print, electronic, people, personal observations). The points of departure for the development of all of these competencies are literary and cultural texts from France and French-speaking regions/counties of the world. All texts are in translation, and knowledge of the French language is not required. Students will be evaluated through written essays, quizzes, class discussions, and a collaborative group project. This course will prepare the students for other courses in the humanities by giving them the opportunity to gain insights into the study of the humanities through literary and cultural texts. In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them including the opportunity to develop relationships with faculty and other students who share their academic interests. The Department of French plans to offer three (twenty student limit per seminar) first-year seminars per academic year. The course fulfills the first-year seminar requirement as well as one of the humanities requirements in general education or a Bachelor of Arts humanities requirement. This course does not require any special facility or equipment to be taught effectively.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "First-Year Seminar", "General Education: Humanities (GH)"]}, {"department": "FR", "number": "111", "credits": "6 Credits", "description": "Acquisition of basic skills in the active use of French: listening, speaking, reading, and writing.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "112", "credits": "6 Credits", "description": "Reinforcement of basic skills previously acquired in the active use of French in FR 111.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "FR", "number": "121G", "credits": "3 Credits", "description": "Instruction in fundamental skills required for reading expository French prose, primarily for research purposes. (This course may not be used to satisfy any baccalaureate degree requirements.  No graduate credit is given for this course.)", "prerequisite": "seventh-semester standing", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "122G", "credits": "3 Credits", "description": "Development and reinforcement of basic reading skills, with emphasis on the individual student's area of research. (This course may not be used to satisfy any baccalaureate degree requirements.  No graduate credit is given for this course.)", "prerequisite": "FR   121G", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "137", "credits": "3 Credits", "description": "Exploration of the cultural, artistic, literary, and social life of the city of Paris. FR 137, taught in English, is an introduction to the cultural, artistic, literary, and social life of the city of Paris that pays particular attention to its transnational influences. We will explore painting, sculpture, architecture, music, dance, theater, literature, and the graphic novel as well as the history and geography of Paris. Looking at pivotal moments both past and present, the course examines what has made the city and its people through the ages. Students will read representative texts from every period and be exposed to artistic and social movements through visual presentations, films, and virtual tour.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "FR", "number": "138N", "credits": "3 Credits", "description": "This course presents a survey of important cultural and historical moments in France with a special emphasis on the ways in which these moments are represented in film. The course has a dual focus: 1.) a chronological and historical overview of major moments in 20th and 21st century French history as they have been represented, imagined and presented through the selected films and 2.) the artistic and cinematic movements and concepts that inform our understanding of these films. Beginning with WWI, the historical trajectory outlined by the course will cover the Interwar period, the Occupation and Liberation, the consumer culture of France in 1950s, France as a former colonial power and the Algerian war, France in the 60s, May 1968, France in the 1970s and les trente glorieuses, Mitterrand's 1980s, and Immigration and French identity. We will grapple with these historical moments as they have been filtered through the lens of cinema. Our attention will remain focused both on the historical time periods in which the films of the course were made as well as the moments they are representing. Our approach to the filmic corpus of the course will be one that seeks to understand and situate the films within the broader context of the aesthetic movements that have characterized film both within France and in world cinema. Movements and moments such as Poetic Realism, Neorealism, the French New Wave, Left-Bank filmmaking, cinema vérité, documentary filmmaking and le ciné du Look will serve as an artistic backdrop and provide a framework for understanding the cinematic choices of the directors studied. No prior coursework in film is required; FR 138 will introduce students to the special vocabulary and building block concepts that allow them to deeper comprehend and analyze film on a formal basis. Concepts covered include mise en scène, editing, approaches to narrative, dialogue and soundtrack, lighting, set pieces, characterization, camerawork, CGI special effects, and the technology of film making. Students can expect to come away with a set of tools to analyze not only other French films but also visual texts in general.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "FR", "number": "139", "credits": "3 Credits", "description": "An introduction to the culture of France and its impact on the world. FR 139 France and the French Speaking World (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. By studying the artistic, social and intellectual components of the French cultural ethos, the undergraduate student will develop an appreciation of a major Western European humanistic tradition and its impact and adaptation on several continents. The notion of a national culture, which has become an international phenomenon integrates a broad spectrum of subject areas in the arts, humanities, and social sciences. The elements to be articulated embrace: socioeconomic, linguistic, and demographic profiles, social stereotypes (internal, external, and colonial), social structures (family, gender, childhood/old age), and selected \"high\" and \"popular\" cultural themes (cuisine, architecture, dress, painting, social philosophy). Using today's metropolitan French culture as a point of departure, and its historical legacy, the course will explore the consequences of French cultural hegemony in various French-speaking areas (Belgium, Switzerland, North and West Africa, North America, Maghreb-Middle East, Orient). In brief, the course introduces Penn State students to the dynamics of cultural pluralism, a crucial acquisition in today's \"global village.\"", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "FR", "number": "142", "credits": "3 Credits", "description": "An introduction, in English, to French and francophone literature and cultural history through film, theater, and literature.  FR 142 French Fiction, Drama, and Film (in English) (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. Taught entirely in English with no assumption of prior knowledge of French, this course is a broad introduction to French/francophone literature and cultural history through a selection from the best-known authors and famous masterpieces of the French-speaking world. The course promotes an informed reflection on narratives, plays, and films; develops critical methods for enjoying all three genres; and may be complemented with FR 137, 138, and/or 139. The course will satisfy a General Education humanities and International Cultures requirement for students in all majors except French and Francophone Studies.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "FR", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Intensive postintermediate grammar review, with emphasis on oral skills and vocabulary building.", "prerequisite": "FR   003", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "201", "credits": "3 Credits", "description": "Emphasis on oral skills and reading for total comprehension.  FR 201 Oral Communication and Reading Comprehension (4) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed to improve French language skills, with an emphasis on speaking and reading. It aims to hone students' ability to understand a wide array of native speakers and to expand their active vocabulary; to foster discussion and debate in a range of formats; to enhance the ability to analyze films and literary texts; and to increase awareness of historical and contemporary cultural issues. It also provides opportunities for reviewing selected grammatical points and for practicing writing short interpretive and imaginative exercises. Students draw on written texts, videos, the Web, and other media to explore cultural and literary aspects of France and the Francophone world from a variety of perspectives. Evaluation methods include individual oral and written exams (30%); formal debates (20%); quizzes and homework assignments (10%); class attendance and participation (20%); and a final oral presentation (20%).", "prerequisite": "FR   003 or FR   112", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"department": "FR", "number": "202", "credits": "3 Credits", "description": "Grammar review and writing of short essays.", "prerequisite": "FR   003", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "270", "credits": "3 Credits", "description": "A critical presentation, taught in English, of changing ideas and values on race and gender in French and Francophone literatures.", "other": ["Cross-listed with: WMNST 270", "Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "299", "credits": "3-12 Credits/Maximum of 12", "description": "Writing practice at postintermediate level. Cultural readings about French civilization.", "prerequisite": "FR   199", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"department": "FR", "number": "301", "credits": "3 Credits", "description": "FOR MAJORS, MINORS, AND OTHERS WITH ADEQUATE PREPARATION; INTENSIVE GRAMMAR REVIEW, COMPOSITION, AND CONVERSATION."}, {"department": "FR", "number": "316", "credits": "3 Credits", "description": "Survey of the theory and methods of linguistics as they apply to the major subfields.  FR 316 French Linguistics (3) The goal of this course is to provide the undergraduate student with a solid overview of the theory and methods used by linguists seeking to develop a formal account of French grammar. Specifically, the student will become acquainted with the basic assumptions of the field (e.g. the prescriptive/descriptive distinction, the notion of competence versus performance, various methods of data collection, and the notion of Universal Grammar). In addition, a selection of the major subfields of linguistics will be surveyed (these include: phonetics, phonology, syntax, semantics, and morphology with the focus being on the linguistic rules found in the French language).", "prerequisite": "FR   201 , FR   202"}, {"department": "FR", "number": "331", "credits": "3 Credits", "description": "French and francophone history and culture from the Middle Ages until the French Revolution. FR 331 French and Francophone Culture I (3) (IL) This course, which fulfills the Humanities requirement within the Bachelor of Arts degree, will present a survey of French and francophone culture and civilization from the Middle Ages up to the French Revolution. The course aims to familiarize students with the major events and themes in French and francophone history of this period; prominent artistic and other cultural developments; and social and daily life. Students will gain a rich appreciation of this time period through frequent exposure to web sites, films, music and other audio-visual materials. Taught in French, the course also aims to help students develop further facility in written and spoken French through a combination of readings, writing assignments, class lectures, conversation and in-class activities. The course is designed as a complement to the French and francophone literature survey sequence. In addition, it serves as an important basis for 400-level language, literature and culture courses.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "332", "credits": "3 Credits", "description": "French and francophone history and culture from the French Revolution through the Third Republic. FR 332 French and Francophone Culture II (3) (IL) This course, which fulfills the Humanities requirement within the Bachelor of Arts degree, will present a survey of French and francophone culture and civilization from the French Revolution to the collapse of the Third Republic with the onset of World War II. The course aims to familiarize students with the major events and themes in French and francophone history of this period; prominent artistic and other cultural developments; and French social and daily life. Students will gain a rich appreciation of this period through frequent exposure to web sites, films, music and other audio-visual materials. Taught in French, the course also aims to help students develop further facility in written and spoken French through a combination of readings, writing assignments, class lectures, conversation and in-class activities. The course is designed as a complement to the French literature survey sequence. In addition, it serves as an important basis for 400-level language, literature and culture courses.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "351", "credits": "3 Credits", "description": "This course presents a survey of selected works of French and francophone literature from the Middle Ages to 1789. It aims to familiarize students with major literary works of this time period through close textual reading and analysis. Taught in French, it also aims to help students develop an appreciation for a wide variety of styles, genres, themes, literary movements, and historical contexts. It also serves to develop students' written and oral language skills. This course is designed as a complement to the French and francophone culture sequence.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "352", "credits": "3 Credits", "description": "This course presents a survey of selected works of French and francophone literature from 1789 to the present. It aims to familiarize students with major literary works of this time period through close textual reading and analysis. Taught in French, it also aims to help students develop an appreciation for a wide variety of styles, genres, themes, literary movements, and historical contexts. It also serves to develop students' written and oral language skills. This course is designed as a complement to the French and francophone culture sequence.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "397", "credits": "1-18 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "FR", "number": "399", "credits": "3-12 Credits/Maximum of 12", "description": "Advanced training in the French language skills.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "401", "credits": "3 Credits", "description": "Emphasis on speaking and listening comprehension through discussion of current issues, using journalistic materials.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"department": "FR", "number": "402Y", "credits": "3 Credits", "description": "Advanced study of the structure of the French language. Intensive essay writing.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "FR", "number": "408", "credits": "3 Credits", "description": "Translation from French to English of actual documents from the business world; theoretical consideration and systematic vocabulary building.", "other": ["International Cultures (IL)"]}, {"department": "FR", "number": "409", "credits": "3 Credits", "description": "This course prepares students to use French in a variety of professional contexts and situations via a series of interpersonal, interpretive and presentational tasks. The focus is on real world language use and developing language proficiency so that students can interact professionally with French speakers in various business, medical, scientific, environmental and humanitarian contexts. The class will work on creating materials such as a French-language cv, a cover letter and other documents that will be of use to them in their specific careers. Additionally, students will engage in a hands on group simulation project in which they create and market a start up.", "prerequisite": "FR 202", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "410", "credits": "3 Credits", "description": "Extensive readings of selected french daily and weekly newspapers and magazines, along with newscast viewings.  FR 410 French Press (3) (IL) This course, which is taught in French, is designed to introduce students to the history and current state of French press and media (including newspapers, magazines, radio and television) while introducing them to French society and culture through media coverage of current and recent events. The course is also designed to help students perfect reading, writing and oral communication in French. The course starts with a brief history of the press in France, including the creation of dailies such as Le Journal de Paris and the impact of some well-known journalists or writers upon events such as the Dreyfus Affair. It will then focus more specifically upon the origins of high-circulation, contemporary newspapers and magazines. Quickly moving to the post-WWII period, students will be introduced to radio and television in France and, as they become more familiar with French and Francophone press and media, will be given several opportunities to study current or recent events of the French and Francophone world, in fields such as sports, politics, culture and economics. Library holdings and internet sites will allow the class to regularly read daily newspapers such as Le Monde and Le Figaro and view newscasts on channels such as TF1 and FR2. Once they are familiar with the available resources, students will share research with fellow classmates through oral presentations, for example in the form of simulated newscasts. Students will also develop with the guidance of the instructor an independent, final paper which will explore some aspect of the French press and media. One of several departmental offerings in the area of French Civilization, FR 410 course can be used to fulfill a 400-level requirement for the French Business, French-Engineering, Applied French, and French Language and Culture options, as well as for the French minor. By covering the way in which the range of social identities and the cultural beliefs and values of French-speaking peoples are reflected in various media, and by assisting students in finding and assessing information about current events in the Francophone world, the course can also fulfill an 'IL' requirement. Evaluation methods include a series of short quizzes to cover historical and factual data; a short midterm paper based on primary (newspaper-based) research; a longer final paper based on primary and secondary research; other written work of a short-response nature; a group oral presentation summing up the previous week's news and events; and participation, including presence. The course is offered once a year, usually in the spring semester.", "prerequisite": "FR   331 or FR   332", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "417", "credits": "3 Credits", "description": "A formal study of the sound pattern of French.  FR 417 French Phonology (3) (IL) The goal of this course is to present an introduction to the linguistic analysis of the sound pattern of French as it is actually spoken by real speakers. by the end of the semester, the student should be able to: -transcribe French phonetically; -understand the articulatory characteristics of French and how these differ from English; -describe the relationship between French spelling and phonology -examine what gives us accent in French; -discern patterns of pronunciation in different varieties of the language; -analyze real speakers' pronunciation on your own; -create your own teaching/learning unit about some aspect of French phonologyEvaluative Methods: Student performance in this course is generally based on a series of assignments, quizzes, transcriptions, a research project and presentation, an evaluation of other students' presentations, and preparation/participation.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "418", "credits": "3 Credits", "description": "A formal theory of word order and related issues in French grammar.  FR 418 French Syntax (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. The aim of this course is to provide the upper level undergraduate student with the background needed to understand modern generative syntactic theory, as well as to eventually enable him or her to do creative and informed research in this area. Roughly three-quarters of the semester will be devoted to an in-depth overview of the historical development of generative syntax, focusing particularly on modern Chomskyan theory - the so-called Minimalist Program. The remainder will build upon and round out this knowledge of syntax by exploring in depth a number of topics that any syntactician must be familiar with in order to do informed research in the field. This section of the course will involve lectures based on close readings of articles and book chapters exploring such topics as the syntax of negation, raising verbs, auxiliary verbs, adverbs, middle constructions, and/or verb movement. (Only a subset of these topics will be discussed, selected on the basis of student interest.)", "prerequisite": "FR   201 and FR   202", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "419", "credits": "3 Credits", "description": "The study of meaning in human language with a special focus on how it is encoded in French.  FR 419 French Semantics (3) The aim of this course is to provide upper level undergraduate students in French with a relatively informal introduction to the field of semantics as it applies to the French language. Semantics is the subfield of theoretical linguistics that seeks to make explicit the rules native speakers use to interpret stable aspects of the meaning of natural language sentences. The course will begin by comparing and contrasting semantic and pragmatic aspects of meaning -an important undertaking since only the former are assumed to be subject to invariable rules of grammar. The conclusions reached in this portion of the course will then be extended to account for a very special type of language -humor -in a particular context, France. That as, it will be shown that a more complete understanding of this linguistic behavior entails recognition of the relative contributions of pragmatics and semantics. We will then turn to a survey of the classic model-theoretic approach to lexical and compositional aspects of semantic meaning, with important (sociolinguistic) refinements to the standard approach to lexical semantics being discussed in detail. With a survey of the fundamentals of the field in place, we will then undertake an investigation of specific topics in semantics, looking first at the status of thematic roles in semantic theory (focusing on work by David Dowty). Here we will examine the important implications his work holds for the initial mapping of arguments into sentence structure, not only for primary transitive verbs, but also unaccusative and psych-verbs. We will then examine current analyses of causation in French, certain aspectual distinctions, and semantic, pragmatic, and syntactic approaches to negative and positive polarity items, n-words, and minimizers.", "prerequisite": "FR   316"}, {"department": "FR", "number": "426Y", "credits": "3 Credits", "description": "Survey of key texts from sixteenth century France, with attention to historical and philosophical currents of French social thought.", "prerequisite": "FR 331", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "FR", "number": "430", "credits": "3 Credits", "description": "This course surveys contemporary French historical, cultural, economic, and political changes from the end of WW II to the present day. A significant portion of the course is devoted to examining key events and transformations of the time period. The second half explores major themes that emerge from the evolutions characterizing these tumultuous decades. Taught entirely in French, students will gain an understanding of and an appreciation for modern France through exposure to web sites, films, music, and authentic written texts.", "prerequisite": "FR 331", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "436", "credits": "3 Credits", "description": "French Theater: From \"classical unities: to Contemporary Performances.", "prerequisite": "FR   351 or FR   352", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "440", "credits": "3 Credits", "description": "Theories of second language acquisition. Current classroom practices in the teaching of Romance languages.", "prerequisite": "15 credits beyond the elementary level", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "445Y", "credits": "3 Credits", "description": "The changing relationship of the individual to society in pre-Revolutionary France will be explored in texts by major writers.", "prerequisite": "FR 331", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "FR", "number": "452Y", "credits": "3 Credits", "description": "Selected readings in romanticism, realism, and symbolism, including Balzac, Stendhal, Sand, Baudelaire, and others, with emphasis on cultural issues.  FR 452Y Nineteenth-Century French Literature (3) (IL)This course offers an overview of Nineteenth-Century French literature. It includes reading material representative of the major literary movements of the period (romanticism, realism, symbolism).  It also gives students a chance to examine a great variety of literary genres (novels, plays, short stories, poems, children's narratives among others). In addition to developing close textual reading skills, emphasis is placed throughout the semester on the larger relationship between literary production, aesthetics and Nineteenth-Century history (political systems, education, social transformations, industries and technologies, etc.). Anthologies and complete texts will be used.", "prerequisite": "FR 331", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "FR", "number": "453Y", "credits": "3 Credits", "description": "Interdisciplinary perspectives on the politics, society, and culture of France, 1880-1914.  FR 453Y LaBelle Epoque: Politics, Society, and Culture in France, 1880-1914 (3) (IL) The goal of this course is to present and analyze the period of extraordinary changes in all domains known as the \"Belle Epoque.\" The starting point for an examination of these changes is Guy de Maupassant's novel, Bel-Ami (1885), which describes the social and professional ascension of an egotistical Parisian parvenu, Georges Duroy.  The reading of this novel will allow us at the same time to study in detail one of the novel's protagonists: Paris.  Through our discussions and through consideration of a wide range of primary and secondary texts, we will examine the complex rapport between literature (as well as art) and society at the end of the nineteenth century, and we will attempt to answer questions such as: how did the changing Parisian landscape inspire the authors, artists et musicians of this era? How did the new Parisian space encourage the development of new \"places of pleasure\" cafes, cabarets, cafes-concerts, theaters, racetracks, restaurants, etc.? How did innovations in architecture and the decorative arts, which flourished under the name of Art Nouveau, reflect both social developments and the transforming profile of Paris? What was, in fact, the new social and artistic geography of the capital?", "prerequisite": "FR   351 or FR   352", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "FR", "number": "458", "credits": "3 Credits", "description": "Genesis of Franco-African literature in the 1930s; phases of the negritude movement; colonial and national literature.  FR 458 African Literature of French Expression (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. African literature in French is one of the most vigorous of the many new literatures in French that are emerging throughout the vast francophone world. Writers from a variety of countries, from Senegal to Djibouti, from Algeria to Congo, are producing works in French, that reflect their own very distinct cultural experiences. They must often modify both the French language and traditional Western genres such as the novel to convey African ways of speaking and narrating. In this course, students will read novels, poems and an epic that has been translated into French from an African language. The subjects range from autobiographical accounts of growing up in an African town and going off to Europe to study during the colonial era to sharp criticism of both the French colonial regime and the subsequent national governments that took over after independence, an event that occurred in 1960 in most francophone African countries. For the new wave of women writers that has emerged on the literary scene in the last two decades, more personal themes such as love, family, personal freedom, and the task of balancing traditional customs with the needs of contemporary life in large cities have marked their works. Students who take this course will discover the diversity of African literature written in French, the traits that distinguish this literature from metropolitan French literature, the links between the oral tradition and the written tradition, and the changing role of women in society today. Students will be evaluated on written essays, submission of questions in advance of classroom discussion of each work, presentation of a talk in class on some aspect of the works read, a midterm and final exam. French 458 satisfies the literature course requirements in the French major and the 400-level course requirement in the French minor. It can also satisfy the diversity requirement for General Education. FR 458 will be offered once a year with 18 seats per offering.", "prerequisite": "FR 331", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "FR", "number": "460", "credits": "3 Credits", "description": "Major authors and movements in French novel, drama, and poetry from Proust to the present. FR 460 Contemporary French Literature (3) This course is designed for advanced undergraduate work and it is taught in French. To function well in this course, students need to have passed an intermediate introductory course to French literature. The primary goal of FR 460 is to facilitate students acquisition of a coherent view of major contemporary literary movements, from modernism in poetry and drama, through surrealism, both lay and Christian humanistic fiction, and existentialism, to the absurd theatre, the nouveau roman, and post-modernism, ecriture feminine, anti-colonial and post-colonial literatures. Major authors are presented thru one of their works, taking into account the cultural, historical context in which they were developed. Instruction also comprises an initiation to basic theoretical notions on genres, literary techniques, and critical reading methodology. Contents will vary according to instructors choices but balance between periods, movements and genres is implied.  Multi-media resources abound for the purpose of illustration and interdisciplinary considerations but the primary thrust is cultural/ literary enrichment, and the development of students reading and analytical skills in French.   Web resources, excerpts, and shorter whole texts will be incorporated to the reading materials and will supplement the required books. Students are expected to read between ten and thirty pages according to the level of difficulty of the materials. No manual or anthology has been established a satisfactory choices for this course even though such tools exist, they generally do not treat the last third of the period properly.  So FR 460 instructors have relied on a variety of primary texts to achieve as comprehensive yet coherent a survey of this overflowing century as possible. Occasionally a thematic approach has been attempted to introduce more cohesiveness in the selected readings but this must be combined with traditional, diacritical approaches so as to facilitate the students ability to see linkages between literature and history as well as other arts, as they pursue their French and other Liberal Arts majors.", "prerequisite": "FR 331", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "470", "credits": "3 Credits", "description": "A critical presentation, taught in French, of changing ideas and values on race and gender in French and Francophone literatures.  FR 470 Race and Gender Issues in Literature in French (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. In addition to presenting subject matter that fosters an appreciation of literatures written in French while exploring racial and gender-related aspects of French and Francophone cultures, this course aims at developing a sophisticated, analytical outlook on peoples of different races and cultures and on women as authors, subjects, and literary 'constrictions' evolving over time. It provides a sense of the historical development of these questions and the interconnectedness of literature with society, and culture. One example of the issues and selections is the vindication of women -including Middle Eastern and Biblical figures- in Christine de Pisan's City of the ladies, in the early 15th c.; it is shown to have links with the 1970 modernistic and satirical text by Monique Wittig, Les Guilrbres. Other examples can be the famed surrealist negritude poetry of Aim Csaire of Martinique, or a classic saga of European Jews by Andr Schwarz-Bart, or the humorous narrative of an African boy in contemporary Paris by Calixthe Beyala. Evaluation is based on a balance of in-class and take home exams and a final paper. Participation is expected, including electronic communication with the instructor. Attendance and participation are assigned a significant proportion of the grade (20%) as is feasible and desirable in small classes with fifteen students or less. The class is led in French, the language of most materials presented, and it is designed primarily for French majors and minors. The literature is supported and illustrated with video excerpts and films available outside class. Internet research is encouraged and expected. It is offered every three or four years, alternating with FR 471 (Francophone Women in Literature and Culture), or special topics courses and period-bound, advanced literature courses in French.", "prerequisite": "FR 331", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "471", "credits": "3 Credits", "description": "Women's issues in literatures and cultures of French-speaking countries in Europe, the mediterranean, Africa, the Caribbean, and Quebec.  FR 471 Francophone Women in Literature and Culture (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. In addition to presenting subject matter that fosters an appreciation of documents and literary sources in French by and about women of Francophone countries in the post-colonial and post-modern era, the course initiates students to researching authentic documentation on those cultures. This course aims at developing a sophisticated, analytical outlook on Francophone women of different ethnic backgrounds and cultures and on women as authors, subjects, and literary &quot;constructions&quot; evolving over time. It provides a sense of the history of colonialism, slavery and Islam where Caribbean or African women are involved. One important component is sociological, demographic research and education. The Internet is a crucial tool for this course. The course contents varies by focussing on particular groups of women such as Caribbean or Islamic Francophone women. Evaluation is based on a balance of in-class and take home exams and a final paper. Participation is expected, including electronic communication with the instructor. Attendance and participation are assigned a significant proportion of the grade (20%) as is feasible and desirable in small classes with fifteen students or less. The class is led in French, the language of most materials presented, and it is designed primarily for French majors and minors. The printed sources and documents are supported and illustrated with video excerpts, films available outside class. Internet research is encouraged and expected. It is offered every three with 18 seats per offering, alternating with FR 470 (Race and Gender Issues in Literatures in French), or special topics courses (&quot;The Francophone Short Story&quot;) and period-bound courses ('Twentieth Century French Literature&quot;), advanced literature courses in French.This course fulfills the French major 400-level requirements in either the literature or the culture options, or the French minor similar requirement, and is also meant to fulfill the General Education requirement in race/gender and cultural diversity.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "475", "credits": "3-6 Credits/Maximum of 6", "description": "Women's history and creativity in post-revolutionary France.", "prerequisite": "FR   332 or FR   352"}, {"department": "FR", "number": "487", "credits": "3 Credits", "description": "Provide background needed to understand the broad outlines of French film history and theory in their first fifty years (1895-1945).  FR 487 Topics in French Film History and Theory I: 1895-1945 (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. The aim of this course is to provide the upper level undergraduate student with the background needed to understand French film in the period up to the end of World War II. This will greatly aid the student in understanding French literature and culture of the period as well. Topics will include the invention of cinema and the early days of French film; adventure serials and commercial films; avant-garde and surrealist film of the 1920s and 30s; and finally, the period often considered the 'golden age' of French film, the 1930s and 40s, and the so-called 'poetic realism' movement. Films will be supplemented with readings in criticism by writers and filmmakers of the period, as well as by the scholarship of critics and theorists writing today. The course would allow upper-level undergraduate students to partially fulfill the 400-level course requirement for French majors and minors. This course may also be used to fulfill a requirement in the newly proposed Film Studies minor. A student's performance in this course will normally be evaluated through an in-class expose, two in-class essay tests, and a short research paper. The class will be offered once a year with 50 seats per offering.", "prerequisite": "COMM 250", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "488", "credits": "3 Credits", "description": "Provide background needed to understand the broad outlines of French film history and theory in their second half-century (1945-2002).  FR 488 Topics in French Film History and Theory II: 1945-2002 (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. The aim of this course is to provide the upper level undergraduate student with the background needed to understand French film in the period from the end of World War II to the present. This will greatly aid the student in understanding French literature and culture of the period as well. Topics will include the French commercial film of the early postwar period; the ground breaking film criticism of the 1950s, and the films it spawned (the early 'New Wave'); the later, more experimental films done in the later 1960s and 1970s by other critic-directors; and, finally, films made in more recent years specifically concerned with the historical memory of social trauma-the Occupation and Holocaust-and the possibility of the cultivation and preservation of this memory in and through the film medium. The analysis will include readings by critics (many of the filmmakers) writing at the time the films were made, as well as more recent scholarship and criticism.The course would allow upper-level undergraduate students to partially fulfill the 400-level course requirement for French majors and minors. It will be offered every other year. This course may also be used to fulfill a requirement in the newly proposed Film Studies minor. A student's performance in this course will normally be evaluated through an in-class expose, two in-class essay tests that will determine the student's analytical skills; and a short research paper. This course will be offered once a year with 50 seats per offering.", "prerequisite": "COMM 250", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "FR", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "FR", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "496H", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"department": "FR", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "FR", "number": "499", "credits": "3-12 Credits/Maximum of 12", "description": "Advanced studies in French language and literature.", "prerequisite": "FR   201 , FR   202", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]