[{"department": "FRNAR", "number": "100", "credits": "3 Credits", "description": "This course will explore the principles of forensic photography and photographic methods, and discuss the procedures and standards that differentiate forensic photography from \"artistic\" photography and other methods of documentary photography. Through readings, analysis and photographic practice, this course will explore the fundamentals of photography, including lighting, image quality, composition, and more. Students will then apply and implement these fundamentals in forensic settings, for evidence documentation such as accidents, injuries, fingerprints, footprints, and bloodstains. Students will follow the standards and guidelines created by Scientific Working Groups in the taking of these images.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "FRNAR", "number": "100Z", "credits": "3 Credits", "description": "This course will explore the principles of forensic photography and photographic methods, and discuss the procedures and standards that differentiate forensic photography from \"artistic\" photography and other methods of documentary photography. Through readings, analysis and photographic practice, this course will explore the fundamentals of photography, including lighting, image quality, composition, and more. Students will then apply and implement these fundamentals in forensic settings, for evidence documentation such as accidents, injuries, fingerprints, footprints, and bloodstains. Students will follow the standards and guidelines created by Scientific Working Groups in the taking of these images.", "other": ["General Education: Arts (GA)", "General Education - Integrative: Linked", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "FRNAR", "number": "200", "credits": "3 Credits", "description": "The emphasis of FRNAR 200 is the Category 1 Forensic Photography. This course builds upon FRNAR 100, which focuses on the standards and guidelines for First Responder Forensic Photography. This course requires that the student have access to a DSLR camera with memory, multiple types of lenses and adjustable settings meeting a minimum set of requirements, which will be provided in an updated syllabus each year. In addition, the student must acquire supplies and equipment typically used by the Forensic Photographer. These may include camera accessories, forensic rulers, flashes, and filters. The student will also be responsible for creating forensic photography scenarios and may have to be creative in assembling the necessary items. Through readings, analysis and photographic practice, this course will explore the basics of DSLR photography, and then apply and implement these fundamentals in forensic settings. Students will follow the standards and guidelines created by the Scientific Working Groups in the taking of images and evidence documentation for crime scenes, motor behicle accidents, impressions and imprints, and victim photography. In two-week modules, students will take photographs to fulfill assignments; after critique (either peer or instructor), the students will re-take the photographs correcting errors. Successful students will complete the course with images and scenarios that can be used for their forensic photographer portfolio.", "prerequisite": "FRNAR 100"}]