[{"department": "FSC", "number": "401", "credits": "3 Credits", "description": "An introduction to the scientific and engineering principles of fuel technology.  For non-fuel science majors; fuel science majors will not receive credit.", "prerequisite": "CHEM 112"}, {"department": "FSC", "number": "431", "credits": "3 Credits", "description": "Nature and properties of fossil and other fuels, including aerospace, in relation to use; preparation of fuels; by-products; fuel analysis. The course deals with the formation, composition and properties of the principal naturally occurring fossil hydrocarbons (coal, petroleum, natural gas), and their refining, upgrading, and conversion chemistry. The objectives of this course are to equip students with a fundamental knowledge of the chemistry for the fossil hydrocarbon resources and their energy use for transportation and stationary fuels as well as their use as chemical feedstocks. It also helps to prepare students for the challenges, opportunities, and changes in the world of energy and resource-related enterprises. The primary emphasis is on petroleum, natural gas, coal, and liquid transportation fuels. This is a required course for the Energy Engineering Major.", "prerequisite": "CHEM 202"}, {"department": "FSC", "number": "432", "credits": "3 Credits", "description": "Transportation of people and goods in many parts of the world depend almost completely on petroleum fuels, such as gasoline, jet fuel, diesel fuel, and marine fuel. Apart from the fuels, materials that are necessary for operating the combustion engines of cars, trucks, planes, and trains also come from petroleum. These materials include lubricating oils (motor oils), greases, tires on the wheels of the vehicles, and asphalt to pave the roads for smooth rides in transportation vehicles. All petroleum fuels and many materials are produced by processing of crude oil in petroleum refineries. Petroleum refineries also supply feedstock to the petrochemicals and chemical industry for producing all consumer goods from rubber and plastics (polymers) to cosmetics and medicine. This course explains how physical processes and chemical reactions that take place in separate petroleum refinery units are integrated to convert crude oil into desired fuels and materials. Refinery processes are divided into four types that include separation, conversion, finishing, and support. The overall objective of petroleum refining is to convert crude oil into fuels and materials that comply with commercial specifications and environmental regulations. All refining processes and refinery operations are also subjected to the applicable environmental regulations. A historical evolution of process concepts is introduced to demonstrate how the refining efficiency has increased with significant reduction of pollutant emissions from individual refinery processes. The principal objectives of this course are to enable students to: 1. explain the market drivers for the refining industry (ABET student outcome 2). 2. indicate what crude oils consist of and how crude oils are characterized based on their physical properties (ABET 1, 2); 3. express the objectives of petroleum refining and classify the processes used in petroleum refining (ABET 1, 2, 7); 4. demonstrate how a petroleum refinery works and sketch a flow diagram that integrates all refining processes and the resulting refinery products (ABET 2); 5. examine how each refinery process works and how physical and chemical principles are applied to achieve the objectives of each refinery process (ABET 1, 2, 7); 6. assess implications of changing crude oil feedstocks on refinery configuration and propose strategies to resolve conflicts with degrading crude oil quality and increasingly stringent environmental regulations on petroleum fuels (ABET outcome 4, 7); 7. discuss different sources of natural gas and explain how natural gas is processed at well sites and in processing plants with application of selected refinery processes and other physical operations (ABET 1, 2).", "prerequisite": "CHEM 202", "other": ["Cross-listed with: CHE 432"]}, {"department": "FSC", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "FSC", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "FSC", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}]