[{"department": "GAME", "number": "140", "credits": "3 Credits", "description": "COMM 190 (GAME 140) Gaming and Interactive Media (3) The course is an introduction to the digital interactive media industries for students who may consider seeking employment in that sector, which includes video games and simulations, products for education, training, medicine, business, government/military, and virtual environments for a range of applications. Students will learn about industry structures, basic economics, business models, work flow, types of enterprises, job descriptions, and opportunities. It examines both the national and global markets. It provides students with a factually and theoretically informed appreciation of these industries.  The course will build on the students' personal and social experiences of these media, but it is not a course about playing or designing games or mastering individual applications. No special knowledge or experience in playing video games, using \"serious games,\" or experiencing virtual worlds is required. It will provide students with the foundation to make a well-informed choice about careers in this sector and respond to their natural curiosity about this pervasive part of their lives.  The course is divided into five segments. The first provides general context: history, scale and scope of the field, information on industry structure, business models and operations, and types of skills required. The second focuses on the video game industry, including social, regulatory and ethical issues. Video games are now a major media industry, having surpassed in U.S. revenue both the movie and recorded music industries. The third section looks at \"serious games.\" A \"serious game\" is a game designed for a primary purpose other than pure entertainment, such as education, scientific exploration, health care, emergency management, city planning, military, engineering, religion, etc. The fourth segment looks at simulations and virtual worlds and their multiple models and uses (entertainment, learning, business, research, etc.), and the development of related online communities. The final section will examine the interrelationship of these industries with the other entertainment industries in terms of planning, marketing, finance, production, etc. It will conclude with a look ahead at new technologies, markets, business models, advancements in artificial intelligence and the convergence of virtual and material worlds.  The course will employ presentations, class discussions, outside readings, demonstrations, videos, class exercises, online explorations, guest experts (in person and via technology), and experiences in virtual worlds.", "other": ["Cross-listed with: COMM 190", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "GAME", "number": "160N", "credits": "3 Credits", "description": "This course is a comparative introduction to the nature and history of video games as cultural artifacts, from Pong to online role-playing. It introduces students to academic discussion on and creative work in new digital forms including hypertexts, video games, cell phone novels, machinima, and more. Students will survey major debates over the meaning and value of video games, and study some of the major theoretical terms and perspectives developed to elaborate the cultural and sociological value of video games. The course extends students' skills in literary interpretation to a variety of new objects, and makes them aware of the role medium plays in aesthetic development and production. Students will leave with a far sharper understanding of how the interpretive tools used in the humanities can be extended to include new media, and with a sense of the historical role video games have played and will continue to play in global cultural production. Because the course is historically focused, it will spend significant time looking at the differential development of video games in three major regions: the United States, Europe, and East Asia (especially Japan).", "other": ["Cross-listed with: CMLIT 191N", "Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "GAME", "number": "180N", "credits": "3 Credits", "description": "GAME 180N is a multidisciplinary course which introduces students to the theories, concepts, and technologies behind virtual worlds. This course will focus on the myriad ways that narrative arts and physical sciences relate to the development of technologically mediated virtual worlds. Designing the physical and narrative voyages of avatars through virtual worlds is necessarily a team-centered undertaking requiring recursive editing from a macroscopic and microscopic point of view to refocus project goals and deliverables. Besides learning the requisite computing and technical skills involved in virtual world development, students enrolled in this course will produce a world design proposal, and storyboards, interactive fiction graphics, or world maps for their virtual world; in this way, they will explore some of the ways that creative writing, particularly interactive fiction and storytelling techniques drawn from non-VR and VR gaming contribute to the planning, design, and execution of virtual worlds. Students will also learn about the basic science behind virtual world concepts such as the physical environment, physical processes (e.g. kinematics, motion), and light; ultimately, they will produce an immersive time-space experience in their proposed world and reflect on the complexity of integrating design elements in a way that creates a satisfying immersive experience. The objectives of the course include: (1) students will work in teams to design a proposed virtual world using world making principles found in interactive fiction narratology and physical principles that embody the avatar and allow it to move in a virtual world environment; (2) students will work in teams to construct a virtual scene, movement in time/space, from that world using computer software tools and mediated through virtual reality hardware; (3) students will be able to discuss developing immersive technology and applications of virtual worlds in business, society, and academia; (4) students will analyze and critique the virtual world designs of other student teams; (5) students will demonstrate comprehension of interactive fiction scene and level structures and world maps as they relate to designing the voyage of the avatar in a virtual world; and (6) students will demonstrate comprehension of physical principles (e.g. kinematics, light) as they apply to virtual worlds. In addition to directed readings, discussions, and quizzes in computing, narrative arts, and physics (related to concepts inherent in virtual worlds), the course will incorporate hands-on lab exercises and online discussions. A semester-long team project will be the primary means of student evaluation. During this semester-long team project students will design and create their own virtual environment(s) and character(s) using software tools and accepted world design principles. Students will apply a variety of computing concepts in the world creation, including some combination of programming, 360-degree video, and digital imagery. The course will culminate in the oral and visual presentation of their creative and technological works. The semester-long team project will be heavily integrated into the in-class experience and assessed using rubrics that draw on examples and assignment descriptions provided to students.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "GAME", "number": "220", "credits": "3 Credits", "description": "Design of games as aesthetic objects and cultural artifacts that people find meaningful and entertaining.  In his 2007 book Persuasive Games, Professor Ian Bogost writes about the power of digital games in social, political, artistic, and psychological meaning-making through what he calls 'procedural rhetoric'. 'Procedural rhetoric entails persuasion - to change opinion or action - to convey ideas effectively.' Procedural rhetoric is a subdomain of procedural authorship;  it's arguments are made not through the construction of worlds or images, but through the authorship of rules and behavior, the construction of dynamic models.' (Bogost 2007, 29). As games become cultural objects with artistic value, achieving orchestral performances in the opera houses of the world, permanent exhibits in the Smithsonian, and having numerous charitable organizations entirely devoted to the appreciation of games, their art, and their rhetoric it behooves educators to enable the next generation of students to become literate in this new and emerging form of expression. This course will provide students with an introduction to game design. It will focus on the design of games as aesthetic objects, both inasmuch as video games have significant aesthetic properties (lighting, narrative, animation, sound design) but also, more generally, inasmuch as games are cultural artifacts that people find meaningful and entertaining. Because GAME 220 takes this broad perspective, students will learn design principles that are used not only in video game design but in traditional \"pen-and-paper\" games, such as board games, card games, role playing games, and so forth. The course will teach students how to design artful, creative games in general.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "GAME", "number": "250", "credits": "3 Credits", "description": "Introduction to the tools and techniques required to implement games in a virtual environment. GAME 250 / CMPSC 208 Technical Game Development.  First, students learn about game and player elements by creating characters and objects and the means of user interactivity. Both orthographic and perspective views are introduced to assist in character design. Objects and characters are created using fundamental geometric primitives like scale, rotation, translation and extrusion. The set operations, union, intersection, and subtraction, are applied to create compound objects. Bezier and NURB curves are introduced to create objects with irregular contours. Students also learn to design graphical user interfaces (GUIs) and handle mouse and keyboard events to support user interactions. Second, students are introduced to methods of storytelling and guide them to build narratives for games. Methods of proximity and collision detection in the environment are studied for both static and dynamic objects. Dynamic objects are programmed to move and behave in a deterministically, random, or probabilistically under a variety of lighting methods including ambient, directional, point and diffuse lights are introduced. A number of particle systems are developed with different considerations of randomness, vector direction and velocity. The concept of linear interpolation is illustrated and applied to texture mapping to improve the look and feel of objects. Third, students are introduced to functions, propositional logic, loops, and randomness to model game behavior. Students will learn to combine a series of primitive actions into a function for control and reuse. Propositional logic will guide students to define conditions and develop game rules. Loops are introduced to simplify the implementation of repeated game behavior. Randomness enables the simulation of many life-like object movements. Students will learn and practice how to write concurrent, event drive and sequential processing algorithms for game objects. Fourth, students are introduced to the game development process of pre-production, production and post-condition phases and have them apply it to their own project. The topic of maintenance will be introduced with an emphasis on refactoring techniques, critical to improving the quality of game and providing flexibility for future updates. This course has a significant applied element. Game engine tools are used to develop prototypes of games and playtest them. Lab assignments are given throughout the semester and a final project requires students to demonstrate mastery of all aspects of the course.", "prerequisite": "MATH 21", "other": ["Cross-listed with: CMPSC 208", "Bachelor of Arts: Quantification", "General Education: Quantification (GQ)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "GAME", "number": "251", "credits": "3 Credits", "description": "Introduction to programming 2D Games with HTML5 and Javascript. GAME 251 2D Game Programming (3) (GQ) An introductory course on web programming, GAME 251 introduces students to HTML Programming for online, browser-based, and mobile games. HTML is a versatile programming and markup language that allows for a lot of flexibility in game development. Throughout the course, students will learn HTML programming using the Canvas element, programmed in Javascript, using a variety of engines and technologies. Students will receive a primer in database management using MySQL, and will interface that database with their games using AJAX calls through PHP. The versatility and cross-platform nature of the HTML programming standard allows games to be compiled across numerous platforms seamlessly - a practice with which students will become accustomed.", "prerequisite": "MATH 21", "other": ["Bachelor of Arts: Quantification", "General Education: Quantification (GQ)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "GAME", "number": "420", "credits": "3 Credits", "description": "Develop the habits of successful game designers - playing games thoughtfully, and documenting those thoughts.  GAME 420 Advanced Game Design (3) Topics covered in this class will include independent game development, marketing, scheduling, and analysis of contemporary games for design choices in something called a \"post-mortem.\" This is done with the intent of training students in the habits of successful game designers- namely, playing games thoughtfully, and then documenting those thoughts. The successful student will have a clear and thoughtful record of at least 15 games he or she has played and analyzed with a critical eye by the end of the semester. These should be peppered with thoughtful critique on the games industry, and musings on trends in game design. This will of course become clear as the course progresses. The culmination of this course will result in the creation of a professional, competent game designer portfolio and blog that can be used in search for a job, to represent oneself as an independent game developer, and to showcase the talents and skills developed over this course and its prerequisite.", "prerequisite": "GAME 220"}, {"department": "GAME", "number": "430", "credits": "3 Credits", "description": "In Modeling and Simulation, students will develop an understanding of the systems, processes, tools, and implications of this field.", "prerequisite": "3 credits of programming; 3 credits of mathematics", "other": ["Cross-listed with: DIGIT 430"]}, {"department": "GAME", "number": "434", "credits": "3 Credits", "description": "Upper level course examining the core psychological principles as they apply to the topic of games.  GAME 434 / PSYCH 434 Psychology of Gaming (3) This course looks at how the field of psychology can be applied to understand and improve the world of games. This requires the application of theories and research based in experimental, cognitive and several other disciplines within psychology, including but not limited to cognitive, social, motivation & emotion, and experimental psychology. By applying different theories within these disciplines we can start to understand how humans interact with games and in turn how games have evolved as a result. This course addresses an active research area in psychology, of broad interest to students in Psychology and other disciplines. The course will fulfill a 400-level requirement for students in the PSYCH majors and minors as well as those in the GAME minor. Students typically will be evaluated by exams, research project, in-class activities, homework, and article discussions.", "other": ["Cross-listed with: PSYCH 434"]}, {"department": "GAME", "number": "450", "credits": "3 Credits", "description": "Autonomously generating object behavior and content in games.  GAME 450 Advanced Game Programming (3) The course is developed in two parts, creating programs to automatically generate object behavior and world content. Students are first introduced to the mathematical basis of vectors and transforms. This is necessary to create engaging characters that properly display behaviors and interact with the player and the world. These behaviors can range from orientating towards the player or pursuing/fleeing from some object in the game. In the presence of obstacles these behaviors require path finding algorithms like A* in order to navigate through the world. Students then learn how to create challenges that adapt their difficulty level based on the user's proficiency and skill in the game. In order to reduce costs and meet the demand to get a product to market, the gaming industry is looking for ways to automate the content generation. Instead of hiring a room-full of artists to generate the layout of a city, a computer can be programmed to dynamically generate this content at run-time, saving not only the work-load of the artists, but also the storage space necessary for the representation of the city. An optimization method like genetic algorithms is presented so that dynamically generated content like the layout of building and streets in a city can be produced at run-time. From the beginning of video games mazes and labyrinths have been a common theme and one of the first examples of run-time generated content. Students are introduced to a variety of maze generation methods using a variety of methods. Fractal geometry is introduced to provide a powerful tool to recursively generate natural looking content like plants and terrain. The mathematical basis of chaotic systems provides the theoretical background necessary to understand the limits of these methods as well as how to apply them to create new content. In addition to the technical content, students are required to demonstrate effective communication skills in these disciplines. Students are required to read and report out on a research paper of historical note or in an emerging field in content generation. Finally, a final project in the course will demonstrate the application of two or more of the concepts covered in the class.", "prerequisite": "GAME 250"}, {"department": "GAME", "number": "460", "credits": "3 Credits", "description": "A comparative look at the nature and history of video games as cultural artifacts, from Pond to online role-playing.  CMLIT 490 Video Game Studies (3)(BA) This course meets the Bachelor of Arts degree requirements. The video game industry is larger than the film industry, and yet the academic study of video games has only just begun. This course is a comparative introduction to the nature and history of video games as cultural artifacts, from Pong to online role-playing. It introduces students to academic discussion on and creative work in new digital forms including hypertexts, video games, cell phone novels, machinima, and more. Studentswill learn basic narrative theory, and study its impact on game studies and game production. They will survey major debates over the meaning and value of video games, and review its history from Pong to contemporary games, including online world-based games. The course extends students' skills in literary interpretation to a variety of new objects, and makes them aware of the role medium plays in aesthetic development and production. Students will leave with a far sharper understanding of how the interpretivetools used in the humanities can be extended to include new media, and with a sense of the historical role video games have played and will continue to play in global cultural production.", "prerequisite": "GAME 140", "other": ["Cross-listed with: CMLIT 490", "Bachelor of Arts: Humanities"]}, {"department": "GAME", "number": "480", "credits": "3 Credits", "description": "A team of students manages the production of a game from concept to implementation.  GAME 480 Game Development Project (3) In this course students take the entire semester to creating a game that will be published. Students are assembled into teams and will be expected to create a game from conception to publication in a very short period of time. What will result from the completion of this course is a demonstration of the knowledge accumulated in previous GAME courses and in important components of your portfolio to enable you to obtain a job in the industry.", "prerequisite": "3 credits of 400 level GAME classes"}, {"department": "GAME", "number": "495", "credits": "1-18 Credits/Maximum of 999", "description": "Supervised off-campus, non-group instruction including field experiences, practicums, or internships. Written and oral critique of activity required.", "prerequisite": "3 credits of GAME courses. Prior approval of proposed assignment by instructor"}]