[{"department": "GD", "number": "1S", "credits": "1 Credits", "description": "An orientation to the historical, social, and professional context of design and an exposure to a variety of ethical, philosophical, and topical ideas from the world of design.", "other": ["First-Year Seminar"]}, {"department": "GD", "number": "100", "credits": "3 Credits", "description": "A beginning level graphic design course. Instruction touches on the practice, theories, history and processes of the graphic design industry. GD 100 Introduction to Graphic Design (3) (GA) GD 100 (GA) INTRODUCTION TO GRAPHIC DESIGN (3) is a beginning level graphic design course. Instruction touches on the practice, history, theories, and analysis of the design industry. This course places emphasis on problem solving and observing design, while developing intuition and creativity. Projects focus on the process of defining the parameters of a design problem, observing examples within the design industry, and critically evaluating examples of effective and ineffective design.The course will help students to: 1. Understand the graphic design industry and the responsibilities of the profession. 2. Develop an appreciation for the practice of design. 3. Begin to develop the ability to define and solve problems. 4. Increase their knowledge of the history of graphic design and typography. 5. Refine their conceptual skills.6. Learn and understand the vernacular of the industry. Students will be quizzed on terminology and important facts provided in the readings.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "GD", "number": "101", "credits": "4 Credits", "description": "Design Foundation is a beginning-level studio course appropriate for students enrolled in a graphic design program. Through exercises and projects, students will use the elements and principles of design to convey information with clarity and impact. Students will practice thinking critically and acting creatively. Work will focus on key design issues, including process, method, technique, technology, and the production of visual and physical artifacts."}, {"department": "GD", "number": "102", "credits": "3 Credits", "description": "Design Foundation 2 continues a student's education in the fundamental practices of graphic design. Students develop greater facility with creative ideation, the fundamentals of visual communication, and the practical application of design principles and elements. Production methods build on the hand-skill of Design Foundation 1, moving into digital platforms.", "prerequisite": "GD 101"}, {"department": "GD", "number": "107", "credits": "4 Credits", "description": "GD107 Design Studio - Components is a beginning-level studio course appropriate for students enrolled in Graphic Design. The course serves as an introduction to analysis and form-making in graphic design through investigation of design artifacts as components of larger physical, social, cultural, and technological systems. Students will observe the world around them, define problems, and develop creative solutions. These solutions will be produced with an eye towards clear and effective visual communication. Critiques will build fluency in the language of design and sharpen their evaluation of design choices.", "prerequisite": "GD 101"}, {"department": "GD", "number": "110", "credits": "3 Credits/Maximum of 6", "description": "Students in this introductory course will study foundational concepts and methodologies in User Experience (UX) design and thinking. User experience (UX) design is the process designers use to create products that provide meaningful and relevant experiences to users and is rooted in the research and discovery of digital audiences, inclusive of enhancing user engagement and loyalty through usability, accessibility and product satisfaction. GD110 offers practical instruction focused on visual communications perspective, rather than one focused on programming alone. The process of designing user experiences within digital systems and applications will be explored and analyzed, as well as introductory knowledge in constructing design systems for various based on the needs of users. The course will feature iterative design processes to employ basic management techniques in working with product stakeholders for digital planning practices. GD 110 will provide foundation level instruction for concepts and principles that will be applied more broadly in GD 210."}, {"department": "GD", "number": "115N", "credits": "3 Credits", "description": "The world is awash with complex, dynamic information. With the development of powerful technologies capturing vast amounts of data, the art of visually representing information in ways that increase understanding of complex data and models will become a critical skill. Effective representations can communicate information in ways that maximize comprehension, analysis, exploration, and understanding of the underlying data. Knowing how to read and interpret visual data is essential to navigating this ocean of information. Those who know how to present data visually employ a powerful communication tool. In this class, you will become an effective reader and creator of visual representations of data. Through critical assessment of examples, interactions with peers, and the generation of your own projects, you will generate visualizations of data and create works using a common visual language to help people analyze and understand the information at hand. Good visualizations not only present a visual interpretation of data, but also do so by improving comprehension, communication, and decision-making. Effectively functional visualizations can offer insights that reveal evidence and truths that may be difficult to otherwise observe. They can often empower readers to explore both the norms that give meaning to the data and the exceptions that convey its complexity or uncertainty. Visualized information can assist in revealing: - Distributions and frequency over time - Changes and trends - Relationships and correlations - Spatial and mapping information Regardless of your major field of study, the ability to effectively visualize information represents a significant and essential skill for effective communication. Whether you are creating representation of your work for your company's leadership board, a general public audience, or a meeting of your peers, the ability to craft a visual display that offers an accurate and insightful interpretation of data is a key capability in the workplace. No prior experience in design or statistics is required for success in this course.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "GD", "number": "200", "credits": "3 Credits", "description": "A beginning graphic design studio course.  Instruction focuses on the practical and analytical process of creating graphic designs and their critical evaluation.  GD 200GD 200 Graphic Design Studio I (3) This course is a beginning graphic design studio course. Instruction focuses on the practical and analytical process of creating graphic designs and their critical evaluation. Emphasis is on problem solving and technical training while, at the same time, nurturing intuition and creativity.The course will help students to: 1. Develop skills and techniques applicable to graphic design. 2. Become familiar with appropriate computer hardware and software. 3. Develop the ability to define and solve problems. 4. Develop an understanding of graphic design as a profession. 5. Refine their conceptual skills. 6. Develop the work habits and attitudes of design professionals.Grading: 1. Work will be evaluated on the relevance and originality of the design idea, the suitability of the design approach in serving the client's needs, the effectiveness of the design in reading its intended audience, and all pertinent functional parameters. 2. Professional attitude and the development of professional work habits will be evaluated. Students are expected to think for themselves, budget their time, meet deadlines, and adhere to production schedules. 3. Attendance is required. In the case of illness or an emergency, students are required to contact the professor just as they would contact an employer. Three unexcused absences will result in the final semester grade being lowered one full letter grade. 4. Neatness, craft and attention to detail will be considered in the final grade. 5. Visual, verbal and written communication skills will also be part of the evaluation.GD 200 carries the prerequisite of GD 102.", "prerequisite": "GD 102"}, {"department": "GD", "number": "201", "credits": "4 Credits", "description": "GD201 Typography 1 is an intermediate-level studio course appropriate for students enrolled in a graphic design program. This course introduces the practical and analytical application of typography across a range of formats with an emphasis on concept development. Students will develop a strong foundation in typography, including knowledge of typographic principles, terminology and technical application. Students will apply knowledge of grid-based systems, typographic hierarchy, and systems-thinking across multiple formats. Projects introduce studio-based problem-solving using typographic¿principles and¿include competencies in formal typographic systems as well as experimental application. This course introduces typographic history as well as contemporary typographic considerations. Critiques will advance students¿ skills in the critical evaluation of design principles and communication in typographic design.", "prerequisite": "GD 107"}, {"department": "GD", "number": "202W", "credits": "3 Credits", "description": "A survey of graphic design, especially emphasizing influential movements, innovative designers and technological advances relevant to contemporary visual communication. GD 202 The History of Graphic Design (3) The History of Graphic Design course provides an overview of design as a vehicle of visual communication. The primary focus of the coursework is on images and styles of image-making as well as on language as a visual, typographic form. The application of images and typography is the basis of design, and its history ranges from Sumerian clay tablets to 21st century digital tablets. Special emphasis is given to periods of innovation and inspiration, including the late Roman period, the Renaissance, the Industrial Era, the rise of Modernism in Europe and America, and the digital revolution. Graphic design is a discipline which embraces its production and delivery technology; therefore, attention is also focused on the evolution of that technology--from the letterpress and metal typography, through the camera and photomechanical reproduction era, to current computer and digital production processes.", "other": ["Writing Across the Curriculum"]}, {"department": "GD", "number": "203", "credits": "3 Credits/Maximum of 3", "description": "GD 203, Advanced Typography is a course that comprises the study and development of advanced knowledge and skills of typography. Specifically, it includes the study and use of type to accomplish broader knowledge and skills in using type to create meaningful visual narratives, advanced skills of typography in organizing, arranging, and presenting information within multi-page layouts, and gain competent critical analysis skills concerning historical contemporary contextual perspectives.", "prerequisite": "GD 201"}, {"department": "GD", "number": "207", "credits": "4 Credits", "description": "Graphic Design Studio - Products is an intermediate-level studio course appropriate for students enrolled in a graphic design program. This course advances concepts and methodologies learned in GD101, GD107, and GD201. Through a series of multifaceted projects, students will analyze complex problems and apply research methodologies to design unique, systems-based solutions. Various modes of image-making will be explored, combining analog and digital techniques to develop fluency across media. Projects will explore the use of type and image in design solutions and expand upon typographic principles from GD201. Students will begin practicing client-designer relationships and addressing real-world problems through studio-based projects. Critiques will advance practical knowledge of critical evaluation and hone oral articulation of design choices.", "prerequisite": "GD 107"}, {"department": "GD", "number": "210", "credits": "3 Credits/Maximum of 6", "description": "Students in this course will apply knowledge in User Interface (UI) design and practice designing and prototyping compelling visual interfaces for multiple platforms - from websites to physical spaces to the nuanced interactions in mobile and wearable environments. The relationship of context to concept will be evaluated and applied, with emphasis placed upon designing for desktop and mobile environments through project-based learning and critique. Knowledge acquired in GD 110: User Experience Design: Concepts & Principals will allow students to understand user behavior while applying technical knowledge in learning design systems and standards for desktop and mobile devices. Students will learn user interface design software to increase design capabilities, as well as prototyping software to further interaction design skill sets.", "prerequisite": "GD 110"}, {"department": "GD", "number": "295", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"department": "GD", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "GD", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "GD", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "GD", "number": "300", "credits": "4 Credits", "description": "GD 300 Design Photography (4) GD 300 is an intermediate design and photography course that explores the visual and conceptual relationship between typography and photography as it relates to the communication of information.", "prerequisite": "GD 203", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "301", "credits": "4 Credits/Maximum of 4", "description": "GD 301, Experience design process and methods, is an advanced graphic design studio class that provides graphic design students with an in-depth study of the intricate relationship between the professional graphic designer and digital technology. Students will advance their knowledge of design software applications and will be introduced to programming languages that will assist them throughout the design process. From research and ideation to the creation of comprehensive studies and final designs, students will be given the tools that are critical to the completion of a variety of graphic design projects."}, {"department": "GD", "number": "302", "credits": "4 Credits", "description": "Definition and concentrated involvement in problem/audience analysis, with emphasis on understanding symbol and image in evoking audience response.  GD 302", "prerequisite": "GD 300", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "303", "credits": "4 Credits/Maximum of 4", "description": "Applied Experience Design, GD 303 explores digital technology as a medium graphic design. Topics include design expressed over time - both linear and nonlinear. The objectives for this course are to give graphic design students experience in the complexities of digital visual communication and to provide students with the opportunity to work with software packages that facilitate digital communication. Students will receive instruction regarding the graphic designer's role in complex, collaborative digital communications.", "prerequisite": "GD 301"}, {"department": "GD", "number": "304", "credits": "3 Credits", "description": "GD 304 Practical Communications (3) GD 304 is an advanced course that is intended to offer practical design experiences to graphic design students through assignments for various University and not-for-profit community clients.", "prerequisite": "GD 300", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "307", "credits": "4 Credits", "description": "Design practice is evolving-focusing less on physical things and more on the connections between them. Increasingly, design practice is concerned with nodes and links-networks, systems, and communities of systems. This course advances concepts and methodologies learned in GD107, and GD207. The design objectives for third year studio evolve to include not just the physical and digital deliverables but focus on the connections between them. Through a series of comprehensive projects, students will analyze complex problems and address integrating concepts and methods in application through systemsbased solutions.", "prerequisite": "GD 207"}, {"department": "GD", "number": "308", "credits": "3 Credits", "description": "Graphic Design Seminar offers a theoretical and critical examination of contemporary and future-facing design issues. The course includes lectures and discussions of current design strategies and practices. Students will be introduced to critical reading, writing, discussion, and presentation as reflective practices with a focus on diverse perspectives and approaches."}, {"department": "GD", "number": "310", "credits": "3-6 Credits/Maximum of 6", "description": "GD 310 is an advanced course that will offer pragmatic design experiences to graphic design students through direct involvement in the creative process of the designer-teacher in the studio environment.", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "315", "credits": "4 Credits", "description": "Humanizing data is an advanced-level studio course for majors and minors in graphic design, analyzing and visualizing data though aesthetic and humanistic approaches.", "prerequisite": "GD 115N"}, {"department": "GD", "number": "320", "credits": "4 Credits", "description": "This class advances the concepts, technologies, and languages used to design and build modern interactive experiences learned in GD110 and GD210. GD320 will explore the visual aspects and structural flow of interface design. Through projects, lectures, and workshops students will explore design strategies for web and mobile devices. Students will design screen-based experiences through research and empathy to achieve their user's end-goals and objectives. Core concepts might include content strategy, personas, sitemaps, user flows, wireframes, information architecture, and usability principles. The objectives for this course are to give graphic design students experience in the complexities of digital visual communication in emerging mediums. Students will receive instruction regarding the graphic designer's role in complex, collaborative digital communications.", "prerequisite": "GD 210"}, {"department": "GD", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required."}, {"department": "GD", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "GD", "number": "400", "credits": "4 Credits", "description": "Development of visual sequence as replies to graphic design problems.  GD 400", "prerequisite": "GD 302", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "401", "credits": "3 Credits", "description": "Orientation to packaging designs as it relates to the consumer, client, and to societal and environmental concerns.  GD 401", "prerequisite": "GD 302", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "402", "credits": "4 Credits", "description": "GD 402, Senior Problems, allows the senior student to incorporate their knowledge and experience acquired from their years of experimentation, research, and critical thinking. The course focuses on the final preparation of the professional portfolio culminating extensive design projects and the organization and production of senior student design exhibition.", "prerequisite": "GD 400", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "403W", "credits": "3 Credits", "description": "A seminar on subjects which relate to the field of graphic design.  GD 403WGD 403W Graphic Design Seminar (3)(BA) This course meets the Bachelor of Arts degree requirements. This is an advanced course covering the history and contemporary theory and criticism of graphic design. Topics include: the invention of writing and alphabets, medieval manuscripts books, the origin of printing and typography, Renaissance graphic design, the Arts and Crafts movement, Victorian and Art Nouveau graphics, modernist influences on graphic design, visual identity and conceptual images, postmodern design, the computer graphics revolution, new media design, ethics and professional practice, and contemporary issues relating to design theory and criticism.The course is intended to: 1. Provide a firm understanding of the history of graphic design. 2. Develop the capacity to discuss the articulate current issues in graphic design. 3. Promote writing and speaking abilities through class assignments. 4. Help students to develop the work habits and attitudes of professional designers.Grading: 1. Class projects as well as class participation will be evaluated. 2. Written assignments, including short synopses of readings and additional essays, and the quality of writing will be a part of the grade evaluation. 3. Professional attitude and the development of professional work habits will be evaluated. Students are expected to think for themselves, budget their time, meet deadlines, and adhere to production schedules. 4. Attendance is required. In the case of illnesses or an emergency, students are required to contact the professor just as they would contact an employer. Three unexcused absences will result in the final semester grade being lowered one full letter grade. 5. Visual and verbal as well as written communication skills will be a part of the evaluation.GD 320 is the prerequisite to GD 403W.GD 403W will be offered spring semester.", "prerequisite": "GD 302", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"department": "GD", "number": "404", "credits": "3 Credits", "description": "Writing, designing, illustrating and production (printing) of a book.  GD 404GD 404 Book Design (3)(BA) This course meets the Bachelor of Arts degree requirements. This is an advanced course that explores the relationship of the written and visual elements in the design of a book. Each student (or student team) will select a topic, create the text and give visual form to an original book, which will have a minimum length of 16 pages. The intrinsic qualities of the book medium such as typography, sequence, imagery, paper, dye-cuts, fold-outs, pop-ups, and binding will be investigated in relation to how each affects the overall communication of the book's meaning to a specific audience.The course is intended to: 1. Foster an appreciation for good typography. 2. Allow students to investigate the sequential relationships between the visual and verbal aspects of a book and their synergistic interaction in the communication of the books meaning to a particular audience. 3. Introduce the appropriate use of illustrations in book design. 4. Help students develop the work habits and attitudes of professional designers. 5. Help students to examine the design process to learn to define the problem and work logically towards an appropriate solution. 6. Develop the ability to work as a member of a team. 7. Gain a deeper understanding of graphic design aesthetically, critically, and technically.Grading: 1. Each of the two copies of the book that are submitted at the end of the semester should be identical, with flawless execution and craft. 2. The book will be evaluated on the originality of the idea and the appropriateness of the design approach to the idea, the intended audience and all pertinent functional parameters. 3. Professional attitude and the development of professional work habits will be evaluated. Students are expected to think for themselves, budget their time, meet deadlines, and adhere to production schedules. 4. Visual, verbal and written communication skills will be evaluated.GD 404 will be offered fall or spring semesters.", "prerequisite": "GD 302", "other": ["Bachelor of Arts: Arts"]}, {"department": "GD", "number": "405", "credits": "3 Credits/Maximum of 3", "description": "This class introduces the concepts, technologies, and languages used to design and build publications, objects, and complex collaborative digital communications. GD405 provides Graphic Design Minors with an advanced-level design studio, appropriate in rigor, and in keeping with the expectations of the Minor in Graphic Design degree. This will prepare the successful student for the self-guided thesis environment of the Minor in Graphic Design Capstone Course (GD406). Within this advanced studio course, students will continue to develop core professional competencies in their quest for mastery of industry tools and techniques for actual and virtual domains. It will apply the student's existing knowledge of design methodology to the completion of project-based studio coursework. Through research, ideation, and the creation of final designs, students will be given continued experiences in printed mediums, be introduced to the design of physical artifacts, and exposed to the complexities of digital visual communication in emerging mediums. These may include complex long-format publications, commercial product packaging, websites, and digital interfaces. Students will develop an understanding of the graphic designer as a professional communicator, and develop the work habits and attitudes found within this design profession.", "prerequisite": "GD 200"}, {"department": "GD", "number": "406", "credits": "3 Credits/Maximum of 3", "description": "A structured studio for Minors in Graphic Design culminating into a final self-authored project on a topic that engages each student's declared major. The Minor Capstone Studio applies each student's accumulated knowledge of graphic design towards the development of a self-authored project on a topic that engages his or her declared major. Each project will exercise the student's capacity to synthesize visual form and written components through the application of design methodology, and culminate their findings into a completed, presented thesis. Coursework will also include an introduction to communication theory, contemporary communication paradigms, the changing notion of audience and context, and formal research methodology.", "prerequisite": "GD 405"}, {"department": "GD", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "GD", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "GD", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required."}, {"department": "GD", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "GD", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "GD", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]