[{"department": "GER", "number": "1", "credits": "4 Credits", "description": "Introduction to listening, speaking, reading, and writing with emphasis on the first two skills; cultural aspects through readings and videos. Students who have received high school credit for two or more years of German may not schedule this course for credit, without the permission of the department.  GER 001 Elementary German I (4) German 001: Elementary German I is designed to help students develop skills in the interpretation, expression, and negotiation of spoken and written German. In addition to German language skills, students in the course will develop a greater understanding of German-speaking culture. The course requires active student involvement and participation. Attendance is mandatory. Students will be guided by the instructor in working with German-language materials available on the internet. Student evaluation is based on active participation in class, homework, quizzes, oral and mid-term examinations, oral and written final examinations and culture projects. Placement in German 001 is based on Penn State  foreign language placement policy (link to: http://bulletins.psu.edu/bulletins/bluebook/general_information.cfm?section=Placement2). Students who have received high school credit for two or more years of German may not schedule this course for credit, without permission of the department. German 001 is offered every semester. Enrollment is capped at 24 students per section.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "GER", "number": "2", "credits": "4 Credits", "description": "GER 2 is a continuation of GER 1; further introduction of basic structures, culture, and development of four basic skills stressing aural-oral aspects. Students who have received high school credit for four or more years of German may not schedule this course for credit, without the permission of the department.  GER 2 Elementary German II is a continuation of German 1 and is designed to help students develop skills in the interpretation, expression, and negotiation of spoken and written German. In addition to German language skills, students in the course will develop a greater understanding of German-speaking culture. The course requires active student involvement and participation. Attendance is mandatory. Students will be guided by the instructor in working with German-language materials available on the internet. Student evaluation is based on class participation, homework, quizzes, oral and mid-term examinations, oral and written final examinations and culture projects. Students who have received high school credit for four or more years of German may not schedule this course for credit, without permission of the department. German 2 is offered every semester. Enrollment is capped at 24 students per section.", "prerequisite": "GER  001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "GER", "number": "3", "credits": "4 Credits", "description": "Continued four-skill development with increased emphasis on reading, writing, and grammatical accuracy; culturally-oriented reading selections and videos. Students may receive credit for only one of the following: GER 003 or GER 008.", "prerequisite": "GER  002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "GER", "number": "11", "credits": "6 Credits", "description": "Listening, speaking, reading, writing, basic structures and vocabulary of German. Taught on an accelerated basis. Students may receive credit for only one of the following: GER 001, 011, or 015.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "GER", "number": "12", "credits": "6 Credits", "description": "Continued skill development of structures and vocabulary; listening, speaking, reading, writing. Taught on an accelerated basis. Students may receive credit for only one of the following: GER 002, 003, 012, or 016.", "prerequisite": "GER  011", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "GER", "number": "51", "credits": "3 Credits", "description": "Intensive introduction to German: first half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  GER 051 Elementary Intensive German for Graduate Students (3)This is the first in a series of three courses designed to give students an intensive introduction to German. This is the first half of elementary sequence in reading, writing, speaking, listening, and cultural contexts. Students will learn the German vocabulary and will learn to create simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"department": "GER", "number": "52", "credits": "3 Credits", "description": "Intensive introduction to German: second half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  GER 052 Elementary Intensive German for Graduate Students II (3)This is the second in a series of three courses designed to give students an intensive introduction to German. This is the second half of graduate intensive sequence in elementary reading, writing, speaking, listening, and cultural contexts. Students will learn the German vocabulary. Lessons are taught in an authentic cultural context.", "prerequisite": "GER  051 or equivalent, and graduate standing"}, {"department": "GER", "number": "53", "credits": "3 Credits", "description": "Continued intensive study of German at the intermediate level: reading, writing, speaking, listening, cultural contexts.  GER 053 Intermediate Intensive German for Graduate Students (3)This is the third in a series of three courses designed to give students an intermediate intensive knowledge of German. Continued intensive study of German at the intermediate level: reading, writing, speaking, listening, and cultural contexts. Lessons are taught in an authentic cultural context.", "prerequisite": "GER  052 or equivalent, and graduate standing"}, {"department": "GER", "number": "83", "credits": "3 Credits", "description": "Germany's cultural past and present. GER 083S First-Year Seminar in German (3) (GH;FYS;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed to give the student an introductory overview of certain important aspects of German culture and its development during the past 1500 years. The topics selected will give the student an introduction to major periods and representative thinkers that have helped shape the destiny of German-speaking countries and much of Europe as well. As Goethe noted, our views of the past are a mirror in which we dimly see our own reflection. Serious examination of the issues raised in this course also result in learning something about one's self and the world in which s/he live today. This course can be used to fulfill the General Education or Bachelor of Arts Humanities requirement, the Intercultural/International Competence requirement, and the first year seminar requirement. A series of short papers will enable students to develop the skills of information gathering and written expression. The course grade will be based on oral participation and on the grade for the papers, which will be evaluated both for content and writing. This course will help to prepare students for a variety of additional courses in the fields of literature and German-speaking area studies. In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them, including the opportunity to develop relationships with faculty and other students who share their academic interests. The course will be offered once per year to an audience of 20 students.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "GER", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "100", "credits": "3 Credits", "description": "Culture and civilization of the German people from the Germanic migrations to the Nazi period. Conducted in English.  GER 100 German Culture and Civilization (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. In German 100, students examine the ethical basis for decision-making of representative thinkers and periods in German history. The course begins by looking at the warrior ethos that pervades early Germanic literature, proceeds to examine successive changes in ethics brought on by Christianization, the Reformation, and the Enlightenment. The course ends by looking at the ethics of power advocated by Nietzsche and the racialist ideology of Nazism. The course will also examine changes in aesthetic values, as represented by the art of Durer and the Expressionists, the literature of the Storm-and-Stress movement and Kafka, the music and theater of Wagnerian opera and the film of the Expressionists and Leni Riefenstahl. Finally, the nettlesome issue of German national identity will be addressed through the perspective of historical developments since the time of Charlemagne.German l00 is linked closely to German 200. German 100 concentrates on German culture and civilization up to the Nazi period. German 200 concentrates on German culture and civilization since the Nazi period. German/Russian 143 addresses aspects of Nazism in greater depth than does German 100.The course meets three times per week, including fifty-minute lectures on Monday and Friday and a discussion section on Wednesday. The total enrollment is limited to approximately 180 students and the discussion sections have no more than 27 students each. When taught in the summer, the total enrollment for the class is less than fifty. Assessment is based on three examinations with an essay component, one short paper, and participation in classroom discussions, and attendance.German 100 may not be applied toward the requirements of a German major or a German minor. It may be used for the General Education humanities requirement, for the General Education Intercultural/International competence requirement, or for a B.A. humanities requirement.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "GER", "number": "115N", "credits": "3 Credits", "description": "The 20th century was a time of great scientific advancement - advancements that were used both for good and for evil (and for other purposes that lie somewhere in between). Germany and German-speaking scientists played central roles in many of these discoveries. In this course we will take an interdisciplinary approach to discussing key scientific advancements, including the discovery of nuclear fission and the development of the nuclear bomb, the discovery of polymers and the invention of pain medicines such as morphine and oxycodone, learning about the science behind these discoveries alongside the social and historical contexts in which they occurred, and the impact these discoveries had on society. While a majority of the scientific discoveries that we will focus on took place in the first half of the 20th century, we will also discuss the ways in which the long-term consequences of these discoveries are still relevant today, especially as they relate to current issues on sustainability (e.g., the use of plastics) and the ethical considerations that arise more generally when thinking about the relationship between science, technology, engineering and society. This course will count as an interdomain, GH/GN.", "other": ["Cross-listed with: ENGR 115N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "GER", "number": "123", "credits": "3 Credits", "description": "The history and memory of the Holocaust, the Armenian, Cambodian and other forms of genocide are often taught separately in different disciplines. This course will examine them together through the various ways different societies dealt with, experienced and understood these. Using the extensive literature on the history of genocide this course further suggests ways in which these tragic events affected and were entangled by each other's. Specific content will vary according to individual instructor, but topics may include victim cultures, ethnic cleansing, trauma, human rights, dark tourism, memorials, architecture as well as the general impact of these tragedies on global politics, or the way the memories of the tragedies were entangled with the civil rights and other struggles in American and global history.", "other": ["Cross-listed with: HIST 195, JST 195", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "GER", "number": "128N", "credits": "3 Credits", "description": "This class studies how art, literature, film, and other media can help us to gain a perspective on one of the most horrific events in human history, the Holocaust: the genocidal murder of more than six million men, women, and children (mostly Jewish) under the Nazi regime during World War II. We will also examine the theoretical questions involved in any attempt to capture what appears to be beyond our comprehension, in terms of moral outrage and the sheer scale, inhumanity, and bureaucratic efficiency. To this end we will study literary works, such as Primo Levi's Survival in Auschwitz, films such as Steven Spielberg's Schindler's List, Roman Polanski's The Pianist, and Roberto Benigni's Life is Beautiful, as well as photographs, poems, artworks, installations, museum architecture, the design of monuments and other artifacts. We will also examine questions of memorialization (Holocaust museums and memorials), national guilt, survivor's guilt, stigmatization, and the ethics of historical representation.", "other": ["Cross-listed with: CMLIT 128N, ENGL 128N, JST 128N", "Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "GER", "number": "143", "credits": "3 Credits", "description": "This course, which is cross-listed between Russian and German, aims to acquaint students with an important and troubling chapter of 20th-century culture. The regimes of Stalin and Hitler have had a decisive impact not only on life in Russia and Germany, but in much of Europe and the world at large. There is no consensus among scholars about how to classify these systems, whether the term \"totalitarian\" is appropriate to describe them, and whether Stalinist Russia and Nazi Germany are essentially similar or essentially different historical phenomena. Espousing a comparative perspective, this course explores the culture produced by Stalinist Russia and Nazi Germany, taking into account both the culture of daily life and selected works of \"high culture,\" including literature, the visual arts, architecture, music, and film. The ideological underpinnings of both systems will be discussed and compared. The classics of Stalinist Socialist Realism and Nazi propaganda will be analyzed both as political statements and works of art. The course will also include a reading of authors who attempted to create critical representations of life in Stalinist and Nazi societies, such as Lydia Chukovskaya, Varlam Shalamov, Primo Levi, and George Orwell. The course is designed to be suitable for all students generally interested in Russian and/or German culture, or interested in various fields of humanistic study, whether or not they have previously studied the culture of Russia or Germany. A knowledge of Russian or German is not required, as class lectures and discussions as well as all reading assignments will be in English. This course is designed to count as General Education, as a GH \"Humanities,\" and as an IL \"International Cultures\" course. It meets the BA requirements in the humanities by asking students to demonstrate competence in 20th-century German and Russian history, political philosophy, literature, art and film.", "other": ["Cross-listed with: RUS 143", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "GER", "number": "157N", "credits": "3 Credits", "description": "This course investigates the history, culture, religion, beliefs, language and society of the Old Order Amish and related Anabaptist sectarian groups in North America. By studying their historical background, their cultural and social life based on their religious beliefs, their economic and political interactions with mainstream American society, students are offered a unique opportunity to learn more about another culture and are enabled to arrive at a better understanding of their own cultural concepts and values. The course will also focus on basic human issues, such as family, community and economy, and the values that inform the Amish approach to these issues. The ongoing struggle of the Amish and historically-related groups to retain their religious, ethical, and moral values dates back to the Reformation. In particular, the course will discuss the maintenance by the Amish and other Old Order sectarians of their traditional language, beliefs and values after living more than three centuries in North America. Perhaps, surprisingly, the Old Order Amish are thriving economically and demographically in the twenty-first century, and their numbers are doubling approximately every 20 years. This course is designed to be suitable for all students generally interested in the Amish from the perspectives of history, religious studies, anthropology, sociology, agriculture, government, law, or business. This course is designated as Integrated Domain (N) because of the interdependence of humanities and social sciences as fundamental to understanding the Amish. The course is also designated as US \"United States Cultures.\" The course cultivates student knowledge of the social and religious identity of the Amish, and students will learn about the beliefs and values that inform distinctive Amish practices, such as plain dress and the use of horse-and-buggy transportation.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "GER", "number": "166", "credits": "3 Credits", "description": "This course introduces the thought of three German-language writers (Karl Marx, Friedrich Nietzsche, and Sigmund Freud) who transformed the fields of philosophy, economics, psychology, and have made an immense impact on the fields of history, political science, aesthetics, theology, as well as literature and the arts. We will spend approximately equal time on each thinker, with an emphasis on their most important works as well as on their writings that deal with aesthetics, literature, and the arts. Each thinker will be presented in his respective historical and intellectual context. Students will gain an understanding of how each thinker shaped the course of German intellectual history and history of ideas more broadly. Importance will be placed on identifying each thinker's distinct method, the targets of their critiques, and the stakes of their interventions. Why was each thinker so revolutionary, and why is their thought still important today? Additional materials may include relevant literary and cinematic works. The course fulfills the General Education requirement in the Humanities (GH), as well as the International Cultures (IL) requirement. All texts and discussion in English.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "GER", "number": "175", "credits": "3 Credits", "description": "In this course, students will become able to describe the complex cultural history of the German-speaking Middle Ages and its modern reception through analysis of literary and cultural production. The period between the Germanic migrations of the fourth century C.E. (Common Era) and the waning of the high Middle Ages around 1250 C.E. was shaped by a complex convergence of sociocultural, theological, and political forces. A shift from the agrarian society of early Germanic peoples with a minimal government structure, to the stratified socio-political system of the High Middle Ages is reflected in written documents and literary production of the time. Evolving and emerging value systems often clashed. For instance, knights were expected to be the warriors depicted in heroic epic and yet also to behave like the civilized courtiers of Arthurian Romance. Modern retellings of Arthurian and heroic stories are popular in modern film and literature. Newer scholarly approaches such as culture theory, gender studies, critical race theory, and post-colonial studies have expanded the available tools for analysis of Germanic medieval literature and culture. Students will examine historical documents, literary works, visual art, music, as well as secondary articles on history, culture, and literature and will discuss the complexity and diversity of this time period in German-speaking regions. Using modern tools of analysis, students will compare the medieval material with its reception in modern cultural production and will evaluate the relevance of medieval culture to modern society.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "GER", "number": "189N", "credits": "3 Credits", "description": "A survey of German film from its beginnings to the present, with emphasis on historical, political, and cultural contexts. GER 189 German Film (3) (GH; GA; IL) This course is an introduction to German cinema, broadly defined as any representation of moving images made in Germany, Switzerland, or Austria, or by filmmakers from these countries working in exile. The course will be both an historical survey of the developments in German film, as well as a general introduction to film analysis. Neither prior knowledge of German culture and langauge nor of film history and terminology is required.  All materials will be supplied in English. Students will learn about the technology of film production as well as fundamental concepts for film analysis (shots, angles, sound, lighting, etc.). The course will be structured around different political and cultural contexts, providing students with a concrete historical perspective on Germany from the late nineteenth to the early twenty-first centuries. Screenings will cover several artistic modes, including comedy, melodrama, propaganda film, experimental film, period drama, crime drama, horror film, and documentary. Readings will complement screenings with seminal writings by filmmakers and theorists, as well as texts that provide historical perspective and close analysis. By examining German film with attention to changing cultural settings, students will investigate such topics as the relation of memory and history, the representation of war and genocide, the roles of propaganda and censorship, the formation (and deformation) of national identity, the impact of technological and economic changes on culture, and changing gender roles. In addition, students will learn to think critically about the visual medium of film, becoming more engaged and critical spectators in a world saturated with the moving image. Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. The course is designed to be suitable for all students generally interested in German, or interested in various fields of humanistic study, whether or not they have previously studied the culture of Germany. As an inter domain course, GER 189 also counts towards the integrative studies requirement.", "other": ["International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "GER", "number": "190", "credits": "3 Credits", "description": "GER 190, German Twentieth-Century German Literature in Translation (GH; IL; BA) offers an introduction to 20th-century literary texts written in Austria, Germany, and Switzerland, or by authors originally from these countries, with emphasis on cultural, historical, and political contexts. No prior knowledge of German, 20th-century German history, or narrative analysis is required. All texts and discussions are in English. Students will gain a historical perspective of 20th-century German-speaking worlds by analyzing works of award-winning authors and a few filmmakers including but not limited to Arthur Schnitzler, Franz Kafka, Ernst Toller, Bert Brecht, Ruth Klüger, Helma Sanders Brahms, Paul Celan, Max Frisch, and Heinrich Böll. The course draws on diverse genres, such as prose fiction, memoirs, poetry, diaries, short stories, drama, cinematic adaptations of literary works, and film. Short lectures and presentations contextualize the readings about Vienna 1900, two World Wars, the Interwar Years, the Holocaust, and divided and united Germany. Students will engage in an on-going dialogue about the relationships between literature, history, and society. We will explore how literature captures value and belief systems in distinct cultural, social, and political settings. Class discussions focus on the depiction of the individual in modern society, the role of intellectuals as WWI enthusiasts turned pacifists, censorship, the representation of war and the Holocaust, trauma, memory and gender, post-WWII values in a consumer culture, the student movement of 1968, the power of the mass media in the 1970s turning published opinion into public opinion, terrorism, the fall of the Berlin Wall, and German reunification. In German 190, students will critically think about text and context, explore literature as a powerful seismograph of profound cultural and political changes, examine literary works as manifestations of cultural memory and means of social critique, and appreciate writers as keen observers of the world around them. This course is suitable for all students interested in German Studies or the humanities. The course has a GH (General Humanities) and IL (International Cultures) designation and meets the requirement for a BA in the humanities.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "GER", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GER", "number": "197E", "credits": "3 Credits", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain"]}, {"department": "GER", "number": "199", "credits": "3-6 Credits/Maximum of 6", "description": "Intermediate training in German language skills.", "prerequisite": "GER  002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"department": "GER", "number": "200N", "credits": "3 Credits", "description": "How do we make sense of Germany, the country's history, culture, politics, and economics during the twentieth century? In modern German history, periods of impressive social, political, economic, cultural, and intellectual achievements alternated with times of violence, destruction, two world wars, genocide, and authoritarian structures in politics and society. This course helps students to understand Germany during the 20th century. The main focal points of this course include World War I, the 1918 revolution followed by the short history of the Weimar Republic, the rise of the Nazis and the Third Reich, World War II and the Holocaust, post-war reconstruction, the foundation of two German states in 1949, their development until (re-) unification in 1990, the development of Germany from unification to today, Germany's current dominant economic position within the EU, and the recent rise of radical right-wing politics in Germany for the first time since 1945. These focal areas will be approached from various perspectives: From historical (and historiographical) vantage points, from sociological and economic perspectives, and through the lenses of cultural productions such as novels, movies, and other works of art.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "GER", "number": "201", "credits": "4 Credits", "description": "Continuation of GER 003; emphasis on reading, writing, and conversational skills; course utilizes short literary selections, a concise novel, videos.  GER 201 Conversation and Composition (4) IL Offered in the fall and spring semesters of each academic year, this fourth-semester German language course satisfies International Cultures (IL) requirement and is a required course for the German B.A. degree. For the German B.S. degree and the German minor, students must take either German 201 or German 208. German 201 is designed to help students further develop the four basic language skills (listening, speaking, reading and writing) they have attained in previous language courses with particular emphasis on the advancement of their speaking and writing proficiency in German. Through a task-based approach the course aims to assist students in learning to write and speak German with level-appropriate fluency and accuracy. This course will also provide students with ample opportunity to increase their reading command of German through an authentic literary work and short stories by prominent German-speaking authors. The course language is German and class sessions will consist of communicative activities and practices. The learning of the German language will occur through completion of tasks in which students use the level-specific grammatical structures in different formats and circumstances (e.g. writing and oral projects) while receiving little or no direct lecture on German grammar. The delivery and practice of factual information on grammatical structures are integral to the course and thus instructors will highlight them to the extent to help students achieve the course objectives. The class meets twice in a regular classroom and twice in a computer-lab throughout the semester where students will be exposed to computer-mediated language instruction and work on various computer-based projects. Film viewing and discussions will be incorporated into the course, as deemed necessary by the instructors. Attendance and preparation are mandatory and homework is assigned on a regular basis. The evaluation and grading of students' course performance is based on active class participation, successful completion of a rhetorical portfolio, an orally presented cultural project, four brief interviews, and a semester-end aural-oral test.", "prerequisite": "GER  003 or GER  008", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"department": "GER", "number": "208Y", "credits": "4 Credits", "description": "Intermediate Business German.  GER 208Y Business German (4) (IL) In this course students will learn more about German businesses and their culture. At the same time, students will continue to review and learn additional grammar points. They will have more writing experience by completing five different writing assignments. All four language skills (listening, speaking, reading and writing) will be further developed in this course.Students will be evaluated according to class participation, successful completion of in-class presentation, Internet exercises, homework assignments, essays, and examinations. This course complements other offerings for German in the business track. It completes the intermediate level of German and prepares the student to go on to German 308W and German 408. This course also can be counted towards the BS in German.This course will be offered once a year during the Spring Semester. In this type of intensive course, enrollment has to be limited to 22 students.", "prerequisite": "GER  003 or GER  008", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "GER", "number": "245", "credits": "3 Credits", "description": "The Vikings will study the rise and proliferation of Viking culture and society during the Viking Age (c. 793 - c. 1066 CE). This course will examine Norse/Scandinavian culture including their social structure, political and economic systems, technology (especially shipbuilding and navigation), religion, literature, language and of course the raiding, trading and exploration traditionally associated with Vikings. As the course synthesizes and analyzes historical evidence, several themes will be of importance including: social and economic structures, religious belief systems, the place of women and marginalized groups in society, and cultural developments such as art and literature. The overall goal of this course is to use factual and thematic knowledge of this time period and these cultures to analyze and appreciate both change and continuity in the development of Viking history.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "GER", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GER", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GER", "number": "299", "credits": "3-6 Credits/Maximum of 6", "description": "Advanced training in German language skills.", "other": ["International Cultures (IL)"]}, {"department": "GER", "number": "301", "credits": "3 Credits", "description": "Intensive practice in spoken German through readings, discussions and video.  GER 301 Intermediate Conversation and Composition (3) (IL) German 301 is a continuation of the composition and conversation emphases of both GER 201 and GER 208. Fundamental to the course is a thorough grammar review of both basic and advanced grammatical situations. Much of this review is done outside of class. In class, students devote their time primarily to oral work. GER 301 requires students to use German in various ways: group work, individual presentations, discussion of texts, structured partner drills, etc Student evaluations are based on participation, homework, quizzes, a class room presentation, and essays.GER 301 is required for all German majors and the German minor and will be offered every semester.", "prerequisite": "GER  201 or GER  208Y", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "International Cultures (IL)"]}, {"department": "GER", "number": "302W", "credits": "3 Credits", "description": "Continuation of oral and written practice in German with extensive work in composition.  GER 302W Intermediate Conversation and Composition II (3)(BA) This course meets the Bachelor of Arts degree requirements. German 302 is a continuation of the language and composition emphases of both GER 201 and 208. Fundamental to the course is a thorough grammar review of both basic and advanced grammatical situations, with the goal of improving students' grammatical and stylistic precision in written German discourse. GER 302 requires students to use German in various ways: group work, individual presentations, discussion of texts, structured partner drills, etc.", "prerequisite": "GER  201 or GER  208Y", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"department": "GER", "number": "308Y", "credits": "3 Credits", "description": "Development of German commerce and industry; extensive practice in the major forms of business communications such as business correspondence.  GER 308Y German Business Communication (3) (IL) This course provides an introduction to German business and economics. Students will read and respond to a variety of texts about German economic practices and the German business world, as well as texts that introduce and describe more general economic principles. Emphasis is also placed on expanding students' vocabulary and further developing their writing skills in German, especially with regards to economic and business terminology, and writing genres common in business contexts. As this is not intended to be a grammar review course, students are expected to have previously completed or be concurrently enrolled in GER 301 or its equivalent. This course complements other offerings in the German business track and prepares students for the final course in the Business German sequence. This course can also be counted towards either the German minor or the German major. It is offered once a year during the fall semester.", "prerequisite": "GER  301 or GER  302W", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "GER", "number": "310", "credits": "3 Credits", "description": "History, methods, and the terminology of literary interpretation and analysis in German.", "prerequisite": "GER  301 or GER  302W", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "344", "credits": "3 Credits", "description": "An overview of German culture from the Middle Ages to the present. Conducted in German.  GER 344 Intermediate German Culture (3) (IL) This course will be a comprehensive overview of major events and figures in German history that have influenced the development of German culture. This will be a foundational course that will enable students to better situate advanced courses in German literature and culture in the broader context of a cultural tradition that stretches from the Germanic migrations to the present. The course will be taught in German at the intermediate level and will be required of all German majors and minors. It will be a prerequisite for culture courses taught in German at the 400-level. Students will be evaluated on the basis of written tests, an oral presentation and essay on a major cultural figure or event, homework, and class participation. The course will be offered every semester. The enrollment for each section will be capped at approximately 22.", "prerequisite": "GER  301 or GER  302W", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "399", "credits": "3-12 Credits/Maximum of 12", "description": "Advanced studies in German language and/or literature.", "prerequisite": "GER  201", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "401Y", "credits": "3 Credits", "description": "Intensive practice in writing different text types in German.  GER 401Y Advanced Composition (3) (IL) GER 401Y is the writing across the curriculum component of the German language sequence. After thorough discussion of various text types, students will read and practice writing in different genres. GER 401Y concentrates on building other language skills as well. We will do so by reading and discussing short German texts from a variety of sources and watching film and television. In addition, we will review aspects of German grammar that present difficulties to many English speakers. Evaluation will be based on five writing assignments, a writing portfolio, quizzes, and class participation.The course will be offered twice a year with an enrollment of up to twenty students.GER 401Y is required for all German B.A. and B.S. major options as well as for the German minor.", "prerequisite": "GER  301 and GER  302W", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "GER", "number": "408", "credits": "3 Credits", "description": "Study of German business organization, forms of business communications, business terminology; writing of reports and abstracts.", "prerequisite": "GER 301", "other": ["International Cultures (IL)"]}, {"department": "GER", "number": "411", "credits": "3 Credits", "description": "Theory, methods, techniques, materials, bibliography; use of inter-active media; contributions of linguistics or psychology to language learning.", "prerequisite": "or concurrent: GER  401Y"}, {"department": "GER", "number": "412", "credits": "3 Credits", "description": "Structural comparison of the German and English grammatical systems: morphology, syntax, phonology.", "prerequisite": "or concurrent: GER  401Y", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "420", "credits": "3-9 Credits/Maximum of 9", "description": "Special studies in a particular literary genre in German literature, such as lyrical poetry, drama, or narrative prose.", "prerequisite": "GER 401", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "430", "credits": "3 Credits", "description": "Development of German from its earliest stages, including historical and cultural aspects.  GER 430 History of the German Language (3) (IL) This course provides an overview of the history of the German language from its origins to the present. Historical changes and dialectal variation in phonology (sound system), morphology (word structure), syntax (sentence structure), lexicon (vocabulary), and semantics (word meaning) will be examined. Particular emphasis is placed on the impact of cultural and historical changes on the development of German, including its standardization. Students will be evaluated on the basis of homework, classroom participation, tests, and an in-class presentation with a written abstract. No prior knowledge of linguistics is required. The class is conducted in German.", "prerequisite": "or concurrent: GER  401Y", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "431", "credits": "3 Credits", "description": "Significant works of German literature before the mid-eighteenth century considered in their cultural context.", "prerequisite": "GER 401", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "432", "credits": "3 Credits", "description": "Significant works of German literature from the mid-eighteenth century to the present considered in their cultural context.", "prerequisite": "GER 401", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "440", "credits": "3-6 Credits/Maximum of 6", "description": "Seminar devoted to a special topic in the field of German culture and civilization.", "prerequisite": "or concurrent: GER  401Y", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "472", "credits": "3 Credits", "description": "A study of both early and late romanticism, including such writers as Novalis, the Schlegels, E.T.A. Hoffmann, and Heine.", "prerequisite": "GER 401", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GER", "number": "489", "credits": "3 Credits", "description": "Introduces films in German since the 1960s and addresses issues relevant to German and European cultures and politics.  GER 489 Introduction to German Film History and Theory in Context (3) This course focuses on German cinema's development since the 1960s. The course situates the 'Young' and then 'New German Cinema' within contemporaneous European and U.S. film cultures. Thus the course will address the difference between the European cinematic culture of 'auteurs' versus the school of 'genres' in the U.S.The preceding traditions of Italian Neo-realism and of the Frenchnouvelle vagueare also engaged alongside a few Hungarian, Czech and/or Polish films. The students will have the opportunity to consider how these other national cinematic productions impacted the German filmmakers who were involved in the creation of a national German cinema that would critically engage Hollywood on the one hand, and distance itself from the Nazi past on the other.The course will be structured around questions about the grounds for a national cinema and its cultural and critical relevance both at the time these films were produced and today. Yet, the national question will not be the only focus of this class, in the course of which students will be able to discuss the historical, political and ethical questions raised by the directors selected. In addition, students in this course will learn about the specificity of cinematic language and will be exposed to some film theory. In conclusion, the course provides upper level undergraduate students with a basic knowledge of the most important New German films, with a confrontation with issues specifically relevant to a study of German culture, and with some familiarity with film theory.The evaluation methods for this course will be based on 1) participation [attendance; reports/worksheets, after each film and in class discussion]: 30%; 2) presentation 20%; 3) take-home mid term essay 20%; and 4) final paper 30%. The course is part of the German Program, in particular of the German Studies curriculum. It teaches students of German culture about German and European contemporary cinema, while situating the cinema within broader historical-political debates concerning Europe. It functions as an excellent complementary course to our GER LIT classes at the 400 level and offers an additional choice to pursue cultural studies to those who are more reticent about reading texts. Enrollment: 25. The course will be offered every other year.", "prerequisite": "COMM 250"}, {"department": "GER", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GER", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "GER", "number": "495", "credits": "3-9 Credits/Maximum of 9", "description": "Supervised off-campus, non-group instruction including individual field experiences, practicums, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GER", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GER", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GER", "number": "499", "credits": "3-12 Credits/Maximum of 12", "description": "Advanced studies in German language, literature, and culture.", "prerequisite": "any 300-level course in German", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]