[{"department": "GLIS", "number": "101N", "credits": "3 Credits", "description": "This course provides a broad introduction to the topic of global studies. This course meets the Bachelor of Arts degree requirements.This interdisciplinary course explores how people and nations confront the phenomenon of globalization, presenting different perspectives for studying and making sense of the world. Students are exposed to a variety of analytical approaches from the arts, humanities and social sciences to allow them to see how different perspectives portray the world, interpret events, and often shape human actions. The course begins from a humanities perspective, exploring the concept of social identity, in particular understanding how people in different cultures develop a sense of their identity and how this is perpetuated over time through a society's products, practices, and perspectives (e.g. artifacts, value systems, traditions). The focus then shifts to organizations in society, comparing how they operate with either national or global identities. This leads to an exploration of how information and communication technologies are tools to create both global connectivity, yet can also be a source of division. Globalization is then considered in terms of its impact on the natural environment, populations, and health. Challenges arising in each of these areas are the concern of all global citizens, and are explored in terms of how interdependencies are increasing their impact. The focus of the course progresses to gender, poverty, and human rights, exploring these in tandem with their literary representations, presented in both global and comparative contexts. Economic development models are also used to uncover trends in gender and poverty. The final focus is on global peace and conflict, highlighting how globalization, in bringing people and nations closer together, can also give rise to conflict and division. This course is one of two 100-level courses that are required for the GLIS major. While this course focuses on a general introduction to global studies as a field of study, GLIS 102N complements the topics raised here, exploring many from a range of different perspectives to prepare students for choosing their options through the major.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "GLIS", "number": "102N", "credits": "3 Credits", "description": "This course meets the Bachelor of Arts degree requirements. This course introduces students to five pathways to thinking about global issues today: Global Conflict, Health & Environment, Culture & Identity, Wealth & Inequality, and Human Rights. We will spend three weeks focusing on each problem. Students will complete the course with a stronger sense of many of the major global issues of our time, as well as a sense of how those issues can be approached and studied from a variety of humanistic and social scientific perspectives. Students will also learn how aspects of identity, like race, sexuality, or gender, affect and are affected by global forces. Combined with GLIS 101N, this course will help prepare students for lives and careers in which they will interact with these large-scale global issues on a daily basis; it will allow students to understand how various local or national issues are affected by global ones, and to see ways of intervening in the world to address global problems. 1. Global Conflict: Why do people fight? Is violence inherent to human society? How is it possible to dream of an end to war, as creative writers of many cultures have done? 2. Health & Environment: How does climate affect human history? How have societies and individuals interacted with their environments, and how have the relations between human beings and the natural world been represented in literature and the arts? How are health issues depicted in narratives and other media, and how do health crises challenge political or cultural norms? 3. Culture & Identity: How do we come to be who we are? How are we shaped by the circumstances we grow up in? What is culture, and how do we understand cultures other than our own? What happens when people move or change cultures, or when cultures move or change people? 4. Wealth & Inequality: Why are some nations, and some people, rich, and others poor? What structural factors help explain those differences? How does the distribution of wealth factor into what counts as a good society? 5. Human Rights: What are the most fundamental properties of being human? Does everyone in a society have the same rights?", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "GLIS", "number": "310", "credits": "3 Credits", "description": "This is a course on language rights, policy, and planning from individual, group, inter-ethnic, and national perspectives. Linguistic minorities are a consequence of colonization by European powers in different regions of the globe. Other effects of colonization and political conflicts include mass movement, migration, and the emergence of nationalism. In such contexts, minorities have made demands for language rights and used language policy and planning as strategies to realize demands for social justice. This course will examine how linguistic minorities secure opportunities to use their own languages and have them accommodated in official legislation as mother tongue, second, or foreign languages. The course will adopt a global perspective and analyze language rights as well as language policy and planning in diverse regions of the globe, including but not restricted to, Africa, Asia, and South America. Analysis will primarily focus on how language policies can be carried out from different perspectives (e.g., literary, linguistic, and political) in different geographical regions. After examining how language policies operate in and influence society, the course will use sociopolitical ideologies to explore the nature of the relationship between language policies and language rights and the ways this relationship enables one to achieve an expanded understanding of the impact of language policies and language rights on local language practices.", "other": ["Cross-listed with: AFR 310, APLNG 310", "International Cultures (IL)"]}, {"department": "GLIS", "number": "400Y", "credits": "3 Credits/Maximum of 3", "description": "Capstone Seminar focusing on critical themes and the development of the senior thesis for Global Studies Majors. This interdisciplinary course will offer a seminar on some current event, issue, or phenomenon that involves a significant proportion of the globe. Topics will vary each year and depend on the faculty member leading the course, but it may include subjects such as the European Union, global economic change, international pop culture, or international response to human rights violations. Students will develop, write, and workshop a global studies research thesis. Both written and oral work will be assigned and graded. Students will discuss material from a variety of academic fields such as political science, economics, sociology, history, anthropology, and cultural studies.", "prerequisite": "GLIS 101, GLIS 102", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "GLIS", "number": "478", "credits": "3 Credits", "description": "This course examines China's economic reform and development and its engagement with the world since 1978. It pays close attention to the interplay of politics and economics. The course first examines the initiation and process of China's economic reform. This part of course covers topics including state-owned enterprise reform, township and village enterprises, fiscal decentralization, and tax reform. Then the course explores China's interactions with the world, paying special attention to trade, foreign investment,and development aid. Finally, the course addresses the issues and challenges that China faces for sustainable development, including corruption, income inequality, and environmental deterioration. The goal of this course is to give students a comprehensive view of the political economy of contemporary China and its relationship with the world and to develop students' understanding of ecconomic reform and development in the developing world.", "prerequisite": "PLSC 3", "other": ["Cross-listed with: ASIA 478, PLSC 478", "International Cultures (IL)"]}, {"department": "GLIS", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "GLIS", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]