[{"department": "GREEK", "number": "2", "credits": "4 Credits", "description": "Further instruction in syntax and sentence structure.", "prerequisite": "GREEK 1 or permission of instructor", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "GREEK", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "GREEK", "number": "101", "credits": "4 Credits", "description": "GREEK 101 is the first course in a two-semester introduction to ancient Greek, the language of Homer, Sophocles, Plato, and the New Testament. Students will begin to learn the grammar and vocabulary necessary for reading Greek literature of different periods. Unlike a modern language, ancient Greek is not a spoken language. Consequently, the class will be devoted to honing reading skills through drills and the translation of short sentences and passages. Students will also be encouraged to compose ancient Greek sentences and passages as they develop their fluency in the language. By the end of the semester, students will be prepared to continue to GREEK 102.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "102", "credits": "4 Credits", "description": "GREEK 102 continues the work begun in GREEK101, which is prerequisite for enrollment. Students will continue to learn the grammar and vocabulary necessary for reading ancient Greek literature of different periods. During this course, students will begin to read extended, unadapted passages from Plato, Xenophon, the New Testament and other sources. GREEK 102 will prepare students for GREEK 203.", "prerequisite": "GREEK 101", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "GREEK", "number": "203", "credits": "4 Credits", "description": "GREEK 203 is the third course in the introductory ancient Greek language sequence. The aim of this course is to help students increase their familiarity with forms and vocabulary, as well as gain confidence in their ability to read, appreciate, and interpret ancient Greek literature. Students will be introduced to advanced grammar and syntax and will read extensive passages of ancient Greek prose. Greek prose composition will also comprise a significant component of this course. Possible authors covered in this course may include but are not limited to: Plato, Xenophon, Herodotus, Attic orators, and Lucian. The prerequisite for this course is GREEK 102 or the permission of the instructor.", "prerequisite": "GREEK 102", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "420", "credits": "3-12 Credits/Maximum of 12", "description": "GREEK 420 is an advanced reading course in ancient Greek, which focuses on the writings of prose authors. The primary aim of the course will be to hone students¿ ability to read connected passages of Greek prose by a given author or on a particular theme. In addition, students will read and evaluate secondary scholarship in preparation for a final research project. Possible authors/ genres of focus include, but are not limited to: Plato, Xenophon, the Attic Orators, Aristotle, Plutarch, Lucian, the Greek Novel, and the New Testament. The prerequisite for this course is GREEK 203 or the permission of the instruction. This course may be repeated.", "prerequisite": "GREEK 203", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "425", "credits": "3-6 Credits/Maximum of 6", "description": "GREEK 425 is a reading course in ancient Greek focusing on one or more of the major ancient Greek historians. The course is designed to advance the student's fluency in reading Greek prose, while at the same time enriching their understanding of Greek civilization and history by a thematic choice of historical readings. The course may concentrate on one author or may address a thematic issue with readings from a variety of Greek historians (usually Herodotus, Thucydides, or Xenophon, or Polybius). The prerequisite for this course is GREEK 203 or the permission of the instruction. This course may be repeated.", "prerequisite": "GREEK 203", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "430", "credits": "3-6 Credits/Maximum of 6", "description": "GREEK 430 is an advanced reading course in ancient Greek poetry. The primary aim of the course will be to hone students' ability to read and appreciate Greek poetry. In addition, students will read and evaluate secondary scholarship in preparation for a final research project. Possible poets include but are not limited to: Homer, Hesiod, Sappho & the Lyric poets, Callimachus, and Apollonius Rhodius. The prerequisite for this course is GREEK 203 or the permission of the instruction. This course may be repeated.", "prerequisite": "GREEK 203", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "440", "credits": "3-6 Credits/Maximum of 6", "description": "GREEK 440 is an advanced reading course in ancient Greek Drama (tragedy and comedy). The primary aim of the course will be to hone students' ability to read and appreciate Greek drama. In addition, students will read and evaluate secondary scholarship in preparation for a final research project. Possible poets include: Aeschylus, Sophocles, Euripides, Aristophanes, and Menander. The prerequisite for this course is GREEK 203 or the permission of the instruction. This course may be repeated.", "prerequisite": "GREEK 203", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "GREEK", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "GREEK", "number": "496H", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"department": "GREEK", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]