[{"department": "HIST", "number": "1", "credits": "3 Credits", "description": "HIST 1 examines the development of western civilization, beginning with the ancient world of the Mediterranean, Europe, and Mesopotamia, and continuing through Early Modern Europe, which involves the Reformation, the Counter-Reformation, and the early period of the Age of Exploration. The course is intended to introduce aspects of Ancient, Medieval and Early Modern history that has helped to shape the developments of Western Civilization. The examination of written and visual primary sources, as well as secondary sources, allows this course to examine the political, religious, economic, and cultural development of the western world. The variety of sources used in the course aids the students in learning how to understand and interpret history, and encourages the students to develop a critical method by which to evaluate primary and secondary historical sources.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "1H", "credits": "3 Credits", "description": "HIST 1H examines the development of \"Western\" civilization, beginning with the ancient world of the Mediterranean, Europe, and Mesopotamia, and continuing through Early Modern Europe, which encompassed the Reformation, the Counter-Reformation, and the beginning of the Age of Exploration. The course is intended to introduce aspects of Ancient, Medieval, and Early Modern history that have helped to shape the developments of \"Western\" civilization, including elements of its political, religious, economic, and cultural developments. The variety of sources used in the course aids the students in learning how to understand and interpret history and how to develop a critical method by which to evaluate primary and secondary historical sources.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "1T", "credits": "3 Credits", "description": "A survey of the Western heritage from the ancient Mediterranean world to the dawn of modern Europe.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "First-Year Seminar", "General Education: Humanities (GH)", "Honors"]}, {"department": "HIST", "number": "2", "credits": "3 Credits", "description": "This survey examines the history of \"Western\" civilization from the period of Early Modern Europe to the present. The development of social, political, and religious movements in Europe and the development of European colonies around the world had far-reaching, global repercussions. Among the broad developments of this complex period are the creation and collapse of several political and economic global empires, the development of modern nation states, revolutions in technology and industry, and the rise of nationalism, liberalism, socialism, and neoconservatism. The variety of sources used in this course will aid students in learning how to understand and interpret history and in encouraging them to develop a critical method by which to evaluate primary and secondary historical sources and to examine the political, religious, economic, and cultural developments of the \"Western\" world in the Early Modern and Modern periods.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "2H", "credits": "3 Credits", "description": "This honors-level survey examines the history of \"Western\" civilization from the period of Early Modern Europe to the present. The development of social, political, and religious movements in Europe and the development of European colonies around the world had far-reaching, global repercussions. Among the broad developments of this complex period are the creation and collapse of several political and economic global empires, the development of modern nation states, revolutions in technology and industry, and the rise of nationalism, liberalism, socialism, and neoconservatism. The variety of sources used in this course will aid students in learning how to understand and interpret history and in encouraging them to develop a critical method by which to evaluate primary and secondary historical sources and to examine the political, religious, economic, and cultural developments of the \"Western\" world in the Early Modern and Modern periods.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "3", "credits": "3 Credits", "description": "HIST/AMST 3 allows for faculty and students to work in a small setting in order to explore the history of the United States through a detailed interdisciplinary examination of a particular theme, institution, or person in American history. Faculty can structure their particular theme for this course, allowing for the incorporation of a wide range of materials, out of class field trips, examination of popular culture, primary source documents, and/or seminar-style discussions. For example, in recent years this course has been structured around the themes of \"Utopianism in America\" and \"The Life, Times, and Legacies of Abraham Lincoln\". In-depth examinations of such themes in American history offer students the opportunity to work closely with faculty in their area of interest, and to gain an understanding of American historiography and the historical profession.", "other": ["Cross-listed with: AMST 3", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "5", "credits": "3 Credits", "description": "Survey of the history and cultures of ancient Mediterranean civilizations in Mesopotamia, Egypt, Syro-Levant, Anatolia, Greece, and Rome. CAMS (HIST) 5 Ancient Mediterranean Civilizations (3) (GH;IL) This course provides an introduction to the history and cultural traditions of the ancient civilizations of the Mediterranean. From the origins of cities and the invention of writing, it surveys the intellectual, artistic, and political traditions that laid the foundations for the later civilizations of Europe and western Asia. Students will acquire a basic historical framework for the ancient Mediterranean from the third millennium BCE through the end of antiquity in the first millennium CE. Within this framework cross-cultural relationships of time and ideas will be established among religious texts, epic literatures, and political and legal traditions. In the part of the world where the division between Asia and the East and Europe and the West was born, the course will examine the development of regional and ethnic identities along with the historical development of concepts of the universal nature of humanity. This course is designed to serve as the foundation course for all majors in the department of Classics and Ancient Mediterranean Studies (CAMS).", "other": ["Cross-listed with: CAMS 5", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "5Z", "credits": "3 Credits", "description": "Survey of the history and cultures of ancient Mediterranean civilizations in Mesopotamia, Egypt, Syro-Levant, Anatolia, Greece, and Rome. CAMS 5Z Ancient Mediterranean Civilizations (3) (GH;IL), linked to ARTH 111Z. This course provides an introduction to the history and cultural traditions of the ancient civilizations of the Mediterranean. From the origins of cities and the invention of writing, it surveys the intellectual, artistic, and political traditions that laid the foundations for the later civilizations of Europe and western Asia. Students will acquire a basic historical framework for the ancient Mediterranean from the third millennium BCE through the end of antiquity in the first millennium CE. Within this framework cross-cultural relationships of time and ideas will be established among religious texts, epic literatures, political and legal traditions, and their representations in art and architecture. In the part of the world where the division between Asia and the East and Europe and the West was born, the course will examine the development of regional and ethnic identities along with the historical development of concepts of the universal nature of humanity. This course is designed to serve as the foundation course for all majors in the department of Classics and Ancient Mediterranean Studies (CAMS) and to provide a cultural and historical framework for interpreting the visual productions in art and architecture of these ancient cultures as they are examined in more detail in the linked ARTH 111Z course.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "6N", "credits": "3 Credits", "description": "In HIST 6N / METEO 6N, we'll survey how weather and history are integrated throughout time. Moving from past to present, the course will use case studies to navigate historical moments where weather shaped the outcome. Each case study will have a historical, cultural, and meteorological analysis of the event so students gain a deeper understanding of the national or international event and the integration of science and history. Weather has shaped the outcome of major world events. For example, a weather forecast led to the delay of the Allied invasion of Normandy (DDay), record cold weather in Florida led to the Challenger Space Shuttle explosion, General George Washington used fog to conceal the withdrawal of his troops at the Battle of Long Island, and the list goes on. The case studies range from the Revolutionary War through present day, and this period of history has been selected because there are firsthand accounts of the weather and/or recorded weather data for each event. The meteorological study examines the event's atmospheric conditions. How or why did they occur? How did they affect the event? Therefore, students will learn basic meteorology and climatology. They will also analyze weather maps and scientific data. The historical study provides context for the event. What lead to the event? What happened during the event? What are the event's lasting impacts? To better understand the decisions that leaders faced, students will be asked to assess risk and make decisions based on the same weather data or information leaders at the time had. Students will also explain the context, cause, and effects of major historical moments in everyday language to an audience of their peers through discussions and/or projects. The cultural study examines each event from a psychological and sociological point of view. What were the mindsets of the people and cultures involved in the event? How does the event connect to or parallel things in today's society? How would a present day culture react? This study will give students a better understanding of cultural differences in the world and how those cultural differences can alter the course of history. Time in the course is equally split between United States and international topics, and there will be frequent discussion of current events.", "other": ["Cross-listed with: METEO 6N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "10", "credits": "3 Credits", "description": "World Civilizations to 1500 is an introductory survey of the world's major civilizations from the rise of the earliest human communities to the age of global expansion in the sixteenth century. The emphasis will be on the distinctive histories and cultural values that shaped major regions and cross-cultural contacts between those regions. Students will learn how ancient to early modern societies adapted their environments, organized their political economies, expressed themselves in art and philosophy. The course provides a historical overview of global changes over time.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "11", "credits": "3 Credits", "description": "World Civilizations since 1500 is an introductory survey of the world's major civilizations from the age of global expansion in the sixteenth century. The emphasis will be on the distinctive and interconnected histories and cultural values that shaped major regions and cross-cultural contacts between those regions in the early modern and modern eras. Students will learn how early modern societies adapted their environments, organized their political economies, shared technology and ideas as well as being drawn into conflict with one another. The course provides a historical overview of global changes over time.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "12", "credits": "3 Credits", "description": "The course offers a chronological and topical survey, emphasizing immigration of diverse ethnic groups and religious, political, economic, and social developments, including industrialization and urbanization. This survey of the history of the Commonwealth of Pennsylvania satisfies the Gen Ed GH requirement. Course content features important events and themes in the history of Pennsylvania, including colonial development, the importance of Philadelphia in the Revolutionary and Civil War Eras, immigration and urbanization, and labor unrest, as well as the continuing relevance of history to Pennsylvania today", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "20", "credits": "3 Credits", "description": "An historical survey of the political, social, and economic development of America from colonial settlement through the Civil War and Reconstruction. This course meets the Bachelor of Arts degree requirements. HIST 20 provides a historical overview of change over time in North America before 1877 with a focus on the diverse experiences of different groups of Americans. Students will receive an overview of the most important historical developments in America History from the colonial period through Reconstruction, including the history of American slavery, the evolution of American political systems, gender roles, and regional differences, changes in immigration, economic development, and the American Civil War and Reconstruction. While \"knowing the facts\" is obviously important to historical understanding, this course helps students develop critical thinking skills. These skills include: close and thoughtful reading and analysis of primary and secondary sources; looking for a broader coherence or \"order\" to the material; independent analysis and effective articulation (both in writing and in class discussion) of well-reasoned, well-crafted conclusions and interpretations and arguments (conclusions/interpretations / arguments which are supported by specific factual evidence derived from a variety of sources). The three specific course objectives underscore its scholarly dimensions: (1) Students will gain a knowledge and understanding of the diverse histories of the peoples of the United States prior to 1877; (2) Students will gain an understanding and knowledge of the domestic, transnational and global political and economic processes that have shaped the lives, labor, institutions and cultures of the United States before 1877; (3) Students will learn how to \"think historically\" by placing documents written in the past in their historical contexts, and to consider the relationship of the past to the present. By the end of the course students will: Demonstrate an understanding of the chronology of American history prior to 1877. Demonstrate an understanding of the diverse experiences of different groups of Americans prior to 1877. Demonstrate an understanding of the economic, social, and political structures that emerged before 1877 and continue to shape the modern United States.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "20Y", "credits": "3 Credits", "description": "This course offers a writing-intensive historical survey of the political, social, and economic development of America from colonial period through the Civil War and Reconstruction, including the history of American slavery, the evolution of American political systems, gender roles, and regional differences, changes in immigration, economic development, and the American Civil War and Reconstruction. HIST 20Y provides a historical overview of change over time in North America before 1877 with a focus on the diverse experiences of different groups of Americans. Students learn how to \"think historically\", interpreting facts drawn from primary and secondary sources with the goal of understanding how historical events in America unfolded as they did. Students will learn how to recognize the relevance of the past to the present, and how to write to learn in ways that help them think about new material and learn to write in a historical genre.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "21", "credits": "3 Credits", "description": "An historical survey of the American experience from the emergence of urban-industrial society in the late nineteenth century to the present. This course meets the Bachelor of Arts degree requirements. HIST 21 seeks to introduce students to salient events, developments, and themes of United State history since 1877, including westward expansion and the decline of the Native American, the industrial revolution, urbanization, immigration, Gilded Age culture and politics, the labor movement, imperialism, Progressivism, segregation and African-American response, the women's movement, World War I, the Great Depression and New Deal, World War II, post-war prosperity, the Cold War, the Civil Rights movement, the Vietnam War, the disillusionment of the 'Seventies', the Reagan revolution, and America in the post-Cold War era. The social and ideological diversity of the American experience is a prominent theme of HIST 21. Students learn how to \"think historically\", developing their capacity to identify and analyze key themes and issues from the past, critically assess primary sources, and sharpen their skills in marshaling data and concepts, and expressing them cogently in discussions and in writing.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "21Y", "credits": "3 Credits", "description": "This course is a historical survey of the American experience from the emergence of urban-industrial society in the late nineteenth century to the present. This course seeks to introduce students to salient events, developments, and themes of United States history since 1877. Chief topics of the course include westward expansion and the decline of the Native American, the industrial revolution, urbanization, immigration, Gilded Age culture and politics, the labor movement, imperialism, Progressivism, segregation and African-American response, the women's movement, World War I, the Great Depression and New Deal, World War II, post-war prosperity, the Cold War, the Civil Rights movement, the Vietnam War, the disillusionment of the 'Seventies', the Reagan revolution, and America in the post-Cold War era. The social and ideological diversity of the American experience is a prominent theme of History 21Y.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "66", "credits": "3 Credits", "description": "This course is a survey of British history, which chronicles the origins and development of Great Britain from its Romano-Celtic past to the present. The course focuses on the long history of Britain, emphasizing its various and ever-changing political, cultural, economic, intellectual developments. The course is designed to instruct students on how to identify recurring trends and notable anomalies in how Britain developed and to recognize Britain's unique impact on broad international developments and on individual nations in both the past and present world.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "83", "credits": "3 Credits", "description": "HIST 83, students are expected to master the subject material of this seminar, as well as to acquire basic skills useful to the study of the humanities and Liberal Arts. The topics chosen for these seminars will acquaint students with a major figure, theme, or development in a significant historical area. Through readings, discussions, lectures, and research projects, students will learn to read historical documents and secondary sources, discuss them, formulate effective arguments, and write essays and papers. Historical analysis of this type will provide students with techniques for appreciating and judging arguments and presentations in many fields of learning.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "100", "credits": "3 Credits", "description": "The Greek world from the earliest Aegean cultures to the death of Alexander the Great and the beginnings of Hellenistic civilization. CAMS 100 / HIST 100 Ancient Greece (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. The course presents a survey of ancient Greek history and culture beginning with the Bronze Age palace-states of Crete and Mycenae, examines the emergence of Greek city-states, notably Athens and Sparta, traces their transformation through conflicts among themselves and with the Persian empire, and describes their eventual eclipse by the kingdom of Macedon. Since this course treats the beginnings of historical writing among the Greeks, students learn to evaluate diverse historical texts and their relationship to legend, myth, and poetry. The nature of historical thought itself is emphasized throughout the course. Also emphasized is the debate between the egalitarian Justice of democracy, the sober wisdom of oligarchy, and the overwhelming power of monarchy, as experienced by the Greeks down to the end of the fourth century B.C.E.", "other": ["Cross-listed with: CAMS 100", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "101", "credits": "3 Credits", "description": "History of the Roman Republic and Empire from the origins of Rome to the disintegration of the Empire. CAMS 101 / HIST 101 The Roman Republic and Empire (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements and fulfills 3 credits of the General Education-Humanities (GH) requirement. The course provides an introduction to the ancient Roman empire: how that empire came into being, how it evolved, how it came to govern much of the Mediterranean and European world, and how that empire declined. The course demonstrates the social and legal structures employed by a past society to govern an ethnically and religiously diverse population. The course also introduces students to the sources of our knowledge of the past, and illustrates how these sources are to be critically evaluated. This course complements other courses on the ancient Mediterranean world (such as HIST 100 / CAMS 100) and is a prerequisite to more advanced (400-level) courses in ancient Mediterranean history.", "other": ["Cross-listed with: CAMS 101", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "102", "credits": "3 Credits", "description": "This course is an overview of the ancient history and cultures of Canaan (the Mediterranean Levant of Syria-Palestine) and the emergence of Israel. It involves a critical view of biblical texts (especially the Hebrew Bible, aka Old Testament) in light of other ancient texts, archaeology, and historical methods, in order to explain the nature and the evolution of society, religion, and thought in the prebiblical and biblical era. We will be especially interested in the period from the end of the Late Bronze Age (c. 1200 BCE) to the Persian period (539-332 BCE), and will examine ongoing debates about the Bible and history, as well as the development of Israelite religion from polytheism toward monotheism and a distinctive worldview.", "other": ["Cross-listed with: CAMS 102, JST 102, RLST 102", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "103", "credits": "3 Credits", "description": "More than perhaps any other set of human afflictions, the phenomena that have gone under the names of \"madness,\" \"insanity,\" \"lunacy,\" and \"mental illness\" have historically provoked a wide variety of often contradictory reactions. Those who have been in the throes of \"madness\" have described experiences ranging from an ecstatic sense of holiness to being beset by undeniable impulses to feelings of unending despair. Observers have sought explanations for the behavior of \"touched\" and \"crazy\" individuals by invoking such things as sin, destiny, heredity, moral degeneracy, upbringing, trauma, fatigue, and body chemistry. Those afflicted have been admired, pitied, mocked, hidden from public view, canonized, imprisoned, restrained, operated on, sterilized, hospitalized, killed, counseled, analyzed, and medicated. Why? This course will examine the ideas that have shaped European and American perceptions of madness, insanity, and mental illness. This course will be an introduction to the modern history of \"madness\" in the Western world. In particular, we will examine the ideas that have shaped European and American perceptions of madness, insanity, and mental illness; the changing experiences of those afflicted; the development of those professions designed to look after those deemed mad, insane, and mentally ill; and the social and cultural assumptions behind treatments, policies, and public opinions.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "104", "credits": "3 Credits", "description": "This course will track the history of Egypt, the first nation state in the world, covering a time span of over 3,000 years. The investigation of the history will focus primarily on the major players (i.e. the pharaohs themselves) and the political events that shaped their reigns. Its history involves not only the Nile Valley, but also that of the entire northeast African continent and lands of Western Asia. The magnificent ruins and artifacts that have survived offer the student a visual examination of the ancients and will provide illustration to a great extent of the specific time periods and dramatic incidents. The student will also be confronted at every turn by textual sources (in translation) and the archaeological evidence. The latter will be addressed at length with introduction to archaeological expeditions. This will serve to teach the student the contribution of archaeological method and interpretation in the knowledge and understanding of the history of the Near East.", "other": ["Cross-listed with: CAMS 104", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "105", "credits": "3 Credits", "description": "This course examines the development and history of the Byzantine Empire from the decline of the Roman Empire to the fall of Constantinople to the Ottomans in 1453. As the Roman Empire disintegrated, the West slowly developed into smaller kingdoms, while the East survived in a unified empire centered on Constantinople. Modern scholars call this eastern empire, and its culture, Byzantine. This course examines the process by which the Latin imperial culture of Rome was transformed into a profoundly Greek culture, which for centuries represented the model against which other civilizations ¿ the various kingdoms of the Latin West, the Islamic caliphates of Damascus and Baghdad, and the Slavic chieftaincies of eastern Europe ¿ measured themselves.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "105H", "credits": "3 Credits", "description": "Development of Byzantine civilization from the decline of the Roman Empire to the fall of Constantinople.", "other": ["Honors"]}, {"department": "HIST", "number": "106", "credits": "3 Credits", "description": "This course examines the history of the Ottoman, Safavid, and Mughal empires, from their origins to the Safavid Collapse, a historical time period covering approximately 1300 to 1722. Each week, the class will focus on a major turning point or theme using a combination of regional case studies and primary sources. In the process, students will be exposed to ongoing historiographical debates about a variety of events and trends in Ottoman, Safavid, and Mughal history. Topics covered include war, diplomacy, urbanism, architecture, science, religion, technology, and art. This course focuses on and examines how the Ottoman, Safavid, and Mughal states evolved in a changing global context.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "107", "credits": "3 Credits", "description": "HIST 107 / MEDVL 107 examines the history of Europe from c. 300-c. 1400 CE. The many themes of this course include: the development of political, judicial and diplomatic institutions; the role of religion, especially that of Christianity in all its forms - orthodox, heretical, and popular - as a significant element of medieval society; the development of royal houses; and changes in economic and social life of medieval Europe. Within these primary themes, the course addresses many subjects, including the development of both secular and ecclesiastical authority, various efforts to control or wield violence, and the importance of a number of agricultural and economic changes that transformed Europe.", "other": ["Cross-listed with: MEDVL 107", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "108", "credits": "3 Credits", "description": "The course examines the social and political history of the \"Crusades\", one form of holy war in medieval Europe, the Levant, and North Africa, focusing primarily on the period from the 11th through the 14th centuries, but also offering background to, as well the history of later repercussions of, the \"Crusades\". This warfare of the Central and Late Middle Ages, later called \"Crusades\", were fought in many geographical regions, including the Levant, the Baltic, the Iberian peninsula, southern France, and North Africa. The course addresses various elements of this kind of medieval warfare, and examines how such \"crusading\" evolved with complex political, religious, and economic origins.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "109", "credits": "3 Credits", "description": "This course explores the major themes of U.S. Environmental History, examining changes in the American landscape, the development of ideas about nature in the United States, and the history of U.S. environmental activism. Throughout the course, we will be exploring definitions of nature, environment, and environmental history as we investigate the interactions between Americans and their physical worlds. HIST 109 provides an introduction to environmental history as a field of scholarship that examines changing relationships between human beings and the natural world. Environmental history centers on the examination of various questions about such relationships, including exploring how natural forces shape history, how humankind affects nature, and how those ecological changes then reciprocally influence human life. Major themes of the course include: (1) recognizing that American history has a natural context; (2) that relationships between nature and culture change over time; and (3) that knowledge about nature is socially constructed and historically contingent.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "110", "credits": "3 Credits", "description": "This course provides a broad introduction to the history of human relationships with nature throughout the world. The human relationship with the natural environment the world of plants, animals, and microbes, of air, water, and land is an important historical subject. History 110 provides a broad, thematic description and analysis of major global trends and shifts, with an emphasis on contemporary issues and problem solving. The most important goal of the course is to provide students with the historical context necessary to construct a thoughtful appreciation of the environmental dilemmas of our time. Ecology has contributed a great deal to historical understanding in terms of specific examples or case studies; however, it has also begun to reconstruct the overall structure of the history that we teach. History 110 seeks to leverage this new paradigm by encouraging students to break down the barriers that often divide the humanities and the sciences. This course utilizes environmental science to demonstrate and explain specific human tendencies. Finally, this course is structured to help students better situate the history of the United States in a more global centered view of both the past and contemporary environmental concerns. Particularly in relation to contemporary environmental issues, History 110 will make clear that many environmental problems are local in neither their construction nor impact. The course will focus on several critical points, including: How has the non-human world shaped the course of human history? What were the environmental impacts of historic changes in the ways humans produced and consumed resources? What ideas shaped the ways different groups of people defined and used specific resources? What role have science and technology played in changing popular attitudes about the human place in the world?", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "111", "credits": "3 Credits", "description": "This course is a historical analysis of agriculture and food production in the United States. It includes examination of the history of food production and consumption patterns, the food industry, food marketing, and the politics and regulation of the American food system. This course explores the food system as a nexus that brings together history, technology, and culture in ways that have significant impacts on human livelihoods and wellbeing. A core theme of the course will be consideration of questions about food ethics and the challenge of improving the sustainability of food systems including the need to maintain or increase improvements in productivity while also addressing social effects and reducing environmental impacts of food production.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "112", "credits": "3 Credits", "description": "Introduction to Public History lays a broad foundation for history-based careers in museums, historic site management, foundations, and government services. Practicing as a historian outside of a classroom opens worlds of very diverse professional opportunities. This course is designed to introduce students to that wide world and equip them to experiment with it. It teaches theories of public history practice, along with basic approaches and perspectives on audience development, collection management, interpretation, and organizational management and finance that all public historians need to know to succeed. The course will consider the past and future of the field. Students should encounter public history practice; there are various ways to make that happen, including meeting practicing public historians through field trips and/or in class, preparing a grant application, and presenting a modest Public History project in class. Public history offers opportunities to students in communication, media, management, finance/accounting, and education, as well as history. This course is the first stage of a public history emphasis or minor (when available) but also stands alone as an introduction to a growing and promising field of work for students drawn to history but seeking professional opportunities beyond graduate work and teaching.", "other": ["United States Cultures (US)"]}, {"department": "HIST", "number": "113", "credits": "3 Credits", "description": "This course offers a comparative survey of baseball history from its origins in the nineteenth century to the present. The course uses the broad cultural and geographic diffusion of baseball over time to examine the diverse and changing social, economic, and political meanings of this activity in different cultural settings, emphasizing the ways in which a common activity may acquire unique meanings in different cultures. Although North America, Cuba, and Japan demand attention as the most striking examples of baseball's pervasive impact, the course will also consider baseball as a global phenomenon, for example, exploring the minimal impact or failure of baseball promotions in many European and African societies.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "114N", "credits": "3 Credits", "description": "This course will explore how historical context influenced major innovators in health care. It will pursue the general education objectives of 1) integrative thinking, and 2) social responsibility and ethical reasoning. GH learning criteria will include: 1) knowledge of major cultural current issues and developments through time, 2) competence in critical thinking about topics in the humanities, and 3) familiarity with groups, individuals, ideas, or events that have influenced the experiences and values of different communities. GS learning criteria will include the abilities to: 1) describe the ways in which many different factors may interact to influence behaviors and/or institutions, 2) explain how social science researchers work to better understand and address world problems, and 3) recognize social, cultural, political and/or ethical implications of work in the social and behavioral sciences.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "HIST", "number": "115", "credits": "3 Credits", "description": "Chronological and topical survey of the story of Jewish life in America. We will trace the social, religious, cultural, and political developments in the Jewish community from the Colonial Period to the present. Topics to be covered include immigration, acculturation, ethnicity, gender, politics, and communal and religious innovation. While \"knowing the facts\" is obviously important to historical understanding, this course helps students develop critical thinking skills. These skills include: close and thoughtful reading and analysis of primary and secondary sources; looking for a broader coherence or \"order\" to the material; independent analysis and effective articulation (both in writing and in class discussion) of well-reasoned, well-crafted conclusions and interpretations and arguments (conclusions/interpretations/arguments which are supported by specific factual evidence derived from a variety of sources). The three specific course objectives underscore its scholarly dimensions: (1) Students will gain a knowledge and understanding of the relationship between the experiences of members of the American Jewish community and United States history as a whole. (2) Students will gain an understanding and knowledge of the political, economic, and social processes that shaped the American Jewish experience. (3) Students will learn how to \"think historically\" by placing documents written in the past in their historical contexts, and to consider the relationship of the past to the present. By the end of the course students will: Demonstrate an understanding of the chronology of American Jewish history. Demonstrate an understanding of the diverse experiences of different groups of Americans. Demonstrate an understanding of the social, political, and ideological structures that shaped the American Jewish experience and continue to shape the modern United States.", "other": ["Cross-listed with: JST 115, RLST 115", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "116H", "credits": "3 Credits", "description": "Historical perspectives on the western family since 1500: gender roles, marriage, sexuality, child rearing, and old age; emphasis on United States.", "other": ["Cross-Listed", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "Honors"]}, {"department": "HIST", "number": "116N", "credits": "3 Credits", "description": "This course explores the transformation of modern families in the \"Western\" world, beginning with the basic context and elements of families as early as sixteenth-century Europe and Colonial America. The course has a primary focus on marriage, parents and children, and gender in the context of the history of family, family life, and gender roles in the United States. The course focuses on the social history of families, encompassing the ever-changing elements of sociological, political, and gender history within American families.", "other": ["Cross-listed with: WMNST 116N", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "117", "credits": "3 Credits", "description": "HIST 117 / WMNST 117 provides students with an overview of the most important historical developments in the history of women in the United States, including women's actual experiences as members of a class, a race, and an ethnic community, the progress women have made as individuals, workers, and citizens as well as the opposition they have faced. While ¿knowing the facts¿ is obviously important to historical understanding, this course helps students develop critical thinking skills. These skills include: close and thoughtful reading and analysis of primary and secondary sources; looking for a broader coherence or ¿order¿ to the material; independent analysis and effective articulation (both in writing and in class discussion) of well-reasoned, well-crafted conclusions and interpretations and arguments (conclusions/interpretations/arguments which are supported by specific factual evidence derived from a variety of sources). The three specific course objectives underscore its scholarly dimensions: (1) Students will gain a knowledge and understanding of the diverse experiences of different groups of American women. (2) Students will gain an understanding and knowledge of the political, economic, and social processes that shaped the history of women in the United States. (3) Students will learn how to ¿think historically¿ by placing documents written in the past in their historical contexts, and to consider the relationship of the past to the present. By the end of the course students will: Demonstrate an understanding of the chronology of United States women¿s history. Demonstrate an understanding of the diverse experiences of different groups of American women. Demonstrate an understanding of the social, political, and ideological structures that shaped the history of American women and continue to shape the modern United States.", "other": ["Cross-listed with: WMNST 117", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "118", "credits": "3 Credits", "description": "Modern Jewish history is a complex and fascinating story. Some scholars depicted it as a long period of suffering and isolation that culminated in the Holocaust and only ended with the founding of the state of Israel. In recent decades a more balanced perspective has found wide acceptance. Today scholars highlight Jewish agency and different conditions in the various places Jews settled without downplaying anti-Jewish prejudice and violence. A recurring theme in this course concerns the relationship between individual Jews and Jewish communities, and on a broader level, the perception and treatment of Jews by societies and states. As Jews in Western and Central Europe \"left the Ghetto\" around 1800 and became citizens of states, they redefined their relationship to Jewish communities in strikingly different ways. Some Jewish women and men emerged as agents of change, others resisted change. We will explore Jewish \"responses to modernity,\" ranging from assimilation, Zionism, and socialism to migration. While many Jews in Western Europe and the United States prospered, the lives of Jews (and their neighbors) in Eastern Europe and the Ottoman Empire were shaped by social and economic crisis (albeit not constantly and not everywhere). For the twentieth century the course will concentrate on three major events that had a dramatic impact on Jews, especially in Europe: the First World War and the collapse of the large multiethnic Empires in Eastern Europe, the Holocaust and the founding of the first modern Jewish state, Israel.", "other": ["Cross-listed with: JST 118", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "HIST", "number": "119", "credits": "3 Credits", "description": "Survey of the development of gender roles in Western societies from the prehistoric era to the early modern period.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "120N", "credits": "3 Credits", "description": "This course traces the history of modern Europe, beginning with a brief contextual background of the French Revolution and the Napoleonic era. The course then focuses primarily on the political, economic, and social developments in Europe from rise of the European nation state during the nineteenth century through the present day. The course examines several broad topics, including the political and ideological developments of this period in European history; the origins and enduring impact of two World Wars; the developments of totalitarianism, fascism, socialism, and democracy in Europe; and Europe's political and economic roles in the modern world.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "121", "credits": "3 Credits", "description": "This course focuses on the history and historiography of the Holocaust from 1933-1945. In addition to cultivating intellectual skills, such as critical analysis and concise presentation, the primary purpose of this course is to provide an in-depth overview of the Holocaust. The course will touch on various aspects of the Holocaust, including the function of the \"Ghettos\", the role of the mobile killing units, extermination camps, Jewish resistance, the role of the Allies, Holocaust trials, and the question how the Holocaust can be compared with other genocides. The course will analyze the Holocaust using historical, literary, and philosophical approaches.", "other": ["Cross-listed with: JST 121", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "122", "credits": "3 Credits", "description": "The main goal of this course is to think through and understand major developments, ideas and issues in natural philosophy. \"Natural philosophy\" is the premodern term for science. The term \"science\" began to acquire its modern meanings around 1840. The geographic focus of this course is the Mediterranean region and Europe, but we will also investigate early science in China, the Indian subcontinent, and the Islamic world. The temporal coverage of this course is vast: from about 10,000 years ago to the 19th century. As is common in history courses, it will be essential for us temporarily to set aside modern and contemporary biases and ways of thinking. Our goal is to understand the world as ancient and premodern people did. Issues of religion will constantly make appearances in this course. If you have studied world religions already, that is great, but if not, the books and lectures will provide the essential points as we go along. You should also use Wikipedia or similar reference tools to look up any key term or concept that does not make sense to you, whether with respect to lectures or the books. It is your job to make an active effort to master the material. This course is ideal for anyone pursuing a scientific or technical major, but anyone should benefit from it. We will be exploring some of the most important issues that have shaped our world, key developments in the human capacity for creating knowledge and useful technologies, and, in some cases, innovative solutions to vexing problems. We will also examine some of the ways that social institutions, belief systems, and paradigms (models) have helped both to organize and to constrain human knowledge. If all goes reasonably well, this course will enhance your knowledge and open your mind to hitherto unfamiliar ways of thinking and approaches to problems.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "123", "credits": "3 Credits", "description": "A history of science and culture from the scientific revolution to the present. HIST 123 examines the intellectual, social, and cultural history of science from the Scientific Revolution to the present. The course covers a range of theoretical and applied disciplines, including engineering and medicine. In addition to major discoveries and new ideas, methods, and tools, the course examines the effect of social conditions on science as well as the impact science has had on society. Scientific developments in the Western world, broadly defined, constitute the organizing framework of the course, but the course also examines science in non-Western cultures", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "124", "credits": "3 Credits", "description": "This course explores the history of health, illness, and medicine in western society from Ancient Egypt through the modern world. Relying on both primary and secondary sources, the course examines major developments in the understanding of health, illness, medical treatment, and medical practice in western society from Ancient Egypt to the present. The course will explore such themes as the changing status of medical practitioners, the experience of patients in different historical settings, artistic depictions of illness and healing, and the increasingly prominent role of medicine in public policy in order to better understand the links between medicine and its social, cultural, intellectual, and political contexts.", "other": ["Cross-listed with: STS 124", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "125N", "credits": "3 Credits", "description": "Infectious diseases once thought to be nearly eradicated have seen a resurgence in recent years. The majority of the cases arose from people who deliberately chose not to vaccinate their children against these disease. Even in the twenty-first century the nature of disease and how to prevent it is not merely a matter of science, but an issue laden with cultural, political, and religious concerns. This course charts the history of disease both as a subject of scientific inquiry and a cultural and religious phenomenon. We will begin with early Greek and Egyptian attempts to understand disease as a foreign entity attacking the body and end in the twenty-first century with current ideas surrounding the use of antibiotics, vaccines, and emerging threats throughout the world. Along the way we will discuss the impact of significant epidemics - for example, Bubonic Plague, Syphilis, and Influenza - as well as changing scientific thinking of both how to deal with disease and how to understand the natural world. In tandem with the historical background key scientific ideas necessary for studying disease - including current understanding of the microbial world, microscopy techniques, and modern gene theory - will be presented to the students through classroom instruction and virtual laboratories.", "other": ["Cross-listed with: SC 125N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "127", "credits": "3 Credits", "description": "This course provides an interdisciplinary introduction to the study of Latinas and Latinos in the United States. The course includes a historical overview of the major events in the U.S. Southwest, Mexico, the Caribbean, and Central and South America that led to the creation of Latina/o communities in this country. Students will examine the formation of racial and class hierarchies within U.S. Latina/o communities; the processes of (international and regional) migration; gendered hierarchies and responses to sexism; and the complexities of U.S. Latina/o identity.", "other": ["Cross-listed with: AMST 127, LTNST 127", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "128N", "credits": "3 Credits", "description": "This course will investigate the development of mathematical thought in multiple Afro-Eurasian cultures from the Bronze Age through the early medieval period, including Mesopotamia, Egypt, Greece, India, China, and the Islamic world. Math will be examined as a cultural product, with specific developments contextualized in the generating civilization's history, socio-political structures, economic systems, artistic and literary movements, and prevailing religious and philosophical ideas. Students will investigate the ways in which specific aspects of a culture influenced the development of specific ideas about, approaches to, and techniques regarding number and mathematical processes. Key themes in this respect will be what social forces encourage the development of practical or theoretical mathematics; how a society determines what is truth; the conception of abstract ideas such as zero and negative, infinite, and irrational numbers; the social status of mathematicians and their relationship with political and social authorities; and what social forces hinder the development of practical and/or theoretical mathematics. Students will also consider how the availability of certain mathematical knowledge enabled the development of particular social systems, architectural achievements, and more. Key themes in this respect will be the mathematical needs of specific political systems (such as the accounting involved in imperial administration), legal systems (such as fair division of goods), and religious systems (such as the calculation of accurate systems of time). At the same time, students will draw connections across time periods and cultures by examining the interactions between civilizations and how those interactions influenced the development of mathematics as a human endeavor. Key themes in this respect will be understanding what political, economic, and other forces cause cultures to come into contact or seek out contact; and how the exchange of knowledge shapes both the receiving culture and the study of mathematics as a whole. As part of this course, students will study both specific mathematical ideas (e.g., number systems, deductive reasoning, geometric algebra, and the motivating problems that spurred development) and the specific ancient and medieval cultures named above.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "129N", "credits": "3 Credits", "description": "This course will examine the \"world\" of chocolate throughout human history. First cultivated by the ancient peoples of the Americas and then manufactured by Europeans and Pennsylvanians alike, chocolate has played a privileged role as a luxury good. An interdomain course, \"Chocolate Worlds\" is interdisciplinary, taught by faculty in the departments of Plant Science, Anthropology, and History. As a team we investigate the how diverse societies have differentially interacted with this crop. Rather than be organized chronologically, this course will be divided into course Units, such as the history of cocoa uses and cultivation, cocoa plant science and farming issues, chocolate making and markets, and the state of the global chocolate industry. The course's lectures and assigned readings work in concert equally directed by scientific inquiry and the queries of the social sciences and humanities. Assignments will address real world questions relating to contemporary cocoa cultivation and production, and its role in international development and social justice. As a class we will take field trips to sites such as local chocolate manufacturing facilities and cocoa research sites and laboratories. The learning objectives of this course include students' broad knowledge of cacao production, its history, and ethnical issues surrounding its cultivation in today's global economy. Additionally, students will gain an historical appreciation for the role this crop his played in diverse human societies and a scientific understanding of its genetic structure.", "other": ["Cross-listed with: ANTH 129N, PLANT 129N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Other Cultures", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "130", "credits": "3 Credits", "description": "Survey of the causes and consequences of America's deadliest conflict, the Civil War, from the end of the U.S.-Mexican War in 1848 through the end of Reconstruction in 1877. This course meets the Bachelor of Arts degree requirements. HIST 130 is a general survey of the American Civil War Era that satisfies the Gen Ed GH requirement. Course content features the causes of the war, the conflict itself, the consequences for the meaning of freedom in the United States, and the continuing relevance of this conflict today. Students will become familiar with American slavery; Northern and Southern social, cultural, political, and economic composition; the military progress of the war; problems on the home front; the struggle for emancipation; and the creation of a new nation based on free labor.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "130H", "credits": "3 Credits", "description": "Survey of the causes and consequences of America's deadliest conflict, the Civil War, from the end of the U.S.-Mexican War in 1848 through the end of Reconstruction in 1877. HIST 130H is an honors course surveying the American Civil War Era that satisfies the Gen Ed GH requirement. Course content features the causes of the war, the conflict itself, the consequences for the meaning of freedom in the United States, and the continuing relevance of this conflict today. Students will become familiar with American slavery; Northern and Southern social, cultural, political, and economic composition; the military progress of the war; problems on the home front; the struggle for emancipation; and the creation of a new nation based on free labor. The honors course will also take time to go further in depth in discussion and analysis of significant trends and topics in the history of the Civil War Era through intensive focus on primary sources in discussion and written assignments.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "131N", "credits": "3 Credits", "description": "This course provides a general introduction to two very different modes of thinking about race and slavery in the United States between the 1770s and the 1860s. The first half of the class will present historians' interpretations of the lives of slaves, the politics of slavery, and the Civil War. The other half of the class is devoted to examining cinematic and artistic treatments of slavery and the Civil War. Overall, the course will focus on the differences and tensions between historians' methods and ways of knowing about and understanding the world, versus the essential truths that artists try to present in film while focusing on the specifics of slavery and the Civil War in the United States. Rather than privileging one way of knowing over the other, the course will focus on the strengths and limits of each. In addition, the course will examine how collective historical memories concerning race, slavery, and the Civil War are created and contested. The first half of the class offers an historical analysis of the history of slavery in the United States between the American Revolution in the 1770s and the American Civil War in the 1860s. The second part of the class will focus on cinematic presentations of slavery and the Civil War. The second part of the course will NOT focus on using historical facts to evaluate a film's fidelity to history as a scholarly discipline. It will instead examine film as art, as a commercial endeavor, and as a cultural product. It will then explore how different filmmakers portray slavery and the Civil War in different genres; how films reflect the period of their production and the personality of their producers; the commercial demands of filmmaking and how that limits subject matter; and how films shape collective historical memories. Students will also learn the basics of film criticism.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "134", "credits": "3 Credits", "description": "This course provides an interdisciplinary introduction to the study of Latinas and Latinos in the United States. The course includes a historical overview of the major events in the U.S. Southwest, Mexico, the Caribbean, and Central and South America that led to the creation of Latina/o communities in this country. Students will examine the formation of racial and class hierarchies within U.S. Latina/o communities; the processes of (international and regional) migration; gendered hierarchies and responses to sexism; and the complexities of U.S. Latina/o identity. HIST 134 provides a survey of the history and cultures of Great Britain and Ireland from 1400 to 1800. The course particularly focuses on the diversity of English, Welsh, Scottish, and Irish cultures and customs, their influence on early forms of nationalism in the British Isles, and their importance in the formation of the modern British nation-state. The relationships between English and Scottish protestants, the importance of translating the Book of Common Prayer from English to Welsh, and the influence of Irish-born families of English descent on the governance of early modern Ireland were all key elements in the emergence of an empire under the authority of an English dynastic state whose practical control over the territories it claimed to govern often remained quite limited. Through an examination of primary and secondary historical sources. students will consider the dynamism of this process, involving complex interrelationships, rather than the simple supremacy of one ethnic group over another.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "140", "credits": "3 Credits/Maximum of 3", "description": "This course covers the origins of the Israeli-Palestinian conflict and how the issues at stake changed over time, up to the present day. The course situates the conflict in the history of the Middle East and the larger context of international relations, including the Cold War and the end of the Cold War. Topics include regional warfare and its significance, efforts at peacemaking, and social, economic, and cultural developments among Israelis and Palestinians.", "other": ["Cross-listed with: JST 140", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "141", "credits": "3 Credits", "description": "This course is an introductory survey, including political, social, economic, and cultural development of Kievan, Muscovite, and Imperial Russia. Tracing the history of Russia from the ninth to early twentieth century, this course examines the central role of the people, politics and culture at the crossroads of Europe and Asia. Particular topics include the rise of the Kievan State, the Mongol rule, the rise of Muscovy, Ivan the Terrible, Peter the Great, relations with Western Europe up until the end of imperial Russia under the last tsar of Russia, Nicholas II. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "142N", "credits": "3 Credits", "description": "This course examines the development of communism, one of the most powerful ideologies to have developed in modern history. This course first explores the writings of Marx and his advocates, notably Engels and Lenin, in order to understand why the first communist regime emerged in the unlikeliest of places: Russia. This course then examines the developments of communism through the evolution of the Soviet Union, the formation and development of the Communist bloc, the impact of Chinese communism, and the impact of Communist ideologies in other areas of the world, such as Cuba.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "143N", "credits": "3 Credits", "description": "This course studies the developments of right-wing totalitarianism in the twentieth century with special emphasis on Fascist Italy and Nazi Germany, which provided the roots for fascist developments in the modern world. The course concerns itself with understanding the social, political, and economic contexts of fascism, its governing assumptions, ideals, and values, how it worked in practice, and its consequences and historical implications. Another focus will be on the question of why these illiberal, anti-democratic, and ultimately murderous regimes appear to have appealed to many groups during the 1930s and 1940s, not only within Italy and Germany, but also within broader European society.", "other": ["Cross-listed with: JST 143N", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "144", "credits": "3 Credits", "description": "History 144 provides an in-depth study of World War II, which brought many new aspects to modern warfare: civilians were the majority of casualties, deliberate air attacks were made on cities, research brought the advent of new technologies, and several of the global belligerents represented the participation of militaristic totalitarian states where dictators had risen to power with considerable popular support. Thus, topics of the course include: the origins of the war; political and economic struggles leading to the conflict; actions of both Axis and Allied military forces; broad violence in the forms of rape and genocide; and the aftermath of the struggle.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "144H", "credits": "3 Credits", "description": "In-depth study of the origins and conduct of World War II. Political and economic aspects as well as military.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "HIST", "number": "145N", "credits": "3 Credits", "description": "This inter-domain course integrates historical (GH) study of the Holocaust with sociological (GS) perspectives on the Holocaust and human rights. Topical content begins with historical antisemitism (\"the longest hatred\") and elaborates the history of the Holocaust in German and in Europe. A second half of the course explores consequent definitions of genocide and human rights, globally established by the United Nations through international law. Post-war campaigns to reduce prejudice and to raise 'Holocaust consciousness' are presented along with sociological insights into problems of persecution through eugenics, xenophobia, and racialized inequalities. Survivor testimonies underscore the value of resilience and the ethics of standing up against injustice, including discrimination or persecution based on cultural or another group identification.", "other": ["Cross-listed with: SOC 145N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "HIST", "number": "147", "credits": "3 Credits", "description": "The study of East European Jewish history, fascinating in its own right, is also key to understanding the lived experience of modernity in a complicated and compelling part of the world. This course will thus seek to examine East European Jewry from the inside and from the outside. We will see how a minority community weathered the storms of modernity, while at the same time noting how their experiences reflect on the broader culture and forces around them. We will look to examine the entire East European Jewish landscape, but with particular attention to Russia and Poland. In addition to the textbooks, we will read articles on economics, culture, politics, gender, religion and literature, as well as reading primary documents. Students who complete the readings and written assignments and participate in class should expect to expand their knowledge of the East European Jewish past as well as enhancing their skills as historians.", "other": ["Cross-listed with: JST 147, SLAV 147", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "148", "credits": "3 Credits", "description": "This course examines the complex history of Penn State. The time period covered extends from mid-19th century origins as the Farmers' High School to the highly complex, multi-faceted, modern \"research university\" of the early 21st century. The course will study closely: the conduct, leadership, perspectives, and educational visions of notable presidents, administrators, and faculty (such as George Atherton, Edwin Sparks, Ralph Hetzel, Milton Eisenhower, Eric Walker, Jesse Arnelle, Howard Davidson, Della Durant, Seth Williams among many others); various dimensions of student life (including student protest and the demise of loci parentis); race and gender relations; athletics; and the challenges of university life, research, admissions, co-education and achieving diversity in the post-World War II era. The Penn State experience will be examined in the context of larger historical developments in American higher education, student life and attitudes, and the broad political / economic / social and legal environment. Comparisons will be made to other colleges and universities. Using primary and secondary historical sources, this course pursues a distinctly historical angle; particular emphasis will be placed on chronicling and evaluating change over time and thoughtful consideration of a diversity of voices and perspectives", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "150", "credits": "3 Credits", "description": "This course offers an introduction to the history of the United States in the 1960s. The dual goals of this course are to instill a particular body of knowledge - in this case, America in the 1960s, and to provide students with tools that will help formulate interpretations of this crucial period in U.S. history. Topics covered will include the leadership of John Kennedy, Lyndon Johnson, and Richard Nixon; the struggle for civil rights for people of color; the emergence of student movements across the country; the steady escalation of US involvement in Vietnam; shifting relations across gender lines, and particularly the rise of the modern feminist movement; and, finally, the growing influence of popular culture, such as music, literature, and film.", "other": ["Cross-listed with: AMST 150", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "151N", "credits": "3 Credits", "description": "This course examines the development of technology in the United States from the colonial period to the present, and places into a historical context the reception and influence of these technological developments on the social, economic, and political life of the United States. The technologies serving American society--past and present--range widely and include, for example, new harvesting techniques, railroads and motor vehicles, assembly-line mass production, and electricity and its multiple dependent technologies. Technologies have always influenced, and been influenced by, human societies; this course examines how technologies and Americans have interacted and influenced each other.", "other": ["Cross-listed with: AMST 151N, STS 151N", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "152", "credits": "3 Credits", "description": "Chronological and topical survey of the history of African Americans from the colonial period to the early twenty-first century. This course covers major themes in African American history including the societies and cultures of Africa, the Middle Passage, the Colonial experience, slavery, abolition, and the quest for freedom, Civil War and emancipation, Reconstruction, Jim Crow, the Great Migration, African American cultural expressions, WWII and the seeds of Civil Rights, the Freedom Movement, Black politics and White backlash. While \"knowing the facts\" is obviously important to historical understanding, this course helps students develop critical thinking skills. These skills include: close and thoughtful reading and analysis of primary and secondary sources; looking for a broader coherence or \"order\" to the material; independent analysis and effective articulation (both in writing and in class discussion) of well-reasoned, well-crafted conclusions and interpretations and arguments (conclusions/interpretations/arguments which are supported by specific factual evidence derived from a variety of sources). The three specific course objectives underscore its scholarly dimensions: (1) Students will gain a knowledge and understanding of the relationship between the experiences of African Americans and United States history as a whole. (2) Students will gain an understanding and knowledge of the political, economic, and social processes that shaped African American history. (3) Students will learn how to \"think historically\" by placing documents written in the past in their historical contexts, and to consider the relationship of the past to the present. By the end of the course students will: Demonstrate an understanding of the chronology of African American history. Demonstrate an understanding of the diverse experiences of different groups of Americans. Demonstrate an understanding of the social, political, and ideological structures that shaped African American history and continue to shape the modern United States.", "other": ["Cross-listed with: AFAM 152", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "153", "credits": "3 Credits", "description": "HIST 153 provides students with an overview of the most important historical developments in the history of America's Native people, including first contact with Europeans, diplomacy and war, assimilation and cultural traditions, military service and the rise of Native casinos. While \"knowing the facts\" is obviously important to historical understanding, this course helps students develop critical thinking skills. These skills include: close and thoughtful reading and analysis of primary and secondary sources; looking for a broader coherence or \"order\" to the material; independent analysis and effective articulation (both in writing and in class discussion) of well-reasoned, well-crafted conclusions and interpretations and arguments (conclusions/interpretations/arguments which are supported by specific factual evidence derived from a variety of sources). The three specific course objectives underscore its scholarly dimensions: (1) Students will gain a knowledge and understanding of the diverse experiences of different groups of Native people. (2) Students will gain an understanding and knowledge of the political, economic, and social processes that shaped Native American history. (3) Students will learn how to \"think historically\" by placing documents written in the past in their historical contexts, and to consider the relationship of the past to the present. By the end of the course students will: Demonstrate an understanding of the chronology of Native America history. Demonstrate an understanding of the diverse experiences of different groups of Native peoples. Demonstrate an understanding of the social, political, and ideological structures that shaped the history of Native peoples and continue to shape the modern United States.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "153Y", "credits": "3 Credits", "description": "A survey of the American Indian from prehistory to the present.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "154", "credits": "3 Credits", "description": "History of care of the impoverished (emphasis on gender, race, nationality, age of poor, and welfare givers), 18th century to present.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "155", "credits": "3 Credits", "description": "This course examines major developments in the history of modern American business and industry from the colonial period to the present. History 155 introduces students to a number of the main themes, concepts, and events comprising American business history. Although the course has a pronounced big business/large corporation focus, it nonetheless provides a broader perspective than simply one of selected corporate histories. Indeed, the course treats the conduct of business as an integral element of American society and culture. Topics to be discussed include the colonial commitment to commerce, the effects of new technologies, the emergence of modern large-scale industrial production and the changes it brought to business management, and the importance of world events and American businesses.", "other": ["Cross-listed with: AMST 155", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "156", "credits": "3 Credits", "description": "A study of the American worker from the preindustrial era to the present.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"department": "HIST", "number": "157", "credits": "3 Credits/Maximum of 3", "description": "HIST157 shows that, without railroads, the United States would not have become the United States. It provides a panoramic view of 200 years, from the earliest rail lines to the current day and shows how the rail industry affected everything, from the economy to daily life. One of the course's central objectives is to demonstrate how these changes were experienced differently by different communities and social groups.. The first half of the course investigates how and why the American rail network was built and how the public and government reacted to the changes it brought. It reviews the financial, geographical, and legal resources needed to build the first rail lines and why they proved to be superior to roads and canals. During and after the Civil War, the building of the transcontinental lines relied heavily on federal aid and the labor of minorities (including African American, Irish, and Chinese). Although many Americans initially embraced the railroad industry, after experiencing improvements in their local economies and lifestyles, many turned against it in the late nineteenth century. Hard economic times turned labor against management, farmers against the industrial centers, nativist Americans against immigrants, and so on. After two decades of protest, the reformers of the Progressive era passed sweeping legislation to regulate the industry. The second half of the course studies how railroads declined during the twentieth century and how government regulations were relaxed. In addition to the challenges of two world wars and The Great Depression, it explores how railroads experienced new economic and technological pressures. These include competition from motor vehicles and airplanes, which led railroads to lose most of their passengers and much of their freight. The change from steam to diesel locomotives brought difficulties for rail communities and rail workers. The course investigates how demands made by labor often served to alienate public opinion. Although streamlined passenger trains briefly regained public enthusiasm, this soon dwindled in the post-WW2 years, as Americans embraced the automobile and the airplane. By the 1970s, railroad troubles were extreme enough to test America's sense of balance between free enterprise and government aid. Despite public criticism, the federal government intervened, to create Amtrak and then Conrail. The final sections of the course investigate how the relaxation of federal regulations led to a partial rail renaissance. It shows how freight service has been a great success but why inter-city passenger service continues to be unattractive to many American citizens and investors.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "158", "credits": "3 Credits", "description": "HIST 158 examines the immigrant experience in North America since 1607. The course explores the various ways in which immigrants of diverse backgrounds experienced life in British North America and the United States, a study that includes an examination of immigration memoirs, policies, responses to immigration, and immigrant culture in different parts of the United States. In addition, the course will critically examine popular representations of immigrants and encourages an analysis of the resulting minority groups, their reception, assimilation, and persisting identity.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "159", "credits": "3 Credits", "description": "Chronological survey of the History of the FBI since its founding in 1908, focused on the evolution of Federal law enforcement, bureaucracy, the increasing power of the Executive branch, the targeting of various minority groups, civil rights and civil liberties issues, and the growth of a national security role for the federal government over time. In its long history the FBI has intersected with a wide variety of groups and issues, and this reality will further expose students to the histories of African Americans, gays and lesbians, women's groups, Latinos, Native Americans, war protesters, students, various political dissenters, immigrants, targeting of morality, obscenity, and labor organizing. Because the FBI is responsive to both the political and policy interests of presidents and the influences of American society, students will come to appreciate the influences that politics has on bureaucracy and law enforcement, as well as the different social, political, economic, and cultural influences that each historical time period have exerted on the FBI to help shape its priorities and structure.", "other": ["Cross-listed with: CRIMJ 159", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "160", "credits": "3 Credits", "description": "Introduction to the role of the United States Navy in the defense, diplomacy, commerce, and scientific development of the nation.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "161", "credits": "3 Credits", "description": "HIST/AMST 161 examines the history of the Battle of Gettysburg, as well as the political and social factors that have shaped perceptions of the Battle of Gettysburg as one of the Civil War's decisive battle and as a national symbol that has transformed over time. The variety of historical sources used in this course will aid students in learning how to understand and interpret history and in encouraging them to develop a critical method by which to evaluate primary and secondary historical sources.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "162N", "credits": "3 Credits", "description": "When Thomas Jefferson elevated one pursuit to stand with life and liberty as inalienable rights, he eschewed others. The Declaration of Independence features the pursuit of happiness rather than that of amusements, consumer goods, status, money, or ease. Happiness carried a history of deeper meanings in philosophy and religion. In 1776, \"happiness\" peppered discussions of individualism, rights, civilization, economics, and government, and echoed Ancient Greek dialogues about virtue and civil society. In America, \"happiness\" joined the religious language of salvation, rapture, and joy to define states of grace. By the twentieth century, happiness became suspect as the term frequently represented a superficial type of enjoyment in needless consumption manipulated through marketing. As happiness came to be twined with wealth and goods, so too did it align increasingly with success in all pursuits. Happiness became a form of winning and a status marker whose overt pursuit was as likely to lead to psychological and social problems as to health. We open with ancient philosophers and modern positive psychologists. The pursuit of happiness reached zenith speed in the history of American literature. From transcendentalists, to pragmatists, self-help, children's fantasy, psychoanalysis, or post-modernism, genres fell out of themselves in the pursuit to merely understand happiness. Novels, poems, memoirs, films, popular psychology, medical literature, memes, and blogs addressed happiness from nearly every conceivable angle to explore strategies such as choosing positive thoughts; stilling thoughts; cultivating enriching interests and habits; influencing our moods and emotions; and optimizing strategies for securing the resources, skill-sets, possessions, and relationships that encourage happiness. Some of these achievements aligned with health and economic benefits and introduced limitations in access or cultural relevance. Bio-behaviorists are exploring correlation vs. causation and ways of assessing social and individual well-being. Bringing modern bio-behavioral methodologies into the chronological narrative creates unprecedented opportunities for integrative study. Experiential elements of wellness fulfill goals of General Health and Wellness, identifying \"wellness as a positive state of well-being, not merely the absence of disease.\" Students will learn the most promising research on generating tangible, healthful benefits in individuals and communities and be introduced to sources for further learning, continuing to learn and pursue long-term happiness.", "other": ["Cross-listed with: ENGL 161N", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "164", "credits": "3 Credits", "description": "This course will study the history of Brazil, the only Portuguese-speaking nation in Latin America, from the colonial to the present period. We will examine Brazil's transformation from Portuguese colony to the seat of a nineteenth century transcontinental empire ruled by the only European monarch to rule from the Americas, and discuss developments such as plantation slavery and industrialization that transformed Brazil into an international powerhouse. We will examine political, economic, cultural and racial movements and institutions that defined Brazilian history during the empire, the first republic, the Vargas era, and the military dictatorship. We will conclude with a look at Brazil's struggles with democracy from the 1980s to the present as well as the rise of contemporary populist leaders, Brazil's struggles surrounding policing, political corruption, affirmative action, and its hosting international sporting events in the twenty-first century. This course is designed to introduce students to the making of the modern Brazilian state focusing on the period from the rise of the Brazilian Empire in 1808 through the modern day. We will survey major historical trends in Brazilian society, from its roots as a Portuguese colony and its role at the center of slavery and the slave trade in the Americas to its distinctive patterns of independence and nationhood. Brazil's experience as an independent nation during the nineteenth century (it became the only long-term monarchy in the Americas) offers an interesting point of comparison to the history of republican nationhood elsewhere in North and South America. We will also examine the challenges of state and nation building during the nineteenth and early twentieth century as well as the challenges associated with late industrialization and state-sponsored development.", "other": ["Cross-listed with: AFAM 164", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "HIST", "number": "165", "credits": "3 Credits", "description": "This course introduces students to the history and culture(s) of the Islamic world from c. 600-1500. The course develops a historical framework for understanding developments in religious and legal thought and practice, science, medicine, and technology, philosophy, and the arts. Students will learn about culture through lecture and discussion and through examination and analysis of a variety of texts and examples of material culture from different periods and regions.", "other": ["Cross-listed with: ARAB 165, RLST 165", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "166", "credits": "3 Credits", "description": "WMNST/HIST 166 History of Sexuality (3) (GH;US)This is a 100-level course on the history of sexuality, spanning several centuries and a wide range of contexts. The study of sexuality offers a particularly good lens for developing students' analytical ability to think historically about something that is often considered both natural and exclusively modern. Topics will include the role of religion, medicine, law, and politics in controlling and shaping sexuality; change and controversy over birth control, abortion, and gender roles; the connections between prescriptive literature and lived experience; the origins and meanings and racial violence in the context of ideas about sexuality; the concept of respectability; and the experiences and conflicts that have shaped the emergence of modern lesbian, gay, and trans identities. Students evaluate large questions about sources, methods, and analysis that historians face, including: How do we recover stories of private life, from societies and eras different from our own? How does our own understanding of what sexuality \"is\" complicate our historical exploration? What can we learn about gender and sexuality, repression and resistance, deviance and acceptance, identity and community from studying persons of nonconforming gender from the past? How has racism been employed to justify particular reproductive and sexual practices, as well as to limit claims to sexual respectability? To what extent is the study of sexuality inherently a study of gender, sex roles, and feminism? While focused primarily on the United States, the course will offer students opportunities to examine these questions in other, transnational contexts.", "prerequisite": "one introductory level course in History or Women's Studies", "other": ["Cross-listed with: WMNST 166", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "169", "credits": "3 Credits", "description": "The Indian Ocean has been a zone of human interaction for several millennia facilitating the circulation of individuals, ideas, commodities and technologies from the Mediterranean and Persian Gulf regions to as far as Southeast Asia. This course introduces students to the growing historical field of the Indian Ocean world and to the usefulness of studying oceans as a useful category of historical analysis. It will examine the dynamism of the Indian Ocean world by exploring themes like trade, migration, slavery, piracy, European expansion, and various kinds of cultural exchange across this vast body of water. The course will also introduce students to a variety of primary sources including travel narratives, personal accounts and diplomatic correspondences.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "170", "credits": "3 Credits", "description": "This course will introduce students to major themes in the history of ancient and medieval South Asia, a region that is now made up of the nation-states of Bangladesh, Bhutan, India, the Maldives, Nepal, Pakistan and Sri Lanka. Students will gain a firm understanding of the key political, economic and socio-cultural traditions and practices that shaped the formation of diverse social groups, sectarian and religious communities and political institutions in the region. While developing a chronological perspective on the history of pre-modern South Asia, this course will encourage students to look beyond the modern nation-state boundaries in order to gain a firm understanding of the region's shared political and cultural past in the period up to 1500. Students will learn to critically read primary sources and secondary literature, to identify historical arguments and take a position in a scholarly conversation in written assignments.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "171", "credits": "3 Credits", "description": "This course will offer students a general introduction to the cultures and societies of the South Asian subcontinent from the early modern to the contemporary through both the colonial and postcolonial periods. Beginning with an introduction to Mughal rule, the course traces the rise of British power, and the various responses to it from collaboration to mutiny before moving on to the development of competing nationalisms and anticolonialisms, including secular, socialist, Hindu and Muslim variations culminating with the creation of the postcolonial states of India, Pakistan, Bangladesh, Nepal, Sri Lanka, and Afghanistan. It then follows the continuing trajectories of these countries after independence, from the Nehruvian years to the neoliberal shift, with attention to emerging social movements and issues including caste and gender relations; religious and separatist politics; struggles around land and development; urbanization, and labor migration; leading into the 21st century. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: ASIA 171", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "172", "credits": "3 Credits", "description": "This course surveys the development of civilization in Japan from ancient times to the present. Among the key goals of this course is to discuss what is distinctive about \"Japanese civilization.\" As a survey of Japan it includes topics such as external relations and cultural exchanges with Japan's neighbors and the world more broadly; the nature of indigenous beliefs, Shinto and Buddhism; the making of the Japanese bureaucratic state and gentry society; the rise of the commercialized economy; the growth of Japanese culture; Tokugawa Japan, It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: ASIA 172, JAPNS 172", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "173", "credits": "3 Credits", "description": "This course examines the long history and culture of Vietnam with a focus on Vietnam's anti-colonial and independence movements of the 20th century. Among the topics covered are Vietnam under French colonial rule, the rise of nationalism and communism, Vietnam during WWII, and the multi-decade struggle for independence in the fifties, sixties and culminating in the departure of American forces in 1973. Vietnam's recent economic rise and emergence as a commercial power is also covered. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "174", "credits": "3 Credits", "description": "This course provides students with an overview of the most important historical developments and external relations of China, Japan and Korea from ancient times to the end of the eighteenth century. As a comparative survey of China, Japan and Korea it includes topics such as external relations and cultural exchanges; early Chinese dynasties; Confucianism, Daoism, Shinto and Buddhism; the making of East Asian bureaucratic state and gentry society; the rise of Ming-Qing commercialized economy; the growth of Japanese culture; Tokugawa Japan, and the role of Korea in East Asia. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: ASIA 174", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "175", "credits": "3 Credits", "description": "This course is a comparative survey of the internal developments and external relations of China, Japan and Korea since the early 1800s. Topics include interaction with the West, internal rebellions and reforms, the importance of certain key figures, the changing roles of women, student protests, and current social problems. Considerable focus will be placed on the transition from imperial to constitutional governments, rise of nationalism, World War II in the East Asian context and the phenomenal role China, Japan and Korea have played in shaping the post-World War II world. It offers a basic knowledge of the cultural, political, economic, artistic and historical background of this vital region of the world.", "other": ["Cross-listed with: ASIA 175", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "175H", "credits": "3 Credits", "description": "Comparative survey of the internal developments and external relations of China and Japan since their contact with the industrialized West.", "other": ["General Education: Humanities (GH)", "Honors"]}, {"department": "HIST", "number": "176", "credits": "3 Credits", "description": "Survey of cultural, institutional, and political history from ancient times to the present.  HIST 176 Survey of Indian History (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course surveys the history and civilization of India or South Asia from the earliest times to the modern period. The goal of the course is to enable students to form a comprehensive conception of the various facets of Indian or, South Asian civilization in a historical context. This course is an excellent foundation for the history of modern India and also complements a variety of existing courses on the history of the non-western world. In addition to satisfying the GI requirement, HIST 175 satisfies the general credit requirements for the history major or minor, including the 'non-western' component of the major. Non-majors may use this course to satisfy a general education humanities selection. Typically, students will be evaluated on in-class quizzes, written exams, participation in class discussions of assigned readings and critical reviews of books. This course is offered once every year and has an enrollment of 50 students.", "other": ["Cross-listed with: ASIA 176", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "177", "credits": "3 Credits", "description": "This course looks at Southeast Asia from the rise of early empires to the present. Beginning with the great empires of Southeast Asia this course surveys the rise of Southeast Asian politics, culture and society before examining the colonial period when the region was dominated by European imperial powers, and concluding with the formation of the modern-day nations of Burma (Myanmar), Cambodia, Laos, Thailand, Indonesia, Malaysia, Singapore, Vietnam, and the Philippines. As part of this discussion, issues of Indianization, colonization, life under Japanese during World War II, and the way in which Cold War politics shaped the region. By the end of the course, students should have a firm understanding of changes in Southeast Asia and be able to assess these historical factors that shaped the current societies.", "other": ["Cross-listed with: ASIA 177", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "178", "credits": "3 Credits", "description": "This course examines the history of Latin America from c. 1450 to 1820, a period encompassing Iberia and the New World before and after the conquest; the course is a survey of three centuries, from the initial encounter on New World soil of Iberian, African, and native cultures and races, to the birth of independent culturally- and racially-mixed nations. Historical topics include the conquest of the New World, the development of colonial institutions and their impact on indigenous cultures, the maintenance of slavery and forced labor systems, the development of multi-ethnic communities, and the origins of independence movements. We will also study colonial-era documents produced by or about the people who lived in colonial Latin America (what historians call primary sources), including Spaniards and Portuguese; African slaves and free blacks; Mayas, Nahuas/Aztecs, and Incas; mixed race peoples called castas; wealthy and poor; and women, men, and children. Particular emphases of the course focus on various patterns of conquest and cultural encounters, the processes of colonial rule, the nature of interaction between social groups, and the cultural impact of the colonial experience upon all colonial Latin America's peoples.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "179", "credits": "3 Credits", "description": "This course examines the history of modern Latin America from the period of independence in the early nineteenth century until the present day. Students will learn about the geographic and political development of the region, the development of various economic models, and the widespread extraction of labor focusing on This African slavery and Indigenous exploitation. The course examines significant events and historical trends in local, national, regional and global contexts. The goal of this class is for students to think critically and analytically about important issues and themes in Latin America, and to understand how historical events have shaped this region. We will look mostly chronologically at important historical themes such as social, economic, gender, and racial conditions, as well as politics, focusing on events throughout select Latin American nations and regions. The course will focus on the following periods: the Independence and post-Independence period of the Spanish Americas (1810-1850); the period of Brazilian Empire (1808-1889); the integration of Latin America into the modern world economy (1850-1914); the rise of oligarchic and military governments (1914-86); Latin America and the US in the Cold War (1945-1989); and concludes with the recent rise of the Populist New Left and the Conservative Right backlash and violence that has recently threatened many nations of Latin America. This course fulfills the requirements for Bachelor of Arts: Humanities (BA), International Cultures (IL), General Education: Humanities (GH) and fulfills the requirement for Latin American Studies Major and Minor as well as the general credit requirement for the History Major.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "180", "credits": "3 Credits", "description": "Historical survey of the evolution of warfare in the ancient Mediterranean region from prehistoric times to the Later Roman Empire. CAMS 180 CAMS (HIST) 180 Ancient Warfare (3) (GH;IL) Warfare has occupied a central place in the civilizations of the Mediterranean from the earliest times. The prehistoric origins of warfare is a hotly debated topic and constitutes the starting point for this course. Most scholars are agreed that military culture grew in step with sociopolitical development over the course of the third millennium BCE. In the following centuries, the Egyptians, and later the Assyrians and Persians, took great strides in developing sophisticated tactical systems, using infantry, chariotry, and cavalry. These matters occupy a little over the first third of the course. Across the Aegean Sea, Bronze Age (Mycenaean) Greece was ruled by elites occupying massively walled citadels, their leaders buried surrounded by their weapons. But how did these warriors fight? Do the epic poems of Homer memorialize Bronze Age combat? In the Archaic Period (700-500 BCE) infantry warfare in Greece was transformed by the appearance of the heavily-armored infantryman (the hoplite), deployed in a tight formation (the phalanx). The processes involved in the appearance of this kind of warfare, its nature, and its affects on Greek society and culture will be the focus of our attention for the second third of the course. On the periphery of the Mediterranean basin stood a variety of warrior cultures (the Scythians, Celts, or Germans). Numerous warrior-dominated polities vied with each other in Archaic Italy, but one of them, sitting on a ford of the river Tiber, ultimately rose to be the greatest military power produced by the ancient Mediterranean world: Rome. The Roman legions first won and then ensured the security of a Mediterranean-wide empire that stood for 700 years and evolved ultimately into world's first standing army of professional volunteers. The Roman military system holds our attention for the final third of the course. The course defines warfare broadly to include both tactical and strategic, as well as cultural and ideological, matters. Even this canvas is too vast to be surveyed in all its richness, so the major themes explored are: (i) what is war, where does it come from, and how did it change as civilization spread?; (ii) in what ways did warfare develop in the periods under study, in terms of strategy, tactics, and weapons technology?; (iii) how do different warfare practices reflect essential facets of the various cultures under consideration?", "other": ["Cross-listed with: CAMS 180", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "HIST", "number": "181", "credits": "3 Credits", "description": "The course offers a survey of the history of the Middle East from the rise of Islam to the present day. The course introduces students to structures of power, society, and economy in three distinctive periods: 1) the rise of Islam and the caliphal era; 2) the pre-modern Ottoman era; 3) the modern era. The course also introduces students to some of the art, architecture, and literature of each period. Students will thus gain some depth in each period of history and acquire a broad view of change over time.", "other": ["Cross-listed with: JST 181", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "181H", "credits": "3 Credits", "description": "The honors course offers a survey of the history of the Middle East from the rise of Islam to the present day. The course introduces students to structures of power, society, and economy in three distinctive periods: 1) the rise of Islam and the caliphal era; 2) the pre-modern Ottoman era; 3) the modern era. The course also introduces students to some of the art, architecture, and literature of each period. Students will acquire a broad view of change over time; the honors course also takes time to go further in depth in discussion and analysis of significant trends and topics in the history through intensive focus on primary sources in discussion and written assignments.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "182", "credits": "3 Credits", "description": "An historical overview of economy, industrialization, globalization and capitalism in Asia from the 16th century to present.  ASIA (HIST) 182 Asian Trade: Economy, Industrialization and Capitalism in Asia (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. Asian economies have experienced spectacular growth in the second half of the 20th century. But this growth is part of a longer story of Asian commerce and trade and its relationship to and integration with (and, in some cases, isolation from) global patterns of exchange. Moreover, these exchanges are best understood alongside the politics, society, and culture--sometimes local, sometimes regional--that shaped trade and business in entrepots, capitals, and hinterlands throughout Asia. This course begins with a historical exploration of the economic development and social change and ends by asking what lies in store for one of the world&rsquo;s fastest growing economic regions. By offering a historical frame for Asian economic experience , students will gain insight into the strengths and weaknesses of prevailing theories that tend to overstate centralized control, market mechanisms, and cultural determination. Asian economies and markets are quite diverse, consisting of emerging and mature markets, making it difficult to view them through a single lens. As a result this course seeks to introduce students to a variety of conceptual frameworks in these countries. Examinations of the major economic players China, India, and Japan form the backbone of the course, but the precise geographic emphasis will vary with instructor, and may also include discussions of Japan, Korea, Vietnam, Singapore, Indonesia, Taiwan, and other Asian states. Themes of the course will vary depending on instructor, but may include industrialization, sustainability and the environment, gender and labor, protest and political reform, and consumerism and advertising, among others. The course will also offer a general introduction to economic theories that underpin the concepts of globalization, capitalism, and socialism as they are understood in an Asian context. This course is intended as an introduction to Asia for those with particular interests in Business, Economics, Global Studies, Labor, and/or Government. Through weekly readings, films and class discussion students will be introduced to the development of Asian economies in the global context.", "other": ["Cross-listed with: ASIA 182", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "183", "credits": "3 Credits", "description": "This course tracks the changes in East Asian gender roles, relationships, and family life from 1800 to the present, placing private life at the center of the history of China, Japan, and Korea. Among the topics covered are the examination of gender and family life in early modern East Asia, considering topics such as marriage customs, the cult of female chastity, birthing practices, male-male sexuality as well as tracing the remarkable shifts in gender and private life in East Asia beginning in the nineteenth century and continuing to the present. The course will likely also cover issues such as women's liberation, changing expectations for courtship, marriage and sex, homosexuality, cross-dressing and androgyny, gender and revolution, and the state's role in regulating sex and procreation.", "other": ["Cross-listed with: ASIA 183", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "184", "credits": "3 Credits", "description": "This course examines will explore the origins, nature, and consequences of World War II in the Pacific. Moving beyond the common American focus on the war as a U.S.-Japanese conflict, it will explore the different nations, political movements, ideologies, and empires that clashed across. Asia-Pacific from 1931 to 1945. Topics include the culture and society of modern Asia in the periods immediately before, during and after the Pacific War. This course looks at social and historical roots of the war across Asia from the 1890s to the present to better understand the causes of the war and the affect it had on people throughout Asia.", "other": ["Cross-listed with: ASIA 184", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "186", "credits": "3 Credits", "description": "Taking cross-cultural communication and connectivity as its central themes, this course explores the central role that the silk roads and Indian Ocean maritime routes have played throughout Eurasian history. The course provides a historical survey of the land and sea routes and networks connecting Europe and Asia, the peoples and cultures that flourished along these routes, and a variety of exchanges that took place by way of these routes.The course develops insight into trends and patterns over a long period of history, from ancient to modern times; the course also focuses on distinctive periods of history when patterns were disrupted and reformed, and when relationships changed among the peoples and states involved in the silk roads and maritime routes.", "other": ["Cross-listed with: ASIA 186, JST 186", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "187", "credits": "3 Credits/Maximum of 3", "description": "This course examines the historical, cultural, and ethnic dimensions of Taiwan over several centuries to the present day. Taiwan's rich history and important economic role in contemporary East Asia clashes with its exclusion from international organizations like the UN and WHO and resultant international isolation. This class will examine the history and culture of Taiwan to better understand how it got here and where it might go. Topics covered will include the Dutch incursions in \"Formosa,\" Japanese colonization, years of military dictatorship and cross-straits tension, rebirth as one of the four \"Asian Tiger\" economies, and its current rowdy democracy and warming ties with the People's Republic of China. We will also explore the literature, film, and culture of this multi-ethnic, multi-lingual, and multi-cultural island.", "other": ["Cross-listed with: ASIA 187", "International Cultures (IL)"]}, {"department": "HIST", "number": "188", "credits": "3 Credits", "description": "Few places generate as much curiosity, interest, or controversy, in the Western mind than Tibet. This course examines Tibet from a variety of perspectives from Tibet's political unification under a single ruler in the seventh century up to Tibet's incorporation into the People's Republic of China in the latter half of the twentieth century. Adopting a Tibet-centered focus, this course examines three core dimensions of Tibet namely its people, its religion and its strong sense of place to allow for a more nuanced and comprehensive understanding of Tibet to emerge. No background or specialized knowledge about Tibet is expected though a willingness to read primary documents on a variety of religious, ethnic and political themes will be quite useful. In this course students can expect to gain an appreciation for how religion, history and politics contribute to contemporary portrayals of Tibet, Tibetans and their society.", "other": ["Cross-listed with: ASIA 188", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "189", "credits": "3 Credits", "description": "A historical introduction to unlawful, illegitmate and forbidden ideas, goods, people and places in modern Asia.  ASIA (HIST) 189 Illicit Asia: An Alternative Introduction to Asia (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines patterns of illicit ideas, goods, peoples and places of modern Asia. Traditional introductions to Asia emphasize a history of the powerful, of the center, of the victors. This course seeks to invert the customary narrative by telling the tale of Asia's early modern and modern past from the perspective of those working against the interest of the elite, popular and mainstream. At the same time, traditional introductions to Asia often risk perpetuating stereotypes of a mysterious, sinister Orient. In fact, dominant discourses both cross-culturally (such as Orientalism) and within a given society (such as elite nationalism) have tended to criminalize or pathologize all kinds of countercultures, alternate economies, non-normative sexual practices, and so forth. But attitudes to orthodoxy and legality may depend on one's relationship to the dominant system, and the dominant narrative. This class seeks to reveal those phenomena in a different light, according to their own contextual logic. Often omitted or ignored, understanding why illegal activity occurs, how it occurs and who the relevant actors are can offer an extremely potent introduction to the roles traditional boundaries of political, cultural and societal activity played in the shaping of Modern Asia. Specific content and regional focus will vary according to individual instructor, but the course will be divided into four general sections that focus on forbidden ideas, goods, places and peoples. Topics may unpack heterodox beliefs like secret societies or anarchist movements; trace the production and distribution of illegal goods like opium or counterfeit items; map out notorious places like the Golden Triangle or the internal workings of human traffickers; or examine the practices and scope of criminal elements like pirates or brigands. The objectives of the course are not only to learn about the illicit activities across modern Asia, but are also organized to encourage us to rethink the way we understand standard interpretations of the past and the factors that go into those perceptions. Students will also consider the changing justifications for and definitions of what is legal, normal and orthodox.", "other": ["Cross-listed with: ASIA 189", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "190", "credits": "3 Credits", "description": "This course introduces students to the peoples and places of the contemporary Middle East. The course engages students in discussion of themes that are pertinent to the region and to contemporary issues, including demographic change, youth culture and university life, human rights issues and activism, the trauma of war, effects of globalization, ecology, and the environment. Exploring the Middle East in the present with attention to historical context, students will examine a variety of sources, including news media, novels, stories, poetry, films, soap operas, blogs and vlogs.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "191", "credits": "3 Credits", "description": "The course is an introduction to the history of Africa south of the Sahara from the origins of humankind to roughly 1750 with a focus on common themes in the cultural and historical development of African societies. Themes include (but are not limited to): Ancient Egypt, Africa's place in the Greco-Roman world, Early African Christianity, Islam in Africa, European contact, and the Atlantic Slave Trade", "other": ["Cross-listed with: AFR 191", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "192", "credits": "3 Credits", "description": "This course offers an overview of the history of Africa from 1750 to the present. The course introduces students to the diversity of Africa's geography, demography, and history and investigates the experience of modern history through specific, regionally distinct, examples. Students will learn about structures of power, society, and economy in the colonial and post-colonial era in comparative terms, and about a variety of cultural forms and expressions.", "other": ["Cross-listed with: AFR 192", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "192H", "credits": "3 Credits", "description": "This Honors course offers an overview of the history of Africa from 1750 to the present. The course introduces students to the diversity of Africa's geography, demography, and history and investigates the experience of modern history through specific, regionally distinct, examples. Students will learn about structures of power, society, and economy in the colonial and post-colonial era in comparative terms, and about a variety of cultural forms and expressions. The honors course takes time to go into greater depth in a few selected topics, with attention to primary sources, historical method, and historiographic trends.", "other": ["Cross-listed with: AFR 192H", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "Honors", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "193", "credits": "3 Credits", "description": "This course covers the history of modern Iran from the late nineteenth century to the present day. The course examines significant events and historical trends with attention to local, regional, and global contexts, and examines causes and consequences of policies, protests, and revolutions from a variety of sources and perspectives. Through class lectures and discussions, and reading and written assignments, students will learn important terms, concepts, contexts, individuals, and events. They will learn to identify and analyze trends and patterns in Iran¿s history, make meaningful comparisons, locate specific events in meaningful context, and explain their significance. By the end of the course students will be able to explain current events in terms of Iran¿s long history of revolution as well as in terms of the more immediate history of the Islamic republic. Students will be able to discuss how the modern history of Iran is an example of larger historical trends of the twentieth century.", "other": ["Cross-listed with: JST 193", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "194", "credits": "3 Credits", "description": "Jerusalem, a city sacred to Judaism, Christianity, and Islam, is often depicted as the spiritual and physical center of the world. Throughout its 5000-year history, Jerusalem has attracted diverse cultures, empires, and peoples who have vied for control of this city that is both religiously significant and a very ordinary site of urban life. Jerusalem: Sacred and Profane surveys the archaeological, religious, cultural, political, social, and historical record of Jerusalem in the ancient, medieval, and modern periods. We will explore a series of themes in the city¿s history: the built urban environment, political power in and over the city, sacred sites and pilgrimage, the everyday experiences of Jerusalemites, the changing cultural meanings of the city across various religious and national traditions, and war, violence, and memory in the urban landscape. The significance of Jerusalem's past, its impact on contemporary society and politics in the modern Middle East, and differing visions for this contested city's future are examined in light of various interpretations of the historical evidence.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "195", "credits": "3 Credits", "description": "The history and memory of the Holocaust, the Armenian, Cambodian and other forms of genocide are often taught separately in different disciplines. This course will examine them together through the various ways different societies dealt with, experienced and understood these. Using the extensive literature on the history of genocide this course further suggests ways in which these tragic events affected and were entangled by each other's. Specific content will vary according to individual instructor, but topics may include victim cultures, ethnic cleansing, trauma, human rights, dark tourism, memorials, architecture as well as the general impact of these tragedies on global politics, or the way the memories of the tragedies were entangled with the civil rights and other struggles in American and global history.", "other": ["Cross-listed with: GER 123, JST 195", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "HIST", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "197I", "credits": "3 Credits", "description": "Formal course given on a topical or special interest subject offered infrequently; several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GS/GH GenEd course.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain"]}, {"department": "HIST", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "200", "credits": "3 Credits/Maximum of 6", "description": "Topics in American local history relating local to national developments and studying the historical method by using primary source material.", "prerequisite": "HIST 020 or HIST 021", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "203N", "credits": "3 Credits", "description": "HIST 203N course considers the role of the supernatural and otherworldly forces in a variety of human societies. The course focuses on narratives of the supernatural/anomalous, as well as the social power that such stories can afford their tellers, who may include poets, writers, filmmakers, journalists, and camp counselors, among many others. Students will read and analyze texts from history, folklore, anthropology, and popular media. A primary tool for describing and understanding the supernatural in human history is ethnography; as such, ethnographic texts dealing with the supernatural will also form an important component of the course, and students will have the opportunity to conduct ethnographic research of their own. In all cases, supernatural beliefs will be considered in their social contexts, rather than as texts divorced from the lives of groups and individuals.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "205", "credits": "3 Credits", "description": "The Phenomenon of antisemitism in American history from Peter Stuyvesant to the present.  HIST (J ST/RL ST) 205 American Antisemitism (3) (GH;US) This course explores the phenomenon of antisemitism in American history from the time of Peter Stuyvesant to the present. The significance and role of American antisemitic movements and authors, as well as its role in American society and culture, are examined and compared to those in European history over the same periods. At the same time, the impact of antisemitism on the lives and mentalities of American Jews is discussed. The course focuses on readings taken from original sources and recent historical treatments. The readings include material on colonial texts, Grant's notorious Order, nativists and anti-immigration texts, Gilded Age antisemitism, the Immigration Acts of the 1920's, Henry Ford's antisemitic campaign, Southern antisemitism and the Leo Frank case, the quota system at American universities, employment discrimination, the 'Gentlemen's Agreement' system, Black antisemitism, and the New Antisemitism.", "other": ["Cross-listed with: JST 205", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "210", "credits": "3 Credits", "description": "HIST/AFAM 210 explores the context and events that shaped African American life during the post-abolition period from the U.S. Civil War until WW II. The course begins with a comparative examination of the decline of African slavery and of emancipation throughout the Americas, and then focuses on Black lives in the United States. The course explores a wide range of topics, including: Black identity in the U.S., the criminalization and disposability of Black bodies, Reconstruction, Jim Crow Laws, lynching, forced labor, the rise of African American leadership, gender and reproduction under slavery and in freedom, the development of protest strategies, the impact of industrialization and urbanization, and the significance of African American culture and art.", "other": ["Cross-listed with: AFAM 210", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "211", "credits": "3 Credits", "description": "This course examines the history of African and Afro-descended people throughout the Atlantic world from the 15th through the 21st centuries. Historical topics include African societies before and after the advent of European trade systems, the Atlantic Slave Trade, the role of enslaved Africans in the conquest, establishment, and independence of the Americas, and the role of free and freed Afro-descended people in resistance, in service, and as citizens of American colonies and nations. This course compares and contrasts the systems of slavery that appeared throughout the Americas, the resistance that developed against these systems, and the nations that developed out of these institutions.", "other": ["Cross-listed with: AFAM 211", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "212N", "credits": "3 Credits", "description": "A natural disaster is the result of a natural hazard impinging upon human society. In this course we examine seismicity as a geophysical phenomenon and as a natural hazard that interacts with the built environment and the social structures of human societies. Whenever possible, we approach this subject historically. Among other topics, we examine the history of how earthquakes have been understood as well as the impact of earthquakes and seismicity on the history and development of certain societies. Our specific perspectives include: Earthquakes as understood by modern and contemporary earth science Major conceptions of earthquakes in the past Impacts of seismic hazards on the built environment of past societies Impacts of seismic hazards on politics, economic development and social policies of past societies Seismic hazards, earthquake-related technology, and contemporary societies By examining earthquakes in these ways, the study of earthquakes becomes a vehicle for enhancing skills in analytical reasoning. In particular, this course focusses on applications of modern scientific analysis and the approaches commonly employed in historical investigation. Specific skills addressed in this course include, processing and quantifying information, problem solving using evidence and sound reasoning, and expressing ideas with clarity. Immersion in the study of earthquakes affords an opportunity to think more broadly about how people have dealt with natural disasters in the past and to explore the roles that science, technology, and social policy play in defining and addressing natural hazards in contemporary societies and in the future. Class meetings include lectures, discussions, and in-class activities. We analyze scientific observations that have led to increased understanding of earthquakes, earthquake hazards and risk. We also make extensive use of case studies as concrete examples of different types of earthquakes, the historical evolution of ideas about earthquakes, and the range of social impacts of earthquakes. Reading assignments provide essential background for class sessions.", "other": ["Cross-listed with: GEOSC 212N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "213Y", "credits": "3 Credits", "description": "This course examines the social, political, and economic history of African American women in the United States from slavery to the present. Using secondary and primary sources along with film and discussion, we will explore the varied lived experiences of African American women paying special attention to the themes of family, sexuality, labor, politics, and religion. We will examine how the simultaneity of racial and sexual oppression influence African American women¿s actions. Additionally, we will consider dominant images of African American women in a historical context. While the course is primarily discussion in format, the professor will lecture when necessary. As the course is writing-intensive, papers of various lengths constitute the bulk of student assessment.", "other": ["Cross-listed with: AFAM 213Y, WMNST 213Y", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "220", "credits": "3 Credits", "description": "Introduction to and survey of the Jewish and other Diasporas around the world.  HIST (J ST) 220 The Jewish and Other Diasporas (3) (GH;IL) The long dominant view that the Jewish experience since antiquity defines Diaspora as a concept has been challenged in recent years. The meaning of the term Diaspora and related terms, especially (ethnic and/or national) identity and (ethnic and/or national) community, is a matter of much debate across disciplines. The longevity and diversity of distinct Jewish communities around the globe make the Jewish case a particularly interesting subject for study. In a wide geographical, chronological and disciplinary comparative sweep, the course will explore the diverse nature of ethno-national and ethno-religious diasporas (and sub-diasporas), their position, their place of origin (\"homeland\") and their new surrounding culture and society. More specifically, the course will analyze how Diaspora communities in Europe, Asia, and the Atlantic world reconstituted their identities as they expanded into new environments and encountered other cultures, from antiquity to the present. Emphasis will be placed on exploration of the intersection of politics and culture in respect to race, nationality, ethnicity, gender and class. A key question guiding the discussions will relate to the usefulness and limitations of the Diaspora concept, especially in regard to the discourse about globalization where the term is often used. The course will begin with an extensive discussion of theoretical texts about the Diaspora phenomenon. This is followed by case studies of several larger Diasporas, ranging from the Jewish, the Greek to the Chinese Diaspora. Several case studies, notably the Muslim Diaspora, the concept of a victim Diaspora, or alternative Diasporas highlight the limitations of the Diaspora concept. The course introduces students to interdisciplinary approaches, placing some emphasis on the use of theoretical texts written by historians, sociologists, political scientists, and anthropologists. The course includes a one-day field trip to the Lower Eastside in New York (visit of the Museum of Chinese in America, walking tour of the Lower Eastside to explore the history of a key American immigrant neighborhood).", "other": ["Cross-listed with: JST 220", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "238N", "credits": "3 Credits", "description": "The course provides students with basic knowledge on major topics in Palestinian and Israeli societies and cultures with a thematic analysis of these topics. It examines the encounter between Palestinians and Israelis from a perspective that questions our ability to understand them separately and it emphasizes interdependency between the Israeli-Palestinian conflict and internal tension within Palestinian and Israeli societies. Some of the major themes under discussion are: the place of religion in defining national identities and boundaries, intra-ethnic divides, competing discourses of citizenship, the fragile status of Palestinian citizens and non-citizens under the Israeli control system, struggles over collective memory, and the place of gender and sexuality in the conflict. The course emphasizes the intersection of politics and culture, demonstrating the political relevance of cultural fields such as music, cinema, and sports.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HIST", "number": "240Q", "credits": "3 Credits", "description": "This course surveys the institutions and social networks in which European fine arts were created, consumed and critiqued. Beginning with the medieval period and ranging to the early 20th century, the course will examine the variety of communities where public and private often intersected and which sponsored innovations in the arts. Often indexing social movements and political change, such communities include convents and cathedrals, royal academies and courts, coffee houses, salons, and theaters. Artists, performers, patrons, politicians, journalists, and others collaborated and competed in these spaces. Such communities could embody political and economic power, or foster resistance to it. This approach to the history of the arts in western culture puts the focus less on the individual creative genius of great composers, writers, painters, and sculptors, and more on the social exchanges and institutions that sponsored and received their work. Such an approach brings to light particularly the ways in which women played significant roles in the production and reception of culture: as salon hostesses, patronesses, and divas, women often enabled and enacted cultural production. Some examples of particular units of study might include: the German convent of Hildegard of Bingen (1098-1179), where monophonic chant and allegorical morality plays developed; the Mantuan (Italy) court of Isabella d'Este ,the first lady of the world, (1474-1539) where the roots of the madrigal began and where notable painters found support and sponsorship; the French salons of Mme. Geoffrin (1699-1777) and Mme. de Staël (1766-1817); and the student residences in Madrid where avant-garde writers and artists interacted. Each unit will also consider the relationships between the aesthetic norms and values of a period and the economic and political realities of sponsorship. The course will require that students attend at least one musical performance or concert held on campus during the semester and complete a brief writing project based on that experience. This requirement will encourage students to think about their own university as a contemporary space of cultural sponsorship.", "other": ["Cross-listed with: CMLIT 240Q, IT 240Q, WMNST 240Q", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "245", "credits": "3 Credits", "description": "This class explores the history of Middle Eastern and North African cities in the 19th-21st centuries. Cities are more than an agglomeration of buildings and bodies; they are also sites of tremendous political, economic, social, and cultural meaning, contestation, and change. The class focuses on the intersection of various urban settings (house, market, street, neighborhood), themes (sacred spaces, gender in the public sphere, sectarianism), and historical forces (nationalism, colonialism, war, revolution). The class draws on a wide range of primary sources such as memoirs, music, poetry, literature, and film, as well as multidisciplinary scholarship in history, anthropology, sociology, and architecture.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "250", "credits": "3 Credits", "description": "A survey course exploring the emergence and historical evolution of the modern Caribbean. This course will explore the evolution of the Caribbean region from the eve of the arrival of Columbus to the 21st century. It will explore Indigenous societies prior to the arrival of Columbus and the interactions that lead to their destruction and the consolidation of European colonial empires. We will explore the coercive labor systems that emerged in the region including indentureship, Indigenous enslavement, transportation of Europeans, the establishment of African slavery, and the establishment of the plantation system that defined the region until the 20th century using both free and unfree labor to maintain its dominance in these island societies. Themes examined will include revolutions in Haiti and Cuba, the struggle for independence, slavery and racial hierarchy, the rise of U.S. neo-colonialism and hegemonic control in the region, nationalism, tourism, and the economic underdevelopment that defines the Caribbean until today.", "other": ["Cross-listed with: AFAM 250", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "252", "credits": "3 Credits", "description": "The \"Arab Spring\" of 2011 that spread rapidly across the region and featured movements for democratization, social justice, and minority rights collapsed into authoritarian military rule, struggles over the role of political Islam, sectarian and civil violence, massive refugee flight and urban destruction, and outside intervention. This course places the 21st century Middle Eastern revolutions and their aftermath in a broader historical perspective. What were the political, economic, religious, social, and geopolitical factors that contributed to the outbreak of revolution throughout the region? In which ways were these revolutions new, and in which ways were they extensions of earlier, unresolved struggles? How can we understand the distinct trajectories of revolution and counter-revolution across the region? We will focus on several country case studies framed against their late 19th and 20th century histories. The class integrates extensive interdisciplinary and multi-media sources, including novels and memoirs, movies and songs, websites and twitter feeds.", "other": ["Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "255N", "credits": "3 Credits", "description": "HIST 255N studies the global history of the book broadly conceived, from oracle bones to \"born digital\" materials. The course will examine major developments including the invention of parchment and paper, the prevalence of woodblock printing in East Asia, the influence of printing in early modern Europe, Latin American writing systems, and the rise of the world wide web. Major themes include book-making technologies, the interplay of form and decoration, the social impact of printing, and the social context of reading practices. Students will combine course readings with hands-on experience examining materials in the Penn State Library's Special Collections and the Palmer Museum.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "260", "credits": "3 Credits", "description": "Through the medium of film, HIST/JST 260 examines the contemporary and historical transformation of the Middle East from the Ottoman period, through the British and French mandates, and the eventual establishment of the modern nation-states. This course analyzes the political-religious-social tensions of this region, and through film illuminates many of the conflicts in a different light. This course engages in specific film define certain moments in the contemporary history of the Middle East. The films reveal the culture perception of politics, the Arab-Israeli conflict, views on and of religious and ethic minorities, women and gender issues, carious elements of political Islam, and the generational shift in politics and culture. The course will watch, analyze and engage in films (with subtitles) from - among other states - Iran before and after the revolution, Turkey, Israel, Palestine, Egypt, and Tunisia.", "other": ["Cross-listed with: JST 260", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "261Y", "credits": "3 Credits", "description": "This course explores why certain groups have been segregated in cities around the world in the last 500 years.  HIST (J ST) 261Y Ghetto: From Venice to Detroit (3) (GH;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the history of segregated and demarcated districts for certain groups of people within cities (and metropolitan regions) in the last five hundred years in different parts of the world. The course identifies factors that led to the establishment of segregated (and often demarcated) districts -and their eventual dissolution (or transformation). The course traces the social and political impact of exclusion within the segregated district, the possibilities of making contacts beyond the district, the function of innovation and cultural production emanating from these urban areas, and the conceptual trajectory of the Ghetto concept from Renaissance Venice to post-industrial Detroit. Cities and states have allowed certain groups to settle within their confines for economic benefit but have imposed severe restrictions to safeguard the respective city's and/or the state's cultural, political, and \"racial\" integrity. The course will present several representative case studies of segregated and demarcated districts in European, North American, Asian and African cities, highlighting strikingly different trajectories and purposes behind the spatial segregation of people categorized as different and threatening but also as useful. Comparing the case studies will lead to a discussion about the transformation of the Ghetto concept between 1517 and the present. Following a discussion of the Ghetto concept and an overview of urban history since 1500 we will study Jewish Ghettos in early and late Renaissance Italy and Central Europe. For comparison we will discuss the history of Dutch and Portuguese trade colonies in Japan around 1600. The second part of the course will focus on Jewish and other immigrant neighborhoods in late 19th century New York and Chicago. Before moving to the origins of the 20th century \"Black Ghetto\" (Chicago, Detroit) four related cases will be discussed: Chinatowns in the United States; residential segregation in colonial cities in South and East Asia, Nazi Ghettos in Poland and the Soviet Union; and townships in South Africa during the Apartheid period. The course introduces students to interdisciplinary approaches, placing some emphasis on the use of theoretical texts written by historians, sociologists, political scientists, and anthropologists.", "other": ["Cross-listed with: JST 261Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "266Y", "credits": "3 Credits", "description": "HIST/WMNST 266Y explores the social and cultural history of sexuality and violence in the United States during the nineteenth century. Both sexuality and violence are extremely broad topics, and the course will focus on a few intriguing elements of sexuality and violence, including courtship, prostitution, the early popular culture of sports, slavery, military violence, exploitative journalism, and sexuality and violence as metaphor. The course also examines the \"creation\" of homosexuality in the nineteenth century, and manner in which masculinity has been historically constructed.", "other": ["Cross-listed with: WMNST 266Y", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "292N", "credits": "3 Credits", "description": "This course will explore the social and cultural history of witches and witchcraft from the late Middle ages in Europe and the U.S. to the present. The very nature and broad scope of the topic lends itself to an interdisciplinary approach that combines history, folklore, religious studies, criminology, women's studies, art history, English literature and popular culture. Historically, real individuals were accused of witchcraft and suffered persecution and punishment accordingly. Others proclaimed themselves to be witches and the practice continues to attract adherents today such as in the modern Wiccan movement. However, modern consensus views witches as fictions: figures of magical power in folklore, literature, visual art and popular culture. From Shakespeare's Macbeth to the characters in the popular Harry Potter books and films, fictional witches have haunted European and American culture for centuries. This course will explore the complex interplay of fact and fiction in the history of witches and witchcraft. In other words, how do fictions become powerful enough to inform history? The course will also focus on the historical status of witches as a source of power outside of, and in opposition to, established political, religious and social structures. Since those accused of witchcraft were predominately women, how has witchcraft functioned as a means of empowerment for women as well as a tool for their persecution? And how has the representation of witches influenced attitudes towards women both historically and today? The course will begin with an historical inquiry into the belief in witchcraft during the late Middle Ages in Europe and the social and cultural role witches played in society. We will look at texts such as the Malleus Maleficarum (Hammer of Witches) published in 1486 as a guide for hunting and destroying witches, as well as studies on the more constructive role witchcraft may have offered women and communities. The course will be organized chronologically and move back and forth between history, such as the Salem witch trials, and the representations of that history in art, literature and film. Particular emphasis will be placed on the visual arts, from the engravings of German Renaissance artists such as Albrecht Durer and Hans Baldung Grien, the gothic paintings of Francisco Goya during the Romantic period, to contemporary artist Louise Bourgeois' monument to those executed as witches in Norway. The course will end with analysis of images of witches in popular culture, movies and television, and with a discussion of the modern representations of the domesticated witch and the femme fatale.", "other": ["Cross-listed with: ARTH 292N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "HIST", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "296A", "credits": "1-6 Credits", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "301W", "credits": "3 Credits", "description": "A course designed to introduce students to the analysis, methods, and practices of historical writing and research.", "prerequisite": "3 credits in history", "other": ["Writing Across the Curriculum"]}, {"department": "HIST", "number": "302M", "credits": "3 Credits", "description": "Thematic or topical investigation; emphasis on historical criticism and analysis.", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "302W", "credits": "3 Credits", "description": "Thematic or topical investigation; emphasis on historical criticism and analysis.  HIST 302W Undergraduate Seminar (3)(BA) This course meets the Bachelor of Arts degree requirements. The principal aim of the course is to assist in training History Majors in writing, analysis, and criticism by pursuing the study of one historical topic in detail. The precise contents of the course may vary in accordance with the teaching and research interests of the instructors. The course is not a conventional lecture course. It is, instead, designed in the seminar format with emphasis on discussion, sequential writing assignments, and further developing the core skills of the historian. Several features reflect its writing intensive designation. The course requires a series of writing exercises (with on-going instructor feedback), attention to relevant methods of research, all leading to the production of a final seminar paper. The final paper should effectively advance a reasoned argument derived from multiple sources (a portion of which must be primary sources when the historical topic permits).", "prerequisite": "4th semester standing", "other": ["Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "305Y", "credits": "3 Credits/Maximum of 6", "description": "The course is a research seminar for undergraduates majoring in Middle East Studies and for students interested in pursuing a sustained research project on a topic related to the Middle East. Course topics on the Middle East will vary according to the interests of the instructor. This course is writing-intensive with attention to developing, drafting, and producing a quality research paper over the course of the semester.", "other": ["Cross-listed with: JST 305Y", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "320", "credits": "3 Credits", "description": "Aspects of global history in 20th and 21st centuries and study of selected trends and controversies."}, {"department": "HIST", "number": "320W", "credits": "3 Credits", "description": "Aspects of global history in 20th and 21st centuries and study of selected trends and controversies.", "other": ["Writing Across the Curriculum"]}, {"department": "HIST", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Study in selected foreign countries of various periods and topics in history.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "400", "credits": "3 Credits", "description": "This course examines different case studies of agriculture, food production, and food availability in diverse settings to show how access to food and its denial intersects with ethnic and nationalist politics, imperial and colonial encounters, and global asymmetries. The course reveals the close association of food to social and cultural identities and to conflicts in a global history framework. Spanning case studies from the Irish Potato Famine of the mid-nineteenth century to the Russian Famine of early twentieth century to the Bengal Famine of mid-twentieth century, the course focuses on disparity in access to food for social classes. It focuses on discrete social classes (landlords, farmers, labor, women), but also on modernizers, agronomists and scientists, on state, and on global diplomacy and developmentalist perspectives in the post-World War II era to show the embeddedness of food production and consumption in social relations and in emergent political economy contexts.", "prerequisite": "3 credits in HIST", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "402N", "credits": "3 Credits", "description": "Russia is the largest country on earth. It has had a major influence on world events, especially during the Soviet period. The Soviet period represents the greatest economic experiment ever undertaken. Russia has had a vast imperial experience, and its economy has proven capable of producing nuclear weapons and space exploration. Yet, its economy remains dependent on natural resources. Russia is a literary, nuclear and geopolitical superpower but not an economic superpower. This juxtaposition is unique. The aim of the course is to provide a review of Russian economic history together with main concepts explaining the peculiarities of economic and institutional development of the country. The course combines historical narrative with formal economic analyses. We will utilize both an economics and a history perspective. We will explore the development of the Russian economy in the Tsarist period, the abolition of serfdom and Russian industrialization before the Russian Revolution, and we will explore the economic history of the Soviet period. We will also explore the interaction of economic history with social history. The course will conclude by examining the myriad economic and social difficulties encountered in transitioning from a socialist to capitalist economy.", "prerequisite": "ECON 102", "other": ["Cross-listed with: ECON 472N", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HIST", "number": "403", "credits": "3 Credits", "description": "The career of Alexander, his impact on his own time, and the Hellenistic legacy.", "prerequisite": "HIST 100", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "404", "credits": "3 Credits", "description": "Public historians build essential bridges between ordinary citizens and the knowledge and understanding of the past required by any self-governing society.  Knowing how time has acted upon a society, how things came to be the way they are, helps individuals and groups move toward where they want that society to go, what they want it to become.  This class will lay the groundwork for what is expected of public historians in the many professional settings available to them, which include museums, art galleries, national parks, historical societies, non-profit organizations, park and recreation commissions, historic homes, battlefields, foundations, corporations, government departments, preservation organizations, archives, libraries, living history organizations, tourism councils, convention and visitors' bureaus, and universities. This course allows students to experience of some of these roles and places, and more importantly, to develop a lived sense of how they all can fit together in an individual career. The course does this partly in the classroom and partly through direct engagement with doing public history, well-supported by faculty and classmates. The course invites students to meet public historians and to participate in the public history process - mobilizing accurate history to stimulate emotions that then produce citizen engagement. The heart of public history practice involves sharing authority with audiences and confronting the line between entertainment and education. The first several weeks of the course introduce students to specific elements of practice and examples of public history, followed by an extended public history work project that can be actual and/or virtual. After the completion of the project, students gather to reflect on their practice and develop a deeper theoretical understanding of what they have come to know. Together, the three sections of the course create the capacity, and the motivation, to become active public historians either as professionals or as participants in the communities students will encounter in their own lives.", "prerequisite": "HIST 020 or HIST 021 or HIST 001 or HIST 002", "other": ["United States Cultures (US)"]}, {"department": "HIST", "number": "405Y", "credits": "3 Credits", "description": "The political and social history of the Roman empire; economic institutions and religious groups which influenced Roman administration.", "prerequisite": "HIST 101", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "406W", "credits": "3 Credits", "description": "Guided research in the literature of medieval Europe.", "prerequisite": "HIST 001", "other": ["Writing Across the Curriculum"]}, {"department": "HIST", "number": "407", "credits": "3 Credits", "description": "Rise of European nations and evolution of their social and political institutions from the time of Constantine to the Crusades.", "prerequisite": "HIST 107", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "408", "credits": "3 Credits", "description": "European political, institutional, and social history in light of church- state tensions from the Crusades to the Renaissance.", "prerequisite": "HIST 107", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "409Y", "credits": "3 Credits", "description": "Surveys the history of anti-Semitism from antiquity through the Middle Ages to the present.  HIST (J ST) 409Y (RL ST 407Y) European Anti-Semitism from Antiquity to the Present (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course analyzes major episodes in the history of anti-Semitism and tries to clarify the motives and dynamics involved. It seeks to understand what these episodes have in common and what is unique in each case--is there a single universal, eternal antisemitism? Or are there rather 'anti-Semitisms' each belonging to a unique historical context? Is there a single continuous line of development in anti-Semitism? What is the relationship of a particular anti-Semitism to the national culture in which it originates?We will be reading the major original texts of anti-Semitism from Roman and ancient writers, through early Christian texts and medieval Christian Blood Libels against the Jews, documents of the Spanish expulsion, Lutheran tracts, Voltaire's essays, German philosophical texts from Kant to Marx, Wagner's racial essays, the Protocols of Zion, and documents of Nazi anti-Semitism by Hitler and Streicher. The major part of the grade will depend on a short research paper which will be presented in various drafts, so that the final version represents the culmination of discussion and constructive criticism and advice. This course is a parallel course to J ST/HIST 416 (Zionist History) and J ST/HIST 118 (Modern Jewish History). This course will count toward the Religious Studies, Jewish Studies, and History majors and minors in the 400-level category.", "other": ["Cross-listed with: JST 409Y, RLST 407Y, RLST 409Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "410", "credits": "3 Credits", "description": "Trends in medieval Jewish society under Islam and Western Christendom.  HIST 410HIST 410 Jews in the Medieval World (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. The Jews lived in widely scattered communities under Christian and Islamic rule in the medieval period. This course will examine how Jews adapted the traditions they developed in Palestine and Babylonia in the early centuries C.E. to the new conditions they encountered in Europe and the Mediterranean region from the ninth to the fifteenth centuries. It will focus on the general problem of how traditional societies survive in rapidly changing circumstances, particularly when their members are a minority population. The course will aim at developing students' skills in comparative analysis as they compare the adaptive strategies of Jews in different cultural spheres (the Franco-German region versus Spain, for example). They will also be asked to compare the different polemical stances Jews adopted vis-a-vis Christianity, on the one hand, and Islam, on the other. They will be encouraged to understand the ways in which Jews internalized certain aspects of the majority culture and rejected others. It is hoped that they will come to see how deeply Jewish history was intertwined with medieval Christian and Islamic history, despite inter-religious hostilities and the frequent need for Jews to defend against majority aggression.Students will be evaluated on the basis of two mid-term exams (the first after the survey of the Muslim world, the second after the examination of the Franco-German region) and a comprehensive final exam.The course will be linked to most of the courses taught in the field of Jewish Studies, especially J ST 111 (Early Judaism), J ST 114 (Modern Judaism), and J ST 118 (Modem Jewish History from 1492). It will also be linked to offerings in Religious Studies: RL ST 001 (Introduction to World Religions), RL ST 101 (Comparative Religion), RL ST 107 (Introduction to Islam), RL ST 124 (Early and Medieval Christianity), and RL ST 165 (Introduction to Islamic Civilization). Further, it would complement HIST 001 and 002 (The Western Heritage), HIST 107 (Medieval Europe), HIST 108 (The Crusades), HIST 407 (Early Medieval Society), HIST 408 (Church and State in the High Middle Ages), HIST 412 (Intellectual History of the Middle Ages), and HIST 471W (Classical Islamic Civilization, 600-1258).The course will count for 3 credits toward: a) the 22 credits required for the minor in Jewish Studies, b) the 33 credits required for the major in Jewish Studies, c) the 30 credits required for the major in Religious Studies, and d) the 36 credits required for the History major. It will be offered once a year with an enrollment of approximately 60 students.", "other": ["Cross-listed with: JST 410, RLST 410", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "HIST", "number": "411", "credits": "3 Credits", "description": "Political, cultural, and economic history of Britain from circa 400 to 1485 with an emphasis on the kingdom of England.", "prerequisite": "6 credits in European history or medieval studies", "other": ["Cross-listed with: MEDVL 411", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "412", "credits": "3 Credits", "description": "Intensive study of selected topics, such as philosophy, mysticism, heresy, the church, literary and artistic expression, and science.", "prerequisite": "HIST 107", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "413", "credits": "3 Credits", "description": "Celtic civilization from antiquity to the end of the middle ages.", "prerequisite": "3 credits in medieval studies, or in language, literature, or   European history of the medieval period", "other": ["Cross-listed with: MEDVL 413", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "414", "credits": "3 Credits", "description": "The transformation of consciousness from medieval to modern times, with special emphasis on Renaissance Italy and Reformation Germany.", "prerequisite": "HIST 001", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "416", "credits": "3 Credits", "description": "History of Zionist thought and politics to the foundation of Israel 1948.", "other": ["Cross-listed with: JST 416", "Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "417", "credits": "3 Credits", "description": "Seventeenth- and eighteenth-century royal absolutism in France, Prussia, and Austria; concurrent economic, social, and scientific developments; the Enlightenment.", "prerequisite": "HIST 001", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "418", "credits": "3 Credits", "description": "Development of revolutionary France and the First French Empire and their impact on Europe from 1789 to the Vienna settlement.", "prerequisite": "HIST 002", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "420", "credits": "3 Credits", "description": "Impact of two World Wars in twentieth century; social conflict and economic catastrophe; political radicalism; post-1945 recovery and cooperation.", "prerequisite": "3 credits in European history", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "421", "credits": "3 Credits", "description": "European women's lives from the Middle Ages to the present.", "prerequisite": "HIST 117", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "423", "credits": "3 Credits", "description": "Examines Orthodox Christianity from origins to present using critical historical analysis of primary and secondary sources. RLST 423 / HIST 423 Orthodox Christianity: History and Interpretations (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines Orthodox Christianity from its origins to the present by focusing on a series of four major problems using critical historical analysis of primary and secondary sources.1) The course provides students with the means to examine Orthodox self-understanding:Orthodox doctrine of God, its anthropology. 2)The issue of a world religion and the relationship of Orthodoxy to other world religions and secular authorities and other forms of Christianity, especially \"western\"Christians. 3) The challenge of alternate world religions--Judaism, Islam, western Christianities. 4)The challenge of modern Orthodoxy in the context of twentieth and twenty-first century developments and issues.", "prerequisite": "HIST 105", "other": ["Cross-listed with: RLST 423", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)"]}, {"department": "HIST", "number": "424", "credits": "3 Credits", "description": "The birth of monotheism and its relation to social organization, the idea of individuality, and science.  HIST (J ST/RL ST) 424H (PHIL 434H) Monotheism and the Birth of the West (3)(BA) This course meets the Bachelor of Arts degree requirements. Learn about the formation of Western culture while learning to analyze the texts and other evidence about its formation from a critical rather than naive viewpoint. The idea of monotheism probably arose very early, and was even briefly implemented as a state cultic policy in Egypt in the 14th century BCE. Why then did it take another seven centuries to become widespread--appearing in ancient Judah, Babylon and Ionia almost simultaneously? To answer this question, the course focuses on several developments through the medium of primary texts and archaeology: the shift from a state hinterland based in extensive agriculture and household processing to one organized for intensive agriculture and industrial processing the rise of recognizably modern science; the promotion of individuation and an international elite culture in the context of Assyrian and Babylonian imperial ambitions; the development of the historical and archaeological arts in the context of archaizing in order to re-invent local traditions; and the socialization of monotheism and of democracy. Students will be evaluated on their discussion of the textual evidence as well as on reports in class and a final paper. This is the sole honors course treating the birth of the West. It expands on knowledge acquired in courses listed as prerequisites and in ANTH/CAMS 012; CAMS 044; ANTH/CAMS 133; CAMS/PHIL 200; HIST 100; HIST/J ST 102; and PHIL 200 and enriches the student experience in CAMS 400, CAMS 440, CAMS 480; HIST 402; J ST 411; PHIL 437; PHIL 453, and PHIL 461. This course counts toward the major in Jewish Studies, History, and Religious Studies and toward the minor in Jewish Studies and Religious Studies.", "prerequisite": "CAMS 110", "other": ["Cross-Listed", "Bachelor of Arts: Humanities", "Honors"]}, {"department": "HIST", "number": "425", "credits": "3 Credits", "description": "This course examines the political, social, cultural, environmental and religious history of the Incas and their Andean subjects from the 15th century to the present. Via written and visual primary and secondary sources, the course explores how the Incas built the largest Indigenous empire of the Americas, and how their descendants and subjects experienced that empire¿s 16th century invasion and takeover by Spain's conquistadors, surviving to shape the world¿s adoption of their environmental innovations. The course will then survey how Incas and Andeans rose up against Spain in the 18th century, and in the 19th through 21st century fought against their economic marginalization by collaborating in the resurrection of the Incas as national, archaeological, and touristic ancestors in republican Peru, Bolivia, and Ecuador, with varying success.", "prerequisite": "3 credits in HIST", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "426", "credits": "3 Credits", "description": "This course is an in-depth study of the history of the Holocaust in Europe that puts special emphasis on primary sources. HIST 426 / JST 426 Holocaust (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. The Holocaust stands out as the most terrible and challenging phenomenon of the 20th Century. Societies and the scholarship struggled for decades to fully grasp how much the Holocaust has questioned widely shared assumptions about modernity and progress. This course pursues the overarching question how the Holocaust could have taken place. Who were the perpetrators, victims and bystanders? How much agency did they have? How was the Holocaust organized? The course will encourage students to critically engage with the Holocaust, and will consider a variety of different kinds of sources and means of representation, including oral testimony, film and fiction, as well as more conventional documentation. After discussing some of the most important studies about the Holocaust and identifying the main historiographical debates, students will look at the origins and the evolution of the \"Final Solution.\" The class will touch on the function of the \"Ghettos,\" the role of the mobile killing units, the extermination camps, and Jewish resistance. The course will also deal with Jewish responses to the Holocaust, notably with attempts to enable Jews to emigrate to safe countries; with efforts to alert the public to the systematic killing after 1940; and the support especially of American Jews for Jewish survivors and DPs. Apart from discussing the historiography, students will work mostly with primary sources. Students are expected to do extensive reading for this class and prepare oral presentations on their respective paper topic. The research paper for this course will be based largely on primary sources. Apart from discussing the historiography, the sessions will concentrate on the interpretation of primary sources: - documents created by the perpetrators, bystanders, and victims; - files relating to postwar trials of perpetrators; - photographs; - representations of objects relating to the Holocaust; - memoirs by survivors; - interviews with survivors and bystanders.", "prerequisite": "J ST 010 , J ST 121 , or by consent of the program", "other": ["Cross-listed with: JST 426", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "427", "credits": "3 Credits", "description": "Bismarckian power-state; rise to economic dominance; welfare and warfare under Weimar republic and Hitler; post-1945 reconstruction and democracy.", "prerequisite": "3 credits in European history", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "427H", "credits": "3 Credits", "description": "Bismarckian power-state; rise to economic dominance; welfare and warfare under Weimar republic and Hitler; post-1945 reconstruction and democracy.", "other": ["Honors"]}, {"department": "HIST", "number": "428", "credits": "3 Credits", "description": "The origins and implications of evolutionary theory.", "prerequisite": "an introductory science course and a history course", "other": ["Cross-listed with: STS 428", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "429", "credits": "3 Credits", "description": "Emphasizing the role of nationalism in European cultural, diplomatic and imperial developments; concurrent economic and social changes.", "prerequisite": "HIST 002"}, {"department": "HIST", "number": "430", "credits": "3 Credits", "description": "Influence of geography, economic conditions, and nationalism upon the Eastern European and Balkan peoples; Pan-Slavism, conflicting interests of the great powers.", "prerequisite": "HIST 001 or HIST 002", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "431", "credits": "3 Credits", "description": "This course deals with American foreign policy and Black liberation in Africa since 1945. AFAM 431 / HIST 431 Black Liberation and American Foreign Policy (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. Black Liberation and American Foreign Policy in Africa since 1945 presents an interdisciplinary approach to the study of American foreign policy in Africa. Course readings will consist of both secondary and primary sources to explore the evolution of American policy toward the continent over the last half-century, and the meaning of the American engagement with Africa for American politics and society. The course will also examine the reasons that Africa has served as a focus of concern among African Americans both prior to, and, over the period 1945 to the present. Of particular concern will be the ways in which American policy has reflected pressures from African Americans as a constituency in foreign policy. The focus of the course will be student-centered written research and discussion. Students will be required to select topics from the course outline for presentation in class with the instructor serving as the moderator of discussion and guide to relevant research materials. Students will be encouraged to use both primary and secondary sources for their research. Students will be expected to prepare two individual written presentations which will serve as the basis for class discussion (30% of the grade), a book review (10% of the grade), and a research paper of 15 pages (40% of the grade) on a topic drawn from the areas identified in the course outline. The final 20% of the grade will be awarded for participation in class discussion.", "prerequisite": "3 credits in African history; 3 credits in African political   science; or 3 credits in American political science", "other": ["Cross-listed with: AFAM 431", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "HIST", "number": "432", "credits": "3 Credits", "description": "An exploration of the political evolution of the Caribbean Region over the course of the 20th Century. HIST 432 / AFAM 432 Between Nation and Empire: The Caribbean in the 20th Century (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will explore the political evolution of the Caribbean Region over the course of the 20th century. Its focus will be the ways in which imperial rule and the search for national identity have been the parameters that have shaped Caribbean political history over that period. Students will explore, in written assignments and class presentations, the ways in which the region which has historically been a theatre of confrontation among the major powers in the international system continued to serve that role over the course of the 20th century. The costs that have been borne by the people of the region from these conflicts have been enormous and crippling for several societies, especially Haiti, Cuba, Jamaica, and the Dominican Republic. Among those costs have also been the continued dependence of these societies upon human migration, limited economic strategies of transformation, increasing levels of poverty, and the emergence of a wide variety of political systems that reflect different historical experiences, demographic diversity, varying levels of political autonomy, and a remarkable level of cultural similarities. Evaluation will be based upon two class presentations; one research paper and class participation. The course will be required for students pursuing the African Diaspora minor and for those seeking to broaden their diversity requirements. It can be used to meet non-Western history requirements in the History major.", "prerequisite": "HIST 250", "other": ["Cross-listed with: AFAM 432", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "433", "credits": "3 Credits", "description": "Enlightened absolutism, mercantilism, westernization; economic progress, liberal reforms, and revolutionary movement; major intellectual and cultural trends; Russia as great power.", "prerequisite": "HIST 141", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "434", "credits": "3 Credits", "description": "Revolution; social, political, economic, and cultural continuity and change in the U.S.S.R. since 1917.", "prerequisite": "HIST 141", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "435", "credits": "3 Credits/Maximum of 9", "description": "Study of a particular period or country in European history, its significance and relation to other areas and the present. (May be repeated for credit.)", "prerequisite": "HIST 001 or HIST 002"}, {"department": "HIST", "number": "436", "credits": "3 Credits", "description": "Religious, political, and constitutional developments in the British Isles.", "prerequisite": "HIST 001 or HIST 002", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "437", "credits": "3 Credits", "description": "Social, economic, and political history of Great Britain from late Stuart times until the mid-Victorian era.", "prerequisite": "HIST 001 or HIST 002", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "438", "credits": "3 Credits", "description": "Social, economic, and political history of Great Britain from the mid- Victorian era to the present.", "prerequisite": "HIST 001 or HIST 002", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "439", "credits": "3 Credits", "description": "Analysis of women's experience in the Holocaust and exploration of the role of gender in Holocaust Studies.  J ST (HIST/WMNST) 439 Women and the Holocaust (3) Most of the early study of the Holocaust focused almost exclusively on the experiences of Jewish men. It was men who wrote the first and most widely read Holocaust memoirs and men who produced the first studies of the Holocaust. The first question motivating this class is thus what we can learn from examining women's experiences. Is it possible that the ghetto, the camp, and the forest look different from women's perspectives? Are there factors we miss when we read primary documents written by only half of the participants in these historical events? Beyond this, however, our exploration will also lead us to look more broadly at gender as a category of analysis. What do we gain by bringing questions of gender to bear on our study of the Holocaust? Are there any ethical concerns that should inform our approach?", "prerequisite": "HIST 121", "other": ["Cross-listed with: JST 439, WMNST 439"]}, {"department": "HIST", "number": "440", "credits": "3 Credits", "description": "Background, establishment, and growth of the American colonies, including economic, political, social, religious, and intellectual developments.", "prerequisite": "3", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "440H", "credits": "3 Credits", "description": "Background, establishment, and growth of the American colonies, including economic, political, social, religious, and intellectual developments.", "other": ["Honors"]}, {"department": "HIST", "number": "441", "credits": "3 Credits", "description": "Forces in Great Britain and America causing withdrawal of thirteen colonies from the British Empire and the Revolutionary War.", "prerequisite": "3", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "442", "credits": "3 Credits", "description": "Confederation and Constitution; the Federalist and Jeffersonian periods; \"the Era of Good Feelings\"; \"the Age of Jackson.\"", "prerequisite": "3 credits in American history", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "443", "credits": "3 Credits/Maximum of 6", "description": "Jews have been part of Middle Eastern societies for thousands of years. They flourished at times and endured hardships at others, but they have been part of every significant social and cultural transformation of the Middle East. In this class, students will discuss the significant contribution of the Jewish community to the development of various Middle Eastern societies throughout the centuries. Students will critically read and analyze primary sources and secondary literature. We will delve into national historiographies of places such as Morocco, Egypt, and Iran-to name a few-and seek to discover a nuanced narrative of Jewish histories of the region. We will also analyze popular culture products, such as documentaries, television, and literature. The course will follow a chronological and thematic order, and will examine Jewish history in conjunction with global and interregional processes in the Middle East and beyond, such as colonialism, imperialism, nationalism, relations with the West, the formation of the modern nation states of the Middle East, and the Israeli-Arab conflict.", "other": ["Cross-listed with: JST 443"]}, {"department": "HIST", "number": "444", "credits": "3 Credits", "description": "Causes of the Civil War; conduct of the war, North and South; impact of the war; problems of Reconstruction.", "prerequisite": "HIST 130", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "444W", "credits": "3 Credits", "description": "Causes of the Civil War; conduct of the war, North and South; impact of the war; problems of reconstruction.", "prerequisite": "HIST 130", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "445", "credits": "3 Credits", "description": "Economic, social, political history of the United States, 1877-1919, emphasizing growth of industrialism and development as a modern nation.", "prerequisite": "3", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "446", "credits": "3 Credits", "description": "The Roaring Twenties, the Great Crash, Depression, and New Deal; war debts, reparations, isolationism, and World War II.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "447", "credits": "3 Credits/Maximum of 3", "description": "Contemporary economic, social, and political aspects of the United States and its role as a world power since 1945. AMST 447 / HIST 447 Recent American History (3)This course covers the history of the United States from the end of World War II to the present. Topics include but are not limited to the Marshall Plan, the Cold War, the Korean War, the rise of television, atomic power, the Eisenhower presidency, the Civil Rights and Women's Movements, the Vietnam War and protests, the space race, Watergate, the Reagan presidency, the two Iraq Wars, the Dot-com revolution, 9-11 and the War on Terror, and the Obama presidency. While addressing major historical movements, the course will also explore the culture of the period - art, literature, music, sports, television, religion, and film. Even though the course covers a relatively short span of years, students will see that American society has undergone dramatic changes in this period as the result of social movements, immigration, wars, political scandal, and technological innovation. The course will close by speculating on the current direction of the United States in light of the serious challenges the nation faces.", "prerequisite": "3", "other": ["Cross-listed with: AMST 447", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "448", "credits": "3 Credits", "description": "Social, political, and cultural themes in the United States in the 1960s.", "prerequisite": "HIST 021", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "449", "credits": "3 Credits", "description": "Colonial background; framing and adoption of the constitution; development of the court under Marshall and Taney; sectionalism, Civil War, Reconstruction.", "prerequisite": "3", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "450", "credits": "3 Credits", "description": "Constitutional developments from laissez-faire to the welfare state; imperialism, war, internationalism; the contemporary court, civil liberties, and civil rights.", "prerequisite": "3", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "451", "credits": "3 Credits", "description": "The origins and impact of American consumer society since 1870.  HIST 451HIST 451 The Consumer Revolution (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. This lecture course shows how the United States became a nation of consumers from 1870 to the present. It is designed both for the business and communications student as well as the liberal arts major. The origins of department stores, name-brand goods, fast-food chains, modern advertising, and mass entertainment show us how American business and culture was transformed by the consumer revolution. We will explore how the automobile became the leading consumer good of the 20th century and analyze its impact on how Americans shopped. The rise of advertising and its linkage to home-based mass entertainment through the radio and TV will interest us. We will also consider how events like the Great Depression, World War II, the counter-cultural movement of the 1960s, the energy crisis of the 1970s, and the economic deregulation of the 1980s and 90s shaped consumer attitudes and advertising. \" The Consumer Revolution\" also briefly explains how American consumer culture has been globalized (with companies like Coca Cola, Disney, and Ford).The course also explores how new consumer goods shaped the experience of childhood, youth, family and home life, and retirement. In particular, we will consider how youth-oriented goods in fashion, foods, and entertainment created a unique youth consumer culture. Also important are the intellectual debates about the meaning and value of consumer society: Is mass consumption the real meaning of American democracy or is it a perversion of it? Are consumer needs unlimited and where does the desire for goods come from? Because consumer society seemed to threaten so many traditional values, we will also analyze movements for restricting consumption. We will consider the origins and impact of Prohibition, dieting and health food crazes, and movements to restrict advertising and sale of goods like cigarettes.In addition to lectures and visual presentations in class, students will read chapters from major studies of the above topics, some of which will be discussed in class. Grades will be based on performance in discussion and essay exams.", "prerequisite": "three credits in history, marketing, or advertising", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "452", "credits": "3 Credits", "description": "History of U.S. foreign relations since 1789; emphasis on twentieth century.", "prerequisite": "HIST 020 or HIST 021", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "HIST", "number": "453", "credits": "3 Credits", "description": "The history of the ways Americans have used and thought about the environment since 1500.", "prerequisite": "GEOG 030 ; and HIST 020 , HIST 021 ; or 6 credits in the humanities or social sciences", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "HIST", "number": "454", "credits": "3 Credits", "description": "Development of U.S. military policy, 1776 to the present, emphasizing the conduct of our wars, interrelationship of civil and military authority.", "prerequisite": "HIST 020 or HIST 021", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "455", "credits": "3 Credits", "description": "This course introduces the history of epidemics from the 1300s to the present day through historical case studies from across the globe, including examples such as the Black eath; Smallpox; Cholera; Influenza; HIV/AIDS; Zika; and most recently, COVID-19. A central focus of the course examines how epidemic and infectious diseases, and human responses to them, have shaped the world history socially, politically, environmentally, medically, and economically to the present day. The analysis of written and visual primary sources, as well as secondary sources, allows this course to ask and answer questions about the experiences of women, men, and children who witnessed epidemics, treated the sick, lived and died during various epidemic outbreaks, and attempted to understand death and disease from a range of perspectives.", "prerequisite": "3 credits in HIST", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "457", "credits": "3 Credits", "description": "The history and memory of the Holocaust and Hiroshima and Nagasaki are often taught separately in different disciplines. This course will examine them together through the various ways different societies remembered, understood and commemorated these. Using the extensive literature on the history of memory, this course further suggests ways in which these memories and histories affected and were entangled by each other. Specific content will vary according to individual instructor, but topics may include victim cultures, cold war nuclear history, trauma, human rights, dark tourism, memorials, architecture as well as the general impact of these tragedies on the fraught politics of memory in East Asia and the Middle East, or the way the memories of the tragedies were entangled with the civil rights and other struggles in American and global history.", "prerequisite": "Three credits in JST, HIST, or ASIA", "other": ["Cross-listed with: ASIA 457, JST 474", "International Cultures (IL)"]}, {"department": "HIST", "number": "458Y", "credits": "3 Credits", "description": "LHR 458Y, \"History of Work in America,\" a writing-intensive course, studies selected problems in the history of work in the United States. This course addresses economic, technological, social, cultural, and political aspects of employment and self-employment. Major topics of concern include methods of producing goods and services, work time, working conditions, the composition of the workforce, the changing functions of managers, the role of the state in shaping labor markets and regulating employment, the formation and actions of unions and other pro-labor organizations, and the relation of work to the family and other social institutions. In addition, students will undertake original research in primary sources and secondary literature, thereby learning something of historical research methods. The essay project is treated as a process, besides regular encouragement of students to submit a paper proposal, rough drafts, and a final draft. Students are advised that the instructor will read and comment on additional drafts as they care to submit. This section of LHR 458Y is a blended course. Some activities take place in the classroom, and other activities are conducted on Canvas.", "prerequisite": "LHR 100", "other": ["Cross-listed with: LHR 458Y", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "459Y", "credits": "3 Credits", "description": "Role of immigration, social reform movements, religion, education, science, literature, and the arts in American history.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "461", "credits": "3 Credits", "description": "The growth of American cities from their urban origins in Europe and the Native-American Southwest to 1880.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "HIST", "number": "462", "credits": "3 Credits", "description": "Political, economic, social, and cultural transformations in American cities from 1880 to 2000.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "HIST", "number": "465", "credits": "3 Credits", "description": "The civil rights struggle and its impact upon American politics. AFAM 465 / HIST 465 The Post-World War II Civil Rights Movement (3) (US) This course focuses on the post-World War II Civil Rights Movement. It begins with a discussion of the \"Long Civil Rights Movement,\" briefly looking at the roots of the movement in the labor movement and social struggles of the Great Depression and World War II. We then turn to the impact of World War II on African Americans, the growing militancy during the war, the struggles over segregation in the military, the growing role of blacks in the labor movement, and the growing link between African Americans and the rising anti-imperial movements that accelerated after the war. We discuss the role of African Americans in the Cold War and the struggles over the role of Communism and Socialism in the emerging Civil Rights Movement. The course is broken down into key topics of the movement years: the rise of localized grassroots movements all over the United States that were led by local people who sought to challenge school segregation, political disfranchisement, poor housing conditions, police brutality, and job discrimination. While legal disfranchisement and segregation existed solely in the southern states, the entire country practiced both and black people suffered the consequences universally. Much time is spent on the more famous southern civil rights movement, with discussions of the Emmett Till Murder of 1955; the Montgomery Bus Boycott and the rise of Martin Luther King, Jr. and the Southern Christian Leadership Conference; and the Little Rock Crisis of 1957. The beginning of the 1960s saw the creation of the Student Non-Violent Coordinating Committee and the emergence of key women leaders in the struggle such as Mrs. Ella Baker, Mrs. Fannie Lou Hamer, Mrs. Rosa Parks, and Mrs. Septima Clark, to name only a few. We discuss key moments in the 1960s, beginning with SNCC and CORE and the Freedom Rides, the SCLC in Birmingham and Albany; the March on Washington, the 1964 Mississippi Freedom Summer and the murders of Chaney, Goodman, Schwerner, and Medgar Evers; the 1965 Selma to Montgomery March, and the final passage of the 1964 Civil Rights Act and the 1965 Voting Rights Act. The emphasis on the southern struggle is on the local, ordinary people who achieved extraordinary things.", "prerequisite": "HIST 152", "other": ["Cross-listed with: AFAM 465", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "HIST", "number": "466", "credits": "3 Credits", "description": "Critical exploration of the history of sexuality, focusing especially on the emergence of modern lesbian and gay identities.  WMNST (HIST) 466 Lesbian and Gay History (3) (US;IL) This course will explore the relationships in different cultures and historical periods between the dominant culture and homosexuals, whom the culture deemed, at different times, sinful, deviant, criminal or, more recently, a minority community. Students will confront the very nature of difference, and how it has been played out in European and American history. The course will challenge students to deal with how societies define difference itself; how they isolate or punish deviants; and how the creation of the 'homosexual' helped establish not simply difference but 'normalcy' in a highly sexualized modern culture. Finally, the course will explore notions of identity itself, focusing on the creation of a modern gay and lesbian identity and its impact on broader questions of gender, community, civil rights, and political discourse in the United States.An example of evaluation methods would be: course presented in a seminar format with grades based on class participation, brief analytical papers, and a longer research or historiographic paper.", "prerequisite": "WMNST100 , WMNST117", "other": ["Cross-listed with: WMNST 466", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "HIST", "number": "467", "credits": "3 Credits", "description": "Historical development of policies of the United States with regard to Latin- American affairs from colonial times to the present.", "other": ["Cross-listed with: LTNST 467", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "HIST", "number": "468", "credits": "3 Credits", "description": "Political, economic, and social development in Mexico and the Caribbean since 1900. Emphasis on Mexican, Guatemalan, and Cuban revolutions.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "468H", "credits": "3 Credits", "description": "Political, economic, and social development in Mexico and the Caribbean since 1900. Emphasis on Mexican, Guatemalan, and Cuban revolutions.", "other": ["Honors"]}, {"department": "HIST", "number": "469", "credits": "3 Credits", "description": "Examines the history and dimensions of drug use and analyzes the impact of drug policy.  CRIMJ 469 / HIST 469 Drugs and Drug Policy in the United States (3) For nearly a century, the United States has been waging its version of a hundred years' war on drugs, spending billions of dollars and incarcerating thousands of offenders while failing to significantly reduce the use of illicit drugs. This course examines drug use in a historical context while addressing the changing nature and dimension of drug use, including the pharmacology of drugs, patterns of drug use, and sentencing policies. Because drug control is inextricably linked to social, political, and public policy, the course will provide the student with a foundation for critical thinking and rational decision making relative to the efficacy of the various drug control initiatives. Since drugs seemingly permeate every level of American society and directly or tangentially touch most Americans' lives, issues such as drug testing in the workplace, the use of drug courier profiles, legalized medical marijuana, and needle exchange programs are evaluated. Students will be expected to learn the pharmacology of various drugs, the history of drug use in the United States since the colonial era, the evolution of federal drug agencies, and acquire knowledge about contemporary drug issues. They also will be expected to develop and strengthen their critical thinking skills as they assess the consequences of implementing particular anti-drug policies and their impact on reducing the use of illicit drug use. An example of the evaluation methods would be: students will be evaluated on the basis of three exams and four \"think pieces\" (requiring students' critical responses to an assigned topic) scheduled throughout the semester. Class attendance also will influence the grade. Faculty Member Proposing Course : John C. McWilliams", "prerequisite": "CRIMJ100 or HIST 021", "other": ["Cross-listed with: CRIMJ 469", "Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "470", "credits": "3 Credits", "description": "The work, culture, ideology, and political economy of slavery in the Americas between 1500 and 1888.", "prerequisite": "HIST 152", "other": ["Bachelor of Arts: Arts"]}, {"department": "HIST", "number": "471Y", "credits": "3 Credits", "description": "Pre-Islamic Arabia; Muhammad; Arab conquests; Islamic beliefs and institutions; literary, artistic, and scientific achievements; relations with Europe; breakdown of unity.", "other": ["Cross-listed with: RLST 471Y", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "472", "credits": "3 Credits", "description": "This course examines the history of the Ottoman Empire from its origins to the rise of the Turkish Republic, an historical time period covering approximately 1300 to 1923. Each week, the class will focus on a major turning point or theme using a combination of regional case studies and primary sources. In the process, students will be exposed to ongoing historiographical debates about a variety of events and trends in Ottoman history. Topics covered include war, diplomacy, gender, architecture, science, religion, technology, and slavery. This course focuses on and examines how the Ottoman state evolved in a changing global context.", "prerequisite": "3 credits in HIST", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "473", "credits": "3 Credits", "description": "Political, economic, and social changes in Turkey, Iran, Israel, and the Arab countries in the twentieth century; Arab-Israeli conflict.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "474", "credits": "3 Credits", "description": "Japanese history from 1580-1880.  ASIA 474 (HIST 474, JAPNS 426) Early Modern Japan (3) Japan's Tokugawa period can be difficult to grasp. It resembles a modern society in many respects but operated according to a logic of social organization different from that of most modern states. There was a collective sense of national identity, but its characteristics differed significantly from modern forms of Japanese identity. Moreover, modern ideologies have contributed to the characterization of early modern Japan as a rigid society and of the country as a whole having been isolated from the rest of the world. The main purpose of this course is to afford students the opportunity to study early modern Japan in detail and, insofar as possible, on its own terms. Through readings in primary and secondary sources, and through the evaluation of visual images, this seminar-style course will deepen students' knowledge of Japan and serve as basis for comparative study of other early modern societies. Although the course investigates classic areas of historical study such as institutional development and foreign relations, the emphasis is on social and environmental history. The course encourages students to think about a range of approaches to the past and to think about the ways our contemporary biases influence the ways we understand the past.", "prerequisite": "HIST 172", "other": ["Cross-listed with: ASIA 474, JAPNS 426"]}, {"department": "HIST", "number": "475Y", "credits": "3 Credits", "description": "India's transition to social, economic, and political modernity through the experience of British colonial rule and the nationalist struggle.  ASIA (HIST) 475Y The Making and Emergence of Modern India (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course covers India's transition to social, economic, and political modernity through the experience of British colonial rule and the nationalist struggle. It begins during the early modern period, when European travelers encountered the flourishing Mughal Empire, and moves into the dynamic moment following, when the East India Company was one of various competing forces, both locally and globally. It then examines the rise of British power, and the various responses to it from collaboration to mutiny; the multiple development of nationalisms and anticolonialisms, including secular, socialist, Hindu and Muslim variations; the accompanying social reform visions, including caste abolition and feminism; the turbulent paths toward partition and independence, resulting in the postcolonial states of India, Pakistan, Bangladesh, Nepal, Sri Lanka, and Afghanistan. It then follows the continuing trajectories of these countries after independence, from the Nehruvian years to the neoliberal shift, with attention to emerging social movements and issues including caste and gender relations; religious and separatist politics; struggles around land and development; urbanization, and labor migration. This course raises important questions about the nature of modernity and its relationship to global interconnectedness, the rise of capitalism and colonialism, industry and technology; while emphasizing South Asian social and cultural contributions and responses to these global shifts. By filling in the context of this part of the world to that global story, the course enables students to grapple with some of the major economic and geopolitical trends of the early 21st century.", "prerequisite": "HIST 172", "other": ["Cross-listed with: ASIA 475Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "477", "credits": "3 Credits", "description": "Development of United States military policy, 1776-1900, emphasizing conduct of wars, interrelationship of civil and military authority.", "prerequisite": "3 credits in history"}, {"department": "HIST", "number": "478", "credits": "3 Credits", "description": "Development of United States military policy in the 20th and 21st centuries, emphasizing conduct of wars, interrelationship of civil and military authority.", "prerequisite": "3 credits in history"}, {"department": "HIST", "number": "479", "credits": "3 Credits", "description": "A selective overview of the history of iumperialism and nationalism in Africa.  HIST/AFR 479 History of Imperialism and Nationalism in Africa. This course meets the Bachelor of Arts degree requirements. History/African Studies 479 will provide a selective introduction to major developments and issues concerning Africa's colonial and postcolonial history. The beginning of this course will concentrate on the meanings of imperialism and nationalism and the fact that there is no \"single\" African experience with either of them. This will be followed by a discussion of 19th and 20th century political history in specific contexts in North, East, West, and Southern Afria. The course concludes with a review of African decolonization and the most notable manifestations of recent nationalism on the continent. Special attention will be given to the methods of colonial takeover, methods of African resistance, the West's role in Africa, and Africa's formative role nstruon the West. Religion, the military, and racial/ethnic identity politics will be recurring themes in the course. The actual time devoted to each topic and the sequence of topics will vary from instructor to instructor. The objective of the course is to intrroduce to the causes, nature, and consequences of modern imperialism in Africa. In doing so, students will receive a comprehensive history about a region of the world that is often misunderstood and misrepresented. Also, the course emphasizes critical thinking and analytical writing. The course will consist of polls, pratice discussions, quizzes, response papers, and a final project. As a general education course, this class will provide an introduction to African political history for students of anyn major. Students majoring or minoring in History, African Studies, International Relations, or Political Science will learn vocabulary and information that is basic to the field and broaden their knowledge of History.", "prerequisite": "3 credits in HIST", "other": ["Cross-listed with: AFR 479", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "480", "credits": "3 Credits", "description": "An overview of Japan from the 10th to 17th century, a period of political decentralization, cultural efflorescence, and social change.  ASIA (HIST) 480 Japan in the Age of Warriors (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. By the eighth century, Japan had become a centralized state centered on the reign of a sovereign, commonly known in English as an emperor. At the end of the ninth century, the emperor&rsquo;s court relocated to the city of Heian (Kyoto), and soon thereafter, an elegant court culture developed in the capital. The courtly culture was based on civilian values and civilian rule. In the countryside, however, Japan was gradually becoming militarized. Local warlords began rising to prominence and vying with each other for power. One of them, Taira-no-Masakado, rebelled against the central government during the years 939-940, declaring himself &ldquo;emperor&rdquo; of several provinces in eastern Japan centered on Hitachi. Although the central government in Kyoto enlisted other warrior groups to put down Taira-no-Masakado&rsquo;s rebellion, the process of militarization was underway. Buddhist temples also participated in this process, using their wealth and influence to assemble monastic armies on occasion. This course examines Japanese history beginning approximately in the 10th century, at time when civilian high culture in the capital was approaching the height of its development. At the same time, the process of militarization of the countryside was beginning to undermine that civilian court culture. The course ends in approximately the seventeenth century with the establishment of a military government under the Tokugawa shoguns. This development was ostensibly the peak of warrior influence, with the samurai (=warrior) class entrenched by law as the elite group within society. However, just as the warriors began their rise to power in the tenth century, by the end of the seventeenth century they were rapidly losing influence and prestige to wealthy merchants as the forces of the market economy spread throughout Japanese society. HIST 480 is a course in medieval Japanese history, broadly defined. Different instructors will emphasize different aspects of Japanese history and culture during this era. Approaches to teaching will also vary depending on the instructor. Class sessions can take the form of lectures or discussions. Assessment methods and learning activities may include debates, discussions, exams, research papers, book review papers, and other similar academic activities.", "other": ["Cross-listed with: ASIA 480", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "481", "credits": "3 Credits", "description": "The transformation of Japan from a relatively isolated, agricultural nation into a highly industrialized world power.  ASIA (HIST) 481 Modern Japan Since 1800 (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. In the late 19th century, Japan emerged from relative seclusion and grew, within the period of a few decades, into one of the world's major powers. Japan's remarkable transformation into an imperialist power ended suddenly with defeat by the Allied powers in August 1945. But the history of prewar and wartime Japanese nation-building and economic growth set the stage for postwar rebuilding. This course examines Japan's development as a powerful modern state, imperialist aggressor, defeated nation, economic power-house, and pop culture super-power. Specific content will vary according to individual instructor, but may include the structures of state and society in the early 19th century, the creation of the Meiji state (1868-1912), the successes and costs of the Meiji government's program of rapid modernization and Westernization, imperialist expansion, the road to war and defeat in World War II, the postwar U.S. occupation of Japan (1945-1952), Japan's resurgence as a global power, and some of the major challenges facing the Japanese state and society today. The goals of the class are not only to gain an understanding of the history of another country, but also to develop the skill of building such an understanding through primary and secondary sources, both written and visual. Students in this class will take on the role of historian themselves, thinking critically about assigned texts and making their own interpretations of their meanings. Through readings, discussions, and written work, students will enhance their ability to think critically and to express their ideas clearly in both speech and writing.", "prerequisite": "HIST 172", "other": ["Cross-listed with: ASIA 481", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "HIST", "number": "482", "credits": "3 Credits", "description": "This course familiarizes students with the critical texts and intellectual cultures of Warring States and early imperial China. CHNS 418 / ASIA 418 / HIST 482 Confucius and the Great Books of China (3) This course exposes students to the key texts, thinkers, and ideas that form the foundation of the Chinese classics and classical period, providing an integral foundation for the study of Chinese history, culture, or literature. While the emphasis is on the texts and their main themes, the course will encourage historical engagement with the texts by placing them into a context of competing cultural, social, political trends. Readings may be grouped around categories of teachings such as Confucianism, Buddhism, and Daoism, or around thinkers such as \"(Confucian) ritualists,\" \"statesmen,\" \"military strategists,\" \"rebels,\" \"recluses,\" and \"spiritual leaders.\" Students will learn how each of these types of teachings and thinkers related to each other, as well as how they responded to the emergent, centralized political order of the day. This will help students better understand many of the recurrent intellectual, political, and religious themes that arise in later Chinese history as well.", "prerequisite": "ASIA 3", "other": ["Cross-listed with: ASIA 418, CHNS 418", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "483", "credits": "3 Credits", "description": "The social, political, and cultural issues and developments from the 8th to 16th century.  ASIA (HIST) 483 Middle China (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This advanced discussion-based course covers the social, political, and cultural issues and developments in Chinese history from roughly the eighth century through the sixteenth century. Specific content will vary according to instructor. Students will gain a strong foundation in Chinese history and culture and experience analyzing historical texts.", "prerequisite": "HIST 174", "other": ["Cross-listed with: ASIA 483", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "484Y", "credits": "3 Credits", "description": "A study of the dynamic historical development of Chinese thought with its diverse expressions from antiquity to the present.  ASIA (HIST) 484Y History of Chinese Thought (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the historical developments of Chinese thought and its multifarious expressions from ancient times to the eighteenth century. It explores the unique Chinese ways and means of making sense of the world and the human condition by probing China&rsquo;s philosophical and religious traditions. It reveals the conscious life of the Chinese in matters moral, ethical, aesthetic and metaphysical. Moreover, by showing the unity, diversity, continuity and discontinuity in Chinese thought throughout the ages, this course debunks the popular &ldquo;Orientalist&rdquo; myth that Chinese culture had been a hermetically sealed and stagnant monolith until the modern era when Western influences became dominant.", "prerequisite": "HIST 174", "other": ["Cross-listed with: ASIA 484Y", "Bachelor of Arts: Humanities", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "485Y", "credits": "3 Credits", "description": "China from 1644 founding of Qing dynasty to 1911 fall; Chinese society and institutions, imperialism and China's internal diversity.  ASIA (HIST) 485Y China's Last Empire: The Qing Dynasty, 1644-1911 (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine the Qing dynasty, the last imperial dynasty to rule China, from the seventeenth to early twentieth centuries. More than doubling the size of the previous Ming dynasty, the empire also included people such as Tibetans, Muslims and Mongols who had never before considered themselves as &ldquo;Chinese&rdquo; but were now Qing subjects. The course will examine how Manchu ruling family, a non-Chinese people, outnumbered by the Chinese by about three hundred and fifty to one managed to conquer and rule China for nearly three hundred years. Tracing the political, social and cultural development of china starting with the foundation and consolidation of the Qing in 1644 and concluding with the collapse of the dynastic system in 1911, this course examines the role of the imperial system, internal rebellions, and the impact of Western colonialism on China. Considerable time will also be focused on China&rsquo;s ethnic, religious and cultural differences in order to allow a deeper understanding of major issues and themes in late imperial Chinese history. Finally, the theme of China&rsquo;s international relations in Asia and the world and China's shifting place in the world will be a prominent thread of the course. Through a blend of primary and secondary sources, students in this class will need to think critically, read broadly and express their ideas clearly regarding the evolving challenges facing China&rsquo;s last empire.", "prerequisite": "HIST 175", "other": ["Cross-listed with: ASIA 485Y", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "HIST", "number": "486", "credits": "3 Credits", "description": "China from 1900 to the present; nationalism, cultural change; development of communism.  ASIA (HIST) 486 China in Revolution (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course examines the social and cultural history of modern China from 1900 to the present. Major topics may include the formation of a modern national state, relationships between society and government, economic development and environmental crises, changes in kinship and family life, and changing relationships between elite and popular culture. The course uses excerpts from primary documents, fiction, and film to help students understand the modern Chinese historical experience.", "prerequisite": "HIST 175", "other": ["Cross-listed with: ASIA 486", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "HIST", "number": "487", "credits": "3 Credits", "description": "Developments in the foreign policy of the United States from independence to the eve of World War I.", "prerequisite": "HIST 002 or HIST 020"}, {"department": "HIST", "number": "488", "credits": "3 Credits", "description": "Developments in the foreign policy of the United States since the eve of World War I.", "prerequisite": "HIST 002 or HIST 021"}, {"department": "HIST", "number": "490", "credits": "1-3 Credits/Maximum of 3", "description": "Introduction to the principles and procedures in the management of archives and historical manuscripts.", "other": ["Cross-listed with: LST 490", "Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "491", "credits": "3 Credits", "description": "This is an advanced course on the history of the general crisis in the British Isles, from the outbreak of war between England and Scotland in 1639 to the securing of the Commonwealth regime following the desstruction of the last major royalist army in 1651.", "prerequisite": "HIST 134", "other": ["International Cultures (IL)"]}, {"department": "HIST", "number": "492", "credits": "3 Credits", "description": "Survey of the social, economic, political, and religious conditions of accusations and prosecutions of witchcraft in western Europe and north America, from 1500 to 1700.", "prerequisite": "HIST 002", "other": ["International Cultures (IL)"]}, {"department": "HIST", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "HIST", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practicums, or internships.", "prerequisite": "prior written approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "496A", "credits": "1-18 Credits", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "496H", "credits": "1 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "HIST", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "HIST", "number": "499", "credits": "1-6 Credits/Maximum of 6", "description": "Study in selected foreign countries of various periods and topics in history.", "prerequisite": "3 credits in the appropriate introductory history course for   the geographic location specified", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]