[{"department": "HM", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual of group instruction.", "other": ["International Cultures (IL)"]}, {"department": "HM", "number": "101", "credits": "3 Credits", "description": "This course introduces students to the many exciting facets of the global hospitality industry, the largest service industry in the world. Students will be provided an overview of the major segments of the hospitality industry and key players, a historical perspective of the hospitality industry, and key operational issues common to most hospitality enterprises. This course will provide students with an overview of the characteristics that distinguish the hospitality industry from other industries and addresses the primary strategic and tactical issues relevant to hospitality enterprises. Current events, diversity, well-being, ethical issues related to the hospitality industry, and global trends will be integrated throughout. Ultimately, the course will provide students a broad and integrative overview of the global hospitality industry, and the opportunities for career development.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "HM", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual of group instruction.", "other": ["International Cultures (IL)"]}, {"department": "HM", "number": "201", "credits": "3 Credits", "description": "Introduction to the hospitality industry and hospitality management.  HM 201 Introduction to Management in the Hospitality Industry (3) The objectives of this course are to provide an introduction to the hospitality industry, to management practices within the industry, and to the hospitality major. Students have an opportunity to learn about the functions of management; the major components of the hospitality, travel, and tourism industries; trade associations and publications; growth areas and trends; and the need for creative leadership. Main topics typically include: functions of management and functional areas of business segments of the hospitality industry, international business as related to hospitality, services business, the planning process and strategic planning, organization design in hospitality, directing and leading in hospitality, the control process in hospitality, travel and tourism industries hospitality, hotels and lodging, the restaurant business, managed services, leisure and recreation/other hospitality opportunities, beverage management, and management ethics and social responsibility."}, {"department": "HM", "number": "202", "credits": "1 Credits/Maximum of 4", "description": "Major industry and professional speakers lecture on current issues followed by discussion with students and faculty.  HM 202 Colloquium in Hospitality Management (1) This course has two primary objectives. First, students have an opportunity to hear from industry leaders. Second, students can determine their career directions, learn about the requirements for success in the industry, and identify career opportunities. The topics for the course vary from semester to semester depending upon the expertise of the distinguished speakers who address the class. However, a common theme is to explore trends in the industry regarding hotels, restaurants, and institutional foodservice. Students may learn about related career opportunities, such as careers with cruise lines, travel agencies, and other sectors in the hospitality and tourism industry."}, {"department": "HM", "number": "203", "credits": "1 Credits", "description": "The purpose of this course is to provide students with professional development preparation early in the curriculum. This course will help students obtain quality work experience during their college career to best prepare them for post-graduate employment. In particular, this course is designed to prepare students for meeting the major's work experience requirement. Meaningful work experience serves as a complement to classroom learning and provides the foundation for securing employment upon graduation. This course will help students understand the connection between college work experience and full-time careers and will impart strategies for conducting a successful job search and making the most out of these work opportunities. The class will include lectures, discussions, experiential exercises, guest lectures, and professional development assignments.", "prerequisite": "HM 201"}, {"department": "HM", "number": "208", "credits": "1.5 Credits", "description": "This course is designed to provide a historical approach to educating students on the development of alcohol and its influence on society. Alcohol is both culturally and economically significant as its usage has been a source of global trade, economic status, and political conflict. Science has proven positive and negative impacts of alcohol, which have shaped marketing, regulation, and consumption patterns. A better understanding of alcohol and its place in our society is not only educational from a historical perspective, but provides students with impactful nutritional and health knowledge regarding alcohol. By the end of this course, each student will feel more comfortable with the topic of alcohol in our society. This course will focus on how we can promote a more responsible educational process involving alcohol consumption, sale, and service. Education on alcohol can provide fundamental information that cannot only significantly improve one's well-being and quality of life, but also others.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "HM", "number": "209", "credits": "1.5 Credits", "description": "This course focuses on the relationship between alcohol and cuisine. Students will gain a historical perspective on the societal, economic, and regulatory trends that shaped the gastronomy of regional entities around the world. The course will explore the role of these trends in defining the customs, opinions, health policies, as well as the attitudes of the various cultures towards alcohol and gastronomy. Evaluating social influences and issues with the spread of food and beverage across communities will allow students to engage in thoughtful discussions regarding cultural differences related to health and wellness initiatives, regulations, and service standards. A primary goal of the class is to instill a strong sense of social responsibility by educating the students not only on the legalities of alcohol sales and service in their community, but on health and wellness issues, and more importantly, on the responsible way to serve and consume alcohol. Students will gain a worldly perspective on regional food and alcohol cultures and how this shapes policies and regulations related to health guidelines and service practices. Specific lectures will emphasize the potential liabilities nationally linked to alcohol service in private settings or organizations such as Greek life, tailgating or other social gatherings. The course will provide training and may offer professional certification in responsible sales and service of alcohol. This certificate, besides educating students on the regulations and proper alcohol service standards, is also a critical mitigating factor in problem cases involving insurance companies or legal courts.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "HM", "number": "210N", "credits": "3 Credits", "description": "We live, work, and travel in a world in which interactions with individuals from different cultures is increasingly common and necessary. This course investigates the differences that exist between countries and geographical regions in their cultural norms and looks at the social customs that are at the basis of proper behavior. The course draws on philosophical explorations of the importance of customs as extensions of cultural norms and morals, and on social science research into the differences between cultures. It provides students with an opportunity to see the world through the eyes of people from different cultures, and broadens their understanding of the different ways of seeing and thinking about themselves and others, and of their place in a global society. Through a greater understanding of the diverse cultural forces that influence values, behaviors, attitudes and business practices, students will develop the critical thinking skills that will allow them to successfully interact with others in personal and business environments, which are exemplified by hospitality management-specific cases. The course provides the opportunity for students, who are future managers, employees, and travelers, to become better global citizens with an appreciation of other cultures.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HM", "number": "228", "credits": "1 Credits", "description": "Application of HACCP, U.S. Food Code, biosecurity and other federal regulations to hospitality foodservice operations.  Students attain certification in foodservice sanitation.  HM 228 Hospitality Food Safety (1) This course will examine the science associated with preparing and serving food that is safe for consumption with regards to biological, chemical, and physical contamination. Emphasis is on federal regulations associated with HACCP, the U.S. Food Code, and other issues associated with safety of the food supply in the U.S. Case studies help students apply food safety principles to hospitality operations. Students will attain certification in foodservice sanitation by taking the examination administered by the National Restaurant Association."}, {"department": "HM", "number": "230", "credits": "3 Credits", "description": "This course introduces students to the food service industry, one of the biggest and most dynamic segments in hospitality. This course will prepare students with a better understanding of the food service industry as well as prepare them for future classes throughout the program. Students will learn how to integrate tools such as menu planning, standardized recipes, forecasting and budget planning to successfully drive revenues, control costs, and manage customer service. This course will also offer students hands-on experience in a professional kitchen environment while introducing them to quantity food production principles. Students will be able to understand and apply the safety, sanitation and sustainability principles in food production, storage, and food handling practices within a professional kitchen. Through a hands-on approach, students will be introduced to professional kitchen equipment and smallwares and their uses, as well as recognition of various food products commonly utilized in foodservice."}, {"department": "HM", "number": "235", "credits": "3 Credits", "description": "Accounting, in many respects, is the language of business and translates business transactions into quantifiable information. The purpose of this course is to provide the tools as to how to use and understand this language for making informed business decisions. Areas of focus include how to analyze and record business transactions, compiling and analyzing three of the four major financial statements, banking procedures and control of cash, various issues related to the payment of employees and the introduction of how to analyze financial statements. Regardless of the functional area in the hospitality industry in which students choose to work, they will be most likely be required to understand how accounting impacts the various financial statements, and how to use financial information to make informed business decisions. Therefore, an understanding of the importance of accounting information to make informed business decisions is vital to students' future success.", "prerequisite": "HM 201"}, {"department": "HM", "number": "250", "credits": "3 Credits", "description": "Principles and methods of quantity food production including preparation techniques, quality control and evaluation, and cost control."}, {"department": "HM", "number": "260", "credits": "3 Credits", "description": "Hospitality management topics are discussed with a major emphasis on operations management.  This course will not meet the prescribed requirements for the HM major in any option.  HM 260 Hospitality Supervision Seminar (3) This course is an introduction to human resource management in the hospitality industry. The course examines the fundamentals of supervision that include planning, basic management functions, and customer relations and service. The overall course focus is on building relationships with diverse employees through communication, motivation, supervision and leadership.&nbsp;Additional topics covered include the human resource environment in hospitality operations, employee recruitment, selection, orientation, training, empowerment, performance appraisals and discipline, risk management, and labor organizations. An introductory supervision course is vital to the success of a hospitality student. It is important to explore this topic in relation to the labor trends in the United States. It is equally important to examine the current demographic and socio-economic conditions that the student faces.&nbsp;Knowing how to access this information in the future will assist the student throughout his/her career. Emphasis will be placed on the diversity of the student as well as his/her employees and colleagues. Social identity is addressed early in the course. Human relationships and interactions are included throughout the course, as supervisors interact with their employees, colleagues, upper management and customers on a daily basis. Values, traditions, beliefs, and customs shape every human being and students will learn how to be sensitive to those differences through the practical applications in each lesson.", "prerequisite": "HM 201"}, {"department": "HM", "number": "265", "credits": "3 Credits", "description": "The human element is vital to the success of any organization, particularly in the hospitality industry. Toward this end, the purpose of this course is to provide students tools for successfully leading teams of employees to enhance organizational performance. Particular areas of focus will be on understanding motivation, individual differences, power and influence, diversity, group dynamics, and conflict management. Students will be familiarized with these content areas and will apply them through project-based work, group assignments, experiential activities, and case studies. Regardless of the functional area in which students choose to work, they will be required to work with, manage, and lead other people. Therefore, an understanding of leadership and the dynamics of working in and with groups and teams is vital to students' future success.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "HM", "number": "270", "credits": "4 Credits", "description": "Components of food service systems are identified and studied as separate problems and as a total system.  This course will not meet the prescribed requirements for the HM major in any option.  HM 270 Hospitality Administration Seminar (4) The organization of a restaurant facility, from concept to operation, allows a student the opportunity to apply all previously learned course material in the Hospitality Management program. The focus of the course urges the student to apply the principles of marketing, menu planning, food cost control, human resource management, financial accounting, layout and design, and purchasing. This course is presented in a seminar format and includes a restaurant design project. Students who have completed this course gain the perspective of designing a restaurant facility with customers' needs and owners' profits in mind. Main topics include: creating a marketing plan and business plan, financing and leasing, leasing and tax matters, menu writing, menu analysis, function analysis, kitchen design and layout design conventions, recruiting and staffing including training and development, food purchasing, bar and beverage purchasing, beverage and alcohol service, and budgeting and controlling costs. The content of this course is considered fundamental for anyone in hospitality management and, therefore is required of all Hospitality Management majors.", "prerequisite": "HM 250"}, {"department": "HM", "number": "271", "credits": "2 Credits", "description": "This course introduces students to the technology used in the hospitality industry and to technology concepts. To prepare students for success in the industry, the class is designed to allow students to possess a working knowledge of technology and how to best use this technology to improve the guest experience and increase an organization's performance.", "prerequisite": "HM 201"}, {"department": "HM", "number": "272", "credits": "2 Credits", "description": "The ability to use and apply MS Excel is a vital competency for SHM graduates to have. Companies expect it for career success and dependency on one's ability to use Excel in solving financial and managerial problems. The advisory board of SHM has identified the students' ability to use and apply MS Excel as a competency required by many hospitality companies. In addition, the use of worksheets and MS Excel is required in such diverse classes as hotel and food service management, marketing, revenue management, finance, real estate, and entrepreneurship. The course involves a lecture on the functionality of the software as well as hands-on, in-class learning exercises illustrating the topics presented in the lecture. Case studies will enable students to explore and analyze a variety of hospitality concepts on a common worksheet platform."}, {"department": "HM", "number": "280", "credits": "3 Credits", "description": "Students will explore the typical ownership and management structures of various types of hotels. Ownership discussions include the various types of ownership entities from sole proprietorships to real estate investment trusts and large institutional owners. The role of the owner is discussed to enable students to understand how ownership entities effect their role as a hotel manager. Students will learn about franchise agreements, brand affiliations, and management companies. Students will learn how key operating departments of a typical hotel work, how the departments interrelate, work with one another to deliver exceptional guest service and profits. Discussions of the key operating departments in a hotel to include front office, housekeeping and laundry, engineering, food and beverage, and safety and security. Students will learn the key performance metrics and terminology related to the operation of the various hotel departments. Students will apply linear programming to optimize staffing and labor scheduling. Students will be provided tours of the primary operating departments, housekeeping and laundry, food and beverage, maintenance, and front office, to experience and observe operations. Students will have the opportunity to enhance their classroom learnings with observation of functioning operations. Students will explore the growth in the home sharing sector and its effect on the hotel business. Other trends and current events will be presented and discussed regarding their short- and long-term impact on the hotel business.", "prerequisite": "HM 201"}, {"department": "HM", "number": "290W", "credits": "3 Credits", "description": "Communication in organizations is essential to creating an open and collaborative environment. The premise of this course focuses on the core fundamentals of creating and delivering clear and concise business messages. Additionally, the course draws on the ability to recognize and understand the differences between communication styles that exist in a global marketplace. Students will be familiarized with types of messages and will apply their knowledge through writing, reviewing, and evaluating written and verbal messages. Particular areas of focus include creating routine business messages, preparing persuasive memos, and delivering bad news messages. Students will also be challenged to create professional reports and presentations, which are essential to influencing and informing key stakeholders. Content in this course will help students become more effective communicators and leaders, regardless of their future profession.", "prerequisite": "HM 201", "other": ["Writing Across the Curriculum"]}, {"department": "HM", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "HM", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual of group instruction.", "other": ["International Cultures (IL)"]}, {"department": "HM", "number": "304", "credits": "3 Credits", "description": "Institutional food service management systems in the hospitality field.  HM 304 Institutional Food Service Management (3) Institutional and contract food service management is in the growth stage of the hospitality industry life cycle. The objective of this course is to provide an overview of the various segments of institutional food service, including health care, life care, education, business, transportation (i.e., airlines, cruise ships), correctional and recreational services. Main topics typically include: historical overview of institutional/non-commercial food service management, exploring key markets where institutional food service management exists, key systems used in the fundamental areas of quantity food production, current and future trends effecting institutional food service management, career opportunities in the institutional food service management sector, and managed services and multi-department management. This course is an elective in the Hospitality Management program.", "prerequisite": "HM 201"}, {"department": "HM", "number": "305", "credits": "3 Credits", "description": "Restaurant food service management systems in the hospitality field; analysis including cost control and quality control techniques.  HM 305 Restaurant Management (3) Providing quality service and products and ultimately making a profit in a restaurant require the foodservice professional to control and analyze costs. The objective of this course is to provide an overview of the food, labor, budget, and finance information required in restaurant management. Main topics typically include: framework and function of control in foodservice operations, steps and processes of using management information systems in controlling food cost and preparation of food; forecasting and menu pricing techniques in controlling food cost in the preparation and service of food; problems associated with labor costs and analyzing various techniques and tools used to control labor cost effectively through proper staffing and scheduling; methods of controlling food and beverage cost through effective purchasing, receiving, storage, issuing, preparation, inventory, and portion control; techniques of preparation and implementation of effective budgets as control tools; ratio-analysis for analyzing cost in foodservice operations; financial statements used to monitor the financial health of a foodservice operation; and capital budgeting and how it is used. This course is required in the Hospitality Management program. The introductory course in Hospitality Management must have been completed or must be taken concurrently.", "prerequisite": "HM 201"}, {"department": "HM", "number": "306", "credits": "3 Credits", "description": "Introduction to senior living and continuing care retirement communities and related hospitality management career opportunities. HM 306 Hospitality in Senior Living (3) This course introduces students to continuing care retirement communities (CCRC's) and senior living facilities. The course is taught from a hospitality perspective and focuses on how the application of hospitality management can enhance senior communities and their residents. The multidisciplinary content includes a variety of perspectives on designing and delivering services for seniors, including long-term care administration, geriatric nursing, adulthood and aging, therapeutic recreation, and nutrition and foodservice."}, {"department": "HM", "number": "311", "credits": "2 Credits", "description": "The course introduces students to viniculture and viticulture and the sensory evaluation of wine. It focuses on the complexities of production, storage, grape-growing, and the intersection of agriculture, commerce, and hospitality businesses. Special emphasis is given to the climates, topographies, and other natural conditions that make some regions more suited to certain wine cultivation than others and how these conditions are replicated around the world. It concentrates on the sensory elements of wine that make it a global economic and culture phenomenon with emphasis on Old World and New World traditions, food pairing, new entries to the marketplace, and trends in the wine business. It covers the important role wine plays in the delivery of dining experiences in both hospitality enterprises such as catering and restaurant venues as well as retail and social experiences. Wine sales makes a substantial contribution to the profitability and marketability of many food service operations. The wine industry is replete with specific and technical vocabulary that when mastered enables students to engage in wine activities knowledgably and successfully, whether as a consumer or hospitality professional."}, {"department": "HM", "number": "318", "credits": "2 Credits", "description": "Principles and practices of club organizations and management.  HM 318 Club Management and Operations (2) This course focuses on the unique management skills that are necessary in the private club industry. A key objective is to demonstrate to students the concept of \"exceptional service\" that is demanded in this field. The course leads students on a tour of the responsibilities and operations of all departments that would be found in a city or country club. Main topics typically include: club management industry and career opportunities; types of clubs that exist in the industry, including structure, organization, and philosophy; the various departments of a successful club including but not limited to: food and beverage, accounting and cost control, human resources, marketing and promotion, catering and banquets, golf operations, tennis operations, aquatics, and fitness facilities; and management skills required of a club manager: leadership, board relations, general management, service excellence, communications. The course is required in the Professional Golf Management option in the Recreation, Park, and Tourism Management program and is a professional elective for Hospitality Management majors.", "prerequisite": "HM 201"}, {"department": "HM", "number": "319", "credits": "3 Credits", "description": "Fundamental principles of facilities planning, facilities management, and maintenance for all segments of the hospitality industry.  HM 319 Hospitality Facilities Management (3) This course has been designed to provide students with information related to hospitality facility design and maintenance. While managers may not have to fix equipment or install heaters, they should understand the complexity of these tasks and respect the position of the architect and hospitality engineer. Main topics typically include: principles of facility engineering and maintenance, costs associated with the life cycle of a hospitality facility; role of the manager in the planning and maintenance process; function of the building in service and marketing, impact of building design on guest service and operation; evaluation of building and grounds for compliance with the Americans with Disabilities Act of 1990; role of management in development, planning, and remodeling of food service operations; and flow of resources as exhibited in blueprints. The course is a required course for all Hospitality Management majors. Students must first complete the introductory hospitality course and the hospitality colloquium.", "prerequisite": "HM 201"}, {"department": "HM", "number": "330", "credits": "3 Credits", "description": "This course is designed to apply management principles to foodservice production and service in a lab environment. HM 330 stresses the integration of management principles acquired in prior classes, including planning, organizing, controlling, staffing, and leading. Students will rotate in management and staff positions for the quantity production of quality food. The course draws from the students' theoretical background in accounting, management, nutrition, food production and sanitation. HM 330 integrates this content into the daily operation of a campus foodservice facility as a living laboratory.", "prerequisite": "NUTR 119"}, {"department": "HM", "number": "336", "credits": "3 Credits", "description": "The course provides managerial tools for decision-making by focusing on the basic concepts, analyses, uses, and procedures of cost accounting in the hospitality industry. Managerial decision-making using accounting data is an integral part of the function of managers in the hospitality industry. The accounting function of a business generates financial data, and managers need to be able to interpret the data, analyze it and make decisions based on their interpretation and analysis of the data. This course provides the student with the core knowledge needed to understand the kinds of data generated by the financial systems of hospitality operations, prepare budgets, perform variance analysis, and provide control over the financial aspects of the hospitality business.", "prerequisite": "ACCTG 211"}, {"department": "HM", "number": "344", "credits": "3 Credits", "description": "This class in social media marketing explores the growing popularity of using digital technologies to reach hospitality guests. The emphasis of the class is on expanding student's working knowledge on the four zones of social media (community, publishing, entertainment and commerce) within the context of hospitality. Students explore how social media can be employed to build hospitality brands, conduct business, handle guest complaints, drive sales, forge and maintain guest relationships. Although strategies for executing successful social media campaigns is taught, an over emphasis on any one specific social network is not.", "prerequisite": "HM 201"}, {"department": "HM", "number": "350", "credits": "3 Credits", "description": "This course introduces students to the principles of revenue and profit optimization, and the methodologies and analytical techniques required to make data-driven, profit-oriented decisions across all of the major revenue streams in hospitality. Areas of focus include data analytics, pricing, demand forecasting, capacity and duration management, and distribution channel management. The overriding goal of this course is to provide students with the skills necessary to make data-driven, profit-oriented decisions.", "prerequisite": "HM 272", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HM", "number": "355", "credits": "3 Credits", "description": "Specialized applications of law to the hospitality industry.  HM 355 Legal Aspects of the Hospitality Industry (3) Laws, courts, and more generally the legal system together constitute an integral feature of the environment within which the hospitality industry operates. The objective of this course is to acquaint students with the application of law to hotels, restaurants, and institutional settings. A hospitality manager who understands the law can prevent many legal problems from occurring, including preventing injuries that may lead to lawsuits Main topics in this course typically include: types of law, judicial structure and trial procedures; conduct of legal research, including use of Web resources; legal duties of innkeepers and guests; negligence and other torts; contract law; civil rights and public accommodations, especially protections from discrimination; guests' property; regulation and licensing; employment law, especially protections from discrimination; casinos and the law; and food and alcohol service liability.", "prerequisite": "HM 201"}, {"department": "HM", "number": "382", "credits": "3 Credits", "description": "The course examines franchising from the perspective of the both the Entrepreneur interested in franchising their business (Franchisor) and the Entrepreneur interested in starting a business by buying a franchise (Franchisee). Franchising is explored from legal requirements to marketing to feasibility and aptitude. Examples are included for a variety of hospitality franchise operations and franchise opportunities in other business segments. The course is oriented to the student who would like to start a business, explore buying a franchise of an existing business, or work for franchisors."}, {"department": "HM", "number": "384", "credits": "3 Credits", "description": "HM 384 Meetings and Events I examines the meeting and event industry, and the skill set of successful Meeting and Event Professionals. The course covers a broad overview of the processes involved in planning and implementing meetings, special events, and conferences by focusing on the basic processes of developing, planning, coordinating, implementing, and evaluating. Meetings & Events management is a viable career option within the hospitality industry. Hotels, restaurants, schools, arenas, convention centers, and retirement communities can all serve as venues for events. Events add value to organizations by creating engaging and memorable experiences for its stakeholders. Effective event managers know how to assess stakeholder objectives and design an event that meets or exceeds those objectives. With actual event case studies, the student will apply best practices in event design, promotion, management, and evaluation."}, {"department": "HM", "number": "386", "credits": "3 Credits", "description": "HM 386 will serve as a gateway course to the casino concentration for some students and as a supplemental course for students focusing in other areas. The goal is to provide students with an overview of the commercial gaming industry with a focus on the United States gaming market. Students will be exposed to the early stages of the gaming industry in the twentieth century as well as the rapid expansion that has occurred in the last twenty years. Students will understand how casinos are structured depending on the markets they serve as well as how they are regulated. After providing the students with a framework from which to view commercial gaming, the course will provide an introduction to four important games that all contribute to casino profits. The goal will be to familiarize students with terms as well as operational knowledge necessary should they decide to pursue a career in commercial gaming. Lastly, HM 386 will serve as an entry course for the remainder of the casino concentration. This course will help students determine whether they wish to make a further commitment which will involve three additional courses and an internship."}, {"department": "HM", "number": "387", "credits": "3 Credits", "description": "This course is an overview of controls used in casinos including an exploration of complimentary goods (comps) and services and credit.", "prerequisite": "HM 201"}, {"department": "HM", "number": "388", "credits": "3 Credits", "description": "The primary objective of this course is to build upon the fundamental understanding of the gaming industry that was introduced in the introductory course. The advanced students will gain an understanding of what it means to be a casino manager. Students will build this knowledge by working through case studies derived from actual issues that have confronted casino managers. In addition, students will continue to build their expertise in the various revenue producing games offered the casino industry. Finally, the students will continue to be exposed to some of the fundamentals of casino mathematics.", "prerequisite": "HM 386"}, {"department": "HM", "number": "390", "credits": "3 Credits", "description": "This course introduces students to issues of corporate social responsibility. The course is taught from both general business and hospitality perspectives. Specifically, this course addresses the general historical development of CSR along with hospitality cases, fundamental concepts of CSR, different arguments for CSR, major frameworks of CSR, sustainability (environmental) issues, and hospitality cases and applications. The course will provide an opportunity to students for analyze the CSR programs of major hospitality companies by applying the concepts and practices of CSR discussed in the course.", "prerequisite": "HM 201"}, {"department": "HM", "number": "395A", "credits": "3 Credits/Maximum of 12", "description": "The on-campus internship course provides experience that will prepare students for management-level employment. This is designed to provide students with real job experience that complements their classroom learning and affords them the opportunity to apply their knowledge in real-world settings. This will be accomplished by participating in rotations as an employee, student supervisor, and Manager in Training in the daily operations in their department of Penn State Hospitality Services, and by developing their job skills specific to their internship position and personal goals. The students professional work experience offers knowledge about the hospitality industry, the chance to learn new skills, and a means to assess strengths and areas for development. Students will receive direct hands-on training in a functional area of Penn State Hospitality Services working in such areas as; front desk, housekeeping, maintenance, sales, restaurants, culinary, banquets, and marketing for 15-20 hours per week for 15 weeks. Students will also attend a 75-minute class weekly, which will feature presentations by Penn State Hospitality Services department heads, and professional development presentations.", "prerequisite": "Approval by course instructor"}, {"department": "HM", "number": "395B", "credits": "3 Credits/Maximum of 6", "description": "The on-campus internship course provides experience that will prepare students for management-level employment. This is designed to provide students with real job experience that complements their classroom learning and affords them the opportunity to apply their knowledge in real-world settings. This will be accomplished by participating in rotations as an employee, student supervisor, and Manager in Training in the daily operations in their department of Penn State Hospitality Services, and by developing their job skills specific to their internship position and personal goals. The students professional work experience offers knowledge about the hospitality industry, the chance to learn new skills, and a means to assess strengths and areas for development. Students will receive direct hands-on training in a functional area of Penn State Hospitality Services working in such areas as; front desk, housekeeping, maintenance, sales, restaurants, culinary, banquets, and marketing for 15-20 hours per week for 15 weeks. Students will also attend a 75-minute class weekly, which will feature presentations by Penn State Hospitality Services department heads, and professional development presentations.", "prerequisite": "HM 395A"}, {"department": "HM", "number": "395C", "credits": "3 Credits/Maximum of 12", "description": "The on-campus internship course provides experience that will prepare students for management-level employment. This is designed to provide them with real job experience that complements their classroom learning and affords them the opportunity to apply their knowledge in real-world settings. This will be accomplished by participating in rotations as an employee, student supervisor and Manager in Training in the daily operations of Penn State Food Services, and by developing their job skills specific to their internship position and personal goals. The student's professional work experience offers knowledge about the hospitality industry, the chance to learn new skills, and a means to assess strengths and areas for development. Students will receive direct hands-on training in a functional area of Penn State Housing and Food Services for working 15-20 hours per week for 15 weeks. Students will also attend a 75-minute class weekly, which will feature presentations by Housing & Food Services department heads, professional development, and tours of the Penn State Housing & Food Services facilities.", "prerequisite": "Approval by course instructor"}, {"department": "HM", "number": "395D", "credits": "3 Credits/Maximum of 12", "description": "The Off-campus internship course provides experience that will prepare students for management-level employment. This is designed to provide students with real job experience that complements their classroom learning and affords them the opportunity to apply their knowledge in real-world settings. This will be accomplished be participating in rotation as an employee, student supervisor and Manager in Training in the daily operations in their department. The students professional work experience offers knowledge about the hospitality industry, the chance to learn new skills, and a means to assess strengths and areas for development. Students will receive direct hands-on training in a functional area working in the hospitality industry for 15-20 hours per week for 15 weeks during Fall and Spring semesters, and 30-40 hours per week during the summer.", "prerequisite": "Approval by course instructor."}, {"department": "HM", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "HM", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual of group instruction.", "other": ["International Cultures (IL)"]}, {"department": "HM", "number": "407", "credits": "3 Credits", "description": "The course will incorporate economic and managerial dimensions to the discussion of food decisions in foodservice away-from-home eating contexts, particularly emphasizing the behavioral aspect of decisions - how individuals (consumers, providers, managers) make choices in the food system, and what might be the consequences of these choices. The course will use evidence from multiple farm-to-fork perspectives to allow students to analyze food systems problems and solutions. It will also require students to engage directly with the local food service system through course projects and tours. The major topics of discussion will be organized under each of the value chain components of the farm-to-fork continuum: production, distribution, purchasing, preparation, and consumption. Specific topics under each of these value chain components will include: nutrition, food safety, food waste, sustainable practices, social justice, consumer utility, economic profits, ethics, government policy, and decision-making. In particular, the course will be motivated by economic theories such as: agency relationship, information asymmetry, transaction cost economics, and behavioral economics topics such as self-rationing, and time discounting.", "prerequisite": "HM 201", "other": ["Cross-listed with: FDSYS 407"]}, {"department": "HM", "number": "411", "credits": "3 Credits", "description": "Management issues in beverage service and products. Students taste wines, brews, and distilled spirits.", "prerequisite": "students must be at least 21 years old"}, {"department": "HM", "number": "413", "credits": "3 Credits", "description": "This course introduces students to a new product development process that requires coordination, communication, and integration throughout the organization.", "prerequisite": "HM 230"}, {"department": "HM", "number": "430", "credits": "3 Credits", "description": "Simulation and application of technical, conceptual, interpersonal skills. Emphasis on group dynamics; improvement in managerial skills; management team functions.  HM 430 Advanced Food Production and Service Management (3) This course is designed to give students an opportunity to gain experience in the wide range of skills and techniques that are normally associated with the duties of a hospitality manager. The skills and techniques that will be emphasized include, but are not limited to, duties involved in the planning, execution and evaluation of full-service, theme oriented ala carte dining. Students are expected to form a marketable theme and then develop, produce and evaluate an authentic dining experience. A successful dining experience is contingent upon both guest satisfaction and the achievement of financial goals. Main topics typically include: * Research, describe and produce an authentic restaurant environment from a selected theme * Demonstration of technical responsibilities involved in the development, production and evaluation of a wide range of food service systems including: sales, menu planning, recipe development and evaluation, pricing, purchasing, facilities management, personnel management and financial management * Operational needs and potential problems in a food and beverage operation during production and service * Timely and effective managerial problem identification and decision-making abilities * Interpersonal and teamwork skills both within a management team and with classmates as employees * Interaction with guests and evaluation of guests' dining experiences The course is a capstone management class in the foods sequence and is required of all Hospitality Management majors. Students must first complete the introductory food production course.", "prerequisite": "HM 330"}, {"department": "HM", "number": "432", "credits": "3 Credits", "description": "A focus on special topics and current events in the restaurant industry.  HM 432 Contemporary Issues in Restaurant Management (3) The purpose of this course is to focus on contemporary issues and current events in the restaurant and food service management. The course will attempt to keep the students as updated as possible regarding the industry by covering these topics and including a discussion of current events from headline news services and other electronic references. Students gain knowledge that is applicable specifically to the restaurant and foodservice industry. This course explores the global food and drink market in today's challenging climate with analysis of trends and conditions expected to influence sales value and volume growth over the next five years. Discussion will include the impact economic shifts have on the restaurant and food service industry and the subsequent influence on consumer purchasing habits and food and drink sales over several years. This course considers food and drink New Product Development (NPD) and other vital branding, marketing and sales strategies in the context of the following challenges, issues and trends expected to influence restaurants and food service management over the years.", "prerequisite": "HM 201"}, {"department": "HM", "number": "435", "credits": "3 Credits", "description": "This is an introductory financial management course for the hospitality management major. The course will teach students fundamental knowledge of financial management concepts. This course will introduce a wide range of essential concepts that students can utilize to improve their decision-making and value creation abilities. The course introduces financial management Health and Human Development concepts with a focus on practical application, both in professional and personal lives. Students' ability to learn these concepts will be tested through group and individual assignments. This course focuses on conceptual and analytical knowledge and skill.. Practical knowledge will also be reinforced through in-class discussions, and periodic readings that focus on current issues in finance and hospitality.", "prerequisite": "ECON 102"}, {"department": "HM", "number": "442", "credits": "3 Credits", "description": "Understanding the customer is the key to a successful hospitality business. This course is an overview of the principles of services marketing applied to a specific industry. Particular focus will be in understanding the importance of service quality and customer requirements, aligning service design and standards, delivering and performing service, managing service promises and understanding the impact of marketing strategies on the company's bottom-line.", "prerequisite": "HM 201"}, {"department": "HM", "number": "443", "credits": "3 Credits", "description": "Elements of sales management, advertising, promotion, and public relations as applied to hospitality organizations.  HM 443 Sales Planning and Advertising for Hospitality Operations (3) The hospitality industry is entering an era in which operational and product parity between organizations and their properties is increasingly likely. This is so because of their shared access to technology, design and training devices. Consequently, it becomes evident that increases in sales will be reliant on the competitive advantages that professionals achieve in marketing strategies, sales management, and especially in marketing communications (MARCOM) tactics and execution. This course exposes students to a wide range of hospitality marketing communications issues. Students gather information from electronic media, trade and travel media, and consumer media. Students explore hospitality MARCOM issues through semester-long individual projects. Main topics typically include: * Marketing versus selling strategies * Industry trends that affect advertising and sales especially Internet activities * Types of advertising media * Print advertising principles * Broadcast advertising principles * Foundations of direct marketing * Elementals of public relations * Travel agency relations * Personal salesThis is an elective course. Students must first take the hospitality marketing course in Hospitality Management.", "prerequisite": "HM 442"}, {"department": "HM", "number": "466", "credits": "3 Credits", "description": "Recruitment, selection, training, performance appraisal, and compensation of hospitality human resources in today's culturally diverse work force.", "prerequisite": "HM 201", "other": ["United States Cultures (US)"]}, {"department": "HM", "number": "471", "credits": "3 Credits", "description": "This course introduces the student to new information technology in the hospitality industry and to the system selection process.  HM 471 New Trends and System Selection in Hospitality Information Technology (3) The purpose of this course is to focus on new IT trends and system selection in the hospitality industry. New trends are topics that have become important or prevalent in the industry and are generally not covered in other courses. Examples include Software as a Service delivery of property management systems, enterprise restaurant management reporting, Web 2-3.0, smart phone applications, Radio Frequency Identification (RFID), ect. The course will attempt to keep the students as updated as possible regarding the industry trends by covering these topics and including a discussion of current events from industry partners, headline news services, and other electronic references. Students gain knowledge that is applicable specifically to the hospitality industry.", "prerequisite": "HM 271"}, {"department": "HM", "number": "480", "credits": "3 Credits", "description": "Applied Hospitality Concepts and Decision Making is designed as a capstone course in the Hospitality Operations stream. The course primarily focuses on students' participation in a hotel management simulation. The simulation requires students to consider strategic objectives through the application of revenue management, managerial accounting, human resource management, sales and marketing, and sustainability and innovation concepts. The course also devotes time to the topic of service quality and the considerations in delivering high-quality service in the hospitality experience including both theoretical perspectives and quantitative analysis (i.e., project management, process analysis). As a capstone course, the course will also keep students abreast of trends and current events in the hospitality industry.", "prerequisite": "HM 280"}, {"department": "HM", "number": "481", "credits": "3 Credits", "description": "This course will focus on advanced topics in hotel management that are of critical importance in a dynamic and ever-changing operating environment. In particular, this course will address the economy, hotel ownership relationships, brand development, other industries in the value chain, product and service trends, and legislative issues. Knowledge of the economy and its relationship to the hotel industry is presented with discussions on stock markets, economic indicators, capital structure, and hotel economic indicators. Hotel ownership relationships are becoming more complicated, which will be addressed with discussions on asset management, owner objectives, management contracts, and franchise agreements. The introduction of new brands is a key component to corporate strategy, and the nature of strategic brand development will be covered. Other industries in the value chain have a significant impact on the hotel industry, and this course will focus on the evolution of alternative booking channels and lodging options. Product and service trends will also be a course focus, including healthy hotel initiatives, environmental initiatives, design trends, amenity trends, and technological advances. In addition, legal issues impacting the hotel industry will be discussed, along with the role of the American Hotel and Lodging Association and its lobbying efforts on specific legislation.", "prerequisite": "HM 280"}, {"department": "HM", "number": "482", "credits": "3 Credits", "description": "Ultimately, hospitality enterprises are location-based businesses requiring the deployment of real estate. To understand this important concept, hospitality students need to understand real estate in a hospitality industry environment. Students in HM 482 complete projects including feasibility studies for proposed hotels where they evaluate the competition, project hotel supply by future year, including evaluating and quantifying future supply additions. Then, students project hotel demand by future year by market segment, including estimating growth and any induced demand, and they calculate fair share by future year for proposed hotels. Students estimate penetration ratios by future year by market segment for proposed hotels, until stabilization, calculate occupancy by future year for proposed hotels, until stabilization, and estimate Average Daily Rate (ADR) by future year for proposed hotels, including estimating inflation. Students develop detailed financial projections by future year for proposed hotels, estimate market value for proposed hotels by applying the Income Approach, Cost Approach, and Sales Comparison Approach, conduct a Reconciliation to conclude a single, final Market Value Estimate, and compare the estimated market value of proposed hotels to the estimated development cost to conclude feasibility.", "prerequisite": "HM 201"}, {"department": "HM", "number": "483", "credits": "3 Credits", "description": "Students learn how to effectively implement revenue management strategies and techniques in the hospitality industry.", "prerequisite": "HM 350"}, {"department": "HM", "number": "484", "credits": "3 Credits", "description": "This course examines Entrepreneurship, Intrapreneurship and Innovation in the Hospitality Industry. The course provides a foundation of how ideas are generated, implemented, and taken to market. The course examines the characteristics of the entrepreneur and the process from idea generations, building a business model, preparing competitive analysis, completing a feasibility study, reviewing intellectual property, developing a business plan, seeking funding, and presentation to investors. The course is oriented to the student who would like to start a business or explore innovation within an existing organization", "prerequisite": "ACCTG 211"}, {"department": "HM", "number": "485", "credits": "3 Credits", "description": "Meeting and event planning is an important and viable professional career option within the hospitality industry. Each event contains all the aspects of any business venture: stakeholder analysis, operations plan, marketing plan, and financial plan. Accordingly, the execution of an event requires effective communication, teamwork, motivational, and analytical skills. Therefore, students seeking a career in event management need to possess these fundamental business skills. In this advanced, hands-on course, students will plan and execute an event, building on event management content from HM 384: Introduction to Meeting and Event Planning. Students will be involved in all major aspects of planning and executing events, including contract negotiation, budgeting, risk management, promotion, menu planning, site selection, on-site management, sustainability, inclusivity, volunteer management, and evaluation.", "prerequisite": "HM 384"}, {"department": "HM", "number": "486", "credits": "3 Credits", "description": "The primary objective of this course is to build upon the fundamental understanding of the gaming industry that was introduced in the introductory course. The advanced students will gain an understanding of the various promotional programs currently used by the commercial gaming industry. Students will build this knowledge by working in teams to build competence and present specific programs to their classmates. In addition, students will continue to learn to evaluate marketing programs based on their incremental contributions to profits and thereby understand that some marketing approaches cannot be financially justified. Finally, the students will continue to build competence in the fundamentals of casino mathematics.", "prerequisite": "HM 386"}, {"department": "HM", "number": "488", "credits": "3 Credits", "description": "Asset management is a growing and dynamic discipline in the hospitality industry. Asset managers are integral to the relationships between owners, managers, franchisors, franchisees, and brands. Today's owners expect asset management to function as the owner¿s representative in optimizing the value and protecting the asset. This course introduces students to asset management (\"AM\") and the role of the asset manager in global hospitality operations. The course is taught from a hospitality perspective and focuses on how asset managers usually work with hospitality asset owners and third-party providers to enhance and optimize the value of hospitality assets. The multidisciplinary content includes a variety of perspectives on asset manager helping owners and third-party operators make investment decisions, enhance asset value, review and assess contractual agreements, and be aware of ongoing global and local trends that could eventually affect the value of hospitality assets such as hotels and restaurants", "prerequisite": "ACCTG 211"}, {"department": "HM", "number": "490", "credits": "3 Credits", "description": "The purpose of this capstone course is to integrate previous course work to enhance students' analytical and critical thinking skills, managerial decision making skills, and an awareness of emerging trends in the hospitality industry. In particular, this course will integrate content in the areas of hospitality marketing, human resource management, organizational behavior, finance, accounting, and hospitality operations. The course offers a blend of theory and practical application of models of competitive strategy. The central questions that drive the course are: 'How do hospitality companies make strategic decisions, and how does strategy enhance the effectiveness of hospitality enterprises?' During the first half of the semester, the course will focus on the model of strategy formulation, from developing company vision and mission and setting objectives, through conducting an environmental scan, SWOT analysis, strategic analysis, and strategic choice. During the second half of the course, the focus will shift to corporate social responsibility, ethics, international strategic decision making, global hospitality management, and emerging trends in the industry.", "prerequisite": "HM 442"}, {"department": "HM", "number": "490W", "credits": "3 Credits", "description": "This capstone writing-intensive class integrates content from throughout the previous curriculum, focusing on strategic application to current industry issues.  HM 490W Strategic Hospitality Management (3) This capstone course integrates previous courses in the curriculum and introduces students to new strategic management concepts. This course adopts a macro perspective by focusing on the total hospitality enterprise and the external competitive environment in which hospitality firms operate. The goal of the course is to develop students' analytical skills to formulate, implement, and evaluate business strategies. Using a case-based approach, the course emphasizes critical thinking and evidence-based decision making.", "prerequisite": "HM 336", "other": ["Writing Across the Curriculum"]}, {"department": "HM", "number": "492", "credits": "1 Credits", "description": "Course prepares senior HM students to assume leadership positions in the hospitality industry (Focus on careers, leadership, ethics, lifelong learning).", "prerequisite": "HM 430"}, {"department": "HM", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "HM", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Independent study related to a student's interests directed by a faculty supervisor and culminating in the production of a thesis.", "prerequisite": "STAT 200", "other": ["Honors"]}, {"department": "HM", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "HM", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "HM", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "HM", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual of group instruction.", "other": ["International Cultures (IL)"]}]