[{"department": "HORT", "number": "101", "credits": "3 Credits", "description": "Introduction to horticulture with an emphasis on plant domestication, morphology, classification, world food crops, commodities, gardens, propagation, and agrochemicals. The course content of HORT 101, as indicated in the complete course outline, deals with the fundamental concepts and specialty areas, which contribute not only to the science and technology involved in horticulture but also to the art. It provides an overview of the role of various specialties of the natural sciences (e.g. plant morphology, physiology, taxonomy, genetics and nutrition, pest management, management and production of crops, landscaping, and technology) relevant to a range of plant uses from medicinals and food production to the aesthetic benefits derived from plants. The course begins with the origin and domestication of plants followed by: A. An Overview of horticulture which includes an explanation of the horticulture industry, how to achieve success in horticulture and the relationship between horticulture and the environment; B. Science in horticulture which includes the classification of plants, plant propagation, plant nutrition, environmental factors affecting plant growth and development, plant growth regulators, post harvest physiology and pest management; C. Management and production of horticultural crops which include nursery, floral, turfgrass, vegetable, fruit and nuts; D. Landscaping including designing landscapes, xeroscapes and sitescapes, establishing and maintaining landscapes; and E. Concluding with Technology in horticulture. The course content additionally includes major areas of knowledge based on the fundamentals, universal concepts and achievements in the cluster of scientific disciplines comprising horticulture and provides students with the opportunity to appreciate that the origins, domestication and production of cultivated plants are the essence of human existence.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "HORT", "number": "120", "credits": "2 Credits", "description": "Emphasis is placed on the use of commercial software used for landscape planning and estimating.  Limited to Landscape Contracting majors only."}, {"department": "HORT", "number": "131", "credits": "3 Credits", "description": "In this class students learn to identify and use many common and some not-so-common ornamental herbaceous annual and perennial plants. After completing this class students will have practiced identifying by scientific name and common name over 200 herbaceous annual and perennial plants in the field, and will have studied common uses for these plants, and practiced selecting plants for different landscape applications. Students will use online resources and databases to aid in identification of herbaceous annual and perennial plants and to research their characteristics and cultural needs."}, {"department": "HORT", "number": "137", "credits": "3 Credits", "description": "Identification and description under fall conditions; discussion of cultural and aesthetic aspects of trees of value in ornamental planting."}, {"department": "HORT", "number": "138", "credits": "3 Credits", "description": "Identification and description under spring conditions; discussion of cultural and aesthetic aspects of shrubs of value in ornamental plantings."}, {"department": "HORT", "number": "150N", "credits": "3 Credits", "description": "Plants have played a dynamic role in shaping our life. In reality, human existence on Earth is made possible by the breath of plants through photosynthesis. Likewise, our botanical connections and interactions are many: we need plants for food, beverages, medicines, materials, healthy lifestyles, and aesthetics. Plants have also played an important role in where our ancestors settled and where we live today. Some of the important topics discussed in this class will include the role of tea in transforming world cultures, the importance of sugar in the Civil War and the establishment of the Caribbean nations, the effect of the Irish potato famine on Europe and the US, and the use of plants in solving crimes.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "HORT", "number": "169N", "credits": "3 Credits", "description": "Fundamentals of Home Landscaping offers broad coverage of the environmental, human, technological, and aesthetic issues associated with residential landscape design. Beginning with the way we perceive, manage, and design the landscape, the course examines the arrangement of land, water, plant forms, and structures for their best use and greater enjoyment. Relying on actual procedures and underlying principles utilized by experienced residential landscape designers, the course will introduce students to basic design principles, concepts, specific procedures for preparing site plans and associated documents. The course will also explore designing with and general care of plants, assorted hardscape types, and how to properly assess a site. From choosing trees, shrubs, groundcovers that are correct for the site to properly installing patios, decks, and walkways, students will be presented with the varied ways plants and hardscape are installed and maintained. The course will conclude with students completing a design for a residential site.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "HORT", "number": "201", "credits": "2 Credits", "description": "The objective of this course is to provide students with the opportunity to develop an appreciation of the skills required to properly care for large trees. The course provides information that is especially useful to those in the Landscape Management option of the Landscape Contracting major. The course will provide an overview of the methods used to diagnose problems and provide for the long term care of large trees. Areas of emphasis will include accessing the upper parts of large trees; safety when working in and around large trees; and the proper selection, use, and maintenance of the equipment used in the arboriculture profession."}, {"department": "HORT", "number": "202", "credits": "3 Credits", "description": "This course introduces the principles and practices of asexual and sexual plant propagation. By the end of this class students will have hands on experience with many common forms of plant propagation and should be able to figure out how to successfully propagate most plants. The class covers common plant propagation techniques and equipment, commercial scale .propagation methods, basic plant physiological processes that influence plant propagation, and the role of environmental factors such as light, temperature, and water on propagation success."}, {"department": "HORT", "number": "220", "credits": "3 Credits", "description": "Application of computer-aided design software including AutoCAD and LANDCADD to landscape contracting.", "prerequisite": "HORT 120"}, {"department": "HORT", "number": "232", "credits": "3 Credits", "description": "Fundamentals of horticultural crop plant classification and systematics. Examples chosen from fruits and vegetables, exclusive of subtropical and tropical fruit.", "prerequisite": "HORT 101"}, {"department": "HORT", "number": "233", "credits": "3 Credits/Maximum of 3", "description": "Introduction to the principles of wine production emphasizing basic wine grape biology, fermentation science, wine chemistry, and wine perception. FDSC 233 / HORT 233 provides an interdisciplinary treatment of the science of grape growing, vinification, and wine consumption. Students will learn how viticultural practices translate to wine chemistry, and how key variables associated with that conversion affect consumer perception. The course will cover topics such as basic grapevine physiology, vineyard management practices, vinification, domestic and international wine styles, and consumer interactions with wine (e.g., sensory evaluation, health aspects of wine). Although the course is considered to be introductory, students must have a basic grounding in university-level chemistry and biology. Course material will be primarily transmitted through lectures, reading assignments to be completed outside of class, and brief practical exercises in the Sensory Evaluation Center (Department of Food Science).", "prerequisite": "CHEM 110", "other": ["Cross-listed with: FDSC 233"]}, {"department": "HORT", "number": "238", "credits": "3 Credits", "description": "Students will be introduced to the development of integrated weed management strategies utilizing a variety of cultural and chemical methods.", "other": ["Cross-listed with: TURF 238"]}, {"department": "HORT", "number": "250", "credits": "3 Credits", "description": "Introduction to the processes and principles of residential landscape site development, from initial client contact to implementation."}, {"department": "HORT", "number": "269", "credits": "3 Credits", "description": "Introductory course which develops the student's ability to understand the processes, techniques, and theories that form the basis of residential site planning. The course covers the planning process, principles of design and graphic presentation"}, {"department": "HORT", "number": "270", "credits": "1 Credits", "description": "Graphics are the language of design and presentation in Landscape Contracting. The ability to develop, document and communicate design ideas is essential for success in any design profession. As a graphics arts course, emphasis will be placed on hands-on studio activities and skill development to explore drafting, graphic, and rendering techniques using a variety of traditional drawing media to develop symbolic and representational graphics essential for the communication of design ideas. Digital rendering and hybrid (tradigital) graphics methods and techniques will also be explored.", "prerequisite": "HORT 269"}, {"department": "HORT", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "HORT", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "HORT", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "HORT", "number": "301", "credits": "3 Credits", "description": "The objective of the course is to introduce students to the theories and practices related to the care of trees in developed areas. The course provides information that is especially useful to those in the Landscape Management option of the Landscape Contracting major, and the Urban Forestry option of the Forestry major. This course will provide an overview of the concepts and methods prescribed for the evaluation and care of large trees in urban settings. Emphasis will be placed on maintaining the long-term health of large trees. Major topic areas will include methods for characterization of tree health, diagnosing problems in trees, the influence of environmental factors on tree health, and the assessment of hazard trees. Proper pruning techniques and factors to consider when making decisions regarding long-term tree care in urban areas will be discussed.", "prerequisite": "BIOL 110"}, {"department": "HORT", "number": "315", "credits": "3 Credits", "description": "Horticultural plants respond to the environmental factors of light, temperature, water, and fertilizer both in controlled and field environments.", "prerequisite": "HORT 101"}, {"department": "HORT", "number": "352", "credits": "2 Credits", "description": "Floral design beginning with elements and principles of design. Flower arranging techniques as well as different styles of flower arrangements."}, {"department": "HORT", "number": "368", "credits": "4 Credits", "description": "Basic planting design employing the use of indigenous and ornamental plants as design elements in the man-made environment. Intended for Landscape Contracting majors only.", "prerequisite": "HORT 269"}, {"department": "HORT", "number": "402W", "credits": "3 Credits", "description": "Mineral nutrition of higher plants, including nutrient acquisition, transport, metabolism, and practical implications.  HORT 402W Plant Nutrition (3) The course considers the mineral nutrition of higher plants from physiological, ecological, and agricultural perspectives. The first part of the course considers factors influencing the acquisition of mineral nutrients and their transport in the plant, including nutrient mobility in the soil, root biology, rhizosphere interactions, membrane transport, xylem, and phloem transport. Root symbioses and metabolic assimilation of N and S will also be discussed. The second part of the course gives an overview of mineral metabolism. The final third of the course illustrates the practical dimensions of plant nutrition. The diagnosis of nutritional disorders, nutrition, and yield, foliar fertilization, genetic aspects of plant nutrition, and nutrient cycling will be covered by lecture and laboratory exercises. Laboratory exercises demonstrate lecture topics and permit a 'Hands-on' involvement with the subject. Emphasis is placed on concepts and integrating principles rather than memorization of technical details.", "prerequisite": "HORT 315", "other": ["Writing Across the Curriculum"]}, {"department": "HORT", "number": "407", "credits": "3 Credits", "description": "The scientific principles and techniques of utilizing genetic variability in improving the heredity of plants for specific purposes.  HORT 407 Plant Breeding (3) Horticulture 407 is a 3-credit course that is taught every spring semester and is required of horticulture undergraduate students at Penn State. This course also attracts upper-division and graduate students from other departments such as Agronomy, Biology, Forest Resources, Plant Pathology, Biochemistry, and Molecular Biology. The objectives of the course are to 1) develop an understanding of the role of genetics in plant breeding, 2) elucidate the diversity of plant characteristics which are subject to improvement, 3) review conventional and contemporary techniques for the development of new cultivars, and 4) present the opportunity for the student to effectively communicate scientific information in writing and through speaking. Horticulture 407 emphasizes basic principles of plant genetics and breeding and the utilization of molecular biology techniques for crop improvement. It includes two-hours of lecture and a two-hour laboratory-discussion session each week. Major topics of discussion during lecture periods include plant reproduction, genetic variation in plants, review of mitosis and meiosis, Mendelian genetics, linkage, and recombination, qualitative and quantitative traits, population genetics, cytogenetics, theory of selection and response to selection, heritability, review of statistical tools useful in plant genetics and breeding, systems of pollination controls in plants including self-incompatibility and male sterility, breeding methods for self- and cross-fertilized plants, and application of modern technologies, including molecular markers, marker-assisted selection, and genetic transformation, to crop improvement. The laboratory sessions are designed to complement the lectures and provide opportunities for hands-on experience. For example, students practice staining and counting plant chromosomes on microscope slides, self- and cross-pollination of different plant species, linkage mapping and analysis of plants for Mendelian segregation, inoculating plants with fungal pathogens and observing and evaluating plants for disease development, extracting DNA from plant tissue and separating DNA segments on agarose medium using gel electrophoresis, and practicing computer programs for gene mapping and analysis of Quantitative Trait Loci (QTLs). Furthermore, students are mentored to prepare a term paper on a plant breeding/plant genetics subject and to orally present their findings to the class using visual aids.Student evaluation is based on two mid-term exams (each 100 points), one comprehensive final exam (200 points), 10 weekly homework or laboratory reports (for a total of 100 points), and a term paper (50 points for writing and 50 points for presentation). For the presentation, each student is required to turn in a 3-5 page write-up about a topic of interest."}, {"department": "HORT", "number": "408", "credits": "4 Credits", "description": "The course examines the environmental factors that assure success of landscape plants and the plant physiological conditions affected by the management practices (e.g., selecting plants, planting, irrigating, fertilizing, mulching, pruning, and pest management) used to successfully produce, grow, install, and maintain ornamental plants in the nursery and landscape. Students analyze and summarize their findings from landscape evaluations conducted in the field and produce and present a thorough landscape management plan to an audience of their peers, professionals, and guests. By the end of the semester students will be conversant on the best management practices for selecting, planting, and maintaining plants in the landscape and capable of making landscape installation and management decisions and presenting them to their clientele.", "prerequisite": "HORT 137"}, {"department": "HORT", "number": "410W", "credits": "3 Credits", "description": "An overview of current and emerging issues in the Landscape Contracting Industry. Students will learn about the entrepreneurial, management, labor, and environmental issues that are shaping careers and the direction of the industry. Interactions with personnel within the landscape industry will expose the students to company expectations of employees, and the immediate issues those companies are facing in the marketplace. Students will also practice and perfect their written communication skills.", "prerequisite": "HORT 269", "other": ["Writing Across the Curriculum"]}, {"department": "HORT", "number": "412W", "credits": "3 Credits", "description": "The purpose of this course is to examine the changes occurring in harvested horticultural crops and understand the means of controlling these changes. This is accomplished through an understanding of the basic physiological, biochemical, and molecular processes associated with senescence, such as respiratory metabolism, chilling injury, and ethylene action. The processes associated with the deterioration of specific plants or plant parts are also discussed, for example the physiological changes associated with fruit ripening, flower senescence, leaf yellowing and abscission. This knowledge is then used to understand why various storage technologies are effective in prolonging the useful life of horticultural commodities.", "prerequisite": "HORT 101", "other": ["Writing Across the Curriculum"]}, {"department": "HORT", "number": "431", "credits": "3 Credits", "description": "An overview of small fruit crop production, including grapes, strawberries, raspberries, blackberries, blueberries, cranberries, currants and gooseberries. The botany and physiology of each crop is discussed so students understand how the crops can be manipulated for maximum production under various environmental conditions. Production practices are described for each crop, including growing requirements, cultivar selection, planting systems, pruning, plant nutrition, frost protection, irrigation scheduling, harvest and postharvest handling, mechanization, and pest identification and control. Sustainable production techniques, including aspects of organic production methods, are stressed. Laboratories in the field stress hands-on production practices.", "prerequisite": "HORT 101"}, {"department": "HORT", "number": "432", "credits": "3 Credits", "description": "Science, art, and techniques of regulated cropping; orchard designs and management systems.", "prerequisite": "HORT 101"}, {"department": "HORT", "number": "433", "credits": "3 Credits", "description": "Cultural requirements of important vegetable crops in conjunction with physiological processes and problems related to commercial production. This course will provide students with information, techniques and ideas to produce vegetable crops on a commercial scale. Students learn production fundamentals applying to aIl vegetable crops including fertility management, transplant production, season extension, and pest management during the first part of the semester. This is followed by detailed and specific information for important vegetables on the science of producing high quality crops. Using a participatory approach students learn important techniques to successful production including experimenting on a small scale, designing a drip irrigation system, scouting for pests and developing a pest management strategy. Field trips to successful operations and outlets and the research farm are important elements of the class.", "prerequisite": "HORT 101"}, {"department": "HORT", "number": "445", "credits": "3 Credits", "description": "Advanced lectures on plant ecology which stress integration of physiological, population-level and community-level phenomena, and ecology in agriculture.", "prerequisite": "BIOL 220W"}, {"department": "HORT", "number": "451", "credits": "3 Credits", "description": "The course provides information that is especially useful to those with knowledge of horticultural plants; however a background in plant production is not needed. Major topics discussed include basic concepts in plant and fish biology; nutrient and water use, cycling, and management; pest and pathogen management; and environmental factors as they relate to the design and operation of hydroponics and aquaponics systems. This course includes a weekly laboratory session where students gain practical skills in growing crops in a variety of hydroponics systems and growing crops and fish in an aquaponics system.", "prerequisite": "HORT 101"}, {"department": "HORT", "number": "453", "credits": "3 Credits", "description": "The objective of this course is to provide students with detailed and specific knowledge, skills, and techniques used in production of commercial floricultural crops in the greenhouse and to introduce students to the systems and approaches used in managing a greenhouse. After completing this course students will understand basic greenhouse management practices and environmental systems, controls and management used to produce potted flowering plants, bedding plants, greenhouse grown cut flowers, potted perennials, transplants, plugs and liners, and houseplants. Students will know the cultural and environmental conditions required for about 60 common floriculture crops and will have practiced scheduling and producing some of these plants in the PSU teaching greenhouses. We will also cover costs of production, production management and post harvest needs for many greenhouse crops.", "prerequisite": "HORT 101"}, {"department": "HORT", "number": "455", "credits": "3 Credits", "description": "The nature, operation, and management of retail garden centers, winery tasting rooms, and independent food retailers. Overview of retail marketing principles and practices as they pertaining to horticultural retail businesses. Lectures, discussions, and projects focus on: selecting and pricing goods and services ; how independent retailers effectively use traditional promotion avenues and social media networks to connect with customers; and how to develop a relevant brand, cause marketing effort, and loyalty program. Students will also learn: about retail layout and display strategies; that each consumer segment has different wants, interests, and abilities to obtain goods and services, and about effective employee management.", "prerequisite": "AGBM 101", "other": ["Cross-listed with: AGBM 455"]}, {"department": "HORT", "number": "459", "credits": "3 Credits", "description": "The overall goal of this course is to provide a strong overview of the techniques used in plant biotechnology and the applications made possible by those techniques. The lecture topics will be used to introduce the principles of tissue culture and molecular biology, including how they are used to produce transgenic plants. Furthermore, the course will give students a broader and deeper knowledge in the field of Plant Biotechnology and provide a foundation for understanding the field as it changes in the future. Topics include the safety, legal and ethical issues surrounding GMOs and the study of the anti-GMO arguments surrounding each issue. In the laboratory component of the course, students will be introduced to the underlying principles of molecular biology techniques and aseptic culture of plant cells as well as the tissues and organs used to produce transgenic plants. In summary, through this course students will be introduced to many of the most important tools of the biotechnologist.", "prerequisite": "BMB 252", "other": ["Cross-listed with: BIOL 459, BIOTC 459"]}, {"department": "HORT", "number": "464", "credits": "4 Credits", "description": "Develop and refine the student's ability to understand construction details likely to be encountered by the landscape contractor. It will introduce the technical considerations required to implement design in a manner that is both functional and aesthetically pleasing. It will also introduce principles of grading and drainage.", "prerequisite": "HORT 250"}, {"department": "HORT", "number": "466", "credits": "5 Credits", "description": "Project scheduling methods, plant installation techniques, and field layout principles and practices.  Implications of site preparation.", "prerequisite": "HORT 464"}, {"department": "HORT", "number": "468", "credits": "2 Credits", "description": "Reading and interpreting contract drawings and specifications, quantity take- offs, cost estimating, and bid document preparation.", "prerequisite": "HORT 250"}, {"department": "HORT", "number": "495", "credits": "1-13 Credits/Maximum of 13", "description": "Supervised off campus experience in a public or commercial horticultural enterprise. Written and oral critique of activity required.", "prerequisite": "approval of proposed assignment required prior to registration", "other": ["Full-Time Equivalent Course"]}, {"department": "HORT", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "HORT", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "HORT", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "HORT", "number": "499F", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given on", "other": ["International Cultures (IL)", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors"]}]