[{"department": "HUM", "number": "100N", "credits": "3 Credits", "description": "This course is an introduction to great ideas, themes, creations, and values in the arts and humanities, emphasizing the development of students' basic interpretive and close reading skills as applied to historically significant works in the various disciplines. The course introduces students to interpretive skills for analyzing and understanding historically significant works in the visual arts (painting, sculpture, architecture), the performing arts (theater, film, dance, music), history, literature, and philosophy. Students demonstrate their basic understanding of the disciplines encompassed in the course by interpreting key works in the various fields. The course stresses introducing students to these fields, as well as interdisciplinary connections between them, through broadly synthetic interpretations of important works within their cultural settings. The course will develop students' understanding of different historical periods by examining a variety of cultures, traditions, and aesthetic movements. The course promotes critical conversation among students, for example, by providing lectures that introduce and frame topics for discussion (this pedagogical practice is suggested as one possible approach, not as a requirement). The course also stresses the improvement of students' writing and critical thinking skills through such means as essay exams, group work, oral reports, and/or term papers, as deemed appropriate by the instructor.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HUM", "number": "101", "credits": "3 Credits", "description": "This 3-credit General Humanities (GH) course with an International Cultures (IL) designate offers an introduction to transformative texts from around the world. Students will learn foundational knowledge from various disciplines in the humanities and arts, while developing basic interpretive, close-reading, writing, communication, and critical-thinking skills. This first course of the Keystone sequence engages students with core texts and arts-based materials from antiquity to the modern era, offering a roadmap of disciplinary, interdisciplinary, historical, cultural, and aesthetic perspectives within which to contextualize interpretation. Students will read texts from a variety of humanities disciplines alongside appropriate historical context to learn how ideas transformed, and were transformed, by social, economic, political, and historical events and institutions. The course supports open dialogue and critical engagement among students and faculty, to promote curiosity, reflexivity, and mindfulness, while cultivating the spirit of life-long learning. Students will learn about the value of the humanities and the arts in the context of its historical, sociopolitical, cultural, and global contributions. Student engagement will focus on close textual analysis, critical thinking, and synthesis skills with an emphasis on promoting excellence in written communication through a variety of written assignments designed to prepare students for the oral communication skills expected in our increasingly high-tech, global economy.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "HUM", "number": "102", "credits": "3 Credits", "description": "This 3-credit General Humanities (GH) course with a United States (US) designate offers an introduction to transformative texts from the beginning of modern history to the present that address current issues in the United States. Students will learn foundational knowledge from various disciplines in the humanities and the liberal arts, while developing basic interpretive, close-reading, writing, communication, and critical-thinking skills. This second course of the Keystone sequence engages students with transformative texts from beginning of the modern era to present day, offering a roadmap of disciplinary, interdisciplinary, historical, cultural, and aesthetic perspectives within which to contextualize interpretation. Students will read texts from a variety of humanities disciplines alongside appropriate historical context to learn how ideas transformed, and were transformed, by social, economic, political, and historical events and institutions and how these ideas relate to the history, politics, economics, and social structures of the United States. The course supports open dialogue and critical engagement among students and faculty, to promote curiosity, reflexivity, and mindfulness, while cultivating the spirit of life-long learning. Students will learn about the value of the humanities and the arts in the context of its historical, sociopolitical, cultural, and global contributions. Student engagement will focus on close textual analysis, critical thinking, and synthesis skills with an emphasis on promoting excellence in written communication through a variety of written assignments designed to prepare students for the oral communication skills expected in our increasingly high-tech, global economy.", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "HUM", "number": "150N", "credits": "3 Credits", "description": "This course is an interdisciplinary, cross-cultural, historical, and contemporary examination of myth as it appears in the visual arts, literature, and film. Each iteration of the course covers myths in the arts of at least several of the following cultures-Greek and Roman, Celtic, Norse, European, Egyptian, Near Eastern, Indian, Chinese, Pacific, African, and Native American. The course is thematic and intercultural, for example in the way myths are told in historical cultures and then retold and transformed in art, literature, and films in later cultures. Thus, the course considers in what ways myths are reconceived and altered when they appear in later cultures and in different media within the arts. The course is not a survey of world mythologies, but an interdisciplinary examination of myths and mythic themes and images in the arts (such as painting and film) and literature, with an emphasis on the interpretations and transformative processes applicable to myths as they are (sometimes radically) altered and embodied in art forms that may be far removed in time, place, and meaning from the original contexts of the myths themselves. The course is intended to familiarize students with the ways that different cultures have interpreted the world in which they live-how cultures created their own explanations for phenomena they could not understand, and how contemporary culture gives new life to older myths. The course examines such questions as the meanings of myths as represented in the arts, the various purposes of myths in the arts, such as the functions of creation myths and myths of the hero; theories of how myths originate; and ways that myths have been analyzed, interpreted, and adapted in other cultures through the arts. Students learn to compare and contrast myths in the arts, discuss common elements in myths in the arts, and to interpret the meaning of the myths both within the cultural and historical context in which they were created and the ways they are reinterpreted in later cultures in the arts.", "other": ["International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HUM", "number": "197C", "credits": "3 Credits", "description": "Formal courses given on a topical or special interest subject offered infrequently;  several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GA/GS GenEd course.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain"]}, {"department": "HUM", "number": "200N", "credits": "3 Credits", "description": "The theme of this course, Explorations in the Humanities: The Quest, is a highly flexible one used to investigate a variety of historically significant works in the arts and humanities from different perspectives-moral, social, historical, literary, artistic, and philosophical. The quest is conceived as a theme involving active human inquiry and historical breakthroughs that enlarged understanding of the world in new ways. The major fields within the arts and humanities that are covered in the course include art and art history, history, literature, philosophy, mythology, and the performing arts (theater, film, music). The selected works within the disciplines exemplify the broad theme of the course. This thematic course emphasizes the development of students' interpretative and close reading skills as applied to historically significant works in the fields of the arts and humanities. The course promotes the improvement of students' writing and critical thinking. It is designed so that students investigate, analyze, and interpret topics within the arts and humanities as they develop principles of critical practice and interpretation. The course promotes critical conversation among students, for example, by providing lectures that introduce and frame topics for discussion (this pedagogical practice is suggested as one possible approach, not as a requirement). The course also stresses the improvement of students' writing and critical thinking skills through such means as essay exams, group work, oral reports, and/or term papers, as deemed appropriate by the instructor. The course also emphasizes interdisciplinary connections between these arts and humanities fields, through broadly synthetic interpretations of important works within their cultural settings. Each iteration of the course is designed by the instructor teaching it, within the framework set out here. The specific works from the arts and humanities covered in the course are selected by the instructor, and represent major works within the disciplines specified above, and as reflected in the theme of The Quest.", "prerequisite": "HUM 100N", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HUM", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "HUM", "number": "300N", "credits": "3 Credits", "description": "Two to four (usually three) different interpretive approaches to understanding creative and/or scholarly works in the arts and humanities, as exemplified by the study of specific works organized by theme, topic, or time period(s). The interpretive approaches chosen will be applied to a variety of arts and humanities content drawn from the arts, including the visual arts and art history, the performing arts, including theater, film, and music, and the humanities, including literature, history, and philosophy. The core course will develop students' abilities to employ advanced interpretive strategies appropriate to upper-division study in a range of fields of study within the School of Humanities. Students will learn to interpret and analyze primary texts or creative works using several different methods, will exchange views with one another, and will develop skills in writing and expression through a variety of assignments. The course is designed to be taken at the junior level, because it presupposes a preliminary knowledge of the disciplines, before an interdisciplinary study can be undertaken. It is a writing-intensive course that requires substantial writing and revision. This course is designed to familiarize students with several different approaches to understanding creative and scholarly works in a range of humanities areas; to expose them to the viewpoints of others and encourage dialogue among students; to reinforce the interdisciplinary connections among arts and humanities fields; and to improve students' abilities to formulate, express, and defend their own interpretations using the approaches studied. Individual instructors select the particular interpretive methods to be studied, along with appropriate primary works or texts and examples of the scholarly or critical methods chosen. Instructors will typically organize their sections around specific themes, periods, or topics, which will vary from time to time. Ideally, students should take the course in the junior year.", "prerequisite": "ENGL 015, ENGL 202", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "Writing Across the Curriculum"]}, {"department": "HUM", "number": "311N", "credits": "3 Credits", "description": "The course focuses on the Ancient Greek and Roman worlds. This course is appropriate for introducing students to a broad spectrum of materials, methods, and perspectives across the humanities. The course addresses ancient Greek and Roman culture with attention to architecture, art, drama, literature, philosophy, science, history, and other humanities fields. Students are introduced to methods for linking the original works they study (by theme, historical context, and in other ways) and to both discipline-based and interdisciplinary modes of understanding them. The course requires students to engage in significant critical reading of a variety of texts; to discuss and present their understanding in class; to acquire information through a variety of means, from printed sources to Web materials; to analyze the materials and write about them analytically in a mix of formal and informal ways; and to make and defend critical judgments. The course addresses cultures very different from our own in many ways. The prevalent institutions and practices of ancient Greece and Rome, for instance, included slavery; a subordinate status for almost all women; very different attitudes toward sexuality; and a view of other cultures as inferior. These institutions and beliefs coexisted with extraordinary achievements in the arts, thought, social institutions, and other areas. Students acquire familiarity with social practices and attitudes very different from their own environment. Students must integrate knowledge acquired from works of art, literature, philosophy, and other areas; from scholarly writing on those subjects; from Web sources; and from their peers and the instructor. Students are encouraged to undertake more specialized study to pursue particular humanities interests.", "other": ["International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HUM", "number": "400N", "credits": "3 Credits", "description": "Advanced interdisciplinary study of a particular theme, period, or topic including materials from various arts and humanities disciplines and interdisciplinary works. Students will identify and apply several approaches to interpretation of such works-theoretical perspectives, integrating questions, comparative criticism-and express their understanding in class discussion, formal and informal writing, and creative expression. The course investigates the humanities from different perspectives-moral, social, historical, literary, artistic, and philosophical. The major fields within the arts and humanities that are covered in the course include, from the arts, the visual arts (painting, sculpture, architecture) and the performing arts (theater, film, music), and from the humanities, art history, history, literature, philosophy, and mythology. The selected works within the disciplines exemplify the broad theme of the course. This thematic course emphasizes the development of students' interpretative and close reading skills as applied to historically significant works in the fields of the arts and humanities. The course promotes the improvement of students' writing and critical thinking. It is designed so that students investigate, analyze, and interpret topics within the arts and humanities as they develop principles of critical practice and interpretation. The course promotes critical conversation among students, through the framing of topics for discussion. The course also emphasizes interdisciplinary connections between these arts and humanities fields, through broadly synthetic interpretations of important works within their cultural settings. Each iteration of the course is designed by the instructor teaching it, within the framework set out here. The specific works from the humanities covered in the course are selected by the instructor, and represent major works within the disciplines specified above.", "prerequisite": "HUM  300W , seventh-semester standing", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "HUM", "number": "410", "credits": "3 Credits", "description": "A comparative examination of several world religions in their social and cultural contexts.", "other": ["International Cultures (IL)"]}, {"department": "HUM", "number": "430", "credits": "3 Credits", "description": "The study of philosophical viewpoints in literature.", "prerequisite": "fifth-semester standing"}, {"department": "HUM", "number": "453", "credits": "3 Credits", "description": "Study of art, literature, film, and other creative genres to illustrate the interrelationships between creative expression and cultural practices."}, {"department": "HUM", "number": "460", "credits": "3 Credits/Maximum of 9", "description": "Analysis of a group of related ideas in art, music, literature, and/or philosophy. (May be repeated for credit.)"}, {"department": "HUM", "number": "461", "credits": "3 Credits", "description": "Interdisciplinary studies dealing with selected periods of world culture. (May be repeated for credit.)  I HUM 461 Selected Periods in Humanities (3) (IL) Study of interdisciplinary aspects of a particular chronological period, including works from several disciplines or genres within the humanities. The period chosen may be from any time and any culture (or more than one culture during the same period).", "other": ["International Cultures (IL)"]}, {"department": "HUM", "number": "491", "credits": "3 Credits/Maximum of 9", "description": "Interdisciplinary studies dealing with selected periods of world culture. (May be repeated for credit.)"}, {"department": "HUM", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "HUM", "number": "495", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised internship for undergraduate or graduate Humanities majors in state offices, educational institutions, arts agencies, community organizations, or humanities councils."}, {"department": "HUM", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "HUM", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "HUM", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]