[{"department": "IET", "number": "101", "credits": "3 Credits", "description": "Mechanical properties of materials; primary processing methods used in manufacturing; ferrous and nonferrous metals; important plastic plus ceramic materials; dimensional verification and measurements; mechanical properties evaluation; laboratory methods; statistical interpretation of data."}, {"department": "IET", "number": "215", "credits": "2 Credits", "description": "The study of manufacturing processes for the purpose of part creation and/or part feature creation using both current and advanced technologies.", "prerequisite": "IET 101"}, {"department": "IET", "number": "216", "credits": "2 Credits", "description": "Laboratory methods in production design including conventional and advanced manufacturing processes, computer applications, and automation/robotics."}, {"department": "IET", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "IET", "number": "308", "credits": "3 Credits", "description": "Fundamentals of probability and statistics, introduction to quality control fundamentals, control charts, acceptance sampling."}, {"department": "IET", "number": "311", "credits": "3 Credits", "description": "Introduction to metallurgical concepts, metallurgical testing, phase diagram studies, heat treating concepts, ferrous and nonferrous systems.", "prerequisite": "ET 322"}, {"department": "IET", "number": "321", "credits": "3 Credits", "description": "Manufacturing processes for producing metal, plastic, and ceramic items. Primary emphasis is placed on machine tool processes."}, {"department": "IET", "number": "333", "credits": "2 Credits", "description": "Fundamentals of engineering economics; equivalence and rate of return analysis; replacement models; depreciation and tax considerations; and economic decision making for technologists.", "prerequisite": "MATH 22"}]