[{"department": "INART", "number": "1", "credits": "3 Credits", "description": "The Arts is a course designed to give students an integrative experience of the themes and purposes common among the arts, visual, performing, and literary. Students are given the opportunity to view and discuss many forms of art, learning a specific vocabulary for discussing each artistic form and arriving at an answer to the question \"what is art?\" The goal of the course is to enhance aesthetic perception by examining works of art, by discerning what can be seen and heard in them, by understanding what those elements are called, and by determining how the artwork creates a response in the viewer or listener.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "INART", "number": "3", "credits": "3 Credits", "description": "This course considers how art uses time, space, and causality to define culture and the human condition.  INART 003 Reception of the Arts (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. INART 003 approaches the study of the arts from the audience's point of view. It is designed to meet the General Education Arts requirement. The course is offered in the Fall and Spring University Park, with a typical enrollment of 50, and is available to other locations through Campus Course Exchange. There are no prerequisites, and students are assumed to have little or no background in art. As a result of taking the course, students are able to use analogy, the idea of structure, and theories of reception and communication in both art and non-art situations. The course is offered on-line, making it particularly useful for students with family and personal obligations, for older students with job obligations, and for students with handicaps limiting their access to traditional 'classroom' courses. Although INART 003 is designed for potentially large enrollments, students relate to the instructor on a one-to-one basis through e-mail and interact with other students using an on-line bulletin board. Writing, criticism, and analytical thinking are required. Evaluation is based on five on-line quizzes, two on-line exams, and participation in on-line discussions. Tests measure students' ability to reason, synthesize materials, and apply ideas about art to other situations. The discussion sessions expand ideas found in art to apply them to everyday life. Writing is required for the course. Students must contribute at least three short essays and post commentary on others' work for 20 points of the final grade. Informal e-mail conversations supplement this requirement. The course's extensive web site includes lessons corresponding to each chapter in the text, a lexicon of difficult terms, links to other web sites, study guides, works of art, and provocative essays about art.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "INART", "number": "5", "credits": "3 Credits", "description": "INART 5 is not an \"art appreciation\" course in any traditional sense of the term. Rather, it is focused on the act of experience and the encouragement of critical thinking about those experiences. No effort is made to encourage students to \"like\" or \"dislike\" the things that they experience or to encourage them to accept the view that some experiences are more or less valuable than others. The idea, simply, is to have informed experiences in the performing arts and think about them in a critical context. To satisfy those ends, the course will provide students with exposure to significant examples of dance, music, and theatre as well as give students a practical and theoretical background to enrich their experience of those performing arts. The course will also help to develop students' critical thinking as they evaluate their experiences. This is accomplished through student attendance at six performing arts events on campus throughout the semester and the completion of related assignments.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "INART", "number": "10", "credits": "3 Credits", "description": "An introduction to the arts of the mass media with emphasis on how film, radio, television, and the print media influence and reflect society. INART 010 The Popular Arts in America: Mass Media Arts (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. INART 10 examines the historical and technological development of media in relationship to popular culture from the invention of the printing press up to present 21st century America. The primary goal of the course is to help students develop a critical and analytical approach to dealing with contemporary mass media. The course presupposes some familiarity with modern popular media and takes as its content both historical and contemporary examples as sources for analysis. While the class offers facts and data, the central focus of the course is the theory, stylistic elements, and structural workings of media content. The pedagogical goal of this approach is to examine not just what the mass media arts are but also where they come from, how they function, and what effects they have on our culture and society. The key to this goal is understanding the naturalized ideologies imbedded in the structural form of popular culture: how the early expressions of popular culture both shaped cultural attitudes and reflected societal notions of race, gender, and socioeconomic norms. Class meetings consist of lectures and in-class discussions that illustrate modern critical approaches to popular culture and the terminology used in presenting critical arguments and ideological viewpoints on these art forms. Reading assignments will support classroom work by presenting students with a diversity of opinion on popular culture and significant examples of that culture in media. Further, examples of historically significant popular mass media arts will be shown in class or online and then discussed in relation to the concepts and critical viewpoints covered in lectures.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "15", "credits": "3 Credits", "description": "The development of the performing arts of American popular culture; emphasis on popular music, dance, theatre, and variety arts.  INART 015 The Popular Arts in America: Performing Arts (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. INART 015 examines the Popular performing arts and their place in American popular culture. broken into four units: popular music, popular stage dance, popular theatre, and acts like the circus and stand up comedy. The course will highlight important influences, artists, events, works, and effects such as:1) Popular Music: This unit will trace the development of the American popular music from the emergence of the popular songwriter in the 1830s to the beginnings of rock and roll. Jazz, country, blues, and mainstream pop will be major genres examined. 2) Popular Stage Dance: This unit will cover the evolution of dance as a popular performance art from percussive dances performed in the minstrel show to rock and roll choreography in music videos. 3) Popular Theatre: This unit examines the founding forms of popular theatre (minstrelsy, vaudeville, and burlesque) and their effect on later arts like motion pictures and television. 4) Popular Variety Arts: This unit deals with those performing arts that fall outside of the broader categories of dance, music, and theatre.The circus, stand up comedy, and stage magic will be highlighted. There will be three equally weighted objective tests in the course, each covering approximately one-third of the course's content. These examinations account for 75% of the semester grade (25% each). Students in INART 01 5 also participate in the Popular Arts Forum, a semester-long examination of an important contemporary issue in popular culture (cultural imperialism and censorship; sexuality in popular culture; gender, ethnicity, and race in the popular arts; etc.) that requires research, critical thinking, the formation of objective opinions, and discussion. The Popular Arts Forum is conducted online utilizing resources held on the Forum website and World Wide Web. Asynchronous online discussions on the topic will occur three times during the semester. The class will be broken into groups of fifteen students for the purpose of discussion. Participation in the Popular Music Forum will account for 25% of the semester grade. The discussion grade will be determined by the quality of participation and degree of involvement in the discussion.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "INART", "number": "50", "credits": "3 Credits", "description": "Waves, physics of sound, hearing, musical scales, musical instruments, and room acoustics. INART 050 The Science of Music (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. This course explores the physical and acoustical bases of sound and music.The physics include a study of vibrating systems and simple harmonic motion, wave propagation, reflection and refraction, superposition, resonant frequencies, harmonics, phase, the relationship of speed and velocity, and spectra. The acoustics portion applies these physical properties to hearing, sound and music, covering the nature of the human auditory system, and correlations of pitch to frequency, loudness to amplitude/power/intensity, timbre to spectra and envelope. An overview of perceptual psychological studies of Gestalt organizational principles and auditory streaming explores how the auditory system organizes sound on a primitive, unlearned level. NOTE: there need be no specific math prerequisite for the course. Though high school algebra and trigonometry will be recommended, these topics will be integrated with the rest of the course material.With physical and physiological groundwork laid, the subject matter movea to purely musical areas: the construction of musical scales, the nature of consonance, dissonance, and harmony. Twelve-tone equal temperament, the basis of Western common practice music, is not an absolute, but a decision made to facilitate certain musical choices, and a compromise in terms of optimal consonance. The nature of the different instruments is then discussed - strings, winds, brass, percussion, and voice. Different instruments naturally produce different scale types and different types of spectra. Students will learn to appreciate the inherent differences in different instrument types.The course then returns to acoustics, exploring the role that performance spaces play in the propagation and reception of sound. The shape and materials of a room determine its characteristic sound. Students learn about how sound in large auditoriums is characterized by the balance of direct and reflected sound, the distinction between specular and diffuse reflections, the absorptive properties of different building materials, and the nature of reverberation. Smaller performance spaces are subject to standing waves, flutter echo, and comb filtering. Taking steps to avoid undesirable characteristics is often an easy matter once the nature of these characteristics is understood. The final weeks cover audio technology and the distinctions between analog and digital formats.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "50Z", "credits": "3 Credits", "description": "Waves, physics of sound, hearing, musical scales, musical instruments, and room acoustics. INART 50Z The Science of Music (3) (GN)(BA) meets the Bachelor of Arts degree requirements and includes curricular links to MUSIC 11Z UNDER THE HOOD: HOW CLASSICAL MUSIC WORKS. This course explores the physical and acoustical bases of sound and music.The physics include a study of vibrating systems and simple harmonic motion, wave propagation, reflection and refraction, superposition, resonant frequencies, harmonics, phase, the relationship of speed and velocity, and spectra. The acoustics portion applies these physical properties to hearing, sound and music, covering the nature of the human auditory system, and correlations of pitch to frequency, loudness to amplitude/power/intensity, timbre to spectra and envelope. An overview of perceptual psychological studies of Gestalt organizational principles and auditory streaming explores how the auditory system organizes sound on a primitive, unlearned level. NOTE: there need be no specific math prerequisite for the course. Though high school algebra and trigonometry will be recommended, these topics will be integrated with the rest of the course material. With physical and physiological groundwork laid, the subject matter moves to purely musical areas: the construction of musical scales, the nature of consonance, dissonance, and harmony. Twelve-tone equal temperament, the basis of Western common practice music, is not an absolute, but a decision made to facilitate certain musical choices, and a compromise in terms of optimal consonance. The nature of the different instruments is then discussed - strings, winds, brass, percussion, and voice. Different instruments naturally produce different scale types and different types of spectra. Students will learn to appreciate the inherent differences in different instrument types.The course then returns to acoustics, exploring the role that performance spaces play in the propagation and reception of sound. The shape and materials of a room determine its characteristic sound. Students learn about how sound in large auditoriums is characterized by the balance of direct and reflected sound, the distinction between specular and diffuse reflections, the absorptive properties of different building materials, and the nature of reverberation. Smaller performance spaces are subject to standing waves, flutter echo, and comb filtering. Taking steps to avoid undesirable characteristics is often an easy matter once the nature of these characteristics is understood. The final weeks cover audio technology and the distinctions between analog and digital formats. The course ends with a unit on auditory display and sonification, wherein scientific data may be presented through musical sound. INART 50Z and MUSIC 11Z are linked courses", "prerequisite": "ENGL 015 or ENGL 030", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "General Education - Integrative: Linked", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "55N", "credits": "3 Credits", "description": "This course investigates how technology and music developed in parallel from the start of the twentieth century to the present. It explores the international cultural movements, technological developments, and music trends and genres of the era. Students will learn to recognize the primary innovators in the field of electronic music, not only by name, date, nationality and affiliations, but also by the sound of their music.", "other": ["Bachelor of Arts: Arts", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "100", "credits": "3 Credits", "description": "A study of various arts with emphasis on comparison, contrast, and other aspects of interrelation. Topics will change each semester. INART 100 Seminar in Integrative Arts (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. INART 100 is a semester-long seminar that explores a theme or topic through selected works of the visual or performing arts. Various arts will be examined with emphasis on comparison, contrast, and other aspects of interrelation. Although topics will change each semester, they will always be bound to broad concerns in the arts that are shared or common. The approach will be strictly interdisciplinary with emphasis, on discussion and the direct experience of art. INART 100 is a General Education Arts offering (GA) and, for selected topics, will satisfy the Intercultural and International Competence Requirement (GI). This is an experiment in experiential learning, combined with a traditional examination of modern cinema from Latin America. As regards the latter point, students will become familiar with the history and scope of Latin American cinema in the past 30 years, considering the historical and social contexts in which movies were made and which the movies address. The films chosen for this course are \"road movies\" about journeys of discovery. We'll watch six movies, read about them, and discuss them in light of these historical and social contexts. In addition, we will discuss the films from technical angles - the use of music, narration, camera angles, dialogue, settings, etc. This technical component feeds into the first point of the first sentence above. As part of the course requirements, students will make their own \"on the road\" film.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "100W", "credits": "3 Credits", "description": "A study of various arts with emphasis on comparison, contrast, and other aspects of interrelation.  Topics will change each semester.  INART 100W Seminar in Integrative Arts (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. INART 100W is a semester-long seminar that explores a theme or topic through selected works of the visual or performing arts. Various arts will be examined with emphasis on comparison, contrast, and other aspects of interrelation. Although topics will change each semester, they will always be bound to broad concerns in the arts that are shared or common. The approach will be strictly interdisciplinary with emphasis on writing, discussion, and the direct experience of art. INART 100w is a General Education Arts offering (GA), a writing intensive course (W), and, for selected topics, will satisfy the Intercultural and International Competence Requirement (GI). At University Park, the course is built around twelve to thirteen motion pictures shown as part of the Palmer Museum of Art's film series, a gallery exhibition at the Palmer, and two or three performances at the Center for the Performing Arts. Students are required to attend all of these events and showings. The film series and the gallery exhibition are free. Tickets for the two events at the Center for the Performing Arts must be purchased. Attendance will constitute 20% of the semester grade. Each week, there will be a required online discussion based on the &quot;Commentaries&quot; associated with the event or exhibition of that week. These &quot;Commentaries&quot; are included with the background information on the events and exhibitions contained in the course web site. Discussions will last for one week and all students are required to participate in all online discussions. Participation in discussions will constitute 30% of the semester grade. INART 100W is a &quot;writing intensive&quot; course and, as a consequence, a major portion of the course is devoted to the acquisition of skills and practice in writing. There are three required papers in the course: one 600 word critical review, one 900-word critical opinion paper, and a final 1500-word critical opinion paper, Grading will be based on the quality of students' critical arguments and the quality of their writing. These three papers will constitute 50% of the semester grade.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "Writing Across the Curriculum"]}, {"department": "INART", "number": "110", "credits": "3 Credits", "description": "The place of television-radio-film drama in our culture; relationship with other art forms; standards of evaluation.  INART 110 Dramatic Arts in the Mass Media (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. INART 110 examines the history and development of the dramatic arts of the mass media with a particular focus on television as the strongest exemplar of media practice. The primary goal of the course is to help students develop a critical and analytical approach to dealing with the dramatic arts of the contemporary mass media. The course presupposes some familiarity with modern popular media and takes as its content both historical and contemporary examples as sources for analysis. While the class offers facts and data, the central focus of the course in the theory, stylistic elements, and structural workings of media content. The pedagogical goal of this approach is to examine not just what the mass media arts are but also where they come from, how they function, and what effects they have on our culture and society. The key to this goal is understanding the effects and influence of dramas in the mass media on our society and its beliefs and values. Class meetings consist of lectures and in-class discussions that illustrate modern critical approaches to popular culture and the terminology used in presenting critical arguments and ideological viewpoints on the dramatic arts of the mass media. Reading assignments will support classroom work by presenting students with a diversity of opinion on mass media and the influence of television dramas and comedies. Further, examples of historically significant radio and television dramatic works will be shown in class and then discussed in relation to the concepts and critical viewpoints covered in lectures. In addition to regular scheduled classes, students will participate in an on-line Television Journal that requires watching and critically responding to assigned television programs. Each week, students will be required to watch and critically respond to assigned television programs. Their critical responses will be posted on the online Television Journal and made available to all members of the class. Grades will be based on three equally weighted objective examinations that will account for 50% of the semester grade. A written paper will account for 25% of the final grade, and the remaining 25% of the grade will be determined by participation in the online Television Journal.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "INART", "number": "115", "credits": "3 Credits", "description": "An examination of the roots, development, and significance of popular music in our culture.  INART 115 The Popular Arts in America: Popular Music (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. INART 115 examines the roots, development, and significance of popular music in our culture. It covers the origin of popular music in the early nineteenth century and introduces the major genres of the art: blues, jazz, country, mainstream pop, and rock and roll. The thrust of the course is sociological and cultural rather than musicological and will trace the music's development in a historical context. The intent of the course is to provide students with a comprehensive overview of popular music, the significance of major artists in its development, and its importance in our social and cultural history. There are three equally weighted objective tests in the course, each covering approximately one-third of the course's content. These examinations account for 75% of the semester grade (25% each). Students in INART 115 also participate in the Popular Music Forum, a semester-long examination of an important contemporary issue in popular music (censorship, copyright infringement and music piracy, music and violence, etc.) that requires research, critical thinking, the formation of objective opinions, and discussion. The Popular Music Forum is conducted online utilizing resources held on the Forum website and World Wide Web. Asynchronous online discussions on the topic will occur three times during the semester. The class will be broken into groups of fifteen students for the purpose of discussion. Participation in the Popular Music Forum will account for 25% of the semester grade. The discussion grade will be determined by the quality of participation and degree of involvement in the discussion.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)"]}, {"department": "INART", "number": "116", "credits": "3 Credits", "description": "This course examines the roots, development, and significance of rock and roll music in its first decade.  INART 116 INART 116 The Popular Arts in America: The History of Rock and Roll-The 1950s (GA;US)(BA) This course meets the Bachelor of Arts degree requirements. This course is composed of eight chronologically arranged units of study that examine the major developments in early rock and roll in an historical context.Rock and roll music, especially in the 1950s, was the reflection of the dynamic cross-cultural interplay between country, gospel, rhythm and blues, and mainstream pop. Of central importance in early rock and roll was the influence of African American music and culture and the effect that African American music and culture had when brought into the mainstream. Through an examination of the foundation of emergence of rock and roll in our culture, students gain an understanding of the role played by intercultural cross-influences in shaping both our music and our cultural sensibilities.Both the content of the course and the assignments in the Popular Music Forum are directed at helping students understand, reflect upon, and critically think about the intercultural nature and effect of our musical heritage.The thrust of the course is sociological and cultural rather than musicological, and the intent of the course is to provide students with a comprehensive overview of the early development of rock and roll and its importance in our social and cultural history.Each unit of study will be accompanied by key examples of recorded music from the period of the late 1940s through the 1950s. The course includes approximately 100 important recordings for required study.Grades in INART 116 will be determined by a series of eight objective tests and four assignments in the Popular Music Forum. The Popular Music Forum will examine important issues in popular music and culture concerning or related to rock and roll in the 1950s that require research, critical thinking, the formation of objective opinions, and discussion. The Popular Music Forum is conducted online as a series of asynchronous discussions on Forum topics. The class will be broken into groups of fifteen students for the purpose of discussion.Grading will be based on a point system. There are 1200 possible points that can be earned during the course - 800 points on exams (2/3 of the final grade) and 400 points on written assignments in the Popular Music Forum (1/3 of the final grade).", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)"]}, {"department": "INART", "number": "125", "credits": "3 Credits", "description": "An examination of the roots, development, and significance of punk rock in our culture.  INART 125 The Popular Arts in America: The History of Rock and Roll - Punk Rock (3) (GA;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. Punk rock was an important and historically significant genre in rock and roll music that initially developed in the United States and Great Britain in the late 1960s and has continued to the present. Through an examination of the now more than thirty-year history of punk rock in our culture and that of Great Britain, students gain an understanding of the role played by punk rock in shaping both our musical and cultural sensibilities and the historical and social movements that influenced and led to the development of punk rock as a musical genre and lifestyle. This course is composed of eight chronologically arranged units of study that examine the major developments in punk rock in an historical context. In addition to weekly text assignments, students are required to complete four assignments in the Popular Music Forum. The Popular Music Forum will examine important issues in popular music and culture concerning or related to the historical development of punk rock in both countries that require research, critical thinking, the formation of objective opinions, and discussion. The Popular Music Forum is conducted online as a series of asynchronous discussions on Forum topics. The class will be broken into groups of fifteen students for the purpose of discussion. Both the content of the course and the assignments in the Popular Music Forum are directed at helping students understand, reflect upon, and critically examine the music created in the genre and the social and cultural forces that influenced and were influenced by punk rock. The thrust of the course is sociological and cultural rather than musicological, and the intent of the course is to provide students with a comprehensive overview of the development of punk rock its importance in our social and cultural history. Each unit of study will be accompanied by key examples of recorded music. The course will include approximately 200 important recordings for required study.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)"]}, {"department": "INART", "number": "126N", "credits": "3 Credits", "description": "Hip-hop is an important and historically significant genre in popular music that initially began in the South Bronx in the early 1970s and has grown to become one of the most influential, controversial, and important genres to emerge in the last quarter of the 20th century. Beyond music, hip-hop has also been defined as a commercial enterprise, a lifestyle, and a sociocultural movement. This course explores the various meanings and manifestations of hip-hop throughout its evolution from the early 1970s to the present day. Students will examine the cultural, economic, social, and political implications of hip-hop nationally and globally. Drawing on frameworks like critical race theory and Black feminist/womanist theory, students will engage enduring debates at the heart of hip-hop-debates about art, race, class, gender, citizenship, power, and the body. Topics to be covered include: four foundational elements of hip-hop (rap, DJ arts, graffiti & visual arts, dance); the cultural, economic, political, and social conditions under which hip-hop emerged and developed; impact of hip-hop on the culture industries and the commercialization of the genre; stylistic principles that constitute the hip-hop aesthetic; racial parameters of hip-hop and notions of authenticity; gender and hip-hop's framing of black femininity and masculinity; and global circulation of hip-hop culture. Throughout the course students will explore the following questions: Under what social, political, and economic conditions did hip-hop emerge? Who were the key producers, fans, and detractors of hip-hop in its earliest years? Whose voices are privileged (and marginalized) within hip-hop studies as an academic project? How has hip-hop been framed within and/or transcended traditional notions of art and beauty? In what ways has hip-hop style been criminalized and degraded as low culture? In what ways has hip-hop style been (mis)appropriated? What is authentic hip-hop and how is it measured? To what extent do hip-hop artists pander to stereotypes? What is the relationship between hip-hop and capitalism? What are the benefits and limitations of the commercialization of hip-hop? How do fans and producers impact the genre in the contemporary digital era? What are the primary impediments to rappers who are neither black, nor male achieving the level of popularity and respect that hip-hop's biggest stars have attained? To what extent does the music industry use talent and marketability as a stand in for racial identity? How has hip-hop been taken up by marginalized groups in countries such as Brazil, Cambodia, and South Africa?", "other": ["Cross-listed with: AFAM 126N", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "INART", "number": "141N", "credits": "1-3 Credits/Maximum of 6", "description": "This course will allow students to study African American literature, culture, history, and arts in connection with an annual public event, the African American Read-In (AARI). The AARI, promoting literacy and appreciation of African American literature, is a national event established in 1990 under the auspices of the National Council of Teachers of English. It has become a regular feature of Black History Month celebrated by community, neighborhood, and church groups as well as schools and institutions of higher education throughout the United States and elsewhere on a given Sunday and Monday in February attracting more than a million participants annually. This course offers students an engaged learning experience in which they will produce original intellectual and artistic content to be presented publicly at an AARI event on campus. Students will study texts from a range of historical periods and/or genres, and thus gain a solid introduction to the African American literary tradition. At the same time, the primary organizing principle of the course will be a particular theme that both allows a broad and coherent overview of a significant cultural or historical topic and engages issues of cultural diversity in the United States. The specific theme, thus, will bring the study of African American literature into a broader interdisciplinary context that intersects with African American culture, history, identity, and the struggle for equality. Students will study texts that relate to this annual theme and participate in a relevant field trip (museum, theater, cultural site, library, etc.) to deepen their understanding of the significance and contexts, social, historical, cultural, artistic of these materials and this theme. They will then develop this knowledge through creative and critical engagements into exhibitions, presentations, or performances to communicate their insights about a particular author, text, or topic in in the African American literary tradition. As shapers of the AARI program on their campus, class members will also have a voice in designing and planning the AARI as well as a stake in its overall success. As this course necessarily spans semesters, students who enroll in the Fall course will be expected to enroll in the Spring course in order to present their projects at the AARI in February. Only students who were enrolled in the Fall course will be permitted to enroll in the Spring, as it is the culmination of the same course.", "other": ["Cross-listed with: AFAM 141N, ENGL 141N", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "INART", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INART", "number": "197Q", "credits": "3 Credits/Maximum of 3", "description": "Formal course given on a topical or special interest subject offered infrequently; several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GA/GN GenEd course.", "other": ["Cross-listed with: SC 197Q", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "Honors"]}, {"department": "INART", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "INART", "number": "200", "credits": "3 Credits", "description": "The significance and influence of Elvis Presley as an artist and cultural force focusing on his recordings and major performances.  INART 200 The Popular Arts in America: Elvis Presley - The King of Rock and Roll (3) (GA)(BA) This course meets the Bachelor of Arts degree requirement. INART 200 is composed of eight chronologically arranged units of study that trace Elvis Presley's life; accomplishments; the significance of his art; his influence as a performer, recording artist, and motion picture star; and , perhaps most important, his place as a force and symbol of social/cultural change in the second half of the 20th century. Elvis was the principal symbol of change in a time when change was all-important. He was the first of the great rock and roll superstars, a herald of the cultural revolution of the 1960s, and the central figure in the musical revolution that brought rock and roll into the popular mainstream. He was - and is - the King of Rock and Roll and his place and importance in the cultural history of the twentieth century can never be overstated or exaggerated.The thrust of the course is sociological and cultural rather than musicological and the intent of the course is to provide students with a comprehensive overview of Elvis as an artist, his significance in the development of rock and roll, and his importance in our social and cultural history.Each unit of study will be accomplished by key examples of recorded music and video records of important performances from television and motion pictures. The course includes approximately 100 important recordings and 15 video performances for required study.Grades in INART 200 will be determined by a series of eight objective tests and four assignments in the Popular Music Forum. The Popular Music Forum will examine important issues in popular music and culture concerning or related to the life of Elvis Presley that require research, critical thinking, the formation of objective opinions, and discussion. The Popular Music Forum is conducted online as a series of asynchronous discussions on Forum topics. The class will be broken into groups of fifteen students for the purpose of discussion.Grading will be based on a point system. There are 1200 possible points that can be earned during the course - 800 points on exams (2/3 of the final grade) and 400 points on written assignments in the Popular Music Forum (1/3 of the final grade).", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "INART", "number": "203Q", "credits": "3 Credits", "description": "In English 190Q / INART 203Q students will gain an understanding of medievalism, defined by Leslie J. Workman in 1987 as \"the study of the Middle Ages, the application of medieval models to contemporary needs, and the inspiration of the Middle Ages in all forms of art and thought.\" As this definition suggests, understanding medievalism and, thus, the popular works students know, such as Game of Thrones and Lord of the Rings' benefit from learning something about the Middle Ages and the reach of its re-mediation across various kinds of expression. Therefore, ENGL 190Q / INART 203Q begins by introducing students to medieval works and a few of the forms that characterize it. More particularly, the medieval works to be studied are those combining more than one genre, media, and/or form. For example, students will read and listen to (or sing!) medieval lyrics, read and perform short medieval plays such as Robin Hood, be introduced to manuscripts of the bestiary with its illuminations, historiated letters, and scribal copying. They also will be introduced to Romanesque and Gothic architecture The first medievalist remediations--works adapted in other media--to be examined will be Book I of Spenser's Faerie Queene, with the woodcut of the Redcrosse Knight and Dryden/Purcell's King Arthur, which will introduce students to Early Modern English medievalism and how it reflects prevailing values in new combinations of old and new artistic forms. Still greater emphasis will be placed on the English Medieval Revival of the nineteenth century, including John Ruskin and the PreRaphaelites poetry, paintings, and essays, as well as William Morris's poetry, painting and Arts and Crafts Movement. Then, as now, medievalism served multiple purposes, including aesthetic, political, and social. To put into practice what students learn and to engage their creativity, one assignment involves hand crafting an art project to be accompanied by an artist statement. In the last part of the course, the focus shifts to contemporary medievalist arts and theory. In keeping with the contemporary direction, another assignment asks students to remediate their handcrafted medievalist work, or to create a new one, using digital resources to engage both their creativity and understanding of key medievalist concepts.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "INART", "number": "205", "credits": "3 Credits", "description": "The influence and achievement of the Beatles as artists focusing on their recordings and films as sociocultural artifacts.  INART 205 Introducing the Beatles (3) (GA)INART 205 is composed of eight unites of study that trace the lives and work of the Beatles. The course's chronological design is arranged in order to capture the band's artistic trajectory from two-track recording and the relatively primitive Please Please Me album through the sonic heights of Revolver, Sgt. Pepper's Lonely Hearts Club Band, The White Album, and Abbey Road. This course examines the group's wide-ranging sociocultural influence in terms of music, fashion, film, gender, consumerism, and politics. The thrust of the course is interpretive in nature, with the Beatles' songs and albums receiving considerable scrutiny in terms of their composition, production, and attendant musicianship. Developments in recordings and instrument technology are germane to our understanding of the Beatles' evolving aesthetic, as is the bandmates' development as songwriters who eventually eschew issues associated with romance in order to address larger and more prescient subjects such as loneliness, oppression, nostalgia, ethics, and redemption in their music. Each unit of study will be accompanied by the analysis of key examples from the Beatles' massive recorded corpus. More than 100 songs will receive consideration, as will the group's five forays as feature-film stars. Grades in INART 205 will be determined by two objective examinations- a midterm and a final. Class participation will be a key ingredient in student performance, as will students' work on two papers. The first of such assignments will involve a shorter paper in which students address a particular aspect of the band's sociocultural emergence during their early years. The longer term paper will be researched, argumentative essay in which students will be assigned to discuss any aspect of the Beatles' career - a particular album (or series of albums), their musical influence, or their cultural impact, among other topics - and construct a mature, expansive thesis about its meaning.", "other": ["General Education: Arts (GA)"]}, {"department": "INART", "number": "205H", "credits": "3 Credits", "description": "The influence and achievement of the Beatles as artists focusing on their recordings and films as sociocultural artifacts.", "other": ["General Education: Arts (GA)", "Honors"]}, {"department": "INART", "number": "210", "credits": "3 Credits", "description": "INART 210 is an interdisciplinary introduction to software-assisted music composition. This course explores the basic concepts and techniques of computeraided music composition, including historical background, fundamental principles of computer programming, practical exercises in programming interactive multimedia art, and conceptualization and design of complete works of interactive music.", "prerequisite": "MUSIC008 or instructor permission", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "220", "credits": "3 Credits", "description": "An American cultural history from mid-19th through mid-20th Century as seen through the prism of stand-up comedy.  INART 220 Stand-Up Comedy: A Cultural History (3) (GA;US)(BA) This course meets the Bachelor of Arts degree requirements. Stand-up comedy, the art of making an audience laugh through primarily the spoken word, is a vital and revealing part of American cultural history. The best American comedians from Mark Twain and his sardonic monologues to Lenny Bruce and Richard Pryor's unexpurgated free form rants not only entertained, but illuminated, challenged, reflected the times, and at their best influenced the culture for the better.This course, through rare uncensored video and audio clips, readings, and lecture, offers an American cultural history through the lens of stand-up comedy covering a span from the mid-19th through the 20th Century. Topics of consideration include the art of the joke and stand-up comedy performance, the evolution of American comedy genres and venues, the significant performers, the impact of technologies such as radio and television, as well as a variety of issues ranging from racism, ethnic, and gender stereotyping to freedom of speech and political and social change.", "prerequisite": "sophomore standing", "other": ["United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "INART", "number": "226N", "credits": "3 Credits", "description": "This course will examine the politics of hip-hop art and culture. To do so, we will place hip-hop in broad historical context and trace its aesthetic and cultural roots from Africa to Jamaica to 1970s New York City and then forward to 1980s gangsta rap and former President Barack Obama's iPod. We will think through the implications of hip-hop's addiction to Italian-American mobsters, bling, and all-things keepin' it real. We will also search for hip-hop's political foundations in funk records, 1960s community organizing, and poetry of the Harlem Renaissance. All the while, we will analyze the varieties of hip-hop politics by paying close attention to how hip-hoppers vie for authenticity, recognition, and power through cultural practices--b-boying/girling, graffiti art, emceeing, djing, e.g.-at odds with the State, inequality, and injustice. We will also situate hip-hop politics within the ongoing history of American social movements. To avoid over-romanticizing, we will equally examine hip-hop's appetite for conspicuous consumption, misogyny, homophobia, trappin', and criminality. A deep understanding of hip-hop politics, then, requires examining its contradictions as well as the ways race, class, gender, sexuality, and geography shape hip-hop--and therefore American-culture, art, and identity. To get at these and other ideas, we will read, listen, and think broadly about why a full understanding of hip-hop truly matters.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "INART", "number": "236", "credits": "3 Credits", "description": "An introduction to the theory, design and creation of musical animations. For general students.", "other": ["General Education: Arts (GA)"]}, {"department": "INART", "number": "258A", "credits": "3 Credits", "description": "A thorough introduction to digital music production technologies, covering fundamentals of how digital musical information is stored, processed and transmitted. INART 258A Fundamentals of Digital Audio (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. A thorough introduction to digital music production technologies, covering the fundamentals of how musical information is stored and transmitted in digital devices.This course is meant for people who are passionate about working with sound, and who are willing to take on new technical and creative challenges in audio production. It is the pre-requisite for many more advanced courses in music technology and audio production. Students complete a series of low-stakes audio exercises on fundamental operations, a series of written responses to questions on the underlying theory of digital audio, and a small number of extended creative projects.The software used is at the level of professional audio production workstations. Students complete the course with a set of vocational skills in computer music and audio.", "prerequisite": "MUSIC008 or concurrent enrollment in either MUSIC131 or MUSIC132", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "258B", "credits": "1 Credits", "description": "A general overview of music technologies current to music educators and performers, as defined by their accrediting organization. This course is meant for students who do not intend to pursue further studies in music technology. Students will be exposed to software that is meant for non-specialists, and learn basics of music recording and editing. Students complete a set of lessons, each of which features a hands-on exercise. They gain a set of technical tools that should be of immediate relevance to their careers, including basics of music recording, audio editing, Internet resources, music arranging and score preparation.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "INART", "number": "295", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"department": "INART", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "INART", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INART", "number": "298", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "INART", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "INART", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "INART", "number": "410", "credits": "3 Credits", "description": "The study of Pennsylvania and related furniture, pottery, paintings, and decorative arts of the seventeenth, eighteenth, and early nineteenth centuries.  INART (AM ST) 410 Early Pennsylvania Decorative Arts and Furniture (3)(BA) This course meets the Bachelor of Arts degree requirements. This course explores the aesthetic, cultural, and social significance of the household arts common in Pennsylvania in the seventeenth, eighteenth, and nineteenth centuries. Emphasis is placed on the major periods and styles (Puritan, William and Mary, Queen Anne, Chippendale, and Federal) as represented in furniture, pottery, paintings and decorative arts. Indigenous styles and crafts representative of Pennsylvania arts and crafts will be explored in detail.The course combines lecture and discussion with seven field trips to historic sites to provide students with the opportunity to view furniture and decorative arts within the setting of period homes.The course carries no prerequisite.", "other": ["Bachelor of Arts: Arts"]}, {"department": "INART", "number": "415", "credits": "3 Credits", "description": "Interior and exterior design of early Pennsylvania architecture; understanding and evaluation of and experience in restoration.  INART (AM ST) 415 Nineteenth Century Pennsylvania Architecture and Restoration (3)(BA) This course meets the Bachelor of Arts degree requirements. This course provides students with hands-on practical experience in the restoration of historic buildings of the nineteenth century. Each semester, students will research, evaluate, identify problems, and develop solutions to restore these structures in an historically correct manner. Students will then practically restore these structures and gain practical experience in the process of restoration.Major classroom topics will vary in order to meet the specific needs of the project at hand. Topics may include wood technology, structural problems and solutions, vernacular architecture, use of early tools, etc. Students will also take field trips to several restored homes to gain insight into applicable methods and approaches to restoration and gain perspective on costs and outcomes.INART 410 Early Pennsylvania Decorative Arts and Furniture is the prerequisite for this course.", "prerequisite": "INART410", "other": ["Bachelor of Arts: Arts"]}, {"department": "INART", "number": "420W", "credits": "3 Credits", "description": "INART 420W: Portfolio Matters is the writing-intensive capstone course for the Integrative Arts degree. The course is based on the application of integrated learning to complex life and career questions through assignments that include self-reflection exercises, independent research, collaborative teamwork, participation in seminar-based discussions, peer critiques, resume writing, portfolio planning, and individual presentations that may include visual and written elements. The course prepares Integrative Arts majors to be able to evaluate and curate their creative, academic, and work experiences for the development of a strategic plan for a professional portfolio and resume. The course design provides students with the opportunity to use thought and creativity to develop a plan for a portfolio and resume that reflects their creative and intellectual accomplishments and the range of their capabilities. The skills, reflections, shared engagement, and written documentation of the work produced as part of the course will enhance students' preparation for post-graduate study and career activities. Through this course, students will gain experience in the definition, articulation, and design of life and career goals and how to incorporate them into focused actions. This course provides the opportunity for individual student and program assessment. Although designed specifically for Integrative Arts majors, the course may function as an elective course for students who are intent on pursuing professional goals that involve a synthesis of learning across creative disciplines. Students who enroll in the course should be sixth-semester standing or higher and have completed at least six credits or more of 400-level or equivalent courses in ARCH, ART, A ED, ART H, DANCE, GD, INART, LARCH, MUSIC, PHOTO, THEA, COMM or ENGL.", "other": ["Writing Across the Curriculum"]}, {"department": "INART", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "INART", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "INART", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"department": "INART", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an indivdual basis and which fall outside the scope of formal courses."}, {"department": "INART", "number": "496H", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an indivdual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"department": "INART", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INART", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "INART", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]