[{"department": "INTAG", "number": "100N", "credits": "3 Credits", "description": "How does reduced rainfall impact the lives of people growing coffee in Hondur... and immigration in the USA? How does increasing consumption of meat in China influence deforestation of the Amazon Rainforest? How do subsidies for cotton in the USA effect cotton growers in Mali and the price of a t-shirt in Italy? These are a few of the complex issues we will explore this semester. ¿ Agriculture affects all of us. Every time we eat, go to the grocery store, or even buy clothing, we are participating in complex agricultural systems that are increasingly more globally integrated. This course takes an interdisciplinary approach, combining both natural and social science theory and scholarship to investigate topics such as climate change, technological applications to agriculture (e.g. GMOs), soil and water usage, the role of culture and local knowledge, and population growth. Over the course of the semester we will investigate issues receiving widespread attention from policymakers, national governments, academics, farmers, consumers, and many others. This class will place a specific emphasis on agriculture in the global South examining issues related to food security. As we explore the issues related to international agriculture, we will confront implications for national and global security, human rights, sustainability, and other ethical questions.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "INTAG", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "INTAG", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "INTAG", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INTAG", "number": "298", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INTAG", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "INTAG", "number": "300", "credits": "3 Credits", "description": "The primary goal of this course is to inform students about tropical agriculture, including the environments of tropical agroecosystems, the production of crops, livestock and forestry within these systems, and major farming systems of the tropics. This class will focus on agriculture in developing countries in the tropics. Several examples from around the world will be included. By the end of this course students should be able to: 1. Describe the various environments of the tropics and explain the influence of these environments on tropical agroecosystems 2. Identify the major crops and livestock of the tropics and discuss their agroecological requirements and production in tropical environments 3. Identify and describe the major farming systems of the tropics 4. Critically analyze the important issues facing contemporary tropical agriculture", "other": ["International Cultures (IL)"]}, {"department": "INTAG", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INTAG", "number": "398", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INTAG", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "INTAG", "number": "460", "credits": "1 Credits/Maximum of 3", "description": "FDSC 460 / INTAG 460 is designed to give food science undergraduate and graduate students an appreciation of how food is produced and processed abroad. Students participate in a number of production facility tours, interact with local food scientists and food technologists, and gain valuable international experience. A major point of emphasis for the course is comparing and contrasting food production norms in the U.S. and the host country or region. The course consists of pre-trip lectures and meetings and culminates in a faculty-guided embedded study tour. Prior to the travel component of the course, students work in small groups to research a specific food product that is of economic and cultural importance to the country or region of interest, then write reports to be presented in-country before a tour of the related product's production facility. The course integrates and builds upon core concepts in food chemistry and food microbiology; as such, FDSC 460 / INTAG 460 is targeted towards upper-level food science undergraduate students, as well as food science graduate students.", "prerequisite": "FDSC 200", "other": ["International Cultures (IL)"]}, {"department": "INTAG", "number": "470A", "credits": "2.5 Credits", "description": "This course is designed to explore key similarities and differences in the food and agricultural systems of the United States and France. It introduces students to a number of overarching food and agricultural topics that pertain to both countries, and students explore and analyze these key issues from both countries perspective. These overarching topics include the structure of agricultural and environmental policies, the use agricultural land for biofuel production, organic agriculture, food safety, attitudes and policies surrounding the use of genetically modified crops, the role of large agribusiness firms, attitudes towards diet and health, and several others important topics. Students conduct background reading on these topics, hear lectures -- sometimes from guest presenters -- that frame the topics from both the U.S. and France's perspective, and write reports on specific crops or foods that expose key similarities and differences between the two food systems. Finally, students pick one crop or food for an oral presentation that contains background information on how that crop fits into the two food systems, U.S. and France, and analyzes the key issues that relate to the overarching topics already identified. This course has two components that must be taken in partnership: 470A (FOOD SYS US/FRANCE I) and 470B (FOOD SYS US/FRANCE II). The first is a classroom - based course, and meets regularly during the semester. The second is a two - week component that takes place after the end of the semester. In this second component, after traveling to France, students hear presentations from the French perspective on the overarching topics identified earlier and also explore the topics first hand via field trips to farms, wholesale markets, retail markets, and other places relevant to the French food system. This component is organized by a host university, AgroParisTech. For these two weeks, students live in dorms within the city of Paris. Knowledge of French is not required.", "prerequisite": "AGBM 101", "other": ["Cross-listed with: AGBM 470A"]}, {"department": "INTAG", "number": "470B", "credits": "0.5 Credits", "description": "Explore key differences and similarities in the food and agricultural systems of the United Sates and France. INTAG 470B / AGBM 470B Comparing Agricultural and Food Systems in the US and France: Travel (0.5) This course is designed to explore key similarities and differences in the food and agricultural systems of the United States and France. It introduces students to a number of overarching food and agricultural topics that pertain to both countries, and students explore and analyze these key issues from both countries perspective. These overarching topics include the structure of agricultural and environmental policies, the use agricultural land for biofuel production, organic agriculture, food safety, attitudes and policies surrounding the use of genetically modified crops, the role of large agribusiness firms, attitudes towards diet and health, and several others important topics. Students conduct background reading on these topics, hear lectures -- sometimes from guest presenters -- that frame the topics from both the U.S. and France's perspective, and write reports on specific crops or foods that expose key similarities and differences between the two food systems. Finally, students pick one crop or food for an oral presentation that contains background information on how that crop fits into the two food systems, U.S. and France, and analyzes the key issues that relate to the overarching topics already identified. This course has two components that must be taken in partnership: 470A (FOOD SYS US/FRANCE I) and 470B (FOOD SYS US/FRANCE II). The first is a classroom - based course, and meets regularly during the semester. The second is a two - week component that takes place after the end of the semester. In this second component, after traveling to France, students hear presentations from the French perspective on the overarching topics identified earlier and also explore the topics first hand via field trips to farms, wholesale markets, retail markets, and other places relevant to the French food system. This component is organized by a host university, AgroParisTech. For these two weeks, students live in dorms within the city of Paris. Knowledge of French is not required.", "prerequisite": "INTAG470A or AG BM470A", "other": ["Cross-listed with: AGBM 470B"]}, {"department": "INTAG", "number": "490", "credits": "3 Credits", "description": "Seminar discussions on contemporary topics in global agriculture; capstone course for INTAG minor.  INTAG 490 Senior Seminar in International Agriculture (3) This course is designed to meet the need for a capstone course within the International Agriculture (INTAG) minor. The course provides a range of experiential learning techniques including intensive reading and in-class discussion, practical experience through a group trip to the nation's capital, and application of the international experiences encountered through the INTAG program. Included is course content designed to provide a holistic integration of the four main INTAG study areas (Socioeconomic and Communication Systems, Animal and Plant Sciences, Natural Resources and the Environment, and Food, Health, and Nutrition). Students will learn about the current state of international agriculture through recent articles and analyses and respond in-class discussions and through written response papers. The second half of the course involves site visits to major international development organizations in Washington, D.C. (US government, international agricultural research organizations, and various NGOs) and participation in the form of an INTAG senior seminar series open to the public. This seminar series allows students to present and discuss their past (or intended) international agriculture experiences while a student at Penn State, and share with both those in the class and those outside of the class options, opinions about and critical issues in international agriculture. This seminar series will be an important tool in promoting the INTAG minor. The students will then synthesize the knowledge they have obtained both from the course and their international agriculture experiences to complete final reports which outline their understanding of the current state of international agriculture. This course is ultimately designed to facilitate the development of students to be global citizens in the agricultural arena.The course is geared towards students in their junior or senior years. Evaluation consists of class participation (20%), student-led presentation of materials (15%), response papers to readings and D.C. trip (30%); presentation at INTAG seminar series (15%) and the completion of a final paper on their understanding of the current state of international agriculture (20%). The course is offered once every academic year in the Spring semester.The course is a core requirement for the International Agriculture minor. INTAG 100 is a prerequisite.", "prerequisite": "INTAG100"}, {"department": "INTAG", "number": "495", "credits": "1-13 Credits", "description": "Observation of and participation in the operation and management of a University-approved international agricultural firm or international agricultural development agency.", "prerequisite": "Prior approval of proposed internship plan", "other": ["Full-Time Equivalent Course"]}, {"department": "INTAG", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "INTAG", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INTAG", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "INTAG", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]