[{"department": "INTST", "number": "100", "credits": "3 Credits", "description": "An introductory multidisciplinary course designed to familiarize students with critical international issues. INTST 100 Introduction to International Studies (3) (GS;IL)(BA) This course meets the Bachelor of Arts degree requirements. This is an interdisciplinary course designed to provide students with an introduction to a range of global issues. The course will emphasize the themes of international interdependence and globalization and their development over time. A key component of this course is cultural diversity and the connecting international and domestic issues, particularly those of race and culture. In both their written and oral work, students will be required to relate international issues to their own fields of study. The disciplines involved are mainly political science and economics, ecology, history, and cultural studies.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "INTST", "number": "400", "credits": "3 Credits", "description": "An upper-division seminar focusing on one or two critical international issues from an interdisciplinary perspective; individual projects.  INTST 400 Seminar in International Studies (3) (IL) This interdisciplinary course will offer a seminar on some current event, issue, or phenomenon that involves a large number of countries. Topics will vary each year and depend on the faculty member leading the course, but it may include subjects such as the European Union, global economic change, international pop culture, or international response to human rights violations. Both written and oral work will be assigned and graded. Students will discuss material from a variety of academic fields such as political science, economics, sociology, history, anthropology, and cultural studies.", "prerequisite": "INTST100", "other": ["International Cultures (IL)"]}, {"department": "INTST", "number": "493", "credits": "3 Credits", "description": "Selected topics in International Studies.", "prerequisite": "prior participation in an Education Abroad program or   international work experience, and enrollment in the   International Studies major"}, {"department": "INTST", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "INTST", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "INTST", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written or oral critique of activity required.", "prerequisite": "Approval by International Studies or Global Studies Advisor"}]