[{"department": "IST", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "IST", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "IST", "number": "110", "credits": "3 Credits", "description": "Information, People and Technology presents the high points of an education in the College of Information Sciences and Technology. It opens an intellectual journey through the ideas and challenges that IT professionals face in the world. It will address major questions such as: How can we use technology to organize and integrate human enterprises? How can technology help people and organizations adapt rapidly and creatively? What can we do about information overload?Three perspectives (or facets) address the core issues: information or the basic science of data encoding, transmission and storage; people or the interactions among technologies, institutions, regulations and users; and technology or the design and operation of basic information technology devices. Students completing the course will be confident users and consumers of information technology. Students will develop research and analytical skills to evaluate specific devices and understand how those devices function in larger socio-technical systems. Students will be able to predict and anticipate the impact of new technologies on human institutions as well as understand the potential impact of institutions on the use and design of information technologies.The course employs an action-oriented approach. Students learn by doing-formulating and solving problems drawn from professional contexts, detecting and recovering from errors related to technology use, and locating, reading and studying materials that support their analysis and problem-solving. Students will accomplish this by participating in team-based learning. The course provides students with the opportunity to use, modify, and evaluate software to search for, frame, and express ideas with fluency. A variety of mechanisms are used to assess student performance. These evaluation methods typically include exams, quizzes, homework assignments, group projects, and peer and self-assessments.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "IST", "number": "111", "credits": "1 Credits", "description": "Introduction to academic requirements, career planning & information literacy for students majoring in College of IST.  IST 111 Seminar in IST (1)IST 111 introduces the student to the academic requirements, career planning and information literacy for the School of Information Sciences and Technology degree programs. Seminar in Information Sciences and Technology is required of all Information Sciences and Technology Associate degree candidates. Upon completion of the course, the student will have an understanding of the programs and requirements of the School of Information Sciences and Technology and the University, and the career options for which they prepare students. The student will also develop and exercise habits and techniques for continuing self-assessment of learning styles, personality traits, vocational interests, and career plans. The student will learn how to maintain involvement in professional conversations and networks, including local, state, national, international organizations, listservs, etc. Students will have a basic knowledge of professional news literature, and the ability to identify and use reference tools and databases, which provide access to professional knowledge and literature. Finally, the student will have a basic understanding of government plans, policies and actions regarding the information professions including: regulatory agencies of the executive branch, legislative activities, and judicial decisions at local state and national levels. Students will be graded on course attendance, participation, examinations and brief exercises."}, {"department": "IST", "number": "111S", "credits": "1 Credits", "description": "Introduction to academic requirements, career planning, and information literacy for students majoring in the College of Information Sciences and Technology.  IST 111S Seminar in IST (1) IST 111S introduces the student to the academic requirements, career planning and information literacy for the School of Information Sciences and Technology degree programs. Seminar in Information Sciences and Technology is required of all Information Sciences and Technology Associate degree candidates.Upon completion of the course, the student will have an understanding of the programs and requirements of the School of Information Sciences and Technology and the University, and the career options for which they prepare students. The student will also develop and exercise habits and techniques for continuing self-assessment of learning styles, personality traits, vocational interests, and career plans. The student will learn how to maintain involvement in professional conversations and networks, including local, state, national, international organizations, listservs, etc. Students will have a basic knowledge of professional news literature, and the ability to identify and use reference tools and databases, which provide access to professional knowledge and literature. Finally, the student will have a basic understanding of government plans, policies and actions regarding the information professions including: regulatory agencies of the executive branch, legislative activities, and judicial decisions at local state and national levels. Students will be graded on course attendance, participation, examinations and brief exercises.Since this is a core requirement, all IST students will be enrolling; it should be offered at least once per year. As enrollment growth warrants, it may require more frequent offering.", "other": ["First-Year Seminar"]}, {"department": "IST", "number": "130", "credits": "3 Credits", "description": "A survey course that explores emerging technologies used to produce and consume popular cultural artifacts. Through individual and team-based learning activities, students will analyze and interact with information and communication technologies across popular culture genres. The course content and the assignments are directed at helping students to both create and critique digital media in ways that demonstrate their understanding of, engagement with, and reflections upon the relationships among people and organizations, emerging technology, and popular culture. Students will also design and produce digital media that demonstrate their ability to integrate and synthesize central concepts and themes from the course. This is an introductory course in IST, and meets the requirements for a General Education course in Arts (GA). This course is delivered with significant student and instructor interaction with computers and digital media.", "other": ["General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "IST", "number": "140", "credits": "3 Credits", "description": "A first course in concepts and skills for application development. Math 22 is recommended as preparation for IST 140. This is a first course in application development. Applications are computer programs developed to support human activity in enterprise and other social contexts. Examples of applications might include programs to help run a business, manage personal information, or provide entertainment. The emphasis of this course is on learning to translate practical problems through domain analysis into software applications usable in a human or organizational context. It will focus on the knowledge needed to create applications that use high level programming languages, combining original code with existing code libraries and application programming interfaces (APIs). Students in this course will learn application development concepts including problem solving using computer programming; how to recognize the need for different types of data and how to use data of different types to represent an application's information; application testing and debugging; basic computer organization; and the basics of operating systems. This is a hands-on, practical course designed for students without prior computer programming experience who will use computer languages and tools to develop applications in their later courses and future careers.", "prerequisite": "C or better in Math 21 or placement above the level of Math 21 in the mathematics placement test. Recommended Preparation: Math 22"}, {"department": "IST", "number": "140H", "credits": "3 Credits", "description": "A first course in concepts and skills for application development.  IST 140 Introduction to Application Development (3) This is a first course in application development. Applications are computer programs developed to support human activity in enterprise and other social contexts. Examples of applications might include programs to help run a business, manage personal information, or provide entertainment. The emphasis of this course is on learning to translate practical problems through domain analysis into software applications usable in a human or organizational context. It will focus on the knowledge needed to create applications that use high level programming languages, combining original code with existing code libraries and application programming interfaces (APIs). Students in this course will learn application development concepts including problem solving using computer programming; how to recognize the need for different types of data and how to use data of different types to represent an application's information; application testing and debugging; basic computer organization; and the basics of operating systems. This is a hands-on, practical course designed for students without prior computer programming experience who will use computer languages and tools to develop applications in their later courses and future careers.", "other": ["Honors"]}, {"department": "IST", "number": "144N", "credits": "3 Credits", "description": "The Invasion of Technology from a 21st Century Perspective introduces students to the world of technology from a humanistic point of view. Students will embark on a journey starting in the early 20th century to explore technology and relationships between technology and society and what the varying theoretical and historical underpinning about \"human progress\" in respect to these relationships. They will then sojourn through the years to learn about the advances of technology for better or worse. Students will develop an understanding of how individuals and social groups shape and are shaped by technological change and how human societies create means for both social control and freedom, with a focus on ethics and morality as related to the use of technology and its resulting consequences. Students will also be introduced to the latest technology and current collaboration with other professionals. They will gain a better understanding of the historical perspective and the societal, political, cultural and economic issues relative to technology. This course is a multidimensional, interactive course, which allows students to explore the nuances of modern technology as it pertains to security, medicine, education, employment, treatment, military defense and social media. Students will create/invent a design proposal for a scalable and usable application that focuses on topics related to the humanities and social sciences, which may ultimately find its way into the marketplace. Students will also conduct an interview with a grandparent or equivalent to gain a better understanding of people's impact on technology and visa-versa.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "IST", "number": "170N", "credits": "3 Credits", "description": "\"What is Information?\" considers the material and social nature of information in historical and contemporary contexts. How has information been managed and valued? How have information infrastructures served as sites of social and political connection or antagonism? How have ideas about information changed over time and how have they remained the same? The course integrates perspectives from the social sciences and the humanities, and prepares students to think about (and act in) a world in which information (and its linked concepts, like data) play an increasingly important social and political role. The course addresses the history of information as both a concept and as a matter of social practice, and then focuses on three major topics: how information is presented, how information is organized, and how information is put to social and political use. Moving from the earliest periods of human history and their \"information ages\" (including the birth of writing and the dawn of printing and mass literacy), the course leads students into our contemporary \"information society,\" and the ways in which both the use and manipulation of information shape our lives.", "other": ["Cross-listed with: CAS 170N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "IST", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "IST", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "IST", "number": "210", "credits": "3 Credits", "description": "Introduction to concept of databases including the storage, manipulation, evaluation, and display of data and related issues. IST 110 is recommended as preparation for IST 210. IST 210 Organization of Data (3) As the database management software becomes one of the critical components in modern IT applications and systems, a solid understanding of the fundamental knowledge on the design and management of \"data\" is required for virtually any IT professionals. In a business setting, such IT professionals should be able to talk to the clients to derive right requirements for database applications, ask the right questions about the nature of their entities and in-between relationships in their business scenarios, analyze and develop an effective and robust design to address business constraints, and react to the existing database designs as new needs arise. Modern IT professionals should be able to guide a company in the best use of the diverse database-related technologies and applications toward the \"Big Data\" era. As such, IST 210 aims to prepare students for obtaining fundamental understanding on the database concepts and practical skills to analyze and implement a well-defined database design. In particular, IST 210 provides an introduction to physical database design, data modeling, relational model, logical database design, SQL query language, and instructors' choices on database applications and advanced concepts. Students will learn to use a real-world commercial or open-source database management system, too. Upon taking IST 210, students should be able to understand the implications and future directions of databases and database technologies."}, {"department": "IST", "number": "220", "credits": "3 Credits", "description": "Introduction to digital network topologies; transmission media, signal modulation, digital packet switching and routing, systems integration, communications management, and security. IST 110 is recommended as preparation for IST 220. The course includes an introduction to: telecommunications history; telecommunications transmission media (conducted and radiated); transmission characteristics (including an introduction to coding and modulation techniques); error characteristics, detection, and correctional; local and wide area networking applications, hardware, and software; the OSI models; industry standards; topologies; protocols; internetworking devices; communications management; security and recovery; information system applications; and the selection of telecommunications and networking systems. Special attention will be paid to evolving Internet Protocol (IP) technologies, e.g., Internet2. IST 220 is an introduction to digital networking and telecommunications and their applications in information systems. It is a required core course for both the two-year and four-year Information Sciences and Technology degrees, and is a critical part of the curriculum. Its objective is to provide the students with a basic understanding of the working of digital networks and the ability to apply this knowledge to specific applications and situations. Evaluation of knowledge objectives will be by examination; and of application (i.e., selection and management) objectives by grading of group and individual projects and case studies. As a \"core course\", IST 220 will be offered every semester at University Park, in as many sections as necessary to meet current demand. At other locations where the Associate and Baccalaureate degrees are offered, it will be offered 1-2 times annually depending on demand. Ideally, section size should not exceed 45 students per class. While the course is about digital technology and how it works, it is not a \"hands on\" course, or a training course in particular equipment and/or applications. While there will be demonstrations of relevant technologies, the course is not equipment-intensive and will not involve special technology needs beyond the normal access to computing and the Internet. The course is not duplicative of any other course currently offered. Although there is some overlap with CMPET 401-402, CSE 458, and COMP 421, none of these courses cover exactly the same material, and they operate at a different level of depth and detail. M I S 180 also overlaps somewhat, but it appears that no current course provides the same 200-level mixture of local and wide-area networking and business communications topics."}, {"department": "IST", "number": "222H", "credits": "3 Credits", "description": "This course combines theory and practice to help students develop a contextualized understanding of community as a conceptual lens for understanding human history and human experience. This course examines the history of community, and of interactions between community and information technology, emphasizing how possibilities and practices of community have been transformed by information technology through the last half century, and currently. The course includes opportunities for students to engage with, and thereby come to understand and appreciate local community institutions off campus. Thus, in the tradition of the Chicago School of Sociology, the course directly utilizes the local community itself as a living laboratory for the study of community informatics. The objective of the course is to help students think critically about community and technology in society, and more specifically, about the how information technology can be used to shape human participation in and experience of community. The course is an honors course. It is run as a small class. It is taught by a research leader in the field of community informatics. The class environment is dominated by debate and discussion. And the course has challenging assignments, involving direct interaction with local community groups.", "other": ["General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "IST", "number": "225", "credits": "3 Credits", "description": "Preparation for PC hardware support: Students learn data recovery and how to build, configure, upgrade, troubleshoot, diagnose, and repair PC's.  IST 225 PC Hardware Basics (3) IST 225 covers materials needed to prepare students to function as PC support technicians in business and industry. In a hands-on laboratory environment, students learn to build, configure, upgrade, troubleshoot, diagnose, and repair PC hardware. Course modules cover all the basic hardware components of the PC - their functions, interactions, installation, configuration, upgrading, repair, and replacement. Detailed coverage of system BIOS, CMOS setup, and the boot process is also included. Preventive maintenance and data recovery procedures are also studied. IST 225 is one of four courses required for the Networking Option in the Associate degree in Information Sciences and Technology (IST).The IST 225 is designed to help the student to thoroughly understand all the basic hardware and firmware PC components, from PC resources, their function (BIOS and CMOS setup) and interaction, to diagnosing and resolving resource conflicts. The IST student should be able to install, configure, troubleshoot, repair, recover data, correct errors or replace all basic hardware components. The student should also be able to make appropriate hardware recommendations, purchases and upgrade decisions, as well as, determine appropriate preventive maintenance procedures. Finally, the Information Sciences and Technology major will learn how to foster communications, interpersonal, and group interaction skills through appropriate collaborative and active learning projects, laboratory exercises, and related experiences.Achievement of knowledge objectives will be evaluated by examinations. Ability to perform hands-on support activities will be evaluated by grading appropriate group and individual hands-on laboratory projects, scenarios, and case studies.The majority of campuses offering the Associate degree in Information Sciences and Technology will have 20-30 students enrolled in the course. The course will be offered one semester each academic year.", "prerequisite": "IST 220"}, {"department": "IST", "number": "226", "credits": "3 Credits", "description": "Concepts for peer-to-peer and server-based network:International Organization for Standardization-Open Systems Interconnection (ISO-OSI) reference model, industry standards, troubleshooting, performance monitoring, and optimization.  IST 226 Networking Essentials (3) IST 226 covers basic networking concepts such as network types, cable types, wireless technologies, and network adapters. It discusses network models, including the ISO-OSI reference model and all industry standard network architectures. Both peer-to-peer and server-based commercial network operating systems are introduced with hands-on laboratory experience provided. Basic network administration issues are introduced. Internetworking/enterprise networking devices and architectures are also covered, as are network troubleshooting, performance monitoring, and optimization. IST 226 is one of four courses required for the Networking Option in the Associate degree of Information Sciences and Technology (IST).Achievement of knowledge objectives will be evaluated by examinations. Ability to perform hands-on network administration and support activities will be evaluated by grading appropriate group and individual hands-on laboratory projects, scenarios, and case studies.Upon completion of this course, the students will be able to understand both cabled and wireless media types and be able to select appropriate media. The student will also understand the ISO-OSI and IEEE models and other industry standards, the roles of drivers and protocols and network architectures. The student will have experience with the installation, configuration and administration of basic server-based networking, as well as, an understanding of wide area/enterprise networking, performance monitoring and network troubleshooting. Most important, the student will learn how to foster communications, interpersonal, and group interaction skills through appropriate collaborative and active learning projects, laboratory exercises, and related experiences.The majoriety of campuses offering the Associate degree in Information Sciences and Technology will have 20-30 students enrolled in the course. The course will be offered one semester each academic year.", "prerequisite": "IST 220"}, {"department": "IST", "number": "227", "credits": "3 Credits", "description": "Administering peer-to-peer and client/server networks: Planning, installation, server configuration, resource management, remote access, performance monitoring, and optimization.  IST 227 Network Administration (3) IST 227 covers the essential knowledge and skills required to successfully administer peer-to-peer and client/server networks. Hands-on experience with commercial networking software such as Windows 9x, NetWare, Windowns NT Workstation, and Windows NT Server is an important course component. Topics covered include pre-installation planning, network installation, network software architecture, server configuration, profiles and logon scripts, user account management, policies, resource sharing and security, disk management, remote access, backup and recovery, performance monitoring, and network optimization. IST 227 is one of four courses required for the Networking Option in the Associate degree in Information Sciences and Technology (IST).Upon completion of this course, the students will be able to understand network software architecture, plan and install peer-to-peer and server-based networks. The IST student will also be able to manage user accounts, profiles, logon scripts, and system policies. The student will have practical experience with disk storage, resources, security, backup and recovery procedures. Finally, the student will be able to manage remote access features, monitor and optimize network performance, and foster communications, interpersonal, and group interaction skills through appropriate collaborative and active learning projects, laboratory exercises, and related experiences.Achievement of knowledge objectives will be evaluated by exam. Ability to perform hands-on network administration and support activities will be evaluated by grading appropriate group and individual hands-on laboratory projects, scenarios, and case studies.The majority of campuses offering the Associate degree in Information Sciences and Technology will have 20-30 students enrolled in the course. The course will be offered one semester each academic year.", "prerequisite": "IST 226"}, {"department": "IST", "number": "228", "credits": "3 Credits", "description": "TCP/IP planning, installation, configuration: IP addressing, subnetting, routing, Dynamic Host Configuration Protocol (DHCP), Windows Internet Naming Service (WINS), address/name resolution, Domain Name System (DNS); database, web, mail server management.  IST 228 Advanced Network Administration (3) IST 228 covers the essential knowledge and skills required to successfully administer TCP/IP networks and applications servers such as database servers, web servers, and mail servers. Hands-on experience with commerical software such as SQL Server, Exchange Sever, and Internet Information Server is an important course component. Topics covered include TCP/IP planning, installation, and configuration, IP addressing, subnetting, IP routing, DHCP, WINS, address and name resolution protocols, DNS, and management of database, web, and mail servers. IST 228 is one of four courses required for the Networking Option in the Associate degree of Information Science and Technology (IST).Upon completion of this course, the IST students will be able to plan, install, configure and troubleshoot TCP/IP. The student will also understand IP addressing, subnetting, supernetting, routing and configuration. The student will have practical experience installing and configuring DHCP, WINS, and various protocols. Finally, the IST student will have administrative skills with database, server and web software, as well as, the ability to foster communications, interpersonal, and group interaction skills; through appropriate collaborative and active learning projects, laboratory, exercises, and related experiences.Achievement of knowledge objectives will be evaluated by exam. Ability to perform hands-on network administration and support activites will be evaluated by grading appropriate group and individual hands-on laboratory projects, scenarios, and case studies.The majority of campuses offering the Associate degree in Information Sciences and Technology will have 20-30 students enrolled in the course. The course will be offered one semester each academic year.", "prerequisite": "IST 226"}, {"department": "IST", "number": "230", "credits": "3 Credits", "description": "Introduction to formal languages, mathematical logic, and discrete mathematics, with applications to information sciences and technology.  IST 230 Language, Logic, and Discrete Mathematics (3) IST 230 is one of the five introductory core courses for the baccalaureate degree program in Information Sciences and Technology. The purpose of IST 230 is to provide students with an understanding of an array of mathematical concepts and methods which form the foundation of modern information science, in a form that will be relevant and useful for IST students. Exams and assignments will be used to assess that understanding. IST 230 will draw some of its material from several mathematical disciplines: formal language theory, mathematical logic, discrete mathematics. In-depth treatments of each of these subjects are offered elsewhere in the University as advanced mathematics and computer science courses. The difference is that IST 230 will present these concepts in a more elementary way, with much more emphasis on IST applications, and in a more eclectic, web-based format. IST 230 will be structured as a small number of modules. Each module will introduce a group of mathematical concepts and present applications of those concepts to problems of information storage, information retrieval, information management, etc. These include: MODULE 1: SET, RELATIONS, FUNCTIONS, NUMBERS set operations, applications of relations, equivalence relations, function composition, inverse functions, logarithms, exponential function, number systems, applications of number theory. APPLICATIONS: mathematical data types (integers, fractions, real numbers, tuples, function spaces); exponential growth; non-feasible algorithms; public key encryption. MODULE 2: LOGIC AND BOOLEAN ALGEBRA predicates, quantifiers, formulas, interpretations, syllogisms, logical consequence, tableau method, boolean connectives, boolean functions, valuations, truth tables, logic gates. APPLICATIONS: database query languages; specification languages; switching circuits; boolean search expressions. MODULE 3: COMBINATORICS AND PROBABILITY combination, permutation, discrete probability APPLICATIONS: lexicographic ordering; combinatorial explosions; lower bouncs of algorithms; reliability of computer systems MODULE 4: GRAPHS AND TREES directed and undirected graphs, weighted graphs, walks, paths, matrix representations, graph algorithms, spanning trees, rooted and structured trees, combining trees to form new trees, inserting nodes in trees, sorting, searching. APPLICATIONS: flow diagrams; task scheduling; critical paths; network connectivity; finite state machines; parsing; derivation; trees as data structures for storing information. MODULE 5: INDUCTION AND RECURSION induction and recursion on the natural numbers and other structures such as trees. APPLICATIONS: recursive evaluation of mathematical and Boolean expressions; recursive searching and sorting algorithms; asymptotic analysis of algorithms. MODULE 6: GRAMMARS, LANGUAGES AND FINITE STATE MACHINES alphabets, strings, grammars, languages, regular languages, regular expressions, finite state machines, language recognizers. APPLICATIONS: regular expression search; efficient pattern matching using finite-state machines.", "prerequisite": "MATH 110"}, {"department": "IST", "number": "234N", "credits": "3 Credits", "description": "This introductory course will combine theory and practice to help students develop a rich understanding of the constantly evolving US digital culture. We will survey a variety of information and communication technologies (ICTs), and their modes of production, distribution, and consumption by individuals and institutions including traditional media, business, and government. Specifically, we will examine the impact of social and mobile technologies on how we consume, share, resist, and participate in digital culture. Students will also develop basic technical and media creation skills. The general theme of the course is analyzing contemporary cases to understand the significance of new ICTs in shaping our identities, behaviors, language, imaginations, and society. Students will read texts authored by some of the most formative thinkers examining the impact ICTs on society, and apply these core concepts in our analysis of digital cultures. Students will actively use microblogging, RSS feeds, social networking and other Web 2.0 tools to produce and consume content, interact with peers, and reflect critically on this experience. This course will emphasize awareness of current events and technology trends, as well as critical thinking skills and the ability to frame and explore issues through written, visual and verbal communication. This is an introductory course in IST and COMM, and meets the requirements for a Social and Behavioral Sciences (GS) and Humanities (GH) Course. This course is delivered with significant student and instructor interaction with computers and digital media.", "other": ["Cross-listed with: COMM 234N", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "IST", "number": "235", "credits": "3 Credits", "description": "Integrates information technology and gender studies. Overview issues and socio-cultural shaping of gender in the IT field.", "other": ["Cross-listed with: WMNST 235", "United States Cultures (US)"]}, {"department": "IST", "number": "237", "credits": "3 Credits", "description": "The proliferation of new IT combined with the reach of the Web, Internet, and mobile devices is opening up new possibilities for individuals and companies to leverage IT to create new digital businesses. This course provides a broad overview of the role of entrepreneurial thinking and innovation in advancing IT-focused businesses. Students will examine how these skills can be leveraged to create new IT-driven businesses as well as to create competitive advantage for existing businesses via new IT products and services (i.e., intrapreneurship). This course provides a broad overview of the role of entrepreneurial thinking and innovation in advancing IT-focused businesses and familiarizes students with the processes and tools used to conceptualize and plan new innovative products and/or services that leverage IT as a core component of their business model. Students will be introduced to concepts, tools, and principles of business management including business strategy, finance, marketing, human resources, and leadership within the context of IT business models.  This will be a very hands-on active class. Students will have the opportunity to work in teams to practice skills related to identifying novel ideas, assessing market opportunities, defining customer segments, identifying key partners, and building IT-based business models.", "prerequisite": "MGMT 215"}, {"department": "IST", "number": "240", "credits": "3 Credits", "description": "Introduction to the specification and application of languages and language paradigms that interact with computers.  IST 230 is recommended to be taken before or at the same time as IST 240. IST 240 is one of two courses added to the three core courses for the associate degree program to form the core courses for the baccalaureate degree program in Information Sciences and Technology. The primary goal of this course is to study the foundations underlying the design, specification and use of a wide variety of language paradigms used to interact with computers. The following details the content of the course: (1) nature of languages; (2) elements of languages; (3) classification of languages; (4) formal descriptions of languages; (5) data and types; (6) names and bindings; (7) control structures; (8) language processors; and (9) study experiences. Student evaluation may be accomplished by means of assignments, examinations, and possibly a project. This course will most likely involve Web-based course material and will therefore require student access to computers and the Web. Although other existing courses are similar to IST 240 in content, none of those courses fit the objective of this course and of this program.", "prerequisite": "CMPSC 101"}, {"department": "IST", "number": "240H", "credits": "3 Credits", "description": "Introduction to the specification and application of languages and language paradigms that interact with computers.", "other": ["Honors"]}, {"department": "IST", "number": "242", "credits": "3 Credits", "description": "Intermediate application development including algorithms, data structures, and object-oriented concepts.  IST 242 Intermediate & Object-Oriented Application Development (3) This is a second course in application development. It will focus on the intermediate knowledge needed to create applications that use high level programming languages, combining original code with existing code libraries and application programming interfaces (APIs). The perspective will be of application development that takes place within a human and organizational context; in this sense data structures will be construed as representations of organizational entities and information, and algorithms as a reflection of human and organizational processes and activity. Students will also learn about common application architectures and design patterns. This is a hands-on, practical course designed for IST design and development option undergraduate students and others as an elective.", "prerequisite": "IST 140"}, {"department": "IST", "number": "250", "credits": "3 Credits", "description": "Introduction to how the World Wide Web utilizes emerging technologies. Students acquire conceptual and practical understanding of constructing Web sites. IST 110 is recommended to be taken before or at the same time as IST 250.   This course provides an introduction to the visual/information design of Web sites and the technologies of the World Wide Web. Students will acquire a sound conceptual understanding of how to design and construct simple to complex web sites, and how this knowledge can be applied in practical ways across all disciplines. Knowledge gained in this course will support the Information Sciences and Technology (IST) Associate degree, as well as other degree options within IST and across the university. Knowledge gained in this course will also support other disciplines within the University, as the Web becomes the predominant publication medium of the 21st Century.   There are two major course objectives: (1) students will be able to perform a written critical evaluation of any web site, using the criteria listed below for evaluation; (2) students will be able to develop a written and/or electronic comprehensive proposal for the design or redesign of a web site, based on their understanding of visual and information design."}, {"department": "IST", "number": "256", "credits": "3 Credits", "description": "IST 256 will provide students with the knowledge and skills to create both basic and more dynamic web-based content pages and applications. The course will first focus on acquiring competencies in core web development languages including HTML, CSS, and JavaScript, then move on to more advanced topics such as information architecture, incorporation of multimedia, and the use of application programming interfaces (APIs) and application development frameworks for the web. The course will follow an active learning pedagogy and incorporate a substantial project component. The first part of the course consists of introduction of web programming concepts, techniques, and tools. Students will demonstrate understanding of the course content by building web pages via individual and group activities. The latter half of the course will involve more in-depth project work both as individuals and in groups.", "prerequisite": "IST 250"}, {"department": "IST", "number": "260W", "credits": "3 Credits/Maximum of 3", "description": "Introduction to systems analysis and design, stressing the process of requirements acquisition, specification, design, and implementation.  IST 260W Introduction to Systems Analysis and Design (3)IST 260W is an introductory course to system analysis and design. It covers the process and is intended to be independent of the specific system, whether it be a hardware, software, telecommunication, logistics, or information system. This course can be used as a prerequisite to specific Associate degree system design courses. It can also be used for breadth for those IST students who do not pursue technical emphases. It serves as a writing across the curriculum course for the Information Sciences and Technology Associate degree. The course looks at two design paradigms. A small design project is included in the course. The objectives of the course include: (1) teaching students the importance of teamwork, project management, and oral and written communication skills; (2) teaching students a systems design strategy that emphasizes customer requirements at all stages of the process; (3) introducing students to the object oriented design process; (4) giving students a full design experience on a small project such as designing an e-Commerce system; and (5) showing students examples of the writing required for systems design and requiring them to write individual and team reports as well as give oral presentations on their designs. Students will be evaluated by examinations and by grading of their written reports and oral presentations. System design courses are taught at the upper-division level in Engineering and Business departments. This is a lower-division course that serves as an introduction for Associate degree students to give them a background for project-level courses in their fourth semester. It will serve as a core requirement in the Associate degree program and act as a prerequisite for the design courses that are capstone courses in many of the Associate degree options. The course will be offered one semester each academic year.", "prerequisite": "IST 110", "other": ["Writing Across the Curriculum"]}, {"department": "IST", "number": "261", "credits": "3 Credits", "description": "Introductory design and development studio course for IST and SRA students.  IST 261 Application Development Design Studio I (3) This studio course will provide opportunities for students to practice the technical skills acquired in their foundation application design and development courses, specifically, in IST 140 and IST 242. The course will follow the general format of experiential studios in the arts and architecture. It will be primarily problem-based and project oriented. Peer and instructor design critiques will be the major feedback and assessment mechanisms. Students in the IST Software Design Studios will be expected to complete deliverables in each phase of the systems development lifecycle (i.e. problem definition, requirements analysis, design, development, test) regardless of the development paradigm employed (plan-based, agile, etc). A key objective of this design studio will be to introduce students to the challenges faced in different application design and development activities before exposing them to specific techniques to manage these challenges in upper-division courses. Projects may be undertaken by individuals, pairs, or larger groups but each studio participant will be responsible for producing significant individual project deliverables. Project ideas may come from the student or from the instructor; however, projects related to students' other course deliverables will require the agreement of both instructors. Students will be required to maintain a design and development journal. This journal will be the analog of an engineering notebook or artist's sketchbook and should contain a running account of the students design and development ideas, explorations, rationale, and other notes. The IST design and development studios are a forum for serious students to engage with the concepts, process, tools, and materials used to envision and build software applications. Both collaboration and individual performance will be emphasized, as will experimentation, risk-taking, and enthusiasm for the process of designing and building working software applications. Students will be expected to improvise and then respond constructively to feedback from instructors and peers.", "prerequisite": "IST 242"}, {"department": "IST", "number": "261H", "credits": "3 Credits", "description": "Introductory design and development studio course for IST and SRA students."}, {"department": "IST", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "IST", "number": "295A", "credits": "1-3 Credits/Maximum of 3", "description": "IST 295A Distributed Team Project (3) This course offers a web-based distributed project that simulates an internship of a student in a company. Faculty gather information system design projects from industry or units within the university. These projects are announced on the web and students bid to join groups to work on the projects. Each project has a faculty mentor with an additional industrial mentor where appropriate. Student groups are formed by the mentors based on the resumes and skill sets of the students. Students bid on one project at a time until they have been selected to be a member of a project team. Membership in a group may include students from different campuses throughout the Penn State System. The majority of communication within the groups and with the mentors is to be via the internet. This course gives a true experience in information project development. Students will be graded as a team by the faculty mentor on the quality of the project. An individual written report detailing the work accomplished during the course is required from all team members. The grade of the individual report and the team project grade form a basis for student evaluation.The objectives of the course include: (1) teaching students the importance of teamwork, project management, and oral and written communication skills: and (2) exposing students to the virtual workplace and providing them with meaningful information and technology related tasks.", "prerequisite": "IST 110"}, {"department": "IST", "number": "295B", "credits": "1-3 Credits/Maximum of 3", "description": "IST 295B IST Internship (1-3) This course is offered as an internship for a student within a company. Faculty and industry collaborate to specify the duties of the intern. The faculty member responsible for the course then approves the internship. The internship must consist of a minimum of 150 hours of meaningful information and technology related tasks. A written report by the student, detailing the work accomplished during the internship, is required. This report and a report from the intern supervisor form the basis for the grade.The objectives of the course include: (1) teaching students the importance of teamwork, project management, and oral and written communication skills; and (2) exposing students to the workplace and providing them with meaningful information and technology related tasks.", "prerequisite": "IST 110", "other": ["Full-Time Equivalent Course"]}, {"department": "IST", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "IST", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "IST", "number": "298", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "IST", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "IST", "number": "301", "credits": "3 Credits", "description": "Overview of organizational structures and functions. Includes information processing and analytic perspectives of organizations.  IST 301 Information and Organizations (3) This course provides students the opportunity to learn and experience: 1. Applicable organization and the ways in which IT can alter and enable these activities. 2. A series of analytic techniques that students can use to investigate the effects of new IT on work and organization. 3. Examples and problems set in and drawn from a range of domains including military, medical, high technology, business and government.This course is designed around a series of ill-structured, contemporary problems that require students to develop responses by applying analytic techniques and theories of work and organization. At the end of the course, students will be able to: 1. Apply theories of work and organization as analytic techniques. 2. Conduct organizational and inter-organizational process analyses. 3. Map information flows among organizational units and actors.", "prerequisite": "IST 210"}, {"department": "IST", "number": "302", "credits": "3 Credits", "description": "Exploration and application of the basic concepts, methodologies, and tools of project management in the field of information sciences and technology.  IST 302 IT Project Management (3) This course is designed to introduce and explore the basic concepts and practices of project management and help students understand how to plan and manage IT projects successfully. Throughout the course, students will be asked to utilize course concepts, methodologies, and tools while utilizing technology applications and addressing real-world problems. Students will learn the skills necessary to define project scope, create workable project plans, and manage projects with quality, budget, and schedule in mind. The course is structured around the key phases of project lifecycle, including initiating a project, developing project plans, executing and managing a project, and closing out a project. In addition, students will be taught how to identify and address the change management and political issues associated with project management.", "prerequisite": "IST 210"}, {"department": "IST", "number": "310", "credits": "3 Credits", "description": "Analysis of audience data for traditional and new media to create metrics for advertising, content marketing and audience analysis.  COMM (IST) 310 Digital Media Metrics (3) The emergence of a converged marketplace where all media are now digital, including broadcasting, websites and social media, has created enormous new opportunities for advertising, promotions and content distribution. The proliferation of media has made the marketplace much more competitive, but simultaneously the availability of data too has increased significantly making possible the much more precise and segmented distribution of messages and content. For media practitioners in this new environment, a familiarity with audience data, metrics and dimensions is essential.  This course is an introduction to the methods for collecting, analyzing and utilizing audience data for traditional and new media. The class will cover the fundamentals of traditional media audience analysis, web metrics, and social media metrics, specifically as they relate to audience measurement, advertising campaign evaluation and content distribution. Students will learn the methods of data collection, analysis and use for traditional broadcast media, and the transformation of these practices in the newly digitized and converged multiplatform, multiscreen environment. The course will also cover the basics of data capture for new media (at an appropriate technical level), and the use of this data for the design of metrics appropriate for various purposes such as monitoring traffic, conversions and revenue generation. The use of metrics in pricing models for advertising, sales generation and content distribution will also be covered. Students will be introduced to data sources for digital media audience analysis, with a special focus on Google Analytics. Students passing this class would be able to pass the Google Analytics Individual Qualification test.", "other": ["Cross-listed with: COMM 310"]}, {"department": "IST", "number": "311", "credits": "3 Credits", "description": "Introduction to object-oriented applications including applications in an Object Oriented Design (OOD) language or OOD languages.  IST 311 Object-Oriented Design and Software Applications (3) IST 311 is among the courses making up the Application Design & Development option in the Baccalaureate degree in Information Sciences and Technology. This course is normally taken in the 5th or 6th semester. It is the first upper-division course in the option sequence. The course is intended to provide students with a background in object-oriented design and object-oriented application development. Students will learn the fundamentals of object-oriented analysis, design, and modeling. They will apply design concepts and develop the skills necessary to bring an idea through the different phases of the application development lifecycle. The course normally involves students working on teams to design and develop working application prototypes. Upon completion of this course, students will be able to apply object-oriented design principles using object-oriented modeling and programming languages, show how object-oriented principles increase the quality of complex applications, and begin development of the team skills necessary when developing complex systems.", "prerequisite": "IST 242"}, {"department": "IST", "number": "331", "credits": "3 Credits", "description": "Interdisciplinary survey of topics and methods related to the human-centered design use and usability of information systems.  IST 331 Foundations of Human-Centered Design: User and System Principles (3) This course provides a focused introduction to one of the most complicated parts of information systems design: users and the contexts in which they live, work, and play. The course provides a balance between theory and practice, which are tightly intertwined in this area. Students will learn how to use social science theories about human capabilities and group behavior to predict whether an information system will be usable and useful, and they will learn about the opportunities and challenges that are associated with a wide range of emerging technologies. Students will also gain skills in designing and evaluating information systems that meet the needs of a target audience. Because the information technology design space evolves rapidly, much of the technology-related content covered in this course will evolve from year to year; however the focus throughout will be understanding and responding to the needs, capabilities and preferences of the users of interactive information systems. The format of the class may include lectures, readings, in-class or online discussions, projects, or case studies. Assessment of student performance may include short assignments, quizzes, exams, or in-depth projects.", "prerequisite": "IST 240"}, {"department": "IST", "number": "331H", "credits": "3 Credits", "description": "Interdisciplinary survey of topics related to the use and usability of information systems.", "other": ["Honors"]}, {"department": "IST", "number": "337", "credits": "3 Credits", "description": "This course introduces the student to the applications, technologies, and tools for entrepreneurs engaging in or considering engaging in a start-up or running a small-to-medium size business. Although there will be some consideration of product concept development and implementation, much of the course will be devoted to the tools and infrastructure need to support a start-up up a small-to-medium size business. These concepts and skills will also support entrepreneurs looking to develop new applications to open new market opportunities. This will be a very hands-on and active class that relies on approaches such as problem-based learning (PBL), \"flipped\" classrooms, and learning by doing. Students will spend time outside class learning key concepts and time inside class applying them.", "prerequisite": "IST 237"}, {"department": "IST", "number": "361", "credits": "3 Credits", "description": "Second of two design and development studio courses for IST and SRA students.  IST 361 Application Development Design Studio II (3) This studio course will provide opportunities for students to practice technical skills acquired in their previous design and development courses to date, specifically, in IST 140, Introduction to Application Development; IST 242, Intermediate and Object-Oriented Application Development; and IST 311, Object-Oriented Design and Software Applications. The course will follow the general format of experiential studios in the arts and architecture. It will be primarily largely problem-based and project oriented. Peer and instructor design critiques will be the primary feedback and assessment mechanisms. Students in the IST Software Design Studios will be expected to complete deliverables in each phase of the systems development lifecycle (i.e. problem definition, requirements analysis, design, development, test) regardless of the development paradigm employed (plan-based, agile, etc). A key objective of this design studio will be to provide application development opportunities where students can apply knowledge and practice techniques gained from their foundation and first upper-division courses. Projects may be undertaken by individuals, pairs, or larger groups but each studio participant will be responsible for producing significant individual project deliverables. Project ideas may come from the student or from the instructor; however, projects related to students' other course deliverables will require the agreement of both instructors. Students will be required to maintain a design and development journal. This journal will be the analog of an engineering notebook or artist's sketchbook and should contain a running account of the students design and development ideas, explorations, rationale, and other notes. The IST design and development studios are a forum for serious students to engage with the concepts, process, tools, and materials used to envision and build software applications. Both collaboration and individual performance will be emphasized, as will experimentation, risk-taking, and enthusiasm for the process of designing and building working software applications. Students will be expected to improvise and then respond constructively to feedback from instructors and peers.", "prerequisite": "IST 311"}, {"department": "IST", "number": "389", "credits": "1-4 Credits", "description": "Leadership in college instructional settings; teaching and learning principles; instructional technologies; and best practices in coaching, team facilitation, learning assessment. This course prepares undergraduate students for their role as Learning Assistants (LA's) in the College of IST. In this course, LA's will prepare to assist in instructional environments that encourage students to participate actively in their learning. LA's will be immersed in activities that introduce them to some of the teaching methods aimed at promoting active learning in College of IST classrooms, while being prepared for leadership responsibilities such as coaching, providing feedback, evaluating, monitoring academic integrity, fostering inclusive learning environments, and supporting teams. Students will also learn about information technologies designed for managing courses and increasing student engagement. Outside of class meetings, students will serve as instructional assistants in an assigned course. They will be mentored, supervised, and evaluated on the job by their assigned faculty member.", "prerequisite": "IST 110"}, {"department": "IST", "number": "390", "credits": "1 Credits", "description": "Interdisciplinary course to introduce students to the issues, concepts and skills involved in successfully transitioning into professional life.  IST 390 Introduction to Professional Development (1) IST 390 focuses on introducing the students to professionalism and professional development in the field of IT. Emphasis will be placed on the theories and skills required for planning, developing, implementing, and managing professional skills. For example, students will attempt to master relationship skills such as client relationship management and interpersonal communication, business skills such as presentation planning and scheduling; leadership skills such as decision making and goal setting; and career management skills such as networking and interviewing. Additional focus will be placed on the various resources and strategies available for pursuing a successful job search. Students will be given opportunities to practice the concepts, theories, and methodologies learned in class by working in teams on real-world case studies (many derived from corporate partners). Students will be periodically assessed through examinations, case studies, individual and group assignments and projects, and other performance indicators where appropriate.The audience is students who are ready to enter the work force. For those pursuing Baccalaureate Degrees, this would mean a class standing of Junior or Senior. For those pursuing Associate Degrees, this would mean a second year standing."}, {"department": "IST", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "IST", "number": "398", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "IST", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "IST", "number": "402", "credits": "3 Credits/Maximum of 9", "description": "Introduction to emerging issues, technology forecasting and analysis; overview of emerging issues and leading technologies in IST and how they impact information systems, users, the IT labor force and society.  IST 402 Emerging Issues and Technologies (3 per semester/maximum of 9) Information Sciences and Technology (IST) is a rapidly changing discipline. New issues, methods, tools, applications and terminology appear on a continual basis. A key skill is the ability to analyze new issues and assess new technologies within the context of the information age. This course prepares students to understand the difference between potential technological failures and success, fads and revolutionary technology. It also helps students to view emerging issues as an opportunity rather than a threat. Intellectual tools are provided to assist in understanding issues, assessing and forecasting technological changes for feasibility and planning in real world situations. The course provides students with: a.) A process framework for analyzing new issues and a theoretical framework to study technological and social impacts of such issues. b.) A process framework for recognizing and understanding new technologies and a theoretical framework to take advantage of such technologies. c.) Exposure to new issues and technologies. d.) Hands-on experience in studying recent technological advances in detail.The course will also provide students with the ability to: a.) Understand the concept of issue analysis and technology forecasting. b.) Recognize the important of new issues and technologies in information sciences. c.) Incorporate these new issues and technologies into an existing information systems framework. d.) Develop and implement new technology solutions, or discuss policies for addressing emerging issues. e.) Predict impacts of issues and technology on information management, users, policies, and the environment.Each time the course is offered; new issues and.or information technology areas will be explored. Examples of issues and technologies addressed include: wireless communications, security and intrusion detection, intelligent agents, web search, languages, intelligent systems, bio-informatics, advanced visualization and human-computer interactions, ubiquitous-pervasive computing, groupware, computer aided cognition, system design by global IT teams, IT outsourcing, and digital divide.", "prerequisite": "IST 210"}, {"department": "IST", "number": "402H", "credits": "3 Credits/Maximum of 9", "description": "Introduction to emerging issues, technology forecasting and analysis; overview of emerging issues and leading technologies in IST and how they impact information systems, users, the IT labor force and society.", "other": ["Honors"]}, {"department": "IST", "number": "411", "credits": "3 Credits/Maximum of 3", "description": "Introduction to distributed-object computing and its use in client/server and real-world computing applications.  This course presents the fundamental concepts of distributed-object computing, including client/server computing which is an important platform for real-world computing systems. The course focuses on design, development, and deployment of distributed systems. Students will also consider issues of managing distributed systems and the relationships between organizational processes and information-system architectures. IST 411 is an elective course for the Baccalaureate degree program in Information Sciences and Technology. Students completing the Systems Development Option may take this course to fulfill option requirements.  Upon completion of this course, students will have a broad understanding of the fundamental concepts of distributed objects and distributed-computing architectures, have the ability to apply these concepts to real-world applications, and be able to design, develop, deploy, and maintain distributed applications.", "prerequisite": "IST 311"}, {"department": "IST", "number": "412", "credits": "3 Credits/Maximum of 3", "description": "Introduction to the engineering of complex software systems including software system specification, design and implementation, integration and test, and evolution.  IST 412 The Engineering of Complex Software Systems (3) This course presents the fundamental concepts of the engineering of complex software systems, including iterative and agile development strategies.  The course gives students insight into the full software development cycle, including design, implementation, test and quality assurance, deployment, maintenance, and project estimation and management.  IST 412 is an elective course for the Baccalaureate degree program in Information Sciences and Technology. Students completing the Systems Development Option may take this course to fulfill option requirements. Upon completion of this course, students will have a broad understanding of the fundamental concepts of complex system software engineering and be able to apply these concepts to managing and developing a complex software project over the full software development cycle.", "prerequisite": "IST 311"}, {"department": "IST", "number": "413", "credits": "3 Credits", "description": "This course addresses activities in the system development process that ensure usability.  It considers the emerging concept of usability, requirements gathering and analysis, activity design, information design, interaction design, documentation design, user testing and usability evaluation.  IST 413 Usability Engineering (3) The modern system development process includes concurrent engineering of usability - features of a system that make it approachable, learnable, as well as easy and satisfying to use. Topics in the course include the emerging concept of usability, requirements gathering and analysis, the use of scenarios and claims to describe and analyze both current human practices and envisioned practices, activity design, information design, interaction design, documentation design, and user testing, including techniques for formative and summative usability evaluation.", "prerequisite": "IST 331"}, {"department": "IST", "number": "420", "credits": "3 Credits", "description": "Introductory course on integration of information technology into different venues, including the planning, development, and implementation of the integration.  IST 420 Fundamentals of Systems and Enterprise Integration (3) IST 420 focuses on introducing the student to the role of information systems and technologies in achieving a variety of system goals. Emphasis will be placed on the theories and skills required for planning, developing, implementing, and managing the integration of information technology and different systems. IST 420 is required of all Information Sciences and Technology (IST) undergraduates who have chosen the Information Technology Integration Option in their baccalaureate degree. It is the prerequisite for IST 421 which is also required for the Option. Upon completion of the course, the student will be able to recognize information technology integration. They will also understand the 'business processes and information value chain' within a system, and be able to foster an understanding of the role of IT in system integration. Students will be periodically assessed through examinations, case studies, individual and group assignments and projects, and other performance indicators where appropriate.", "prerequisite": "IST 240"}, {"department": "IST", "number": "421", "credits": "3 Credits", "description": "Advanced course on the integration of information technology into systems applications.  IST 421 Advanced Enterprise Integration: Technology and Applications (3) IST 421 expands the knowledge gained in IST 420 on the theories and skills required for planning, developing, implementing, and managing information systems. IST 421 is required of all Information Sciences and Technology (IST) undergraduates who have chosen the Information Technology: Integration and Application Option in their Baccalaureate degree. Upon completion of the course, the student will have expanded knowledge of information technology and systems integration issues across multiple application settings. They will also have a deeper understanding of the specific information technology (both hardware and software) that can serve as the foundation for designing systems within an organization, and have experience that fosters an understanding of the role of IT achieving system performance goals.", "prerequisite": "IST 420"}, {"department": "IST", "number": "422", "credits": "3 Credits", "description": "Theoretical foundations and practice of enterprise architecture.  IST 422 Enterprise Architecture Foundations (3) Enterprise Architecture is the overall framework and set of strategic objectives for the usage of technology over time across an organization. Enterprise Architecture can also be described as the top-down, strategy-driven, integrating framework that brings together and manages the business model, applications and technology. Its primary goal is to facilitate improvement and deliver business-aligned information systems. This course presents the key components and processes involved in the effective creation and governance of enterprise architectures. Students will acquire knowledge about the key foundational aspects of enterprise architecture, learn what decisions need to be made and how to make them, and be able to explain and justify their recommendations.", "prerequisite": "IST 301"}, {"department": "IST", "number": "423", "credits": "3 Credits", "description": "Provide in-depth study of the concepts, issues, and technologies associated with the complex world of enterprise information and storage architecture.  IST 423 Enterprise Information Management and Storage Architecture (3) This course is designed to introduce students to enterprise information storage and management concepts, issues, trends, and technologies. As an upper-division course, the focus will center on applying design concepts and associated technologies to real-world problems in the area of enterprise information storage and management . Existing partnerships with leading information management firms will be leveraged to provide real-world exposure to the complex enterprise information storage and management issues facing all organizations today. This course also focuses increasingly on the critical areas of information security and the emerging field of information storage virtualization. The course will mix technical details, applied value, and organizational insights of enterprise information storage and management through the use of labs, case studies, real-life problems, and team projects. This is a unique course that has generated great industry interest.", "prerequisite": "IST 301"}, {"department": "IST", "number": "424", "credits": "3 Credits", "description": "Theoretical foundations and practice of enterprise modeling.  IST 424 Architectural Modeling of Organizations (3) Enterprise Architecture is the overall framework and set of strategic objectives for the usage of technology over time across an organization. Enterprise Architecture can also be described as the top-down, strategy-driven, integrating framework that brings together and manages the organization model, applications and technology. Its primary goal is to facilitate improvement and deliver organization-aligned information systems. Effective modeling is crucial for successful EA. This course provides an exposure to the foundational concepts and practices of effective enterprise modeling for EA. Students will acquire knowledge about the key foundational knowledge in modeling different layers of the enterprise, learn what decisions need to be made and how to make them, and be able to explain and justify their models and recommendations. This course explores the use and effectiveness of architectural modeling to describe an organization and to integrate and manage IT resources strategically from an enterprise perspective. Hands-on exercises and cases studies are used to illustrate the role and effect of enterprise architecture concepts and methodologies. Emphasis is placed on understanding different architectural approaches, standards, and styles. Students will use enterprise architectural tools to develop descriptive models and understand how to integrate and manage IT within and between organizations. For each general topic area, core readings are used to define standard vocabulary, concepts and relations, methods and criteria for evaluation, and implications for enterprise architecture. Students participate in class discussions as well as complete written assignments that focus on solidifying the understanding of the course content. Students also complete a team modeling project that is motivated by, and whose outcomes are discussed with respect to, one or more theoretical frameworks covered in the course.", "prerequisite": "IST 301"}, {"department": "IST", "number": "425", "credits": "3 Credits", "description": "Via problem-based learning, students define new business ventures to meet current market needs, develop business models, and present to various stakeholders. The goal of New Venture Creation is to better prepare undergraduate students to be leaders in adaptive, globally-minded, technology-savvy organizations. The course is structured so students develop skills that are of high value in any workplace: leadership skills, self-efficacy, creativity and the ability to deal with ambiguity. Upon course completion, students will have a working knowledge of traditional and non-traditional ways for identifying a new product or business opportunity, quantifying the potential, understanding the key competitive factors, researching the audience, and producing a convincing plan for financing and launch. Students who want to augment the skills and knowledge from their major with the ability to develop a new product/service/process, will find New Venture Creation a valuable course. This is a novel problem-based learning (PBL) course, where the learning is student-centered, with faculty acting primarily in the role of facilitators. Active/Experiential learning happens in this course because students develop ownership of their venture concepts and are fully responsible for the genesis of ideas.", "prerequisite": "ECON 102", "other": ["Cross-listed with: ENGR 425, MGMT 425"]}, {"department": "IST", "number": "426", "credits": "3 Credits", "description": "Working with Penn State inventions selected by the Intellectual Property Office, student teams define an optimum commercialization path each technology.  ENGR 426ENGR (MGMT/IST/ENTR) 426 Invention Commercialization (3) The goal of ENGR (MGMT/IST/ENTR) 426 is to have students understand why invention commercialization is complicated and difficult by participating in the process. For example, the inventor rarely has insights into the markets for his/her invention, is often not interested in the details of commercialization, and can be secretive. In addition, the business and financial communities often do not take the time, or have the resources, to understand new technologies and perform complex due diligence. Thus lack of due diligence often leads to rejection of innovation because existing companies often discount new technologies from outside the company as NIH - 'not invented here'. Effective transfer of new invention or innovation to a commercial product requires at least three different functional communities to interface: technical, legal and business. Each uses a different language, comes from different educational and cultural backgrounds, and may have an inherent distrust of the others. These functional barriers are difficult to overcome.This course teaches how these barriers can be broken down as student teams help bridge the perceived chasm between key players in the invention commercialization process. In these teams, students bring the skills and knowledge from their major to develop an invention commercialization recommendation for the Technology Transfer Office and the inventor. For example, business students focus on finance and market opportunity assessment; engineering and IST students focus on design refinements, prototyping support, and (if appropriate) making technology suggestions to the inventor.Upon completing the course, the students will have a working knowledge of different university and corporate technology or invention commercialization processes, important intellectual property management tools for inventions (patents, license agreements, option agreements) source of funding to move inventions toward product development, and delivering top quality presentations which outline the recommended commercialization path. Students who enjoy open-ended projects which involve the interplay of business and invention of who wants to work on interdisciplinary teams with the newest inventions will find this course a valuable course. NOTE: Because the inventions/products are based on Penn State faculty intellectual property, students must sign the Penn State Special Intellectual Property Agreement For Students - For Use When Assigning Intellectual Property to The Pennsylvania State University. The form can be viewed at http://guru.psu.edu/policies/RAG13.htmlThe course will be offered both Spring and Fall semesters with an enrollment of 40 students.", "prerequisite": "ECON 102", "other": ["Cross-listed with: ENGR 426, MGMT 426"]}, {"department": "IST", "number": "431", "credits": "3 Credits", "description": "Survey of social environment of information technology themes: Community, sovereignty, privacy, ethics, economics, and knowledge management.  IST 431 The Information Environment (3) The ways that people communicate and utilize information is being changed dramatically by new information technologies. Information and the technologies that are employed by create, organize, transfer, and utilize that information in a networked environment, using such global networks as the internet or internal networks such as intranets, have become a key component of the global economy. This global environment can change the way we interact, communicate, and function on the job and in our daily lives. The new technologies also raise new economic, legal, ethical, and social issues that are of grave importance to society. IST 431 examines the overall context of the new information environment and new technical issues relating to knowledge management in the global networked environment. IST 431 is a required course in the Information, Society and Public Policy Option.There may be some overlap of material with COMM 405, COMM 483, COMM 485, PHIL 407, PHIL 423, PHIL 433 and PL SC 460m but none of these courses cover the same material, or approach it in the same manner.Upon completion of this course, the student will gain an appreciation of the differences between 'cyberspace' and the 'real' world. The student will also understand that the implementation and modern information technologies has significant social and policy implications that demand appropriate policy issues in several different contexts (globa, national, local). The student will also be able to discuss the major themes in information policy studies (e.g., community, privacy, access, economic participation, security) and be able to relate these themes to the applications of particular technologies. They will be able to describe policy frameworks and issues, as well as the ethical and social implications of these choices.Homework assignments; Socratic dialogue; analysis and write-up of case studies; assessment of group research projects and presentations; participation in on-line discussion groups; two mid-term and one final examination (objective and essay). The precise mix of evaluation components will be determined by individual instructors; a typical weighting might be exams (60%), written assignments and papers (20%), and collaborative projects (20%).IST 431 will be offered every semester at University Park. At every other campus location where the Baccalaureate degree program is offered, the course will be offered 1-2 times annually depending on demand. Student enrollment at University Park will begin at approximately 50-75 in the first year and grow to 200 over a 3-4 year time period. At other locations, enrollment should range from 25-50 annually.", "prerequisite": "IST 210"}, {"department": "IST", "number": "432", "credits": "3 Credits", "description": "Legal environment of information technology, constitutional/political issues, intellectual property, management, e-commerce, privacy, access, computer contracting, cyberspace regulation.  IST 432 Legal and Regulatory Environment of Information Science and Technology (3) The new information technologies are creating a global economy heavily dependent upon networked information, hardware, software, and electronic commerce, which calls for adaptation of existing legal and business practices. In many cases, the new technologies pose problems that existing laws or legislation are inadequate to cope with; but the complexity of the environment makes new solutions elusive. This course examines the legal, regulatory, and political environment within which intellectual property rights and examination of contracting issues, licensing of information and products, data protection, patents, cyberspace regulation, and implications for personal privacy. It also focuses on where technology is making regulation difficult by challenging previous concepts upon which our legal and regulatory systems depend.", "prerequisite": "IST 301"}, {"department": "IST", "number": "437", "credits": "3 Credits", "description": "This course introduces students to design thinking, user-driven innovation and user experience, and business model implementation issues for IT-driven innovation.  IST 437 Digital Design & Innovation (3) IT-driven innovation requires a deep understanding of the user, the context of the compute environment, and a systems approach to identifying critical system features. In addition, the IT-driven innovation must meet user needs in a commercially feasible manner. Students taking this class will work in teams to create a design concept and refine it through user analysis and prototyping. To get to a commercially feasible concept, students will analyze the competitive landscape and the ecosystem in which their concept will reside. Each team will express their concepts using the Business Model Canvas - a tool used in both educational and professional settings - to identify the value proposition and potential monetization strategies. Throughout the class, students will be introduced to tools in the IT design space through hands-on problem solving, role playing, and improvisation, among other techniques. A critical part of this course is the in-class coaching that teams will receive from the instructor, as well as guest speakers who can demonstrate the real world challenges of entrepreneurship and innovation. Frequent communication practice using techniques such as idea pitches will help students refine their ability to express their ideas more effectively.", "prerequisite": "IST 237"}, {"department": "IST", "number": "440W", "credits": "3 Credits", "description": "Problem-based approach to technology integration by focusing on real-life problems faced by an organization.  IST 440W Information Sciences and Technology Integration and Problem Solving (3) This course is the undergraduate capstone for Information Sciences and Technology majors in the Baccalaureate degree. It requires students to work collaboratively in teams of 4-6 students, with each team comprised of students from more than one option and, if possible, more than one campus. Each team is given a significant real-world problem or issue in which information technology is part of the solution. Teams will be expected to manage the project effectively and to communicate its results clearly to a variety of audiences within an organization. Major topics include: review of problem-based and case-based learning; overview of project management practices; assessment of organizational and technical issues posed by the scenario; development and testing of work plans and analysis of options; communication within the group; communication within a management environment; and presentation of results to a variety of audiences inside and outside the organization. IST students need to understand the organizational and social contexts in which technology functions. Indeed, many technology problems are multi-dimensional--they have an economic dimension, a legal dimension, a human resources dimension, and so on. This course will require students to analyze, evaluate, and test alternative solutions and to weigh their advantages and disadvantages for the organization. Students will be evaluated in three ways: by the effectiveness of their team's solution of the technical or organizational problem; by the quality of the students' written and oral presentations; and by the quality of their project management and internal communication. A substantial written paper will be required of each student and each time; in addition, each team will also construct a Web-site for sharing results. Other technologies will be used as required by the project. It is expected that membership on teams of students will be drawn from the various options in the Information Sciences and Technology major. At least nine credits (including at least one IST 300-level and one IST 400-level course) in the student's option must be completed before enrollment in IST 440W. This course should be offered every fall and spring semester beginning in the fall semester 2002. It will be taught in sections of 25 and have a total enrollment of approximately 100 per semester.", "prerequisite": "ENGL 202C", "other": ["Writing Across the Curriculum"]}, {"department": "IST", "number": "441", "credits": "3 Credits", "description": "The practices and foundations of access to textual and nontextual information using the principles of information retrieval and web search. Introductory course for for undergraduate students in the last year of their academic program and graduate students covering the practices, issues, and theoretical foundations of organizing and analyzing information and information content for the purpose of providing access to textual and nontextual information resources. Introduces students to the principles of information storage and retrieval systems and databases.  IST 441 Information Retrieval and Organization (3) This is an introductory course for Information Sciences and Technology senior and graduate students covering the practices, issues, and theoretical foundations of organizing and analyzing information and information content for the purpose of providing access to textual and non-textual information resources. This course will introduce students to the principles of information storage and retrieval systems and databases. Students will learn how effective information search and retrieval is interrelated with the organization and description of information to be retrieved. Students will also learn to use a set of tools, such as search engines, and procedures for organizing information. They will become familiar with the techniques involved in conducting effective searches of information resources.", "prerequisite": "IST 210"}, {"department": "IST", "number": "442", "credits": "3 Credits", "description": "International concepts to improve strategies for the design, dissemination, and use of information technology.  IST 442 Information Technology in an International Context (3) (IL) IST 442 focuses on the implications of the international context for the design, diffusion and use of information technology. The course will provide students with an understanding of the three crucial IT-related characteristics of the international context: 1. information infrastructure, 2. the economic and policy environment, and 3. social and cultural structures. Students will develop analytic skills that will enable them to predict the implications of the international context for information technology and will apply these skills in a final project that addresses a problem in the areas such as information systems integration, interface design, or management of information technology projects.", "prerequisite": "IST 110", "other": ["International Cultures (IL)"]}, {"department": "IST", "number": "445", "credits": "3 Credits", "description": "This course covers trends in globalization and their influence on U.S. policy making as well as the role of the U.S. in international issues.", "other": ["Honors"]}, {"department": "IST", "number": "446", "credits": "3 Credits", "description": "An interdisciplinary course that introduces students to process and techniques involved in developing a video or computer game.  IST 446 An Introduction to Building Computer/Video Games (3) The course is project driven. Students will form teams and collaborate with one another to develop an interactive immersive experience. During the course, students will be exposed to several techniques for building graphical 3D worlds, animating characters, moving the camera and lights in real-time, and building intelligent characters (using state machine-based architectures). They will also learn different techniques of interactive storytelling, such as linear narrative, branching narrative, and adaptive narrative. Furthermore, they will be introduced to several tools that will aid in realizing their own projects and ideas, such as graphic engines (e.g. Wildtangent), and game engines (e.g. Unreal Tournament).The course is heavily project driven. Students will, in the first half of the course, learn the tools used in the development of interactive 3D environments. They will submit 2 individual assignments using these tools to develop a simple interactive environment. These individual assignments will be graded and critiqued.In the second half of the course, students will work on a game idea from generation to actual implementation. Students will be grouped in teams of three to develop a project, integrating concepts they learned through the class. They will use one or more of the tools they learned to build this project. Projects will be continuously evaluated and critiqued during game tuning sessions. In addition, projects will be formally evaluated through two prototypes that are critiqued by the class and the instructor. The students will continuously revise their designs and projects through the semester. The final version of the system is due by the end of the semester.", "prerequisite": "IST 311"}, {"department": "IST", "number": "450", "credits": "3 Credits", "description": "Digital advertising has transformed many industry activities related to buying and delivering advertising. Information technology and big data have revolutionized the way media and content providers interact and negotiate with advertisers, agencies and third parties. This course will explore the digital advertising and media ¿ecosystem,¿ identify key players and trends, and review performance analysis and evaluation. Particular attention will be paid to sources, management, storage, analysis and visualization of data. Trends in industry regulation and ethics will be explored. This includes ad industry selfregulation and data privacy regulations. The implications of big data and artificial intelligence on industry ethics is discussed.", "prerequisite": "COMM 310", "other": ["Cross-listed with: COMM 450"]}, {"department": "IST", "number": "450A", "credits": "3 Credits/Maximum of 3", "description": "This project-oriented course provides students with the knowledge and skills necessary to conduct sponsored advertising-based marketing campaigns. This course offers students an opportunity to gain knowledge and hands-on experience on sponsored search and email advertising. Strategies for developing successful digital advertising campaigns will be discussed, including qualifying and researching clients, account and campaign structure, identifying and organizing keywords, bidding strategies and budgeting, and targeting approaches (including geo, time-based, audience, content and domain targeting), and conversion tagging, tracking and attribution. Students will earn certifications for Google Search and Display, and gain experience with the Google Ads platform, including use of the keyword planning tool, setting up campaigns, ad groups and keywords, writing text and display ad copy, and applying proper settings at the account, campaign, ad group and ad levels. Finally, students will learn important principles for landing page design and become proficient building professional landing pages. Students cannot earn credit for both COMM 450A and MKTG 473.", "prerequisite": "COMM 450", "other": ["Cross-listed with: COMM 450A"]}, {"department": "IST", "number": "451", "credits": "3 Credits", "description": "Fundamental issues and concepts of network security, network security technologies and protocols, and emerging technologies in network security.  IST 451 Network Security (3) Information technology has become a key component to support critical infrastructure services in various sectors of our society. In an effort to share information and streamline operations, organizations are creating complex networked systems and opening their networks to customers, suppliers, and other business partners. Increasing network complexity, greater access, and a growing emphasis on the Internet have made information/network security a major concern for organizations.IST 451 focuses on network security. The course will provide the students with a comprehensive understanding of the fundamental issues and concepts of network security, and the mainstream network security technologies and protocols that are widely used in the real world. The course will also address emerging technologies in network security.A major component of the course will be several team-based hands-on attack-defense projects. Each project has two phases: the attack phase and the defense phase. A group may be asked to defend against the attacks enforced by another group. This course will incorporate collaborative and action-learning experiences wherever appropriate. Emphasis will be placed on developing and practicing writing and speaking skills through application of the concepts, theories and technologies that define the course.", "prerequisite": "IST 220"}, {"department": "IST", "number": "452", "credits": "3 Credits", "description": "Exploration of legal, regulatory, public policy, and ethical issues related to security and privacy for information technology professionals in public institutions, private enterprise, and IT services.  IST 452 Legal and Regulatory Environment of Privacy and Security (3) Institutional constraints on security historically focused on traditional criminal enforcement and a slow but steady increase in civil remedies through the twentieth century. Professional security protection could satisfy reasonable assurance criteria by managing legal and regulatory risks based on commonly-held understandings of burglary, theft, conversion and widely-understood but related institutional constraints in the protection of physical property. This focus retained effectiveness so long as physical security over tangible property appeared successful, even extending to the maintenance of control over mainframe computers and their peripherals. However, the proliferation of networked computers has made access and storage ubiquitous, vastly increasing the vulnerability of confidential data, private information and critical national security infrastructure. Security and privacy regulation compliance responsibility now falls much more harshly on both organizations and most of their individual personnel. These complex new duties constrain organizations in the data management industry as well as suppliers and users of data and all participants in the information supply chain, including consultants, software suppliers, applications service providers, maintenance, outsourcing and communications providers.Other factors exacerbate these liability risk management difficulties. Advances in network computer storage and use, the broadening perception of heightened value of information and the pervasive availability of rich data warehousing increase the vulnerability of data management. Risks of information theft and integrity losses as well as the explosion of privacy rights and national security concerns now require pervasive and fuller understanding of liability risk management principles/techniques among all managers and subordinates in the data management industry and in government. Information suppliers, handlers, owners and network service providers are increasingly exposed to civil litigation, regulatory oversight/compliance and criminal prosecution for various information-related wrongs. For example, confidentiality is compulsory for corporate trade secrets, privacy is required for personally identifiable information about individuals and secrecy is mandatory over matters of national security; all of which create complex legal duties that are fundamentally driving the design of information handling processes. This course surveys legal and regulatory constraints on information security and privacy practices.", "prerequisite": "IST 432"}, {"department": "IST", "number": "453", "credits": "3 Credits", "description": "Legal, regulatory and public policy environment of computer and network forensics that constrain investigatory and monitoring activities in computer and network environments.  IST 453 Legal, Regulatory, Policy Environment of Cyber Forensics (3) This course covers the major legal, regulatory and policy issues in cyber-forensics including, pre-trail discovery, production of electronic documents (electronic data discovery or EDD), custody, EDD cost balancing, admissibility of electronic evidence, \"business records,\" expert witness roles and qualification, constitutional rights to privacy and confidentiality, privilege, litigation support, forensic service providers, document retention standards, legal constraints on electronic records management, EDD employment policies, key EDD laws, civil, criminal and regulatory procedure and evidence, litigation holds, spoliation, obstruction of justice, interaction with inside and outside service providers and counsel, EDD strategy, audit trails, and multi-disciplinary relations with computer and network forensic experts. Students are exposed to the failure and successes of particular cyber forensic techniques in the dominant legal and regulatory forums.", "prerequisite": "IST 110"}, {"department": "IST", "number": "454", "credits": "3 Credits", "description": "Fundamental issues and concepts of computer forensics; aspects of computer and cyber crime; methods to uncover, protect, exploit, and document digital evidence; tools, techniques, and procedure to perform computer and cyber crime investigation.  IST 454 Computer and Cyber Forensics (3) Computer and communication technologies have become the key components to support critical infrastructure services in various sectors of our society. In an effort to share information and streamline operations, organizations are creating complex networked systems and opening their networks to customers, suppliers, and other business partners. Increasing network complexity, greater access, and a growing emphasis on the Internet have made information and network security a major concern for organizations.IST 454 focuses on computer and cyber forensics. Students will learn different aspects of computer and cyber crime and ways in which to uncover, protect, exploit, and document digital evidence. Students will be exposed to different types of tools (both software and hardware), techniques and procedure, and be able to use them to perform rudimentary forensic investigations.A major component of the course will be several hands-on exercises and a final team-based project. This course will incorporate collaborative and action-learning experiences wherever appropriate. Emphasis will be placed on developing and practicing writing and speaking skills through application of the concepts, theories and technologies that define the course.Integrated throughout are perspectives of computer and related legal process, including computer crimes from state and federal law, methods of interaction with law enforcement and prosecutors, admissibility of expert witness testimony and the use of forensic reports in civil, regulatory and internal investigations.", "prerequisite": "IST 220"}, {"department": "IST", "number": "456", "credits": "3 Credits", "description": "Contemporary Security Issues; security management processes, architecture and models; risk analysis and management; security planning, analysis and safeguards; security policies development and administration; contingency planning, incidence handling and response; and security standards and certification processes.  IST 456 Information Security Management (3) Communication technologies have become a key component to support critical infrastructure services in various sectors of our society. In an effort to share information and streamline operations, organizations are creating complex networked systems and opening their networks to customers, suppliers, and other business partners. Increasing network complexity, greater access, and a growing emphasis on the Internet have made information systems and network security a major concern for organizations. IST 456 focuses on security and risk management. Students will learn contemporary security issues; security management processes, architecture and models; risk analysis and management; security planning, analysis and safeguards; security policies development and administration; contingency planning, incidence handling and response; and security standards and certification processes.A major component of the course will be several case studies and a final team-based project. This course will incorporate collaborative and action-learning experiences wherever appropriate. Emphasis will be placed on developing and practicing writing and speaking skills through application of the concepts, theories and technologies that define the course.", "prerequisite": "IST 220"}, {"department": "IST", "number": "461", "credits": "3 Credits", "description": "Introduces advanced topics in database management systems that are fundamental  to effective administration of enterprise information systems.  IST 461 Database Management and Administration (3) The objective of the course is to enable a student to comprehend principles of database management and administration. The students will learn how data are stored (indexing), accessed (query processing), shared (currency and transactions), and controlled (security). Students will be creating and using these features in a database in the laboratory. They can then develop, use, and tune database systems and applications, utilizing advanced database management features. This course assumes basic familiarity with relational model, Entity-Relationship diagram, SQL query language, and normalization (as covered in IST 210). It builds the foundation on more advanced concepts of database systems that are fundamental to a career in database administration.", "prerequisite": "IST 210"}, {"department": "IST", "number": "462", "credits": "3 Credits", "description": "This course introduces advanced topics in database modeling and applicaitons.  IST 462 Database Modeling and Applications (3) The objective of the course is to enable a student to comprehend advanced database modeling and their applications. Students will model requirements using the advanced techniques and implement various applications in different domains. This course assumes basic familiarity with relational model, Entity-Relationship diagram, SQL query language, and normalization (as covered in IST 210). This course will cover more advanced topics in database modeling and database applications.", "prerequisite": "IST 210"}, {"department": "IST", "number": "489", "credits": "3 Credits", "description": "Seminar course focused on approaches to studying information and communication technologies and writing theses and other research reports.  IST 489H Research Methods for the Information Sciences and Technology (3) IST 489H provides students the opportunity to learn and experience: 1) Conceptualizing what are information and communications technologies. 2) Approaches to conducting research on, and reporting results of studies, of ICT. 3) The research process and its academic context.The course is designed around a series of ill-structured, contemporary, problems that require students to develop responses by applying research approaches to ICT. At the end of the course, students will be able to: 1) Apply different conceptualizations of ICT to common problems. 2) Select and initiate research on ICT. 3) Begin writing research-oriented work such as theses and papers.", "prerequisite": "IST 110", "other": ["Honors"]}, {"department": "IST", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "IST", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "This course is the mechanism by which students in the Schreyer Honors College who are conducting research with a faculty member affiliated with the IST undergraduate major will register for thesis credits. The course includes activities related to research, scholarship, and/or writing necessary for the completion of an approved honors thesis.", "other": ["Honors"]}, {"department": "IST", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised on or off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor", "other": ["Full-Time Equivalent Course"]}, {"department": "IST", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "IST", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "IST", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]