[{"department": "IT", "number": "1", "credits": "4 Credits", "description": "For beginners. Grammar, with reading and writing of simple Italian; oral and aural work stressed.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "IT", "number": "2", "credits": "4 Credits", "description": "Grammar and reading continued; oral and aural phrases progressively increased; composition.", "prerequisite": "IT   001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "IT", "number": "3", "credits": "4 Credits", "description": "Advanced grammar; oral and written composition; reading of modern authors; Italian life and culture.", "prerequisite": "IT   002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "IT", "number": "10", "credits": "6 Credits", "description": "Intensive Italian basic reading, writing, listening, and speaking skills stressed.  Lab.  Equivalent to IT 001 and half of IT 002.  IT 010 Intensive Elementary Italian (6)(BA) This course meets the Bachelor of Arts degree requirements. This course is intended for students with no experience of Italian. It provides an intensive language-learning environment in which to complete 6 credits of elementary Italian (equivalent to IT 001 and the first half of IT 002). Students receive an extensive introduction to Italian grammar, speech, and culture. Evaluation methods include a variety of written and oral exercises (presentations, compositions, quizzes, exams, etc.). All work is done in Italian. The course is offered once per year. Enrollment is limited to 18. The course can count toward the completion of the Italian minor. This course prepares students for IT 020, a continuation of elementary and intermediate Italian.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "20", "credits": "6 Credits", "description": "Continuation of Intensive Elementary Italian, building on grammar and communication skills (reading, writing, listening, and speaking).  IT 020 Intensive Intermediate Italian (6)(BA) This course meets the Bachelor of Arts degree requirements. This course is for students who have successfully completed IT 010 Intensive Elementary Italian, and who seek an Intensive learning environment of Italian grammar (all aspects: reading, writing, listening, and speaking). Students learn intermediate Italian in an intensive language-learning environment. Extensive reinforcement of elementary Italian grammar (reading, writing, speaking, listening) and introduction to intermediate Italian grammar, speech, and culture through a variety of written and oral exercises. All work is done in Italian. Homework in the accompanying workbooks is assigned each week. Pronunciation practice in the language lab is also required weekly. There are also supplementary grammatical and cultural activities on the course web page. Equivalent to last half of IT 002 and all of IT 003.", "prerequisite": "IT   010", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)", "Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "50", "credits": "1-3 Credits/Maximum of 3", "description": "Roundtable conversation practicum for students concurrently enrolled in IT 001, 002, 003, 010, or 020. May be repeated up to 3 times for credit.  IT 050 Italian Conversation Tutorial (1-3)(BA) This course meets the Bachelor of Arts degree requirements. Students supplement their elementary or intermediate language classes (001, 002, 003, 010, 020) with this practicum, which has as its objective to improve pronunciation and oral conversational skills. This course must be taken concurrently with an elementary or intermediate language course and may be repeated up to three times for credit. Evaluation based on student participation (80%) and performance in oral drills and exercises (20%).", "prerequisite": "Concurrent enrollment in IT   001 , IT   002 , IT   003 , IT   010 or IT   020", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "51", "credits": "3 Credits", "description": "Intensive introduction to Italian: first half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  IT 051 Elementary Intensive Italian for Graduate Students I (3)This is the first in a series of three courses designed to give students an intensive introduction to Italian. This is the first half of elementary sequence in reading, writing, speaking, listening, and cultural contexts. Students will learn the Italian vocabulary and will learn to create simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"department": "IT", "number": "52", "credits": "3 Credits", "description": "Intensive introduction to Italian: second half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  IT 052 Elementary Intensive Italian for Graduate Students II (3)This is the second in a series of three courses designed to give students an intensive introduction to Italian. This is the second half of graduate intensive sequence in elementary reading, writing, speaking, listening, and cultural contexts. Students will learn the Italian vocabulary. Lessons are taught in an authentic cultural context.", "prerequisite": "IT   051 or equivalent, and graduate standing"}, {"department": "IT", "number": "53", "credits": "3 Credits", "description": "Continued intensive study of Italian at the intermediate level: reading, writing, speaking, listening, cultural contexts.  IT 053 Intermediate Intensive Italian for Graduate Students (3)This is the third in a series of three courses designed to give students an intermediate intensive knowledge of Italian. Continued intensive study of Italian at the intermediate level: reading, writing, speaking, listening, and cultural contexts. Lessons are taught in an authentic cultural context.", "prerequisite": "IT   052 or equivalent, and graduate standing"}, {"department": "IT", "number": "83", "credits": "3 Credits", "description": "Introduction to the study of Italian literature and culture. IT 083S First Year Seminar in Italian Literature, Film, and Culture (3) (GH;IL)(BA) This course meets the Bachelor of Arts degree requirements. The first-year seminar will introduce students to the study of Italian literature, film and culture in their first year at Penn State. Students will read significant texts (in English), view videos (with subtitles), listen to music and explore Italian thought and culture in general. These experiences will help prepare students for additional courses in literature and in Italian as well provide a point of comparison with U.S. culture. In addition to the academic topic explored in this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them including the opportunity to develop relationships with faculty and other students who share their academic interests. This course satisfies both the first-year seminar and a General Education humanities or Bachelor of Arts humanities requirement. We will offer the course once every two years with enrollment limit of twenty students.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "First-Year Seminar", "General Education: Humanities (GH)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "IT", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "IT", "number": "130", "credits": "3 Credits", "description": "IT 130, Italian Culture and Civilization, examines Italian life from antiquity to the present. It is designated an International Cultures course, which aims to develop critical and analytical skills of undergraduate students through a global exploration of the historical, cultural, and political aspects of Italian society. Historical material will be studied to facilitate understanding of how Italian unity is imagined across time, and will emphasize the continuous process of fragmentation and negotiation of cultural, national, and political identity through the ages. The course traces, among other topics, the importance of the Roman Empire, the Catholic Church, the Renaissance, Italian Unification, Fascism, and contemporary immigration to Italy. Students will analyze primary texts -- literature, visual art, essays and speeches, music, dramatic works, and film -- to become familiar with significant aspects of Italian thought and culture. Consideration will be given to the various representative Italians such as Dante Alighieri, Leonardo Da Vinci, Niccolò Machiavelli, Galileo Galilei, and Vittorio De Sica; inclusion of lesser-known figures, such as Igiaba Scego and Amara Lakhous, will provide students with a wider range of voices that will enrich critical engagement with course themes. By the end of the course students will be able to identify and critically analyze diversity within the peninsula, and demonstrate a familiarity with the key moments, people, and products of Italian culture from antiquity to the present. Throughout the semester, students will also be encouraged to develop a critical appreciation of the influence of Italian culture on Western civilization, and demonstrate a more nuanced understanding of the country by recognizing and articulating similarities and differences among the various international cultures that have influenced, and continue to shape Italy.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "IT", "number": "131", "credits": "3 Credits", "description": "Between 1870 and 1920 over five million Italians immigrated to the United States. Of those who came, about one-third returned to Italy. Those who remained, often joined by their families, left an indelible mark on the American cultural, political, artistic, educational and social landscape. This course provides an overview of Italian emigration to America in the 19th and 20th centuries and the conditions within the United States as a destination culture. Through a study of historical, sociological, literary and cinematic texts, students will consider, among other topics: 19th Century Italy, the odyssey of immigration to and assimilation in the United States, and life in the ethnic neighborhood. The course will also look at the Mafia, forms of prejudice, and ways Italians uniquely manifested their social values in labor unions, religion and education in America. Upon successfully completing this course, students will have a solid grasp of how Italians, in becoming Americans, contributed to the rich fabric of life in the United States.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "IT", "number": "140", "credits": "3 Credits", "description": "IT 140 prepares students for study abroad in Italy through contact with language and customs and through the inclusion of pragmatic information and cultural intelligence/sensitivity. IT 140 splits equal classroom time between developing basic language skills and providing important cultural information. Pronunciation, key vocabulary terms and scenario-based instruction form the basis of the language portion. Vocabulary sets include travel (emphasis on public transportation), cuisine (cafe and restaurant settings), navigation (using maps, giving/receiving directions), health (pharmacy and doctor's office settings) and shopping (open air market and boutique settings). These areas of content naturally overlap with cultural lessons as does learning to use formal and informal registers. Accordingly, cultural lessons deal with these topics as well as geography (including regional variations), history and safety. Italian 140 is both GH and IL. This course does not count for the Italian major or minor.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "IT", "number": "175", "credits": "3 Credits", "description": "IT175 Italian Language and Culture for Embedded Experiences Abroad, is designed for students who have little or no knowledge of Italy's language and culture. This course is linguistic and cultural preparation for students participating in an embedded experience in Italy. Properly preparing for study and travel to Italy helps students to maximize the abroad experience. The ability of students to function abroad can be greatly facilitated by an understanding of the local culture and language. Students will be introduced to key Italian social and cultural issues, pragmatic information (for travelers, students, and residents of Italy) as well as essential vocabulary terms, phrases, and pronunciation. The course also explores themes of cultural intelligence/sensitivity and proper behavior abroad. IT175 is designed to be taught as a co-requisite for any course with an embedded experience in Italy (e.g. BIOL 475N Anatomy in Italy). With this co-requisite, particular emphasis is placed on vocabulary relevant to the embedded experiences in history of science/medicine museums, university settings and religious institutions.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "IT", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "IT", "number": "210N", "credits": "3 Credits/Maximum of 6", "description": "SPAN 210N Multilingual and Intercultural Communication course will showcase the fundamental components of the intersection of language and culture through humanities and social science. The purpose of this course is to teach the underlying mechanisms of multilingualism through language science principles and develop an understanding of intercultural communication through humanistic approaches. The content of this course focuses on linguistic strategies for succeeding in multilingual environments (e.g. dialect variation, second language acquisition strategies) as well as intercultural communication practices for navigating new environments (e.g. understanding cultural norms, skills for global leadership). The course requires an introductory level understanding of language. Students will learn how language and culture inform each other through the examination of cultures within the United States and internationally, including non-Western cultures.", "prerequisite": "SPAN 3", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "IT", "number": "225N", "credits": "3 Credits", "description": "IT 225N / CRIM 225N, Organized Crime in Film & Society, examines the relationship between criminological and justice theories regarding organized crime and the portrayal of the mafia in popular Italian American film. The course follows two simultaneous threads of inquiry: an examination of historical and theoretical models of organized crime in the United States and the state and federal laws that address them; and an analysis of how such models are depicted in American films and television about the the Italian American community. By the end of the course, students will gain key literacy skills by identifying varied definitions of organized crime and distinguishing between structural models, particularly La Cosa Nostra and network models. Students will also sharpen analytical and critical thinking skills through written and spoken interpretations of films and the scholarly approaches to studying organized crime (e.g. research methods). Throughout the semester students will also be able to apply knowledge of the social scientific aspects of organized crime to guide their observations and analyses of film and Italian American culture, thus refining Integrative Thinking across the humanities and social sciences.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "IT", "number": "240Q", "credits": "3 Credits", "description": "This course surveys the institutions and social networks in which European fine arts were created, consumed and critiqued. Beginning with the medieval period and ranging to the early 20th century, the course will examine the variety of communities where public and private often intersected and which sponsored innovations in the arts. Often indexing social movements and political change, such communities include convents and cathedrals, royal academies and courts, coffee houses, salons, and theaters. Artists, performers, patrons, politicians, journalists, and others collaborated and competed in these spaces. Such communities could embody political and economic power, or foster resistance to it. This approach to the history of the arts in western culture puts the focus less on the individual creative genius of great composers, writers, painters, and sculptors, and more on the social exchanges and institutions that sponsored and received their work. Such an approach brings to light particularly the ways in which women played significant roles in the production and reception of culture: as salon hostesses, patronesses, and divas, women often enabled and enacted cultural production. Some examples of particular units of study might include: the German convent of Hildegard of Bingen (1098-1179), where monophonic chant and allegorical morality plays developed; the Mantuan (Italy) court of Isabella d'Este ,the first lady of the world, (1474-1539) where the roots of the madrigal began and where notable painters found support and sponsorship; the French salons of Mme. Geoffrin (1699-1777) and Mme. de Staël (1766-1817); and the student residences in Madrid where avant-garde writers and artists interacted. Each unit will also consider the relationships between the aesthetic norms and values of a period and the economic and political realities of sponsorship. The course will require that students attend at least one musical performance or concert held on campus during the semester and complete a brief writing project based on that experience. This requirement will encourage students to think about their own university as a contemporary space of cultural sponsorship.", "other": ["Cross-listed with: CMLIT 240Q, HIST 240Q, WMNST 240Q", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "IT", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "IT", "number": "301", "credits": "3 Credits", "description": "For majors, minors, and others with adequate preparation; deepening of grammatical skills, integrated conversation, composition, and reading.  IT 301 Pathways to Fluency (3) For majors, minors, and others with adequate preparation, students in this course review grammatical skills through conversation, class debates, reading, and writing assignments based on contemporary cultural materials (web sites, music lyrics, newspaper and magazine articles, etc.) Prerequisite: IT 003. Evaluation methods include class participation, in-class activities (both oral and written), composition, and exams.", "prerequisite": "IT   003", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "IT", "number": "310", "credits": "3 Credits", "description": "Focus on intensive oral communication practice, designed to provide students pursing upper-level course work in Italian an opportunity to develop advanced intermediate speaking skills. Class time is dedicated to oral practice in small and large group discussions. Prerequisites: IT 3 or IT 20, or permission of program. Course counts toward Italian major and minor.", "prerequisite": "IT 3"}, {"department": "IT", "number": "320", "credits": "3 Credits", "description": "This course focuses on cultural, historical, and sociopolitical issues of Italy, with a particular emphasis on contemporary current events, and by utilizing advanced grammatical tools. Students will be exposed to authentic material from books, newspapers, magazines, comics, movies, songs, the web, and they will deal with topical aspects of the Italian culture: not only food, fashion, and family, but also art, graffiti, cinema - as well as current sociopolitical issues such as immigration, racism, integration, lgbtq rights, and feminism. Evaluation methods include quizzes, exams, current events reviews, class discussions, and oral presentations. This course is in Italian.", "prerequisite": "IT 20", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "325", "credits": "3 Credits", "description": "Focus on the art, literature, and philosophy of Italy from the Renaissance to present.  In Italian.  IT 325 Introduction to Italy's Genius (3) In this course students develop their advanced grammar and conversational skills through readings and class discussions of a variety of works in the Italian arts (literature, art, philosophy, etc.). Taught in Italian. Evaluation methods include class participation, exams, and writing assignments. Prerequisite: IT 003. Course counts toward the Italian major and minor. Offered once per year. Enrollment limited to 20.", "prerequisite": "IT   003"}, {"department": "IT", "number": "330W", "credits": "3 Credits", "description": "A survey of the greatest books of Italian literature (prose, poetry, drama). Time period varies each semester.  In Italian.  IT 330W Greatest Books of Italian Literature (3) This course is a survey of the greatest books of Italian literature (prose, poetry, drama). Time period varies each semester, and may include early literature (St. Francis, Marco Polo, Dante, Boccaccio, Petrarch, Machiavelli, etc.) or modern authors (Vico, Goldoni, Manzoni, Foscolo, Leopardi, Pirandello, Fo, Calvino, Eco, etc.). Please check with department faculty for current offering. Taught in Italian. Course objectives are to read, discuss, and better understand the enduring relevance of Italy's literary masterpieces, while strengthening linguistic skills in writing (especially), as well as reading, speaking, and listening, through weekly or bi-weekly written reading reactions, critical notebooks, and class discussions/participation. Course is appropriate for students who have successfully completed an intermediate Italian course (such as IT 003 or 020) and counts toward the Italian major (all tracks) and minor. Successful completion of this course may permit further Italian study at the 400-level.", "prerequisite": "IT   003 , IT   020 , or permission of program", "other": ["Writing Across the Curriculum"]}, {"department": "IT", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Advanced training in Italian language skills.", "prerequisite": "IT   003", "other": ["International Cultures (IL)"]}, {"department": "IT", "number": "412", "credits": "3 Credits", "description": "Advanced practicum in Italian explores the technical, artistic, and practical applications of translation between Italian and American cultures.  IT 412 Theory and Practice of Translation (3)(BA) This course meets the Bachelor of Arts degree requirements. This course explores the technical, artistic, and practical applications of translation between Italian and American cultures in wide variety of contexts: literature, technical writing, film subtitling, etc. Taught in Italian. Evaluation consists of reading quizzes, short translation assignments, class presentation, longer (roughly 10-page) individual final translation project. Prerequisite: Any 300-level course in Italian.", "prerequisite": "any 300-level course in Italian", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "415", "credits": "3 Credits", "description": "Readings in the Divina Commedia and the related lesser works of Dante Alighieri.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "422", "credits": "3 Credits", "description": "Topics vary by year and may include \"Theories of Love,\" \"Magic, Witchcraft, Alchemy, and the Emergence of Modern Science,\" etc.  IT 422 Topics in the Italian Renaissance (3)(BA) This course meets the Bachelor of Arts degree requirements. In this course students develop their advanced language skills while pursuing study of Italian Renaissance and/or Humanist topics. Topics in Italian Renaissance literature vary by year and may include; \"Theories of Love\" ; \"Magic, Witchcraft, Alchemy, and the Emergence of Modern Science\" etc. Check with faculty for current topic. Course may only be taken once for credit. Course counts toward the Italian major and minor. Course taught in Italian. Evaluation methods include two midterms, short reading response papers, class presentation, and final exam. Prerequisite: any 300-level Italian course.", "prerequisite": "any Italian course at the 300-level", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "430", "credits": "3 Credits", "description": "This course, conducted in Italian, examines Italian children's books from the post-unification period (1880s) to the present day.", "prerequisite": "any 300-level IT course"}, {"department": "IT", "number": "450", "credits": "3 Credits", "description": "Italian romanticism, Verismo and neoclassicism, their origin and development in the novel, poetry, and drama.", "prerequisite": "any 300-level IT course", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "460", "credits": "3 Credits", "description": "Modern and contemporary Italian prose, drama, and poetry.", "prerequisite": "any 300-level IT course", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "470", "credits": "3 Credits", "description": "This course explores ghost storytelling and visions of the afterlife in early Italian literature and culture. Motivations for telling ghost stories go far beyond entertaining or inducing fear in an audience. Ghost stories can engage some of the most profound human inquiries, mortality, grief, commemoration, spirituality, ethics, human imagination, and the violations of proper societal behavior. This course will explore such issues in a range of readings (poetry, short stories, diaries, and dialogues), including works by Dante, Boccaccio, Petrarch, Ficino, Machiavelli, and Ariosto. In addition to a foundational survey knowledge and contextualization of some of the greatest works of medieval/Renaissance Italian literature, successful students of this course will receive a deep understanding of the potentials of authorial power and the rhetorical strategies that storytellers use to convince or manipulate the beliefs and emotions of their readers through close study of the primary texts, active in-class discussions, practice in critical interpretation, and individual experiments in the creative composition of spirit narratives. This 3-credit course is taught in English, and no knowledge of Italian is expected.", "prerequisite": "5TH SEMESTER STANDING"}, {"department": "IT", "number": "475", "credits": "3 Credits", "description": "Focus on silent films, fascism, WWII, Resistance, Neorealism, and reactions against Neorealism.  IT 475 Modern Italian Literature and Cinema (3)(BA) This course meets the Bachelor of Arts degree requirements. This course will explore the literary, cultural, and historical backdrops behind a variety of films from Fellini's The Road, to one of the greatest spaghetti westerns ever made (Leone's Once Upon a Time in the West), to the Oscar winner for Best Foreign Film (Benigni's Life is Beautiful). Selected 19th and 20th-century prose texts also trace such issues as the individual's role in society and the use of the imagination in the representation of history. This course aims to provide students with the fundamental tools to read texts and watch films critically and intelligently while presenting an overview of some major themes of Italian culture. Students will be evaluated on three in-class exams, paper outline, final paper, and participation in class discussions/activities/debates. IT 475 is the first interdisciplinary course taught in English at the IT 400 level. The course helps satisfy the Italian minor requirement. It is also good for students who have taken IT 130 and want to know more about 20th-century Italian lit/film/culture without having to do course work in Italian. IT 475 may also be of particular interest to students of film and media studies, English or comparative literature, religious studies, and history. This course satisfies the Italian minor or bachelor of arts humanities requirements. IT 475 will be offered once a year with 40 seats per offering.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "480", "credits": "3 Credits", "description": "Analysis of the works of women authors in their historical and literary contexts.  IT 480 Italian Women Writers Through the Centuries (3) Italian women have been stereotyped as the \"mamma\" or grandmother who cooks, prays, and idolizes her sons. Such an image does not accommodate the wide variety of experiences, perspectives, and contributions of Italian women throughout history. This seminar will explore the writings of female authors from delimited historical periods (alternating among Renaissance, 19th and 20th Centuries). Depending on time period, genres will include autobiography, poetry, historical novel, drama, film, nonfiction. Throughout the course we will consider the political and social developments in Italy with an emphasis on issues of special relevance to women. As we approach each text, we will examine such questions as: the significance of its form; the author's use of language; the ways in which masculinity and femininity are constructed; intersections with the text's historical moment; the political, philosophical and/or theological questions posed by the text; the ways in which the text inserts or distances itself from the Italian literary canon; and the text's depictions, re-evaluations and uses of history. Through their journal assignments in class discussion, students will be encouraged to reflect upon the implications of course concepts in their own culture and historical moment. Evaluation methods include participation in class discussion, journal entries, short analysis papers, and a longer (8-10 page) research paper. In Italian. Prerequisite: any 300-level Italian course. This course is conducted in Italian and counts for the Italian major and minor. The ability to screen VHS and DVD videos is necessary. Enrollment is limited to 20, and the course will be offered at lease once every four semesters.", "prerequisite": "junior standing or permission of program", "other": ["Cross-listed with: WMNST 480"]}, {"department": "IT", "number": "485", "credits": "3 Credits", "description": "In-depth exploration of Italian-American cultural contributions.  IT 485 Italian-American Cultural Studies (3) Italian-American Cultural Studies explores the representation of self-representation of Italian-Americans that have been produced over the past century in a variety of aesthetic forms. Through analysis of literary and cinematic works, informed by readings in history and sociology, students will refine their critical reading and writing skills, come to a deeper understanding of important currents in 20th-century American history, gain a more informed appreciation of the contributions of Italian-Americans to the arts, engage critically with concepts such as \"identity\", \"ethnicity\", \"gender\", and \"heritage\". This course fulfills requirements for the major and minor in Italian, and allows students interested in Italian-American culture to undertake more in-depth and specialized study than is possible in the 100-level General Education survey offered by the department in English. Evaluation methods include participation in class discussion, short analysis papers, and a longer (8-10 page) research paper. The ability to screen VHS and DVD videos is necessary.", "prerequisite": "junior standing or permission of program"}, {"department": "IT", "number": "490", "credits": "3 Credits", "description": "The reading of Dante's Divine Comedy and selected minor works.", "prerequisite": "junior standing or permission of instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "IT", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "IT", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}]