[{"department": "KINES", "number": "1", "credits": "1.5-3 Credits/Maximum of 12", "description": "Introduction to Outdoor Pursuits (KINES 1/ RPTM 1) is a course that is designed to introduce the student to selected outdoor pursuit activities. The selected activities will depend on the time of the year and availability of resources. The activities could include but are not limited trail day hiking, mountain biking, backpacking, orienteering, kayaking, canoeing, cross country skiing, or to rock climbing experiences. All selected activities will follow the same basic format of skill development and training procedures, history and philosophical underpinnings of the activity, available written resources and professional organizations related to the activity, logistical equipment preparation, appreciation of environmental impact of partaking in the selected activity, safety management / risk assessment and future opportunities to participate in the activity. It is a purpose of this course to allow the student to explore different outdoor pursuit activities and then to make a more informed decision as to which activities they might choose to further develop their skill base and competency necessary to partake in the activity at a more advanced level on a life long basis. Through opportunities to develop camaraderie through collaborative work/ teamwork, students practice safe participation in the selected activities with attention to environmental impact. Students will experience a common skill base from which to engage in the activities. After completion of the course, students are encouraged to engage in adventure recreation programs, and other appropriate courses to help with the continued development of life skills. This course fulfills credits toward the GHW General Education requirement.", "other": ["Cross-listed with: RPTM 1", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "1Z", "credits": "1.5-3 Credits/Maximum of 6", "description": "Introduction to Outdoor Pursuits (KINES 1Z/ RPTM 1Z) is a course that is designed to introduce the student to selected outdoor pursuit activities. The selected activities will depend on the time of the year and availability of resources. The activities could include but are not limited trail day hiking, mountain biking, backpacking, orienteering, kayaking, canoeing, cross country skiing, or to rock climbing experiences. All selected activities will follow the same basic format of skill development and training procedures, history and philosophical underpinnings of the activity, available written resources and professional organizations related to the Course Justification activity, logistical equipment preparation, appreciation of environmental impact of partaking in the selected activity, safety management / risk assessment and future opportunities to participate in the activity. It is a purpose of this course to allow the student to explore different outdoor pursuit activities and then to make a more informed decision as to which activities they might choose to further develop their skill base and competency necessary to partake in the activity at a more advanced level on a life-long basis. Through opportunities to develop camaraderie through collaborative work/ teamwork, students practice safe participation in the selected activities with attention to environmental impact. Students will experience a common skill base from which to engage in the activities. After completion of the course, students are encouraged to engage in adventure recreation programs, and other appropriate courses to help with the continued development of life skills. This course fulfills credits toward the GHW General Education requirement. KINES 1Z/RPTM 1Z is linked to ENGL 183Z; the two courses must be taken concurrently.", "prerequisite": "ENGL 183Z", "other": ["General Education: Health and Wellness (GHW)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "4", "credits": "1.5 Credits", "description": "KINES 4 is a unique course designed to give students of all experience levels an introduction to the lifetime sport of fly fishing. The purpose of the course is to present the students with the many aspects of fly tying and fishing for trout, so that they can enjoy outdoor activity for the remainder of their active lives. In KINES 4, students acquire the knowledge, skills and tactics they will use to solve problems in the constantly changing natural environment. Instruction includes, but is not limited to: conditioning, basic fly tying, tying local patterns, appreciation for conservation techniques, equipment use/care/selection, fly casting, aquatic entomology, stream hydrology, fly fishing tactics, basic knots and experiencing local streams.  Because of the geologic location, students have access to the premiere fly fishing streams in the eastern United States. These streams are a destination for fly fishing minded individuals and provide an outstanding opportunity for practice of a new healthy activity. In this active course, students apply what is learned to enhance the basic understanding of the sport and to experience the full complement of wellness components. Students will find that they have enhanced their quality of life now and for the remainder of their lives. Appreciating the rich history, this course models that of the first accredited university fly tying and fishing course started in the 1930s by Mr. George Harvey, known as the \"dean of fly fishing\" at Penn State (\"Fly Fishing U\").", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "6", "credits": "1.5-3 Credits", "description": "KINES 6 introduces students to the performance of cycling as a lifelong activity that helps maintain and enhance physical fitness and overall wellness. This course provides the information that the student needs to understand, organize, plan and implement a physical fitness program that features cycling as a primary activity. The centerpiece of this course is a progression of individually-paced rides of varying lengths that are conducted over various terrains and potentially utilizing both indoor and outdoor training. Cycle conditioning typically includes a longer group trail ride utilizing designated cycling trails such as the Rails to Trails system. Students may experience opportunities to attempt individual time trial, interval training, and indoor, road or trail riding depending on the offering. Additionally, students are exposed to such topics as the physiology of exercise, cycling safety, goal-setting for personal health, principles and concepts of physical fitness, training methods to address different cycling goals, and nutrition and weight control. Students also have the opportunity to monitor their performance throughout the course using a variety of personal assessment inventories and instruments and are encouraged to utilize current technologies such as heart rate monitors and fitness apps. A student who completes KINES 6 will be able to identify the components of an effective physical fitness program and explain how cycling contributes to the success of this program, develop realistic fitness goals and design a cycling program to meet these goals, perform a variety of fitness cycling techniques, and understand how cycling promotes psychological well-being.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "10", "credits": "1.5 Credits", "description": "KINES 10 is a course designed to give students a comprehensive introduction to the skills, safety, terminology and equipment used in the sport and recreational activity of rock climbing. This course also provides the knowledge base and experience the student needs to evaluate their continued safe participation in rock climbing. There is an emphasis on belaying, technical systems, use and selection of equipment, climbing technique, and the metaphorical and psychological aspects of climbing. Students learn and practice proper physical aspects of climbing focusing on foundational training and conditioning through cardiovascular, strength, and flexibility movements. Important information on training, safety issues, injury prevention and treatment, and gaining appreciation for conservation and preservation of resources are included in the course. The rock climbing surface provides a conduit to promote lifelong wellness by engaging the entire body and mind to be physically challenged and mentally stimulated. Rock climbing challenges the participant to take risks, to work with others to solve problems and make informed decisions, and to learn to trust in partners. Students may be exposed to a wide range of climbing opportunities including indoor and/or outdoor experiences. In this course, students practice responsibility, cooperation, and collaborative skills. Teamwork and communication are essential components to the success of the student; students typically work together as climber, belayer (method of securing a climiber by the use of a rope), and observer. The group connection is dependent on building communication and trust. Students provide constructive feedback and positive encouragement to one another during climbs.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "10A", "credits": "1.5 Credits", "description": "Kinesiology 10A is designed to give students a comprehensive introduction to the skills, safety, terminology and equipment used in the activity of lead rock climbing. Lead climbing involves the climber placing protection to protect oneself as opposed to top roping (KINES 10). This course also provides the knowledge base and experience the student needs to evaluate their continued safe participation in lead rock climbing including a strong group work ethic and practicing the responsibility, cooperation, and collaborative skills needed for safety in lead rock climbing. In Lead Rock Climbing, students are introduced to advanced climbing techniques such as: footwork, hand holds, and body positions and benefit from immediate encouragement and assessment from the group. Lead climbing challenges the climber to be more critically aware of making good decisions in clipping, route choice and direction, back-stepping if necessary, body positions, equipment use, and safety. This class delves more deeply into issues of kinesthetic awareness of the climber's relationship to the climbing surface and to gravitational forces when climbing. Students learn and practice proper physical aspects of climbing focusing on foundational training and conditioning through cardiovascular, strength, and flexibility movements. Important information on training practices, safety issues, injury prevention and treatment, and understanding the climbing environment are important aspects of the course. The climbing surface provides a conduit to promote lifelong wellness by engaging in the entire body and mind to be physically challenged and mentally stimulated. Rock climbing challenges the participant to take risks, to work with others to solve problems and to make informed decisions. Students may be exposed to a wide range of climbing opportunities including indoor and/or outdoor experiences including bouldering and more advanced rock climbing techniques.", "prerequisite": "KINES 10", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "11", "credits": "1.5 Credits", "description": "KINES 11 is designed to help students build overall fitness and wellness based in winter snowsports, specifically downhill skiing. Students acquire the knowledge and critical thinking skills that are essential to the development and continual evolution of a fitness and wellness plan focused on a healthy and active lifestyle that includes cold weather exercise. Students explore such topics as wellness, training principles, cold weather injury and illness prevention and management, and proper mechanics to promote safety and success on snow. Downhill skiing is a popular recreational physical activity in a global market. The early days of skiing in the United States were typified by a variety of styles and techniques, many of which were brought to this country by European ski instructors. As the equipment and the snowmaking capabilities change, these changes are translated into adapting techniques for successful skiing. Downhill skiing can be performed across all ages and skill levels; in KINES 11, students are grouped appropriately by ability, so all students can be challenged individually on snow. If done properly, downhill skiing will promote comprehensive wellness while developing important life-long motor skills. Ultimately students will learn the benefits of downhill skiing as a lifetime activity for health and wellness.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "11A", "credits": "1 Credits", "description": "Students will gain a comprehensive understanding and intermediate to advanced level of proficiency in Downhill Skiing.  KINES 011A Intermediate Downhill Skiing (1) (GHA) Downhill skiing has grown as a recreational physical activity over the past century. The early days of skiing in the United States were typified by a variety of styles and techniques, many of which were brought to this country by European ski instructors. In 1961, the Professional Ski Instructors of America was formed to unify ski instruction across the country and to develop a successful standard for teaching people to ski. As the equipment and the snowmaking capabilities have changed so has PSIA changed and adapted the techniques to successful skiing. Downhill skiing can be performed at any level across all ages. If done properly, downhill skiing will promote comprehensive wellness while developing important life-long motor skills. This course will promote the proper and safe way to enjoy downhill skiing. Ultimately students will learn the benefits of downhill skiing as a lifetime activity for health and wellness.Students will be evaluated using a standard percentage scale. Evaluation is based on attendance and active participation (25%); demonstration of acquired skills (55%), theoretical knowledge as measured by written exam (20%). Five sections will be offered every Spring Semester with a maximum enrollment of 75 per section.", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "12", "credits": "1.5 Credits", "description": "KINES 12 is designed to help students build overall fitness and wellness based in winter snowsports, specifically snowboarding. Students acquire the knowledge and critical thinking skills that are essential to the development and continual evolution of a fitness and wellness plan focused on a healthy and active lifestyle that includes cold weather exercise. Students explore such topics as wellness, training principles, cold weather injury and illness prevention and management, and proper snowboarding mechanics to promote safety and success on snow. Snowboarding is a popular winter recreational physical activity. The early days of snowboarding in the United States were typified by a variety of styles and techniques. As the equipment and snowmaking capabilities continue to change, these changes are translated into adapting techniques for successful snowboarding. Snowboarding can be performed across all ages and skill levels; KINES 12, students are grouped appropriately by ability, so all students can be challenged individually on snow. If done properly, snowboarding will promote comprehensive wellness while developing important life-long motor skills. Ultimately students will learn the benefits of snowboarding as a lifetime activity for health and wellness.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "13", "credits": "1.5 Credits", "description": "KINES 13 provides students with the knowledge and skills necessary to assess and recognize an emergency situation, call for help, and administer basic first aid & cardiopulmonary resuscitation (CPR) with an automated external defibrillator (AED) while maintaining appropriate personal safety precautions. Students are trained to use specific techniques that are current with the practicing standards of the American Red Cross or American Heart Association organizations. Students receive information on the prevention of injury and illness, with a focus on personal safety. Participants assess their environment and personal habits to help reduce their risk of injury and illness and risk to others.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "17", "credits": "1.5 Credits", "description": "KINES 17 introduces students to ballroom dance as a social/recreational or competitive activity, with the goal of leading to an active lifestyle. This course provides the basic skills and information necessary to develop and continue one's appreciation for and interest in ballroom dancing. Dance history and etiquette, cooperation with a partner, and learning the fundamental of leading/following techniques are stressed from the beginning of the semester. As different dances are introduced (i.e. FoxTrot, Waltz, Jitterbug/Swing, Cha-Cha-Cha, Tango, Slasa, etc.), additional terminology and movement patterns are included. Students must combine skills in a variety of ways: timing movement to music, executing dance relevant movements, and interacting with partners. The remainder of the class has the option of practicing or observing. Outside opportunities for dancing are encouraged within Penn State and the local community. This class involves continuous movement for cardiovascular and muscle fitness as well as stretching and strengthening of the muscles to develop and improve posture, balance, coordination and flexibility. Students explore the importance of general fitness and wellness as paths to lifetime activity participation. The weight-bearing, low-impact benefits of Ballroom Dancing allows for maintaining bone density over time. Ballroom Dancing is a lifetime activity and provides an opportunity to encourage physical activity.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "KINES", "number": "20", "credits": "1.5 Credits", "description": "KINES 20 is a beginner's level course designed to provide students with an introduction to the motor skills and cognitive understanding needed for expression through modern dance. This class explores the use of weight, time, space, and energy in relation to a release based on modern dance technique. There is emphasis placed on the development of personal movement vocabulary, experimentation, and self-expression. Modern dance is grounded in somatic practices with importance placed on finding organic or efficient ways to engage the body in movement. By the end of the course, students will develop an appreciation for the lifetime benefits offered by expression through dance and will understand how dance can be incorporated into a lifetime pursuit of health and wellness.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "24", "credits": "3 Credits", "description": "KINES 24 is divided into three equal units that are designed to give students the opportunity to explore three different sports that have the potential for lilfetime participation. This format will give students an opportunity to gain a breadth of information and experience that will serve as a gateway to learning opportunities in more advanced classes that offer more depth and focus. Such sports may include, but are not limited to: racquet sports, winter sports, archery, bowling or golf. Sports that have lifetime social and wellness values may be offered due to specific location considerations such as unique facilities or faculty expertise. This course provides information not only specific to the sports included, but also on how to incorporate those sports into one's fitness plan throughout life, the potential fitness and wellness benefits of regular participation in the sport, injury prevention, and sportsmanship/etiquette to promote lifelong participation. Participating in lifetime sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "25", "credits": "1.5 Credits", "description": "KINES 25 is a course that has been designed to give the Penn State student an introduction to selected lifetime racquet sports such as but not limited to tennis, racquetball, squash, table tennis, badminton, handball, pickleball, and/or other court sports. By the end of the course, each student will possess a basic knowledge of a selection of racquet sports that will allow them to be a knowledgeable spectator or participant over the lifespan. KINES 25 is offered in as a series of modules with two to three racquet sports selected for the course content for the semester. Selections of included sports are noted by section in the schedule of courses. The fundamental skills, strategies, etiquette, and rules will be covered for each racquet sport included in the course. Successful completion of this course serves as a 'gateway' to advanced level courses in court sports, intramural and recreational play and provide the skills and knowledge necessary to participate in a lifetime activity. In addition to acquisition of knowledge and skill in a variety of racquet sports, students will examine the level of fitness necessary for successful participation in such sports, the potential fitness benefits of participating in racquet sports on a regular basis, and the social benefits associated with the betterment of one's well-being and quality of life. Furthermore, students will explore proper training techniques, injury prevention, and fitness habits that may aid their enjoyment of a variety of racquet sports in pursuit of wellness over the lifetime.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "26", "credits": "1.5 Credits", "description": "Course designed to introduce students to Archery/Bowhunting.  KINES 026 Archery/Indoor & Outdoor (1.5) (GHA) KINES 026 is designed to give the Penn State student an introduction to archery from a historical perspective which includes, but is not limited to, cultural use of the bow and arrow for food, protection, recreation and competition. Emphasis is given to the unique role of the bow in Pennsylvania State History and to its role in Pennsylvania Rural Culture. The use of the longbow, the recurve bow, the compound bow and the crossbow will be covered. In addition, Archery can be an activity that provides a positive outlet for those who are physically challenged. The fundamental skills, strategies, rules and regulations will be covered for Archery. Students are encouraged to develop specific outdoor skills which will enhance their success with a bow. These skills include but are not limited to identifying weather patterns which affect shooting, shooting from different heights and angles, selection of the proper clothing, understanding and respecting the wildlife and game animals native to geographical areas. Emphasis is placed upon ethical harvest techniques consistent with current wildlife biology and respective game commission and wildlife managers. Successful completion of the course will provide a foundation for participation in intramural activities, recreational coeducational activities, and will provide a gateway to lifelong movement. While KINES 026 will focus on the skills, strategies and rules of the sport, the underlying sub-focus of the course is the development of persistence and discipline necessary for success and the resulting self-enhancement that accompanies personal success. The commitment to Archery requires students to develop a focus which is achieved only through rigorous attention to fine motor movement. The improvement of individual skills in Archery is important but the process required for target success can be a foundation for a lifelong recreational opportunity. KINES 026 will focus on the skills strategies and rules of archery. Students will be engaged in a collaborative atmosphere. As they seek to solve complex shooting problems they will be required to cooperate to achieve various team goals. Students are evaluated and graded by a combination of techniques which may include but are not limited to tournament performance, written reports, skill acquisition, logged activities and subjective evaluation of team-building ethics. Dress should be appropriate for the conditions (indoor or outdoor). Equipment for this course will be provided but students will be encouraged to purchase their own personal equipment as 'personalized bows' greatly enhance a person's on-target efficiency. Frequency of enrollment: Two to four sections every fall and spring semesters with a maximum of 20 students per section. Facilities: There is an existing range in White Building, however the activity can be taught outdoors.", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "27", "credits": "1.5 Credits", "description": "KINES 27 is a course designed to give the student the understanding, knowledge and skills to begin an exploration of the game of badminton. While the primary focus of this course is shot development and acquiring an understanding of rules, regulations, and terminology, subsequent effort will emphasize the development of movement skills and a progression from rallying to game play. By the end of the course, each student will possess a basic knowledge of the game of badminton that will allow them to be a knowledge spectator or participant int he game of badminton over the lifetime. KINES 27 delivers badminton as a lifetime sport. Students will examine such content as the minimum level of fitness necessary for successful participation in the game of badminton, the potential fitness benefits of participating in badminton on a regular basis, promoting lifetime wellness through activity, and the social benefits associated with the betterment of one's well-being and quality of life. Perhaps the most unique feature of Badminton is the regular on court practice. Each week during this course, students will have a chance to apply the skills they have learned during the week on an actual badminton court. This situation creates an ideal practice areas for the student badminton player to become acquainted with the situational application of badminton skills and to engage in and promote community in badminton.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "29", "credits": "1-1.5 Credits", "description": "KINES 29 is a beginner¿s level course designed to give students the understanding, knowledge and skills to begin an exploration of the game of golf. While the primary focus of this course is the short game, 100 yards and in to the green, students will also develop proficiency in short and mid-range irons. By the end of the course, each student will possess a basic knowledge of the game of golf that will allow them to be a knowledgeable spectator or participant in the game of golf. KINES 29 also explores golf as a lifetime sport. Students will examine the level of fitness necessary for successful participation in the game of golf, the potential fitness and wellness benefits of participating in golf on a regular basis, and the social benefits associated with the betterment of one's well-being and quality of life. During this course, students will have a chance to apply the skills they have learned during the course through practicing the game on an actual golf course. This opportunity creates an ideal practice area for the student golfer to become acquainted with the situational application of golf skills and the decision-making and problem-solving skills needed to manage the golf course including the various hazards.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "29A", "credits": "1.5 Credits", "description": "A course designed to provide a further understanding of and a more advanced proficiency in golf skills, rules and etiquette.  KINES 029A Golf II (1.5) (GHA) KINES 029A is a course designed to give students advanced understanding, knowledge and skills and to continue the development of their game of golf. While the courses main area of emphasis is on golfs' short game (putting, chipping and pitching) the student will be educated about full swing fundamentals and proficiencies will be developed in midirons, long irons, fairway metals, and driver.Perhaps the most unique feature of Golf II is the on course practice. Each week during this course, students will get a chance to apply the skills they have learned during the week on an actual golf course. This practice time is in a situation where the student will learn how to integrate themselves into normal golf play. This creates an ideal practice area for the student golfer to become acquainted with situational application of golf skills and be a part of the golf atmosphere.Students will be evaluated by a combination of (but not limited to) evaluation techniques. Examples of those techniques are written examinations, skills testing, and subjective evaluation of skill level and game performance.The student, who successfully completes Kinesiology 029A-Golf II will be proficient in golf rules, golf terminology and golf etiquette. These advanced fundamentals will ease the transition from golf student to golfer. Students will find that, after completion of Golf II, the work done in this course prepares them for actual participation in the game of golf.The use of the Penn State golf course is required for this course. Three to five sections will be offered every fall semester with an enrollment of up to 30 students per section.", "prerequisite": "KINES 29", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "29B", "credits": "1.5-3 Credits", "description": "KINES 29B is a course that provides the information needed to understand, prepare for, and execute the game of golf and includes mandatory participation in travel during Spring Break. Students in this course work to appreciate the history of the game of golf, gain appreciation for etiquette and ethical play, learn and implement USGA Rules of the Game, practice golf-specific physical conditioning and mental strategies, and develop the swing for various conditions. This course is designed for students who have at least played golf. The main focus during active rounds of golf within the course is not the golfer's score, but the sportsmanship, ethical behavior, and etiquette displayed while demonstrating pace of play. KINES 29B emphasizes golf as a lifetime sport of high integrity. Students will examine the level of fitness necessary for successful participation in the game of golf, the potential social wellness benefits of participating in golf on a regular basis, and potential effect on one's quality of life. Students apply the knowledge and skills they have learned during the course through playing multiple rounds of golf on a golf course. This opportunity creates an ideal practice area for the student golfer to become acquainted with the situational application of golf skills and the decision-making and problem-solving skills needed to manage the golf course while balancing the mental game, ever important etiquette, and displaying ethical behavior and sportsmanship. During the course, students experience golf and good sportsmanship in a social, yet competitive situation. Students receive group and individual practical instruction in addition to learning theoretical knowledge. For completion of this course, students are required to travel with the class during Spring Break, generally to the Southeastern United States; specific details including location and costs are displayed on the section information on the schedule of courses.", "prerequisite": "KINES 29", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "29C", "credits": "3 Credits", "description": "KINES 29C is a course that provides the information needed to understand, prepare for, and execute the game of golf and includes mandatory participation in rounds of golf in and around Pennsylvania per the individual course offering. Students in this course work to appreciate the history of the game of golf, learn and implement USGA Rules of the Game, practice golf-specific physical conditioning and mental strategies, and develop the swing for various conditions. This course is designed for students who have played golf. The main focus during active rounds of golf within the course is not the golfer's score, but the sportsmanship, ethical behavior, and etiquette displayed while demonstrating pace of play.  KINES 29C emphasizes golf as a lifetime sport. Students will examine the level of fitness necessary for successful participation in the game of golf, the potential social wellness benefits of participating in golf on a regular basis, and potential effect on one's quality of life.  Students apply the knowledge and skills they have learned during the course through playing multiple rounds of golf on a golf course. This opportunity creates an ideal practice area for the student golfer to become acquainted with the situational application of golf skills and the decision-making and problem-solving skills needed to manage the golf course while balancing the mental game, ever important etiquette, and displaying ethical behavior and sportsmanship. During the course, students experience golf and good sportsmanship in a social, yet competitive situation. Students receive group and individual practical instruction in addition to learning theoretical knowledge. For completion of this course, students are required to travel locally for day trips; specific details including location and costs are displayed on the section information on the schedule of courses.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "41", "credits": "1.5 Credits", "description": "A course designed to introduce students to a basic instructional course in the fundamentals of 4-wall handball.  KINES 041 Introduction to Handball (1.5) (GHA) Kinesiology 041 is a course that has been designed to give students an introduction into the dynamic game of handball. It is a challenging game requiring the participant to be able to hit a ball with either hand during a rally in a 20'x 40' four-walled court. The technique of hitting a ball is similar to the motions used in throwing a baseball. Since both hands are used to execute shots, the development of the non-dominant hand ('off' hand) is a unique challenge. The course is structured to develop the 'off' hand through a logical progression of drills and game settings, which help the participant to mirror image the dominant hand's motion.Handball is also a sport, which develops an individual's eye/hand coordination to the highest level possible. This eye/hand coordination transfers exceptionally well for participants who pursue activities such as racquetball, tennis, squash, badminton, hitting a softball, and fielding a softball.The tremendous amount of footwork and body movement required to execute a shot in handball develops a fitness level similar to a cross-country skiing workout. Handball is a great lifetime activity.The fundamental skills, strategies, and rules of handball, along with game play, will be integrated throughout the course. The participant will also apply the rules of the game by being taught how to referee a match between fellow students.Students will be evaluated by a combination of (but not limited to) evaluation techniques. Examples of those techniques are written examination, skills testing, tournament performance, and subjective evaluation of skill level and game performance.", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "42", "credits": "1.5 Credits", "description": "KINES 42 is a course focused on the development of basic ice skating skills, and introducing a new physical fitness activity option into the lifestyle of the Penn State student. In the course, students develop balance and control while performing the basic skills necessary for the execution of many ice skating maneuvers for use in recreational skating or in learning to play hockey and/or figure skate. Skills are acquired through the use of exercises and patterns designed to strengthen the fundamentals of skating and to further develop balance, edge control, and confidence while participating in the activity. Such skills are developed and reinforced through off-ice practices to enhance the components of physical fitness, enhance balance, and to promote healthy behaviors in general fitness and wellness. Students may have the opportunity to work as partners and in small groups to balance the individual efforts through peer support and involvement. This course provides the necessary skill foundation for participation in forms of ice skating such as hockey, figure and/or recreational skating activities. In addition to the core component of physical skill development, the student has an opportunity to acquire an enlightened appreciation and understanding of the skill and art of ice sports and enhance general wellness and quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "44", "credits": "1.5 Credits", "description": "This course is a beginner's level course that seeks to give students the understanding, knowledge and skills to begin an exploration of the game of racquetball. While the primary focus of this course is acquiring an understanding of rules, fundamentals,and terminology, subsequent effort will emphasize the development of movement skills and a progression from drills and modified games to full game play. By the end of the course, each student will possess a basic knowledge of the game of racquetball that will allow them to be a knowledgeable spectator or participant in the game of racquetball. KINES 44 also examines racquetball as a lifetime sport. In addition to acquisition of knowledge and skill in tennis, students will examine the level of fitness necessary for successful participation in the game of racquetball, the potential fitness benefits of participating in racquetball on a regular basis, and the social benefits associated with the betterment of one's well-being and quality of life. Furthermore, students will explore proper training techniques, injury prevention, and fitness habits that may aid their enjoyment of racquetball as a lifetime pursuit of wellness. Perhaps the most unique feature of Racquetball I is the regular on court practice. Routinely, students will have a chance to apply the skills they have learned during the week on regulation racquetball courts. This practice time creates an ideal practice area for the student racquetball player to become acquainted with the situational application of racquetball skills.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "45", "credits": "1.5 Credits", "description": "KINES 45 introduces students to the fundamental academic concepts and practical skills of SCUBA diving as described by NAUI (National Association of Underwater Instructors) standards. Students explore the importance of fitness and wellness and their personal fitness needed to succeed in SCUBA. Water safety and emergency response skills are emphasized. Students must be able to tread water, swim the front crawl for an extended time, and be able to swim underwater for a length of the pool. This course addresses academic elements and applied sciences such as: the gas laws, Archimedes' principle, physics (light, sound, heat, aquatic pressure relationships), physiology (arterial gas embolism, miscellaneous barotrauma, decompression illness, hypo and hyperthermia), dive planning, equipment configuration and function, environmental considerations (salt vs. fresh water, dangerous plants and animals, water temperature and visibility, and altitude). In addition, this course introduces practical confined water skills including: basic skin-diving skills, fundamental SCUBA skills (regulator clearing and retrieval, emergency out of air ascents, buoyancy control, rescue techniques, ditch and don of gear, underwater communication, and proper partnership), and equipment preparation and assembly. Students may only earn credit in either KINES 45 or KINES 45A.", "prerequisite": "KINES 45", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "45A", "credits": "1.5 Credits", "description": "KINES 45 introduces students to the fundamental academic concepts and practical skills of SCUBA diving as described by PADI (Professional Association of Diving Instructors) standards. Students explore the importance of fitness and wellness and their personal fitness needed to succeed in SCUBA. Water safety and emergency response skills are emphasized. Students must be able to float or tread water without aid for 10 min and either swim 200 meters/yards with no aid or 300 meters/yards with aids (mask, fins, and snorkel). This course addresses academic elements and applied sciences such as: the gas laws, Archimedes' principle, physics (light, sound, heat, aquatic pressure relationships), physiology (arterial gas embolism, miscellaneous barotrauma, decompression illness, hypo and hyperthermia), dive planning, equipment configuration and function, environmental considerations (salt vs. fresh water, dangerous plants and animals, water temperature and visibility, and altitude). In addition, this course introduces practical confined water skills including: basic skin-diving skills, fundamental SCUBA skills (regulator clearing and retrieval, emergency out of air ascents, buoyancy control, rescue techniques, ditch and don of gear, underwater communication, and proper partnership), and equipment preparation and assembly. Students may only earn credit in either KINES 45 or KINES 45A.", "prerequisite": "KINES 45", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "46", "credits": "1-1.5 Credits/Maximum of 1.5", "description": "KINES 46 is a beginner's level course designed to provide students with the motor skills and cognitive understanding necessary to successfully compete in the game of squash. While the initial focus of this course is development of racquet skills, acquiring an understanding of rules, regulations, and terminology are integral to the process in learning squash. Subsequent effort will emphasize the development of movement skills, progression of racquet fundamentals, and application of the above to managing game situations. Here, students will learn to recognize, comprehend, and develop on-court strategies, and will learn to employ these tactics in game play. By the end of the course, each student will possess a basic knowledge of the game of squash and sound racquet fundamentals that will allow them to be a knowledgeable spectator or participant in the game of squash. This will serve as a \"connector\" to, not only advanced levels of squash, but other forms of racquet play as well. In turn, this will facilitate the discovery and appreciation of the significant lifetime benefits offered by all racquet sports. Finally, KINES 46 examines squash as a lifetime sport. Students will explore the level of fitness necessary for successful participation in racquet sports, the potential fitness benefits of participating in squash on a regular basis, and the social benefits associated with the betterment of one's well-being and quality of life. Furthermore, students will explore proper training techniques, injury prevention, and fitness habits that may aid their enjoyment of squash as a lifetime pursuit of wellness.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "47A", "credits": "1.5 Credits", "description": "KINES 47A introduces students who are beginning swimmers to the performance of swimming safety and skills that can be used as lifelong activities. Students will learn and practice a progression of swimming related skills designed to acclimate the new or beginning swimmer to the aquatic environment. An introduction to personal safety skills provides the students with knowledge necessary for safe behavior in an aquatic setting.  The course provides basic knowledge of hydrodynamic principles that will identify a kinetic awareness at various water depths. KINES 47A may also introduce students to a variety of aquatic fitness activities that include jogging in the water and water aerobics. As swimming and basic aquatic fitness may play a role in lifetime activity, fitness, and wellness, students learn valuable personal fitness knowledge and principles and how to implement them. Though the importance of water safety and basic survival tactics is paramount to the course, so to is the appreciation for self-care and wellness over the lifespan and possessing the tools to have a rich quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "47B", "credits": "1.5 Credits", "description": "KINES 47B introduces students who have attained moderate swimming skills and knowledge to advanced swimming strokes.  Aquatic activities are introduced as they relate to one's lifetime for maintenance of physical health and psychological well-being. Students learn and practice a progression of swimming skills designed to promote efficiency and fitness in the water. Personal safety skills provides the students with knowledge necessary for safe behavior in an aquatic setting. Students are exposed to a variety of aquatic fitness activities that include walking and jogging in the water, lap swimming, and water aerobics. Students also experience recreational aquatic sports (i.e. water polo, volleyball) to allow them to participate independently outside class. Though the importance of water safety and basic survival tactics is paramount to the course, so too is the appreciation for self-care and wellness over the lifespan and possessing the tools to have a rich quality of life.", "prerequisite": "47A or Students taking this course must demonstrate the ability to swim in depths of over 4ft successfully or one length of the pool without apprehension or fear.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "48", "credits": "1.5 Credits", "description": "This is a beginner's level course that seeks to give students the understanding, knowledge and skills to begin an exploration of the game of tennis. While the primary focus of this course is stroke development and acquiring an understanding of rules, regulations, and terminology, subsequent effort will emphasize the development of movement skills and a progression from hitting to rallying. By the end of the course, each student will possess a basic knowledge of the game of tennis that will allow them to be a knowledgeable spectator or participant in the game of tennis. KINES 48 also examines tennis as a lifetime sport. In addition to acquisition of knowledge and skill in tennis, students will examine the level of fitness necessary for successful participation in the game of tennis, the potential fitness benefits of participating in tennis on a regular basis, and the social benefits associated with the betterment of one's well-being and quality of life. Furthermore, students will explore proper training techniques, injury prevention, and fitness habits that may aid their enjoyment of tennis as a lifetime pursuit of wellness. Perhaps the most unique feature of Tennis I is the regular on court practice. Routinely, students will have a chance to apply the skills they have learned during the week on regulation tennis courts. This practice time creates an ideal practice area for the student tennis player to become acquainted with the situational application of tennis skills.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "50", "credits": "3 Credits", "description": "KINES 50 is a course designed to provide the student with comprehensive knowledge of fitness and safety in the aquatic environment. This course includes the development and understanding of aquatic skills, survival techniques, stroke mechanics, patron safety, and rescue skills, as well as provide the knowledge and skills necessary to recognize and respond to life treating emergencies. Emphasis is placed on leadership, professional growth, swimming mechanics, endurance, emergency identification and safety, and understanding of patron safety at aquatic facilities, both in and out of the water. Upon completion of this course, students will be prepared to take Lifeguarding Certification exam.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "56", "credits": "1.5 Credits", "description": "KINES 56 is designed to give students an introduction to martial arts and the use of martial arts for lifelong fitness. Martial arts have been practiced for centuries as a method of integrating mind, body, and spiritual well-being. While improving physical fitness and emotional health, martial arts are the cornerstone of unarmed self-defense. In addition to being able to identify and enact strategies for improving situational awareness and display proficiency in basic Martial Arts for personal defense, this course will promote comprehensive wellness while developing important lifelong motor skills. Assessments will be both written and physical. Students will be expected to show knowledge of martial arts history and terminology and perform martial arts techniques covered in the course.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "57", "credits": "1.5 Credits", "description": "KINES 57 is designed to give students an understanding of and proficiency in self-defense strategies based on martial arts techniques. Students are introduced to the culture and history of the martial arts which encompasses a wide variety of Asian self-defense systems. The skills, strategies and techniques of self-defense developed through this course can be performed at any level across all ages, and the training will promote comprehensive wellness and facilitate the development of a lifelong fitness program. For many, the emotional and psychological benefits of learning self-defense can be as important as the physical benefits. While the focus of this course is not soley on physical fitness, it will challenge students to improve their flexibility and conditioning which will enhance their ability to defend themselves and allow for additional options when defending oneself.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "58", "credits": "1.5 Credits", "description": "Kinesiology 058 will help students develop stamina, confidence and discipline, and promote general fitness through the introduction to basic Judo.  KINES 058 Judo I (1.5) (GHA) Kinesiology 058 will help students develop stamina, confidence and discipline, teach self-defense, and promote general fitness through the introduction of basic Judo. Developed in Japan in 1882, Judo has quickly spread across the globe and won approval as a modern sport. Judo became the first activity of Asian origin to be accepted as an Olympic event in 1964. Women's Judo was admitted to the Games as a full medal event in 1992. Judo, 'the gentle way,' is the modern day form of the ancient Japanese Jujitsu. The art is based on the principle of using the opponent's own strength to put him or her off balance, using minimum effort for maximum efficiency. Judo was initially developed by Professor Jigoro Kano, whose techniques were refined to form a combative system that demonstrates the superiority of techniques over mere strength. Although Judo is a martial art, students need not fear physical injury due to enrollment at Kinesiology 058. Judo I covers fundamental falling, throwing and grappling techniques. More dangerous techniques, such as choking and arm locks, are reserved until students have demonstrated satisfactory command of more basic skills. Kinesiology 058 is not simply aimed at introducing students to basic Judo. Judo instruction at Penn State encourages fitness by incorporating a brief session of physical conditioning into each class in an effort to augment the aerobic workout and prevent injuries. Each student is also asked to learn basic terms and some general history of the sport of Judo. Facilities/Class periods - held in the IM Building Combat Room - begin with stretching and generally continue with a series of technique demonstrations, form practices and free workout. Class concludes with conditioning and cool-down exercises. Frequency of enrollment: Two sections every fall and spring semesters with a maximum of 30 students per section.", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "59", "credits": "1.5 Credits", "description": "A course designed to give students an understanding of and a proficiency in Karate.  KINES 059 Introduction to Karate (1.5) (GHA) KINES 059 will involve the training in the philosophy, principles and techniques of Karate for self-defense, improvement of overall fitness and to give a greater understanding of the art and themselves. This course will involve physical aspects of Karate including blocking, punching, striking, kicking and body shifting techniques in correct stance and the application of these techniques against an opponent. The course will also introduce the mental aspects of Karate illustrating the ideals of 'the way' (including principles such as character, concentration, self control, manners and self discipline) and how they can be applied in everyday life to benefit themselves and society, this will be achieved through meditation and training. There are three primary components of Karate training; fundamentals (basics), sparring and Kata or forms. The basic techniques consist of blocks, punches, strikes, kicks and combinations of these techniques in correct stance or body position. Sparring can take one of three forms; single step, controlled multi-step sparring and free sparing. Only the second form (both controlled and non-contact) is taught in this introductory class. The third component, kata, consists of a series of predefined blocking, striking and kicking techniques performed by an individual and used to simulate defense against multiple opponents. The forms are used to perfect the fundamental techniques to teach balance and timing of techniques so that they then may be applied to sparring. Throughout the semester students will improve in physical fitness and learn how Karate contributes to improved fitness and overall wellness. The basic principles of organizing, planning and implementing a physical fitness program will be taught using martial arts training as a method of exercise. The fitness principles learned in class can be applied to any form of activity the student chooses. At the end of the course the student will be invited to explore, through a term paper, their personal health and fitness goals and how karate training may be incorporated into their lifelong fitness plan. Although some concepts of 'self-defense' are discussed in this class it is not given a priority. However, it is likely that by the end of the course students will feel more physically confident in their ability to avoid and deal with conflict situations. Since Karate is one of the most widely practiced martial arts in the world, the students will also be able to continue their training in Shotokan though either the Penn State Club or at any other club around the world. They will also be given the opportunity to sit a formal grading examination (through a world class examiner), which will hold rank within Karate anywhere in the world, thus acknowledging their abilities gained in this course. This formal ranking is completely at the student's discretion and will not be required for credit toward Kinesiology 059. Frequency of enrollment: One to three sections every fall and spring semesters with a maximum of 30 students per section.", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "61", "credits": "3 Credits", "description": "Fitness theory and Practice is a course designed to give the Penn State student a complete understand of the fundamental principles of physical fitness and the skills necessary to implement a personalized fitness program. This course will provide the information and skill needed for the student to organize, plan and implement a complete physical fitness program which can evolve over the lifespan. In this course the Penn State student will acquire the knowledge and critical thinking skills that are essential to the development of a healthful and active lifestyle. Students explore the training principles, health-related components of physical fitness, benefits of these components, and learn to use and apply established fitness guidelines. Students also consider factors which affect their performance in executing a fitness plan such as nutritional concerns, the impact of stress, choice of proper equipment, matching personal goals to proper execution, and personal motivation. In their pursuit of an active and healthy lifestyle, students assess and evaluate their personal health, fitness, and wellness using pre and post intervention strategies, and engage in physical exercise to practice concepts presented in course materials including cardiovascular, flexibility, muscular strength and endurance training techniques.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "61S", "credits": "3 Credits", "description": "Fitness Theory and Practice is a course designed to give the Penn State student a complete understand of the fundamental principles of physical fitness and the skills necessary to implement a personalized fitness program. This course will provide the information and skills needed for the student to organize, plan and implement a complete physical fitness program which can evolve over the lifespan. In this course the Penn State student will acquire the knowledge and critical thinking skills that are essential to the development of a healthful and active lifestyle. Students explore the training principles, health-related components of physical fitness, benefits of these components, and learn to use and apply established fitness guidelines.  Students also consider factors which affect their performance in executing a fitness plan such as nutritional concerns, the impact of stress, choice of proper equipment, matching personal goals to proper execution, and personal motivation.  In their pursuit of an active and healthy lifestyle, students assess and evaluate their personal health, fitness, and wellness using pre and post intervention strategies, and engage in physical exercise to practice concepts presented in course materials including cardiovascular, flexibility, muscular strength and endurance training techniques.  As a first year seminar course, students receive instruction in and introduction to campus resources and receive peer mentoring.", "other": ["First-Year Seminar", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "62", "credits": "1.5 Credits", "description": "KINES 62 has been designed to help students become acquainted with and proficient in many types of cardiovascular activities that can be used as part of a lifelong exercise program. Students should expect to participate in a variety of activities such as, but not limited to, walking/ jogging, cycling, aquatics, aerobic dance, and cardiovascular exercise machine use. Additionally, students will have an opportunity to learn skills necessary to create safe cardiovascular exercise programs while considering safety, injury prevention, and the pursuit of lifelong wellness. KINES 62 is taught in a modular format including three to five separate types of cardiovascular exercise being chosen for the course content for the semester. Students will know which courses have been selected by listings in the semester Schedule of Courses. KINES 62 will provide a unique balance of training guidelines that can be applied to the various cardiovascular activities one pursues throughout life. Fundamental guidelines for safe exercise, progression, self-monitoring, etiquette, and injury prevention will be introduced and practiced throughout the course. Cardiovascular Activities serves as a stepping stone to lifetime physical fitness and disease prevention. Self and group paced activity will allow for each individual to maximize the benefits of exercise.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "63", "credits": "1.5 Credits", "description": "KINES 63, students engage in participation in various types of group fitness classes including but not limited to aerobic dance, Zumba, interval training, cardio circuit training. This active participation is joined with delivery of information addressing components of cardiovascular training, including principles, components, theories, and training strategies of physical fitness. Students learn how to prepare for and engage in group exercise activities by applying theories of kinesiology and aerobic exercise in real-world experiences. In addition to active engagement in group exercise, students experience collaborative work in small and large groups to solve complex movement problems by developing their own brand of group exercise training. Critical thinking is stressed as students negotiate the implementation of cardiovascular training principles as part of their ADL (activities of daily living). When a student completes KINES 63, he or she is able to identify the components of an effective physical training program and explain how that program contributes to lifelong wellness; develop training goals and design a wellness program to meet these goals; perform a variety of physical training techniques; and understand how the acquisition of components of cardiovascular training skills and knowledge promotes psychological well-being.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "65", "credits": "1.5 Credits", "description": "KINES 65 is a beginner's level course that seeks to give students the understanding, knowledge and skills to establish a fitness program involving jogging. This course introduces students to the performance of jogging as a lifelong activity that helps maintain and enhance physical fitness and overall wellness. It also provides the information that the students need to understand, organize, plan and implement a physical fitness program that features jogging as a primary activity. Students will examine the varying levels of fitness necessary for successful participation in jogging, the potential fitness benefits of engaging in jogging on a regular basis, and the social benefits associated with the betterment of one's well-being and quality of life. The centerpiece of this course is a progression of individually paced jogs of varying lengths that are conducted over various terrains. Students will experience participation in jogging through a variety of training techniques including interval runs, hill runs, and runs to various locations of interest dependent on each campus location and the surrounding community. These activities are complemented by lectures on a variety of jogging and fitness related topics. Students may also participate in small group-based activities that build leadership and teamwork skills. Throughout the course, students will have opportunities to apply the knowledge and skills they have learned during the course through participation in regular exercise. This opportunity creates an ideal practice arena for the students to become acquainted with situational awareness and the ability to make \"on-the-fly\" problem solving decisions.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "67", "credits": "1.5 Credits", "description": "KINES 67 has been designed to help students build high levels of overall physical conditioning based upon a variety of training techniques such as, but not limited to, high intensity interval training, functional training, and body weight training. Students should expect to physically challenge themselves through a variety of activities focusing on aerobic, anaerobic, and resistance training. Students will acquire the knowledge and critical thinking skills that are essential to the development of a healthful and active lifestyle. Students explore such topics as wellness, training principles, health-related components of physical fitness, benefits of these components, and learn to use and apply established fitness guidelines. Students must also consider nutritional concerns and choice of proper equipment and training tactics to match one¿s goals. In this course, students will acquire the knowledge and critical thinking skills that are essential to the development of a healthful and active lifestyle. Additionally, students will have an opportunity to learn skills necessary to create safe, complete conditioning programs while considering safety and injury prevention. Physical Conditioning will provide a unique balance of training guidelines that can be applied to the various activities one pursues throughout life. KINES 67 may serve as a stepping stone to lifetime fitness, competition in organized athletic events, and personal challenge activities. Students will develop a holistic approach to training for endurance, strength, and integrated activities. Students should expect to work individually and in groups to complete athletic challenges and integrate exercise, team work, and problem-solving skills.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "68", "credits": "1.5 Credits", "description": "Resistance Training is a course designed to improve students' muscular strength/endurance and is focused on development and implementation of an effective personal strength/endurance training program for lifelong fitness. Key purposes of this class are to learn the basic principles of resistance training, to learn the role of resistance training in an overall program of health and wellness, and to acquire the necessary skills and experience to develop an individualized program for developing muscular strength and endurance over the lifespan. Students will explore the benefits of incorporating a resistance training program as part of a complete fitness plan and how implementation of such a plan may contribute to such changes as increased weight loss/control, balance and coordination, and a better overall sense of well-being. Students practice proper technique for a wide variety of training exercises and to create a personal training program. Students will explore resistance training principles through learning basic anatomy, basics in muscular physiology, and understanding the body's adaptations to training and detraining. Attention will be given to safety and injury prevention, performance enhancement though natural means and training, proper training techniques and full fitness and wellness plan creation and implementation, and strategies in progression and motivation. Furthermore, students will learn validated techniques to assess muscular strength and endurance and to compare results to normative data. Students will be encouraged to explore their personal health and fitness goals and how resistance training may be incorporated into their lifelong fitness and wellness plan.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "70", "credits": "1.5 Credits", "description": "KINES 70 addresses, in both a theoretical and practical manner, the fitness benefits derived from swimming. These benefits include but are not limited to: flexibility, cardiovascular endurance, muscular strength and endurance, and weight management. Because of its non-weight bearing nature, attention is also given to the exercise value of swimming for arthritic, injured and overweight individuals. This course promotes swimming as a lifelong pursuit and at the same time, enables a student to design an individualized fitness plan, using swimming as the primary activity. Students taking this course must be proficient in swimming skills with the ability to swim distance in the pool. During the swim conditioning portion, students should expect a warm-up, training session, flexibility portion, and a cool-down phase. Training progresses through the semester and takes into account the fitness goal (group or individual). Throughout the semester, swimming is the primary activity, but an exposure to aquatic walking/jogging/running and dryland training is also provided. Moreover, the importance of implementing training variety, proper technique and appropriate safety procedures is emphasized throughout the course with consideration for altering training to meet current and future health and fitness needs. Students have an opportunity to practice skills and behaviors that enable them to better maintain health across their lifespan, as well as to recognize the importance of social, emotion and physical health and wellness.", "prerequisite": "Intermediate or advanced swimming level or Students taking this course must be proficient in swimming skills with the ability to swim distances in the pool.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "72", "credits": "1.5 Credits", "description": "KINES 72 introduces students to the performance of fitness walking as a lifelong activity that is intended to maintain and enhance physical health, wellness, and psychological well-being. This course provides information the student needs to understand, organize, plan and implement a physical fitness program that features walking as a primary, low-impact activity. Students examine the potential fitness benefits of engaging in walking on a regular basis and the social benefits associated with the betterment of one's well-being and quality of life. This course includes a progression of individually paced routes varying lengths that are conducted over various terrains. Students experience participation in ambulation through a variety of training techniques including intervals, hill training, and walks to various locations of interest dependent on each campus location and the surrounding community. These activities are complemented by teachings on a variety of walking and fitness related topics such as the philosophy of walking and walking safety, goal-setting for personal health, principles and concept of physical fitness, the physiology of walking, assessing exercise, promoting wellness, and nutrition and weight control. Students may also participate in small group-based activities that build leadership and teamwork skills. Throughout the course, students have opportunities to apply the knowledge and skills they have learned during the course through participation in regular exercise. Students also experience techniques used to monitor performance throughout the course.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "76", "credits": "1.5 Credits", "description": "KINES 76 is designed to introduce students to Tai Chi Ch'uan, a traditional Chinese system of personal cultivation and self-defense. Students explore Tai Chi Ch'uan as a health and martial arts system which is based on more than five thousand years of observation and practice culled from the major Chinese Schools of philosophy and Chinese medical practice. Tai Chi Ch'uan is considered a physical embodiment of the supreme Taoist principles. Tai chi Ch'uan has been the focus of research in China and the west and has been found extremely beneficial for balance, arthritis, Parkinson Disease and for general health and well-being. Tai Chi Ch'uan has gained popularity throughout the world as a means for attaining physical health and vitality and as a formidable defensive martial art. Students are introduced to the principles of Tai Chi Ch'uan by learning Tai Chi relaxation techniques and warm ups to relax the joints, right body alignment and Qi Gong exercises to promote the flow of chi, or life energy, through the body and the internal organs. Students become proficient in the performance of the first part of the Tai Chi Yang form, which is the heart of the practice. Students also explore the martial art aspects of Tai Chi Ch'uan through the practice of push hands, a two person play, and through the demonstration and introduction to the Tai Chi Sword. The martial art aspects enrich the student's experience and demonstrate the interaction of the student's chi with their environment. Students are encouraged to practice daily outside of class to progress to perform movement and related exercises on their own to create beneficial exercise for mind and body over the lifespan.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "77", "credits": "1.5 Credits", "description": "KINES 77 is a course designed to give students an understanding of and proficiency in yoga. Yoga for the Lifetime introduces students to the performance of yoga as a lifelong activity that maintains and enhances physical health, psychological well-being, and overall wellness. This course provides the information that the student needs to understand, organize, plan, and implement a wellness program that features yoga as a central practice. The centerpiece of this course is an integration of foundations in yoga principles and the physical practice of yoga, introducing students to classical yoga postures that address such needs as stress management, muscular tightness, skeletal alignment, and injury recovery. In addition to posture instruction, students practice breathing techniques and meditation; various breathing techniques are included to calm the mind and focus mental energy on specific tasks. Students explore such topics as the historical and philosophical foundations of yoga, nutritional practices that enhance the value of a lifelong yoga program, and Eastern-based movement traditions that complement yoga practice. Students also have the opportunity to reflect upon various aspects of yoga philosophy and the evolution of their personal practice. Upon completion of KINES 77, the student will be able to identify the components of an effective lifelong wellness program and explain how yoga contributes to the success of this program; perform yoga to develop flexibility, strength, and cardiovascular endurance; select and perform yoga postures that address specific needs (e.g., stress management, muscular tightness); describe the philosophical and historical framework that supports yoga practice; and explain how effective breathing and meditation techniques promote physical and psychological well-being.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "77A", "credits": "1.5 Credits", "description": "Students who enter Advance Yoga Practice (KINES 77A) have experience with yoga but are introduced to a deeper and more detailed knowledge and practice of this ancient philosophy now practiced in all contemporary societies throughout the world. Advanced Yoga is designed to deepen the student's understanding and practice of yoga, including yoga postures (asana), breath-work (pranayama), anatomy, philosophy, meditation, sequencing, and applied personal practice. This course involves basic postures (asanas) building to advanced postures, workshops and partner work, readings and discussions, development of restorative and active home practices, and personal reflection to deepen one¿s practice and overall wellness throughout one's 'lifespan. Students become familiar'with the research that supports the benefits of yoga to the body's systems while exploring the power of changing the mind. Movement-based sessions focus puposeful practicing of yoga postures with the knowledge of their specific benefits. For instance, when learning the bridge pose students will learn that the bridge increases flexibility in the back and shoulders, strengthens the leg muscles and stimulates thyroid function. Students learn to integrate such knowledge into their personal practice of yoga. In addition to the physical practice, students will explore mindfulness, the eight limbs of yoga, restorative practices, the seven chakras, use of breath, use of bandhas, and chanting during the course. The course emphasizes connecting to the core, proper alignment, anatomy, functional movement, intelligent and interesting sequencing, moving fluidly with the breath, mindfulness, and compassion. There are opportunities in Advanced Yoga Practice to understand Sanskrit, the historical language of yoga, in relationship to meditation techniques, energy center practices, temperament determination and application of specific yogic activities.", "prerequisite": "KINES 77", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "81", "credits": "3 Credits", "description": "KINES 81 is a course designed to explore the cognitive foundations of wellness. Wellness is dynamic and multidimensional. Each individual possesses a unique potential for wellness that is impacted by biological, environmental and behavioral factors. This course covers the physical components of wellness as well as the social, emotional, intellectual, and spiritual components. Students explore the health benefits of exercise, diet, and cardiovascular wellness, along with the management of lifestyle change and personal responsibility to achieve wellness across the lifespan. Social, economic, and cultural factors that may influence wellness will be discussed. Assessment activities are integrated to enable and encourage responsible decision making. Emphasis will be placed on helping students understand the impact of lifestyle on acute and chronic disorders. A portion of the course will be devoted to theoretical constructs as they apply to human behavior including the Health Belief Model, Theory of Reasoned Action, Self Efficacy Theory, Transtheoretical Model (Stages of Change), and Planned Behavior. By examining theories of human health behavior over a variety of topics, students will be able to analyze their personal health behavior and gain an understanding of the importance of prevention. Students may participate in collaborative learning activities related to health care ethics, individual rights versus public health and safety issues, and issues related to health information on the internet. Students will explore and differentiate medical based information and marketing based information on the internet. The student who successfully completes KINES 81 will be able to identify the components of a positive healthy lifestyle, understand health risk behavior that delimits wellness, grasp the multidimensional nature of wellness, and comprehend the importance of personal responsibility in maintaining wellness.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "82", "credits": "3 Credits", "description": "In Action Methods for Stress Management, students explore how the mind and body are affected by stress over the lifespan. Through the course students examine the effects of stress on various body systems (i.e. cardiovascular system), learn to identify those factors that typically lead to certain mental and physical stress-related illnesses, study invasive and non-invasive interventions and techniques of stress management, and explore theoretical connections between stress and disease. Students will concentrate their cognitive learning efforts on the most common non-invasive practices that can to be implemented to control stress. In the course, students identify factors that lead to stress-related illness and develop an understanding and practice of active methods of stress management, with a focus on relaxation and meditation techniques. Both formal and informal contemplative practices are introduced, with students expected to develop a daily action method, meditation and/or relaxation practice to promote stress management and overall wellness in changing life conditions. Students will have an opportunity to become proficient with action methods such as yoga, meditation, conscious eating, and regular exercise; time spent in mindfulness, stillness, silence, and nature may also be explored.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "83", "credits": "1.5 Credits", "description": "KINES 83 is a course designed to give the student an introductory understanding of the fundamental principles of stress management. This course will provide pertinent information the student needs to understand, organize, plan and implement a preliminary stress management program. In this course, the student will follow a progression to manage stress that encourages gaining awareness of the factors that contribute to stress, gives attention to the physical/ emotional/ behavioral symptoms in response to stress, encourages exploration of a variety of stress management techniques, and fosters the development of strategies that can be effective over time. Throughout the course, the student considers many components of wellness. Attention is given to specific strategies in physical wellness such as using physical activity and exercise to promote fitness, healthy eating to combat nutritional stresses, and physical relaxation techniques to explore reduction in muscular tightness, physical signs and symptoms of stress, and elevated mental distraction. The course also includes good practices in addressing emotional wellness through improving awareness and practicing cognitive stress management techniques such as reframing and cognitive restructuring. The student is introduced to the elements of fitness and research data that support inclusion of fitness prescriptions to enhance the relaxation response and/or to produce relevant changes in hormone levels. In conjunction with this knowledge and application of such knowledge,the student learns how nutritional decisions and qualities food possesses can result in calming versus energizing effects. Combining this knowledge, the student develops skills to create a personal program to incorporate these fitness and nutritional goals into their own behaviors. As the course progresses, there is continual emphasis on the importance of awareness and the connectedness of the mind and the body. Common themes through the course are awareness, mindfulness, and acting with intention with a goal of performing more effectively in a time of stress.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "84", "credits": "1.5-3 Credits", "description": "Kinesiology 84 is a course that has been designed to give the Penn State student a complete understanding of the fundamental principles of physical fitness. This course will provide the necessary skills and information the student needs to understand, organize, plan and implement a complete physical fitness program. Students are expected to explore wellness, disease progression, assess personal fitness and wellness, and explore variables (such as stress and nutritional practices) which may affect performance in the personal plan. In this course the Penn State student will acquire the knowledge and critical thinking skills that are essential to the development of a healthful and active lifestyle, be able to articulate the interrelationship between fitness and wellness, apply the concepts of physical fitness, develop an appreciation having a physically active lifestyle, and be able to alter a personal plan over the lifespan.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "84Z", "credits": "3 Credits", "description": "KINES 84Z is a course that has been designed to give the student a complete understanding of the fundamental principles of physical fitness and an appreciation for disease prevention. This course will provide the necessary skills and information the student needs to understand, organize, plan and implement a complete physical fitness program. Students are expected to explore wellness, disease progression, disease prevention, assess personal fitness and wellness, and explore variables (such as stress and nutritional practices) which may affect performance in the personal plan and their overall health over the lifespan. Students thoughtfully connect the physical state (including presence of lifestyle-related disease) with the impact experienced from lifestyle and behavior choices. In this course, the student will acquire the knowledge and critical thinking skills that are essential to the development of a healthful and active lifestyle, be able to articulate the interrelationship between fitness and wellness, apply the concepts of physical fitness, develop an appreciation having a physically active lifestyle, and be able to alter a personal plan over the lifetime. This course is linked to BMB 1Z as an option in the Integrative Studies requirement in General Education; students must successfully complete both courses to use this linkage to fulfill the Integrative Studies requirement. As they proceed through this pairing, students are presented with opportunities to make connections between disease and lifestyle from the perspective of both health and wellness and biochemical and molecular changes. Both courses address diseases that have a well-demonstrated lifestyle-related component and with well understood molecular underpinning (i.e. Diabetes, Cancer, Cardiovascular Disease, and Metabolic Syndrome).", "other": ["General Education: Health and Wellness (GHW)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "88", "credits": "1.5-3 Credits", "description": "kines 88 introduces students to the rigors of the varsity sport experience. This course provides the information that the student needs to understand, organize, plan and thrive in the competitive environment of a collegiate sport program while integrating themselves into the university community. The intent of the course is to provide an active learning environment including service. The \"corner stone\" of this course is the varsity sport experience itself. Under the tutelage of some of the best instructors in the nation these student-athletes will learn how to prepare for and engage in physical and psychological contests of the highest order. In addition to engagement with the finest physiological training, students experience collaborative work in small and large groups to solve complex movement problems. Critical thinking is stressed as students negotiate the complex real world problem of being a student athlete in a collegiate athletic program. Social behavior, community and scholarly conduct are continually addressed as the student-athletes attempt to integrate themselves into the university and local community. When a student completes KINES 88, he or she is able to identify the components of an effective physical training program and explain how that program contributes to lifelong wellness; develop training goals and design program to meet these goals; perform a variety of physical training techniques; and understand how the acquisition of sport specific skills and knowledge promotes psychological well-being. Sport-appropriate training and performing venues are provided by the university. All offerings of KINES 88 require completion of the signature assignment including, but not limited to, reflection on one's own sport participation, discussion of how participation impacted academic performance, and based on at least five principles discussed during the semester.", "prerequisite": "Member of Varsity team sport in season.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "89", "credits": "3 Credits/Maximum of 3", "description": "KINES 89 is a wilderness orientation program that is offered for incoming students to assist in their transition to life at Penn State. This course includes multiple days of backpacking in various locations. Through these activities students learn the various skills associated with backpacking and wilderness living which they can continue to use across the lifespan. Students are placed into small groups of eight to ten students with Penn State students and graduate students who mentor and lead the backpacking experience. Small group discussions are threaded throughout the course and focus on student life at Penn State. This class emphasizes teamwork, group living skills, nutritional strategies, living in the elements, wilderness ethics, and health and wellness by introducing students to the craft of backpacking, an activity that students can continue throughout their lifetime. Through this aspect of the course the aim is to help students develop skills to successfully manage their time and stress in order to better balance the physical, social and academic aspects of their lives. Throughout the class these various topics are addressed. Equipment for all activities is provided. Incoming students with all levels of experience may take this course. Both course travel and engagement in and completion of all other course content are required.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "90", "credits": "3 Credits", "description": "This course is divided into two to three units that are designed to provide students with an introduction to a variety of lifetime indoor team sports. The course may include, but is not limited to, basketball, volleyball, team handball, indoor soccer, or floor hockey. Specific location considerations such as facilities or faculty expertise may allow for other indoor team sports to be made available. This format will give students an opportunity to gain a breadth of information and experience that will serve as a gateway to learning opportunities as a knowledgeable spectator or participant over the lifespan; students may also develop an interest to pursue participation in more advanced intramural and recreational sports activities or opportunities. This course provides information not only on participation in the included sports, but also on how to incorporate those sports into one's fitness plan throughout life and the potential fitness benefits of regular participation in the sport. Foundational principles of creating an effective fitness and wellness plan including appreciation for factors impacting performance, safety, and injury prevention are addressed. Participating in team sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life. While the primary focus of the class is the skills, strategies and rules of a variety of indoor team sports, the underlying sub-focus of the course is the development of the social skills required to be a good team member. The commitment to a team sport requires students to encounter a collaborative atmosphere where they seek to solve complex movement problems and learn to cooperate to achieve various team goals. The improvement of individual skills is important however the successful integration of these individual skills into the team is a valuable life lesson. As the student leaves the university the lessons learned in this class will prepare him/her for \"team membership\" in their various areas of professional practice.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "90A", "credits": "1.5 Credits/Maximum of 99", "description": "KINES 90A focuses specifically and solely on volleyball. It is designed to give students an understanding of the knowledge and skills necessary for successful participation in the game of volleyball. This format will give students more depth and focus on the game of volleyball and the communication skills that good teamwork requires. While the primary focus of the class is the skills, strategies and rules of volleyball, the underlying sub-focus of the course is the development of the social skills required to be a good team member. The commitment to a team sport requires students to encounter a collaborative atmosphere where they seek to solve complex movement problems and learn to cooperate to achieve various team goals. This course provides information not only on volleyball, but also on how to incorporate volleyball into one's fitness plan throughout life and the potential fitness benefits of regular participation in volleyball. Foundational principles of creating an effective fitness and wellness plan including appreciation for factors impacting performance, safety, and injury prevention are addressed. Participating in team sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "90B", "credits": "1.5 Credits/Maximum of 99", "description": "KINES 90B focuses specifically and solely on basketball. It is designed to give students an understanding of the knowledge and skills necessary for successful participation in the game of basketball. This format will give students more depth and focus on the game of basketball and the communication skills that good teamwork requires. While the primary focus of the class is the skills, strategies and rules of basketball, the underlying sub-focus of the course is the development of the social skills required to be a good team member. The commitment to a team sport requires students to encounter a collaborative atmosphere where they seek to solve complex movement problems and learn to cooperate to achieve various team goals. This course provides information not only on basketball, but also on how to incorporate basketball into one's fitness plan throughout life and the potential fitness benefits of regular participation in basketball. Foundational principles of creating an effective fitness and wellness plan including appreciation for factors impacting performance, safety, and injury prevention are addressed. Participating in team sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "90C", "credits": "1.5 Credits/Maximum of 99", "description": "KINES 90C focuses specifically and solely on team handball. It is designed to give students an understanding of the knowledge and skills necessary for successful participation in the game of team handball. This format gives students more depth and focus on the game of team handball and the communication skills that good teamwork requires. While the primary focus of the class is the skills, strategies and rules of team handball, the underlying sub-focus of the course is the development of the social skills required to be a good team member. The commitment to a team sport requires students to encounter a collaborative atmosphere where they seek to solve complex movement problems and learn to cooperate to achieve various team goals. This course provides information not only on team handball, but also on how to incorporate team handball into one's fitness plan throughout life and the potential fitness benefits of regular participation in team handball. Foundational principles of creating an effective fitness and wellness plan including appreciation for factors impacting performance, safety, and injury prevention are addressed. Participating in team sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "91A", "credits": "1.5 Credits", "description": "KINES 91A focuses specifically and solely on outdoor soccer. It is designed to give students an understanding of the knowledge and skills necessary for successful participation in the game of soccer. This format gives students a more in-depth understanding of and focus on soccer and the communication skills that good teamwork requires. While the primary focus of the class is the skills, strategies and rules of soccer, the underlying sub-focus of the course is the development of the social skills required to be a good team member. The commitment to a team sport requires students to encounter a collaborative atmosphere where they seek to solve complex movement problems and learn to cooperate to achieve various team goals. This course provides information not only on soccer, but also on how to incorporate soccer into one's fitness plan throughout life and the potential fitness benefits of regular participation in soccer. Foundational principles of creating an effective fitness and wellness plan including appreciation for factors impacting performance, safety, and injury prevention are addressed. Participating in team sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "91C", "credits": "1.5 Credits", "description": "KINES 91C focuses specifically and solely on rugby. It is designed to give students an understanding of the knowledge and skills necessary for successful participation in the game of rugby. This format gives students more depth and focus on the game of rugby and the communication skills that good teamwork requires. While the primary focus of the class is the skills, strategies and rules of rugby, the underlying sub-focus of the course is the development of the social skills required to be a good team member. The commitment to a team sport requires students to encounter a collaborative atmosphere where they seek to solve complex movement problems and learn to cooperate to achieve various team goals. This course provides information not only on rugby, but also on how to incorporate rugby into one's fitness plan throughout life and the potential fitness benefits of regular participation in rugby. Foundational principles of creating an effective fitness and wellness plan including appreciation for factors impacting performance, safety, and injury prevention are addressed. Participating in team sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "91D", "credits": "1.5 Credits", "description": "KINES 91D focuses specifically and solely on the lifetime sport of ultimate. It is designed to give students an understanding of the knowledge and skills necessary for successful participation in the game of ultimate. This format gives students more depth and focus on the game of ultimate and the communication skills that good teamwork requires. While the primary focus of the class is the skills, strategies and rules of ultimate frisbee, the underlying sub-focus of the course is the development of the social skills required to be a good team member. The commitment to a team sport requires students to encounter a collaborative atmosphere where they seek to solve complex movement problems and learn to cooperate to achieve various team goals. This course provides information not only on ultimate, but also on how to incorporate ultimate into one's fitness plan throughout life and the potential fitness benefits of regular participation in ultimate. Foundational principles of creating an effective fitness and wellness plan including appreciation for factors impacting performance, safety, and injury prevention are addressed. Participating in team sports will help students understand that regular activity has social, emotional, and physical benefits with potential for total well-being and a better quality of life.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "92", "credits": "3 Credits/Maximum of 3", "description": "KINES 92 has been designed to help students build overall fitness and wellness based upon their individual condition and accommodating individual needs. Students acquire the knowledge and critical thinking skills that are essential to the development and continual evolution of a fitness and wellness plan focused on a healthy and active lifestyle. Students explore such topics as wellness, training principles, health-related components of physical fitness, benefits of these components, and learn to use and apply established fitness guidelines. Students learn skills necessary to create safe, complete conditioning programs while considering such topics as nutritional choices, safety and injury prevention. KINES 92 may serve as a stepping stone to lifetime fitness, participation in organized athletic events, and personal challenge activities. Students develop a holistic approach to training for endurance, strength, and integrated activities.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "93", "credits": "1.5-3 Credits/Maximum of 6", "description": "The KINES 93 curriculum provides a unique approach to movement education. Rather than focusing on regimented skill development over a period of a semester, KINES 93 requires students to incorporate activity into their daily lives which may continue over multiple semesters. The curriculum is designed to bring a higher percentage of students into a movement subculture requiring understanding of and involvement in such experiences as related clubs, tournaments, competitions, engaging experiences, and/or membership in national or international organizations or workshops. Students experience opportunities to enhance mastery through a focus on specified lifestyle management, personalized wellness, and training as well as advanced movement instruction. Students experience a healthy balance of more advanced training practices and depth to performance related behaviors (e.g. nutrition, training, lifetime wellness) in the specified activity. To reinforce the subject and to encourage practice of becoming part of the subculture, students become connected to the subculture by engaging in appropriate organizations, and/or subscribing to relevant publications. This intensity of involvement is designed to produce students who become bona fide members of a movement subculture by the time they leave the program. The expectation is that students will embody the habits, values, and attitudes needed for an active, healthy lifestyle.", "prerequisite": "Successful completion of relevant course, adequate experience in the topic, or permission of the instructor", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "96", "credits": "0.5-3 Credits/Maximum of 99", "description": "This course is designed to meet the needs of students to expand Kinesiology experiences beyond the designed course curriculum.  KINES 096 Independent Study in Physical Activity (1-3 per semester) (GHA) Students enroll in KINES 096 to take advantage of a unique movement experience in which they plan to participate. They enroll in KINES 096 by an application process. Students who feel that they would like to fulfill their Health Science and PhysicalActivity (GHA) requirement by pursuing a movement form outside of the normal curricular offerings apply to the department of Kinesiology. Applications will be screened to see that they fulfill the tenants of the GHA requirement.The topics for this course vary widely from student to student. A student may be working on a personal contract that has been designed to report the progress of experiences from hiking excursions in Nepal to a mountain biking course in Crested Butte, Colorado, to walking a mile in 15 minutes after major knee surgery. Therefore, many common topics are an exception rather than a rule during any given semester. Each student completes a proposal form that requires that they describe their need for this course. They are also asked to describe the experience that they have identified in detail and also a preliminary program and implementation plan for the detailed program. This proposal is then approved or denied by the faculty member facilitating the independent study program. After the proposal has been approved or denied the student will receive a letter notifying them of their status in the course. If they have received an approval letter they are instructed in the letter to meet one-on-one with the class instructor. At the initial meeting, the proposal is discussed and when there is an agreement with the student and instructor concerning the requirements for the student to complete the course successfully a contract is written and signed by both the instructor and the student. Weekly contact, at a minimum, with the instructor is required.Student evaluation techniques shall include but not be limited to objective testing, individual projects, presentations, journals and subjective evaluation of effort involved in meeting the stated goals and objectives for the course.There are no special facilities for this course. The department plans to offer this course every fall and spring semesters, with an enrollment of up to 25 students each semester.", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "KINES", "number": "100", "credits": "3 Credits", "description": "Philosophical, ethical, historical, cultural, psychological, and behavioral foundations of human movement, health, wellness and exercise.  KINES 100 The Cultural and Behavioral Foundations of Kinesiology (3) This course introduces and integrates the philosophical, ethical, historical, cultural, and psychological foundations of kinesiology. Kinesiology is a dynamic, multi-disciplinary area devoted to the study of human movement. Kinesiology is unique in that it covers the \"three cultures\" of academia: the sciences, the social sciences, and the humanities. This foundational, entry-level survey course introduces students to social scientific and the humanistic approaches to sport, exercise, health, wellness, and physical activity. Topic areas include the psychology of exercise and sport, the history of sport and physical activity, and the philosophy and ethics of sport and physical activity. Throughout the course, applications and integration to human health, physical activity, and to health and fitness professions are provided. The Philosophical & Ethical Foundations of Human MovementThis section introduces students to the philosophical and ethical aspects of kinesiology. This includes fundamental question of human movement, explorations of dualism and holism, ethical decision-making in sport, games and play, and an introduction to the ethical obligations of kinesiology and health/wellness professionals The Cultural Foundations of Human Movement This section introduces to the historical, cultural, and social dynamics of kinesiology. Building off a philosophical foundation, it includes questions about why and humans move, the effects of historical and cultural influences on sport, physical activity, health, and human movement, as well as the roles that social identities play in these processes. In addition, this course module explores significant cultural considerations for kinesiology and health/wellness professionals. The Psychological Foundations of Human Movement This section introduces students to the psychological dimensions of kinesiology. This includes information about psychological orientations and enhancement in exercise and sport and foundations of health and psychological well-being. This section also addresses principles of behavior change, reinforcement, motivation, intervention, and performance enhancement and emphasizes psychological and health theories to explain physical activity behavior. It also includes information about the importance of sport and exercise psychology for kinesiology and health/wellness professionals."}, {"department": "KINES", "number": "101", "credits": "3 Credits", "description": "Biomechanical, physiological, and neurobiological foundations of human movement and exercise, including applications to clinical conditions, rehabilitation, and fitness are presented.  KINES 101 The Biophysical Foundations of Kinesiology (3) This course introduces and integrates the physiological, neural, anatomical and biomechanical foundations of kinesiology. Throughout the course, applications to human health, physical activity, and to health and fitness professions are provided. The Physiological Foundations of Human MovementThis section introduces students to basic physiological principles that are necessary to understand exercise metabolism, adaptations to training, and changes that occur throughout the lifespan. This section builds important groundwork in exercise physiology to enable the student to understand the fundamental principles of energy metabolism and adjustments to energy metabolism as a result of acute and chronic exercise. Adaptations to chronic exercise training to the aerobic, anaerobic and muscular strength systems are a cornerstone of this section, but emphasis is also expanded to include functional capacity. The final section emphasizes the effects of exercise on chronic diseases, and takes a lifespan approach. The Neural Foundations of Human MovementThis section introduces students to basic neural anatomy and physiology that serve as a basis for understanding neural control of movement. This includes the cellular, anatomical and functional organization of the central nervous system, and applications to clinical conditions. Students are introduced to sensorimotor processes, as a foundation for understanding human motor control and motor coordination, and associated dysfunction. Anatomical Foundations of Human MovementThis section provides a survey of basic terms for describing human anatomy, including anatomical planes, axes, and directions, as well as an introduction to the major components of the musculoskeletal system. The fundamental structure and function of muscles and bones will be discussed with reference to their contributions to human movement. Mechanical Foundations of Human MovementThis section introduces the physical principles that underlay the study of biomechanics. Students will learn how to properly describe human movement using terminology for linear and angular motion. Newton's three laws of motion will be introduced and used for as a basis for discussing the role of forces and torques in starting and stopping motion. This section will include discussions of the biomechanics of walking and the biomechanical causes and effects of movement disorders."}, {"department": "KINES", "number": "126", "credits": "1.5 Credits", "description": "Introduction to the Coordinated School Health Program.  Overview of contemporary school-based health education theory, content, methods, and practice.  KINES 126 The Health Program for the Elementary School Child (1.5) KINES 126 is an introductory course designed to prepare school-and community-based educators to implement health promotion and disease prevention educational programs to elementary-aged audiences. Emphasis of the course is on the coordinated school health program model, theory, content, and teaching methods. Eight specific components of a coordinated school health program serve as the foundation for the course: (1) comprehensive school health education; (2) physical education; (3) school health services; (4) school nutrition services; (5) school counseling, psychological, and social services; (6) healthy school environment; and (7) school-site health promotion for faculty and staff; and family and (8) community involvement in school health. Students will gain experience in health promotion and disease prevention concepts; lesson planning; roles and responsibilities of teachers, staff, administrators, and students; and implementing effectively the health education concepts outlined above. The Department will offer one large section each fall and spring semesters with an anticipated enrollment of 150 students per section. A technology room will be required.Participation in this course will enable the student to: a. Analyze the goals, roles, and responsibilities of the classroom teacher concerning the health of the school-aged child. b. Identify appropriate educational resources related to school health. c. Describe the components of the coordinated school health program d. Discuss the important of learning healthy life skills for elementary-aged learners. e. Organize and submit one modified health-based lesson plan for elementary-aged leaners. f. Demonstrate competency in accessing health education resources from the World Wide Web.Methods for Evaluation: Written examinations 50% Lesson Planning 30% In-Class Participation 20%", "prerequisite": "EDPSY 14"}, {"department": "KINES", "number": "127", "credits": "1.5 Credits", "description": "Theoretical and practical overview of developmentally appropriate physical education for children.  KINES 127 The Physical Education Program for the Elementary School Child (1.5) KINES 127 is an introductory course designed to introduce future classroom teachers to the conceptual framework of developmentally appropriate physical education. The class includes both theoretical and practical guidelines for analysis and implementation of children's physical education. The course focuses on applications of the Pennsylvania standards for elementary educators K-6. The components of KINES 127 include: concepts related to becoming and remaining physically active for a lifetime, physical fitness, motor development, movement and fitness concepts and fundamental motor skills, safety procedures, role and value of play, game and sports in child development. Students will gain experience teaching physical education lessons, as well as observing and participating in physical education experiences. Students will be introduced to multi-cultural dance and games. Students will understand the use of small and large equipment. Evaluation will include written examination, group peer teaching, and participation. The Department will offer 4 sections each Fall and Spring semesters with an anticipated enrollment of 30 students. The Department will offer 1 section per summer semester with an anticipated enrollment of 30 students.Participation in this course will enable students to: 1. Define and develop a philosophy of elementary physical education. 2. Identify developmental characteristics and stages for children grades K-8. 3. Develop professional teaching techniques. 4. Apply act ivies for physical education, using proper safety procedures. 5. Discuss the importance of nutrition, personal wellness, and lifelong healthy habits. 6. Understand the human body and its systems. 7. Demonstrate competency in accessing physical education activities and resources from the World Wide Web.Methods for Evaluation: Writing Examination 50% Group Peer Teaching and lesson planning 20% Written Observation of Peer Teaching 10% Participation 20%"}, {"department": "KINES", "number": "135", "credits": "3 Credits", "description": "Introduction to Athletic Training provides an overview of the field of athletic training exploring the breadth of athletic training terminology, issues, and injuries. After completing the course, the students will be able to describe the roles of the sports medicine team, understand the legal considerations for the athletic trainer as a health care provider, and identify the basics of physical conditioning and nutrition in reference to injury prevention. Students will be able to describe an emergency action plan for injuries, and environmental conditions. Students will be able to identify basic use of therapeutic modalities and principles of therapeutic exercise programs. Students will gain an understanding of acute vs. chronic injury conditions and be able to describe the related anatomy, etiologies, pathologies, signs and symptoms, and general treatment and management for injuries of the foot, ankle, lower leg, knee, hip/groin, shoulder, elbow, wrist, hand, cervical spine, and head. Rationale and demonstrations for a variety of taping techniques are included to address upper and lower extremity injuries. Students are also provided an overview of general medical conditions that may occur in the athletic arena.", "other": ["Cross-listed with: ATHTR 135"]}, {"department": "KINES", "number": "136", "credits": "3 Credits", "description": "Approximately 11% of all jobs in the economy are in the healthcare sector. This course will provide an overview of the US healthcare system and the various careers that can be pursued within it. Several career paths (such as athletic training, physical therapy, occupational therapy, physician assistant, chiropractor, medical doctor/osteopath, nursing, diagnostic technician, clinical exercise physiologist, speech pathology and alternative therapies) will be explored in detail with opportunities to interact with professionals working in those careers. For each profession, the clinical focus, clientele, job responsibilities, knowledge, skills, personal attributes, typical workday, work/life balance, financial considerations, ethical considerations, and legal considerations will be discussed. Student personality traits will be assessed and used to help with career exploration. The requirements for gaining admission to various healthcare educational programs will be elucidated. In culmination, students will outline an academic plan to prepare them to apply to the program of their choice, as well as a Plan B option."}, {"department": "KINES", "number": "160N", "credits": "3 Credits/Maximum of 3", "description": "Biology of Exercise is an integrative exercise physiology course that combines performing physical activity (Kinesiology) and applying biological principles (Biology). This course will explain the benefits, changes, and processes the body exhibits while exercising. Students will gain knowledge and comprehension through both a lecture (or online) setting (approximately half of the class meetings) as well as an activity component (approximately half of the class meetings) in which students will demonstrate their health related components of fitness. This includes, but is not limited to, muscular strength, muscular endurance, flexibility, power, cardiorespiratory endurance, and body composition. In the lecture component, students will describe biological principles including homeostasis, nutrition, the structure and function of musculoskeletal, cardiovascular, and respiratory systems. At the completion of this course, students will be able to argue for the lifelong significance of exercise including why it is important, benefits related to organ systems, and disease prevention.", "other": ["Bachelor of Arts: Natural Sciences", "General Education: Health and Wellness (GHW)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "165", "credits": "3 Credits", "description": "Principles of healthy living which are the basis for health instruction in schools and health care settings."}, {"department": "KINES", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "KINES", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "KINES", "number": "200", "credits": "3 Credits", "description": "KINES 200 addresses the physiological basis of strength training emphasizing mechanisms of muscle contraction and growth, program and facility design, and individual exercise technique. This course focuses on the concepts and applications of strength exercise science including relevant testing and evaluation of strength protocols. It explores the organization and administration of resistance training and conditioning facilities including the development of resistance training programs. The course also introduces students to exercise techniques. As a result of this course students will be able to work collaborative with others. They should be able to evaluate information for authority, relevance, currency and accuracy. They will understand the biomechanics of strength training, the physiological adaptations to muscle training and the mechanisms of change with varying populations. In addition they should be able to select and organize appropriate muscle testing protocols. They should be able to teach and demonstrate appropriate strength exercises to an individual or group as well as be able to identify and correct errors an individual might make. They should be able to prescribe the proper exercise and exercise sequence to strengthen a specific muscle or muscle group, and they should be able to design and organize a strength training facility.", "prerequisite": "BIOL 141"}, {"department": "KINES", "number": "201", "credits": "3 Credits", "description": "Exploration of the principles and practical applications of cardiorespiratory training for health and performance enhancement.  KINES 201 Cardiorespiratory Training for Health and Performance (3) KINES 201 prepares students in understanding the process of developing a cardiorespiratory exercise prescription program. Exercise programming is scripted on an individual basis according to goals, national guidelines, age, interests, available time, and commitment. The benefits of physical activity are becoming increasingly documented. However, physical activity is not without risks. The proper cardiorespiratory exercise prescription is important to the safe participation for a wide range of populations. Students will be able to determine the differences between activity, fitness, and sport performance and be cognizant of the various components and modes of cardiorespiratory activity. Students will understand the different models of cardiorespiratory exercise prescription for health, fitness, and sport performance. Applying this knowledge, students will experience practical applications of cardiorespiratory exercise prescription on various training modalities applied to a wide range of settings. Homework assessments, laboratory activities and/or mid-term and final exams based on the discretion of the course instructor will reflect the pedagogical and practical application of cardiorespiratory exercise prescription concepts.The Department is planning to offer one section every year with an anticipated enrollment of 25 students per section."}, {"department": "KINES", "number": "202", "credits": "3 Credits", "description": "This course is designed to provide students a didactic and laboratory experience in functional human anatomy. Upon course completion, students should be able to comprehend and apply standard anatomical nomenclature pertaining to human movement science; comprehend structure and function of the musculoskeletal, systems pertaining to human movements science; comprehend the classification, structure and function of human anatomical articulations (joints) pertaining to human movement science; and comprehend the classification, structure, and function of human biological tissues (epithelium, connective, muscle and nervous) pertaining to human movement science. In the laboratory portion of the course students will learn to identify bone and capsuloligamentous tissues as well as their respective landmarks pertaining to human movement science; identify origins, insertions, actions and innervations of skeletal muscles pertaining to human movement science; and identify biomechanical characteristics and neuromuscular activity of human anatomy during the execution of active, passive as well as resistive movements. The laboratory portion of this course will use three-dimensional bone models, joint models, ligament models and cadaveric models to apply concepts covered in lecture.", "prerequisite": "2nd Semester Standing in HHD or KINES major or KINES minor or ATHTR major", "other": ["Cross-listed with: ATHTR 202"]}, {"department": "KINES", "number": "202H", "credits": "4 Credits", "description": "In-depth examination of the, musculoskeletal, nervous, cardiovascular, and respiratory systems, and their relationship to human movement.", "other": ["Honors"]}, {"department": "KINES", "number": "203", "credits": "3 Credits", "description": "Comprehensive review of terms related to functions, disorders, diagnosis, and treatment of body systems related to physical activity and movement.  KINES 203 Medical Terminology for Allied Health Professionals (3)This course is designed for students who wish to enter an allied health field related to physical activity and human movement. This course will help students prepare for careers in physical therapy (PT), occupational therapy (OT), medicine (MD, DO), physician assistant (PA-C), pharmacy (R.Ph), dietary medicine (RD) and emergency care (EMT, EMT-P). Some of the allied health programs listed above requires a 3 credit course in medical terminology prior to admission into graduate school and this course fulfills that requirement. The goal of this course is to help students develop an understanding of medical terminology related to physical activity and human movement used when dealing with the anatomy and physiology of the systems of the body, disease processes associated with each system, and pharmacology and clinical treatments associated with the pathology of the body systems. Students will appreciate the weights and measures, chemical symbols, diagnoses, procedures, and medical documentation used in allied health fields, especially in sports and human movement medicine."}, {"department": "KINES", "number": "222N", "credits": "3 Credits", "description": "The purpose of this course is to explore gender differences in sport and politics that emerge from physiology, culture, history, politics, and policy. The engagement of women in sport has unique physiological considerations and ethical dilemmas as well as a rich history of defining moments and important ties to feminism and politics. In this course, students will learn how physiology differences affect female athletic performance and the effects of exercise on the female body, as well as how cultural, historical, and political forces shaped women's participation in sport. Students will also see how similar historical, cultural, and political forces affect women's involvement in politics. Combined, students will understand how similar forces shape gender norms and participation two different, yet related, aspects of society. Additionally, students will learn about the push for evidence-based policymaking and apply that knowledge to topics including doping, pregnancy, and gender verification. Students will integrate physiology and policy in a final assignment advocating for evidence-based sport policy. They will also educate their peers through a public education project.", "other": ["Cross-listed with: PLSC 222N, PUBPL 222N", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "233H", "credits": "3 Credits/Maximum of 3", "description": "Introduction into emergency medical care with emphasis on management of common emergency situations occuring during athletic participation. This is a laboratory fee based course.", "other": ["Honors"]}, {"department": "KINES", "number": "260", "credits": "3 Credits", "description": "KINES 260 prepares students to read, understand and critique scientific research. The epistemological belief that knowledge is static and science discovers truth will be challenged. Rather than research being a product achievable only by professors, research will be presented as a process that students can understand and contribute to. Therefore, this course will develop skills and knowledge in understanding and conducting scientific research through practical experience. Specifically, students will learn to search for articles and be able to evaluate different sources of knowledge. Reading strategies will be employed to develop the ability to read and produce research papers according to standard structure and formatting. Students will gain experience using a range of different measurements of human movement and behavior, and understand general measurement issues. Practical experience with different types of research in kinesiology will occur throughout the semester, aiding students to critique and design research. Students will learn when to employ different statistical tests, be able to analyze data using statistical software, and interpret the results. Experience in other computer software will occur throughout the semester to develop student's word processing, spreadsheet and graphical skills. This knowledge and skills will be integrated throughout the semester and culminate in a research project performed by teams of students.", "prerequisite": "KINES 101"}, {"department": "KINES", "number": "267", "credits": "1 Credits", "description": "Instruction for performing and delivering developmentally appropriate psychomotor skills, movement patterns, and content to preschool and elementary school-aged children. The course is designed for students interested in understanding how to instruct movement concepts, skill themes, and fundamental movement skills to preschool and elementary school aged-children. An understanding of developmentally appropriate skills and physical activities and an understanding of how to effectively instruct fundamental movement skills to this population of children make-up the foundations of the course. Students will apply content knowledge to instructing, coaching, and executing movement concepts, skill themes, and fundamental movement skills. Students will be able to identify and organize appropriate skills and activities based on the developmental level of preschool and elementary students. Students develop knowledge and skill in designing and implementing movement and rhythmical activities for preschool and elementary students. Emphasis is placed on the ability to analyze and instruct the associated movement skills. A primary focus of the course is to create interesting challenges that motivate children to continue to practice tasks and engage in regular physical activity. The first half of the course will provide an introduction to developmentally appropriate fundamental movement skills, physical activity participation rates of children, and special considerations when instructing and coaching. Students will examine how the developmental level of the child relates to their level of skill proficiency and the importance of children learning correct skill execution in order to enjoy participation in regular physical activity. The second half of the course will focus on each specific fundamental motor skill. Students will learn the correct form of execution, common errors of execution, verbal cues associated with correct execution, and application of the fundamental motor skill to a developmentally appropriate activity. In this portion of the course, students will have the opportunity to use the knowledge and skills learned in this course by engaging in peer-to-peer instruction sessions."}, {"department": "KINES", "number": "295", "credits": "1 Credits/Maximum of 1", "description": "This course exposes students to self-examination, career pathways, certification prerequisites and internship opportunities within the related field of studies. This course is designed to expose students to specific career pathways, specific certification prerequisites, internship opportunities and professionals in the applied kinesiology fields of study through experimental learning. This course offers, but is not limited to offering, many enriching professional development skill building lectures and assignments, professional interview, and completion of observation hours within a professional setting. Students can choose from a variety of sites, including but not limited to schools, YMCAs, fitness centers, university courses, community or corporate health and wellness programs. Students are required to choose a field that directly relates to their career goals and/or expected professional certifications. Students must complete a minimum of 12 hours of a hands-on experience in that field. The expectation is that students apply and integrate content from other and concurrent courses in the program and further learn appropriate applied skills that are critical to success in the field. This course covers the breadth and depth of discussion pertaining to professional career development within the vast possibilities within the field of applied exercise & health. An important focus of the course are the preparatory fundamentals that foster better student awareness, opportunities and discussion of how to utilize a B.S. degree in Kinesiology for career development and success within the industry. The student's field experience productivity and work will be evaluated on an ongoing basis by the course instructor as well as the field experience supervisor. The course may take place at either on campus facilities or off campus locations."}, {"department": "KINES", "number": "295B", "credits": "1 Credits/Maximum of 1", "description": "KINES 295B (1 credit) is a required course for students in the Movement Science Option and the Applied Exercise and Health Option of the Kinesiology curriculum. It is the first of three practicum courses that exposes students to general and specific career information, an observational experience, research and professionals in Kinesiology related fields of studies. This course is designed to expose students to specific career pathways, specific certification prerequisites, internship opportunities and professionals in the applied Kinesiology fields of study through experimental learning. This course offers, but is not limited to offering, many enriching professional development skill building lectures and assignments, professional interview, and completion of observation hours within a professional setting. Students can choose from a variety of sites, including but not limited to schools, YMCAs, fitness centers, university courses, community or corporate health and wellness programs. Students are required to choose a field that directly relates to their career goals and/or expected professional certifications. Students must complete a minimum of 12 hours of a hands-on experience in that field. This course covers the breadth and depth of discussion pertaining to professional career development within the vast possibilities within the field of applied exercise & health. An important focus of the course are the preparatory fundamentals that foster better student awareness, opportunities and discussion of how to utilize a B.S. degree in Kinesiology for career development and success within the industry. The student's field experience productivity and work will be evaluated on an ongoing basis by the course instructor as well as the field experience supervisor. The course may take place at either on campus facilities or off campus locations.", "prerequisite": "2nd semester standing"}, {"department": "KINES", "number": "295C", "credits": "1-2 Credits/Maximum of 8", "description": "KINES 295C Professional Development - Field Experience (1-2 per semester/maximum of 8) This course is designed to provide undergraduate students the opportunities of professional development via lecture format, professional travel to a national conference, and guest round table discussions. Throughout the course, students will have exposure to professional communication with faculty through formats including, but not limited to the following: conference forums, faculty/professional/expert dinner discussions, lectures, training sessions, symposiums, break-out sessions, and a poster forum. The students will enhance skills needed to develop networking and interview skills, communicate information effectively, and build resumes to meet the needs for such endeavors as graduate school, internship acquisition, and/or employment. Other class foundational principles include but are not limited to: attending a professional conference, practicing business etiquette at professional lectures and expositions, exposure to professional networking, learning how to exchange knowledge within the professional realm, and researching professional collaborative work. Students will share the experience and knowledge gained from this professional travel through relevant exercises that may include a formal poster forum within the university setting.", "prerequisite": "completion of three credits in KINES"}, {"department": "KINES", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "KINES", "number": "296F", "credits": "1-6 Credits/Maximum of 18"}, {"department": "KINES", "number": "296G", "credits": "1-6 Credits/Maximum of 18"}, {"department": "KINES", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "KINES", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "KINES", "number": "303", "credits": "3 Credits", "description": "Develop skills for First Responder Certification in CPR/AED, First Aid and Safety by American Red Cross or National Safety Council.  KINES 303 Emergency Care - First Aid/Safety/AED (3) (GHA) KINES 303 is designed to provide students with the opportunity to acquire and develop the skills and competencies needed for First Responder Certification in CPR/AED, First Aid and Safety from the American Red Cross and/or National Safety Council. Students will understand the role of the Emergency Medical System (EMS) in a complex society and the importance of emergency care in our health care system. KINES 303 will foster the student's critical thinking skills and their ability to assess and evaluate life threatening and disabling injuries and illnesses and to respond with appropriate care and life saving action steps in variety of medical emergencies. Students will develop an understanding of the importance of emergency care, first aid and safety at all levels of society with emphasis on providing and improving the quality of emergency care practices in a wide variety of community organizations, occupations and professions including childcare, education, human services, geriatric care and disaster management. KINES 303 is taught through a variety of teaching methods. Students are prepared for proficiency through readings, classroom discussion, video presentation, practical skills, sudden illness and injury scenarios, group presentations and direct observation of EMS (Ride-Alongs). The course is practice-focused on developing the skills and competencies necessary for emergency scene management, CPR/AED and sudden illness and injury. Various evaluation techniques will be used to assess the students progress in KINES 303. These techniques shall include but not be limited to conventional objective testing, practical skill tests, sudden illness and injury scenarios, group presentation and written observation papers. Students who have already received credit for NURS 203 and/or KINES 233 may not enroll in this course due to duplication of material.", "other": ["General Education: Health and Wellness (GHW)"]}, {"department": "KINES", "number": "304", "credits": "1 Credits", "description": "Competencies leading to certification for teaching American Red Cross Advanced First Aid and Emergency Care and American Heart Association Cardiopulmonary Resuscitation.  Laboratory.", "prerequisite": "KINES 303"}, {"department": "KINES", "number": "321", "credits": "3 Credits", "description": "Psychology of Movement Behavior is designed to introduce students to the basic concepts and applications of psychological knowledge for organized sport, physical activity, athletic training, and related environments where people are active. The course touches on the history of sport and exercise psychology, sport and exercise psychology consultants' responsibilities (i.e., research, teaching, and service), and understanding sport and exercise participants' personality traits and motivation for participation. The course also promotes an understanding of sport and exercise environments through discussion of competition, group dynamics, and the principles of feedback and reinforcement. Performance enhancement is also covered through discussion of topics related to psychological skills training and application (e.g., goal setting, imagery, and relaxation training). Finally, the course focuses on enhancing sport and exercise participants' health and well-being by promoting an understanding of addictive behaviors (e.g., exercise dependence, eating disorders, and substance dependence), body image, injury rehabilitation, and exercise initiation, maintenance, and adherence. The general objective of this course is to familiarize the student with the science and practice of sport and exercise psychology from both a theoretical and applied perspective. To achieve this objective, the student will: (a) develop an understanding of how various psychological factors influence athletic performance, physical activity participation, and overall health and well-being; (b) learn the methods used by athletes and exercisers of various skill levels to achieve peak performance; (c) understand the scientific and theoretical background of sport and exercise participation; and (d) comprehend how psychological skills are applied to sport and exercise environments to enhance peak performance and quality of life, and recognize the ethical principles of applying these psychological skills.", "prerequisite": "KINES 100"}, {"department": "KINES", "number": "321H", "credits": "3 Credits", "description": "Basic concepts and application of psychological knowledge for organized sport, physical activity, and athletic training.", "other": ["Honors"]}, {"department": "KINES", "number": "341", "credits": "3 Credits/Maximum of 3", "description": "Connections between sport and broader historical, cultural, social, political, intellectual, and economic contexts.", "prerequisite": "KINES 100", "other": ["International Cultures (IL)", "United States Cultures (US)"]}, {"department": "KINES", "number": "345", "credits": "3 Credits", "description": "The course focuses on the development of philosophic reasoning skills to better understand the values and ethics of physical activity in a variety of professional settings. Emphasis is placed on the practicality of good philosophy, on applying philosophic insights to the health and physical activity workplace. The course shows how philosophic commitments are unavoidable and thus, why it is better to formally consider these commitments and evaluate their worth than adopt professional standards and behaviors without critical reflection. Specific course content emphasizes a number of learning outcomes. The first objectives are related to clarifying the nature of the philosophy of physical activity and relationships between the philosophy and science of human movement. The field of philosophy is described including the areas of metaphysics, epistemology, axiology, ethics and aesthetics. A variety of philosophic methodologies are identified and practiced including inductive, deductive and descriptive reasoning. Emphasis is placed on the varying degrees of confidence placed on the trustworthiness of philosophic methods and the validity of its conclusions. Students take a \"philosophic readiness inventory\" to determine their own philosophic tendencies and interests. Once the philosophy of physical activity is better understood, its methods and products are compared to the methods and outcomes of science. The course emphasizes a potential complementary relationship between the two where neither one is sufficient. A major portion of the class is devoted to three rival interpretations of personhood that have significant implications for professional practice. Students review the strengths and weaknesses of dualism, materialism, and holism and see their impact on biomedical ethics, motivational strategies, professional-client relationships, and other facets of health and physical activity professions. The undergirding logic here is that practitioners must first understand what a person is before they can best determine how to intervene or otherwise provide services to them. Attention is also directed to the subject matter of Kinesiology-namely, skilled movement in general and physical abilities in work, exercise, sport, dance, games, and play more specifically. The nature and values of these different ways of moving are analyzed in terms of their ability to serve as \"tools\" (means to other ends) and \"jewels\" (ends in themselves). Issues of motivation, efficacy, safety, and other factors are analyzed in an attempt to determine whether a play-and-enjoyment or a work-and-duty philosophy should be emphasized in various professional settings. Quantity and quality of life are juxtaposed to show their interdependence and the variable roles they play in affecting allied medical, coaching, teaching, fitness, recreation, and other movement-related professions. Finally, the course addresses common ethical problems faced by athletes, as well as physical activity and health professionals.", "prerequisite": "KINES 100"}, {"department": "KINES", "number": "350", "credits": "3 Credits", "description": "Structure and function of the human body as applied to health, wellness, exercise, and sports.  KINES 350 Exercise Physiology (3) Exercise Physiology is a mid- to upper division course that will appeal to students with an interest in human biological adaptation. The course has two primary goals: First, students develop an understanding of the physiological adaptations that occur during and after endurance and resistance exercise. Second, students improve their comprehension of the differences between the acute exercise response and the changes that occur with chronic physical activity (exercise training). A major emphasis is placed on physiological systems as they relate to physical activity, exercise and health, and environmental stress; including, but not limited to, cardiovascular, respiratory, musculoskeletal, renal, neural, and metabolic. These systems are considered singly and in combination with regard to both exercise intensity and exercise duration. The depth of inquiry can range from molecular to organismal (whole-body). In addition, the mechanisms underlying the preventive and protective effects of exercise on human health and performance are discussed. The ability to apply concepts and principles of physiology to situations involving exercise, exercise training and decreased physical activity are highlighted, improving students' abilities to develop and differentiate between paradigms that utilize exercise to improve athletic performance and those that utilize physical activity to promote health. Special topics of applied study may include aging; development; gender; body composition; disease and environmental extremes such as heat, cold, diving and altitude. Students are required to demonstrate via assessment, knowledge and understanding of the acute physiological response to exercise and physiological adaptations to programs of chronic resistance and endurance exercise. Quantitative and analytical skills are emphasized, especially as they pertain to exercise testing and exercise program evaluation. The ability to interpret scientific data as they pertain to exercise physiology is required. Background knowledge in biology, chemistry, physics, and exercise science represent the knowledge base from which the class is built and contributes to the mastery of concepts presented. This course is required for Athletic Training and Kinesiology majors.", "prerequisite": "KINES 101"}, {"department": "KINES", "number": "356", "credits": "3 Credits", "description": "KIES 356 is an examination of hypokinetic disease on human wellness involving identification, assessment, research, and exercise design of human activity for disease prevention. Content in this course defines what physical activity, fitness, and lifestyle are. It covers the methodological and measurement assessment of physical activity and disease as well as exploring the relationships between physical activity and specific physical diseases, and between physical activity and various disorders of the mind. After this course students will be able to design and implement an exercise program to prevent or combat the effects of a specific disease on an individual. They will understand and be able to persuasively inform clients to the dangers of a sedentary lifestyle. They will know the strategies necessary to motivate and modify individual behavior so that it results in a more healthy lifestyle. And they will be able to design epidemiological research protocols to study the relationship between a specific disease and activity. Knowledge will be assessed by written evaluations, through the use of case studies in the case of exercise prescription skills, and through presentation of high quality group projects. This course will complement other courses in this curriculum but will be the only course devoted to a thorough investigation of the relationship between inactivity and various disease states. Material in this course and experience in the lab cover the conceptions and applications of strength exercise science. It also addresses testing and evaluation of strength protocols including selecting appropriate tests, organizing testing procedures, and individual testing protocols and procedures. Students will be introduced to material which overviews the organization and administration of resistance training and conditioning facilities. They will also learn the design principles of resistance training programs as well as exercise techniques. After this course, students will understand the biomechanics of strength training, the physiological adaptation to muscle training, and the mechanisms of change with varying populations. Students will be able to select and organize appropriate muscle testing protocol and will be able to teach and demonstrate appropriate strength training exercises to individuals and groups, including being able to identify and correct errors.", "prerequisite": "BIOL 141"}, {"department": "KINES", "number": "358", "credits": "1 Credits", "description": "Skills development including research identification and evaluation of work-enhancing methods and devices as related to human performance and wellness. In this course students will learn about the research identification and evaluation of work-enhancing methods and devices as they relate to human performance and wellness. The course will overview historical and ethical issues associated with the use of ergogenic aids, as well as the mechanisms that delineate how they affect body systems. Ergogenic aids will be classified as hormonal, pharmacological, psychological, physiological, mechanical and nutritional. In the course students will also look at various restorative and accelerate healing agents. As a consequence of this course students, will be able to identify specific ergogenic aids, their actions, their legality, advantages, disadvantages, and safety concerns. Students will also understand the research issues involved with ergogenic aids, as well as developing a philosophy for dealing with clients who approach them interested in these kinds of enhancements. Because of the topic's relevance to work in this field, this course gives students knowledge necessary to function effectively as a professional.", "prerequisite": "BIOL 161"}, {"department": "KINES", "number": "360", "credits": "3 Credits", "description": "This 3 credit lecture course provides a rigorous presentation of the neuroscientific foundations of human movement control and coordination. This course introduces students to the cellular basis of neurophysiology, while emphasizing the contributions of both sensory and motor systems to motor control, coordination, and development. The course provides an in-depth presentation of systems neuroscience, with a special emphasis on the spinal, brainstem, and cortical contributions to movement. The course introduces the physiology and functional anatomy of the major sensory systems, motor systems, and sensorimotor integration networks, of the spinal cord, brainstem, and hemispheric structures in the central nervous system. These include spinal circuitry underlying reflexes and central pattern generators, basal ganglia organization and functional networks, cerebellar organization and functional networks, primary, secondary, and tertiary cortical areas associated with sensory and motor functions, neural tracts associated with ascending and descending sensory and motor systems, and cortical-subcortical loops. Students are introduced to dysfunction in these systems from both disease and traumatic processes, due to development disabilities such as cerebral palsy, degenerative processes including Parkinson's Disease, vascular disease including stroke, as well as traumatic brain injury. The overall objective of this course is to prepare Kinesiology students with a foundational level preparation in neuroscience, as required for understanding control of human movement, motor coordination, motor development and dysfunctions in these processes. This course forms one of four 300-level core courses that provide the basic science foundations that underlie the study of human movement, including exercise physiology, biomechanics, and the psychology of movement behavior. Neuroscience represents the fourth foundational discipline that contributes to human movement science. This course is presented from a hierarchical perspective, that introduces the cellular basis of neural communication, as well as cortical, brainstem, and spinal systems that underlie sensorimotor functions. It provides a thorough introduction to the central nervous system, focusing on a systems level approach to sensory and motor physiology and its impact on motor control and coordination, as well as both developmental, degenerative, and traumatic disorders in these processes. Considerations of applications of the material to the fields of athletics and rehabilitation medicine are often provided.", "prerequisite": "KINES 101"}, {"department": "KINES", "number": "360H", "credits": "3 Credits", "description": "Examination of the basic mechanisms and variables that govern the coordina- tion and control of movement and the acquisition of skill.", "other": ["Honors"]}, {"department": "KINES", "number": "366", "credits": "3 Credits", "description": "Analysis of pedagogical skills and methods applied to K-12 physical education.  KINES 366 The Process of Teaching Physical Education (3) The purpose of this course is to introduce teacher candidates to the pedagogical processes used in teaching K-12 physical education. Physical education instruction techniques related to classroom management, creating effective learning environments, analysis of motor skills, providing effective feedback, content development, creating active learning experiences and systematic analysis of effective instruction comprise the foundation of this class. These pedagogical skills will be practiced and analyzed throughout the semester. Specifically, students will be required to demonstrate the ability to use, analyze and critique these techniques in micro-teaching situations with their peers. The primary focus of the class is to develop a repertoire of effective teaching skills based upon research of teacher effectiveness that enables teacher candidates to become reflective physical educators with the ability to deliver, analyze and modify their teaching to provide developmentally appropriate instruction for elementary, middle and high school students. The content of this course also addresses the physical education teaching standards developed by the National Association for Sport and Physical Education (NASPE), the national accrediting body for physical education teacher education programs that works in conjunction with the National Council for Accreditation of Teacher Education (NCATE) to certify physical education teacher education programs throughout the United States.Assessment of student performance in the course includes: 1. Participation in laboratory experiences (10%) 2. Performance on knowledge tests (35%) 3. The ability to correctly and effectively demonstrate a repertoire of pedagogical skills in simulated teaching situations (35%) 4. Teaching reflections based on class teaching experiences and analyses and observations of teaching (20%)", "prerequisite": "EDPSY 10"}, {"department": "KINES", "number": "367", "credits": "1 Credits", "description": "How to understand, perform and deliver individual and team games and sports across the lifespan. This course is designed to provide students with the opportunity to research, experience, and reflect upon the content knowledge necessary to successfully instruct and coach a variety of individual and team games and sports across the lifespan. Students will gain experience in at least one activity from each of the four games classification groups (net and wall, invasion, striking and fielding, and target games). Students will develop the knowledge and skills necessary to instruct and coach various lifetime individual and team games and sports. The games and sports chosen for this course (basketball, soccer, golf, softball, and tennis) have been specifically selected for three reasons related to lifespan development and participation. First, they are consistently included in preschool through 12th grade school physical education curriculums. Second, they are popular extra-curricular activities, which are heavily attended by young people and adolescents. Finally, they represent popular adult recreational (pick-up games) and competitive activities (adult leagues) that are often continued over the lifespan. Emphasis is placed on the student's competency in being able to effectively instruct and perform across multiple individual and team games and sports. Students will be expected to practically demonstrate a range of psychomotor techniques and skills for each given game and sport to a high level. Students will also need to display competence in a range of cognitive, affective and behavioral domain skills. This includes the ability to make appropriate game play decisions, communicate with teammates, understand and adhere to governing body rules/regulations and creating strategies to promote lifelong participation. Students will be assessed on their ability to instruct and coach the associated psychomotor skills, principles of play, and the official rules and regulations operated by each game or sport's governing body in a peer-to-peer instructional setting. Practical activity learning experiences are designed to provide students with a sound knowledge of the concepts associated with skill acquisition including the class/team/client structure and organization, teaching and coaching techniques, and developmentally appropriate activities. Peer to peer instructing and coaching sessions will be used as an instructional strategy."}, {"department": "KINES", "number": "368", "credits": "2 Credits", "description": "How to perform and deliver fitness and wellness concepts and exercises to individuals across the lifespan. The purpose of this course is to teach students how to effectively communicate, motivate, and engage individuals in fitness improvement exercises and activities across the lifespan (children, young adults, adults, and older adults). Understanding client management skills, various fitness environments, and specific individual fitness exercises and activities from the foundation of the course. Initially, students will learn appropriate and effective client management skills and will explore different instructional environments. Throughout the course, students will work on acquiring skills for developing progressions of exercises across the lifespan. The students will become familiar with contemporary fitness practices and exposed to a variety of exercises. Students will learn the associated execution cues and how to demonstrate the exercise. Students will apply content knowledge to instructing individuals how to properly engage in fitness exercises and activities that contribute to one's overall wellness. Students will be able to organize and execute a developmentally appropriate fitness program for a client that targets one or more of the components of fitness including: cardiovascular, muscular strength, agility, power, coordination, and flexibility. The primary objectives of the course are to develop an understanding of how to create an individualized fitness program that is appropriate for the individual and how to interact with the individual to promote engagement in regular exercise and activity and successful achievement of goals. Students will examine how the age and developmental level of the individual relates to ability and individual fitness programming. Students will learn the correct form of exercise execution and progressions of exercises. Content knowledge is integrated with application of skills in fitness exercise and instruction and will be put to use in a learning laboratory setting which students will have the opportunity to engage in hands-on instructional experiences.", "prerequisite": "KINES 200"}, {"department": "KINES", "number": "384", "credits": "3 Credits", "description": "Basic mechanical knowledge required to understand human movement. KINES 384 Biomechanics examines biological phenomena from a mechanical perspective; this course examines predominantly human movement from this perspective. The course aims to introduce students to the mechanical principles that underpin biomechanics, and to the measurement procedures used in biomechanics. Students will examine these principles for a variety of activities including: walking, running, jumping, quiet standing, throwing, striking, and reaching. Laboratory activities emphasize the qualitative and quantitative analysis of human movement. These sessions require students to work effectively in groups to collect data, and then work independently to analyze and interpret their data. Students use Newton's laws, basic algebra and trigonometry in the analysis of their data, and produce reports about these laboratory activities. The lectures provide the framework for all class activities. They aim to link the student's knowledge of anatomy with mechanics to provide an understanding of how movement is produced in both health and disease. The lectures provide information about the history, scope, and impact of biomechanics. Students are introduced to the pertinent kinematic variables required for the analysis of human movement. Newton's laws are used to understand both linear and angular human motion. Basic principles from aerodynamics are introduced as they may apply to man and the implements he or she may use. The examination of aerodynamic factors is augmented by examining the mechanics of balls spinning, and bouncing. Approaches for the determination of the inertial properties of human body segments are examined in detail, with a view to understanding the strengths and weaknesses of the various approaches. The theory, methodology, and protocols for image-based motion analysis are introduced as common methodology used in biomechanics. The principles behind force measurement are presented, using force plates as the core example. Students are taught the basics of the interpretation of ground reactions forces, using the impulse-momentum relationship. Contractile muscle mechanics are studied to under the influences of muscle fiber activation, length, and velocity on the production of force are presented. The mechanical properties of tendon are presented (stress-strain relationship), and its role in human movement. Potential and kinetic energy are introduced, along with the concept of energy storage and its application in the analysis of human movement examined. The principles governing modeling are introduced, and approaches for modeling human movement are established and then used to understand the coordination of human movement.", "prerequisite": "KINES 101", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "KINES", "number": "384H", "credits": "3 Credits", "description": "Basic mechanical knowledge required to understand human movement.", "other": ["Honors"]}, {"department": "KINES", "number": "395", "credits": "1 Credits/Maximum of 1", "description": "Introduction to hands-on leadership experience within the fields of health, fitness, wellness, and physical activity. This course is designed to provide students with a supervised practicum experience in applied careers in the fields of health, wellness, fitness, and physical activity. Through a combination of classroom-based discussion and workplace opportunities, this course allows each student the opportunity to observe professionals in the fields of health, fitness, wellness, and physical activity, complete hands-on experiences, and learn skills in professional development. This course also offers, but is not limited to offering, many enriching professional development skill building lectures and assignments. Students can choose from a variety of sites, including but not limited to YMCAs, fitness centers, university courses, community or corporate health and wellness programs. Students are required to choose a field that directly relates to their career goals and/or expected professional certifications. Students must complete a minimum of 40 hours of a hands-on experience in that field. The expectation is that students apply and integrate content from other and concurrent courses in the program and further learn appropriate applied skills that are critical to success in the field. The student's field experience, productivity, and work will be evaluated on an ongoing basis by the course instructor as well as the field experience supervisor. The course may take place at either on-campus facilities or off-campus locations.", "prerequisite": "KINES 295"}, {"department": "KINES", "number": "395A", "credits": "1 Credits", "description": "This is a one credit practicum designed to provide teacher candidates with the opportunity to observe, assist, and teach physical education classes in school settings. Most KINES 395A teacher candidates are in the final semester before starting their student-teaching internship and these experiences are intended to provide additional practical experiences in physical education instruction. This practicum involves a minimum of 10 consecutive weeks during a University semester. Teacher candidates need to demonstrate the ability to plan lessons, teach lessons, assess student learning, and reflect on their teaching performance during this practicum experience.", "prerequisite": "EDPSY 10"}, {"department": "KINES", "number": "395B", "credits": "1 Credits", "description": "Supervised experience in leading/assisting in tasks associated with fitness testing/prescription in a variety of settings.", "prerequisite": "KINES 295B"}, {"department": "KINES", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow  subject that may be topical or of special interest."}, {"department": "KINES", "number": "398", "credits": "1-9 Credits/Maximum of 9", "description": "Forman courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "KINES", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "KINES", "number": "400", "credits": "3 Credits", "description": "Basic concepts of planning and conducting physical education programs for children with physical, sensory, and/or intellectual impairments.  KINES 400 Adapted Physical Education (3) This is an undergraduate level course teaching students the basic concepts of planning and conducting physical education programs for children with physical, sensory, and/or intellectual impairments. This course will help the student to become more aware of the physical needs of children with disabilities and of the possibilities to professionally deal with these needs. The course requires the student to complete a 10-hour practicum, providing the opportunity to work with children with a disability. The practicum will be conducted in cooperation with physical education staff members working with various schools in State College. The children's difficulties may range from emotional problems to severe physical and mental handicaps. Students are free to identify alternative practicum sites (e.g., work with a friend or family member with a disability). The requirements for the practicum may include: select a child who has a physical, sensory, or intellectual disability; write an Individualized Education Program (IEP) using the guidelines presented in the textbook; implement the IEP in a two-on-one teaching situation (two students, one child); keep a log of all the practice sessions; after completing the 10-hour practicum, write a final report based on the IEP, this final report should state the definition of the problem, the etiology, the general characteristics, the teaching techniques specific to the disability, an evaluation of the actual teaching strategies and an evaluation of the outcome of the practice (did it work?); and, present the findings orally (10-15 minute talk).The student will generally be evaluated by exam, teaching activity, an oral presentation, and a final report.", "prerequisite": "KINES 202"}, {"department": "KINES", "number": "401", "credits": "3 Credits/Maximum of 3", "description": "Skills and practical knowledge to design safe and effective exercise classes for a variety of populations to improve health. The primary purpose of this course is to provide students interested in applied exercise and health careers (group fitness instructors, health and physical education teachers, personal trainers, wellness professionals, corporate fitness professionals, physical therapists) with skills and practical knowledge to design as well as instruct safe and effective exercise classes for a variety of populations to improve cardiovascular health, strength, and flexibility. Students will learn how to prepare for a class, which includes participant monitoring as well as evaluation and progresses to developing the skills for both programming as well as leading group exercise classes. Students will gather and apply the current literature regarding the ideal training strategies and practical tips for both healthy adults as well as special populations (i.e. asthma, obesity, youth, pregnancy, older adults). They will also learn how to verbally and physically cue and demonstrate the exercises to a group. Strategies for adherence to assist in behavior modification will be a focus throughout the course. At the conclusion of KINES 401, the students will be able to demonstrate a knowledge and understanding of group fitness class components. Inherent in the course goals is an understanding of the adaptations that occur as a result of programs of cardiorespiratory and muscular exercise in apparently healthy, at-risk, and diseased populations. Content knowledge is integrated with application of skills in fitness exercise, and instruction and will be put to use in a learning laboratory setting which students will have the opportunity to engage in hands-on instructional experiences.", "prerequisite": "KINES 367"}, {"department": "KINES", "number": "402", "credits": "3 Credits", "description": "This course is designed to provide students with an established anatomy background (i.e. completed KINES 202 or an equivalent course (BIO 129, 161/162, 163/164, 472) the basic concepts and applications of human cadaver dissection. Upon completion of the course, students will gain an appreciation for the amount of variability that exists in human anatomy as well as be able to apply anatomical concepts related to clinical pathologies to prepare them for a career in the allied health fields.", "prerequisite": "KINES 202"}, {"department": "KINES", "number": "403", "credits": "4 Credits", "description": "Theoretical and practical aspects of emergency medical techniques as applied in the pre-hospital environment.", "prerequisite": "KINES303 and/or current advanced first aid and cardiopulmonary   resuscitation certification"}, {"department": "KINES", "number": "404", "credits": "2 Credits", "description": "Educational concepts and skills necessary to present instruction in emergency care; lesson planning, methods of instruction, and evaluation techniques.", "prerequisite": "KINES403 with current Pennsylvania Emergency Medical Technician   certification"}, {"department": "KINES", "number": "405N", "credits": "3 Credits", "description": "KINES 405N, a study abroad course, based in a bicycle friendly European city, provides students with an opportunity to experience the programs, policies, infrastructure (including urban design features) and culture associated with bicycling in what is one of the most bike-friendly cities in the world. Students will have an opportunity to be immersed in the city's bicycle culture, observe bicycle infrastructure and multi-modal transportation solutions, learn from programs and policies that support bicycling and learn about the role of bicycling in sustainable, liveable communities. This course will be taught from a multi-disciplinary perspective to address the complex issues associated with bicycling. Students are expected to apply information and content to other countries and communities.", "prerequisite": "KINES 100", "other": ["Cross-listed with: LARCH 405N", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "408", "credits": "1-3 Credits/Maximum of 6", "description": "This course provides peer learning assistants with the fundamentals they will need to be effective in the laboratory and/or recitation classroom. Students will learn the fundamental skills needed to; assist in designing lesson plans; facilitate class discussions; assist in developing effective assessments; communicate learning expectations; provide helpful feedback; and maintain a safe learning environment in laboratory settings. Students enrolled in this course will be serving as an undergraduate learning assistants for course instructors and/or lab coordinators in the relevant course, who provide the instruction. Regular meetings with the course instructors will help the learning assistants adjust to their duties and solve common problems that arise in the instructional environment. Learning assistants will learn how to facilitate active learning and help other students develop sound study skills. The focus will be on evidence-based teaching strategies. Students enrolled in this course will be expected to have regular attendance, organization in and preparation for their peer learning assistant role, and clarity in how they communicate with their students", "prerequisite": "KINES 100"}, {"department": "KINES", "number": "410", "credits": "3 Credits", "description": "Study of biologically programmed growth processes and environmental influences leading to attained adult form and biomechanical function.", "prerequisite": "KINES 101"}, {"department": "KINES", "number": "411", "credits": "3 Credits", "description": "This course is designed to provide an overview of common musculoskeletal injuries and rehabilitation for pre-allied health and fitness professionals.  KINES 411 Introduction to Musculoskeletal Injury and Rehabilitation (3) This course is designed to provide an overview of basic orthopaedic injuries and related musculoskeletal system dysfunctions as well as rehabilitation of those injuries and dysfunctions. Common orthopaedic injuries of all major musculoskeletal structures and tissues are discussed moving up the kinetic chain from the feet up the lower extremities, through the spine and out the upper extremities to the hands. Common injuries such as sprains, strains, fractures, tendinopathies, disc herniations, spinal stenosis, compartment syndromes, neural compression, carpal tunnel syndrome and thoracic outlet syndrome will be discussed. Anatomy and function of each body region will be reviewed prior to the discussion of injuries. Mechanisms of injury, tissue pathology and the tissue healing processes are reviewed. The role of inflammation in the healing of injured tissues will be explored and the variations in healing processes between tissues explained. Common surgical procedures for major injuries like anterior cruciate ligament tears will be presented. A general rehabilitation process is discussed and rehabilitation concepts unique to specific injuries are explored. Basic principles of the major components of a rehabilitation program are explained. These major components include the protection of healing tissue, pain control, swelling resolution, restoration of range of motion, facilitation of volitional control, enhancement of muscular strength and endurance, improvement of neuromuscular control, training of functional movement patterns and return to functional activities. The RICE (Rest, Ice, Compression, Elevation) method of treating pain and limiting swelling will be presented. Manual therapy, stretching and exercise activities used to regain range of motion will be explained. Exercises used to improve muscular strength and endurance will be discussed for each region of the body. Methods of facilitating balance and neuromuscular control will be demonstrated. Finally, the benefits of functional exercise in terms of three-dimensional exercise requiring the use of groups of synergistic muscles in a coordinated manner will be presented. In addition, return to sport programs that gradually reintroduce the patient to the real life stresses placed on their injured body part will be explained. Prioritization of addressing the different components of a rehabilitation plan will be discussed and differences between surgical and non-surgical rehabilitation plans presented. Criteria used to make return to play decisions for injured athletes will also be outlined. Modifications of common exercises to accommodate for injuries and allow continued participation in exercise routines will be presented. This course is appropriate for pre-allied health professionals and fitness professionals with an interest in orthopaedic injuries, musculoskeletal system rehabilitation and the construction of exercise programs that prevent, or accommodate for, musculoskeletal problems.", "prerequisite": "KINES 202"}, {"department": "KINES", "number": "419", "credits": "3 Credits", "description": "The purpose of this course is to provide students with an understanding of disability sports and recreation. Throughout the course students will explore the process for developing and implementing a disability sports program such as, but not limited to, identifying community need, determining budget and funding sources, assessing resources needed, and gaining experience in teaching a sport or recreation for individuals with disabilities. While exploring the development of disability sports students will gain an understanding of key historical, sociocultural, and biomedical issues that are unique to individuals with disabilities. Historical issues such as the treatment of individuals with disabilities within society and sport, and the impact that sport has had on acceptance of individuals with disabilities will be examined. Students will also compare and contrast the major international sports organizations as well as United States sport organizations that are specific to individuals with disabilities. Students will gain an understanding of cognitive, mental, and physical disabilities, and the interaction between disability type and other identities such as gender. These concepts will be emphasized with a variety of hands on experience with disability sports and sport equipment. In addition, students will utilize theory based learning to review key concepts of accessible recreation and sport programs for individuals with disabilities in the United States. Students will also gain an understanding of unique characteristics of individuals with disability, and appropriate adaptations for sport and recreational success. By the completion of the course students will be able to identify major resources and concepts for disability sport and recreation related to coaching, sport management, sports medicine, and program development in the United States. Throughout the course an emphasis will be placed on acquiring knowledge of and concern for inclusion of individuals with disabilities through sport.", "prerequisite": "KINES 100", "other": ["United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "KINES", "number": "420", "credits": "3 Credits", "description": "Discussion of theoretical and empirical findings, structuring a frame of reference for exploring man's involvement in physical activity.", "prerequisite": "KINES 321"}, {"department": "KINES", "number": "421", "credits": "3 Credits", "description": "Psychological antecedents and consequences of physical activity behaviors.  KINES 421 Exercise Psychology (3)Exercise Psychology is designed to introduce students to the psychological antecedents and consequences of exercise behaviors. The antecedents of exercise behaviors are the psychosocial and cognitive factors (e.g., beliefs, attitudes, personality traits) that facilitate and/or inhibit exercise behaviors. The consequences of exercise behavior are the physical, psychosocial, and cognitive outcomes (e.g., self-efficacy, body image, mental health) of exercise participation. The antecedents and consequences of exercise behaviors will be presented within the context of contemporary conceptual and theoretical models in exercise psychology. This course is designed to provide students with an overview and foundation of the important psychosocial phenomena related to these antecedents and consequences of exercise behaviors. Students will have the opportunity to apply their knowledge in selected areas within exercise psychology through class discussions and assignments.", "prerequisite": "KINES 321"}, {"department": "KINES", "number": "422", "credits": "3 Credits", "description": "Principles of designing, planning, and implementing theory- and evidence- based physical activity interventions.  KINES 422 Physical Activity Interventions (3)This course is designed to acquaint undergraduate students with the application of major theories and models used to design and guide the development of contemporary physical activity interventions. Students will be familiarized with empirically-supported principles of behavior change and will gain an understanding of the basic strategies and methods used in designing, planning, implementation, and evaluation of physical activity interventions. The course will cover a variety of approaches to physical activity promotion, ranging from clinical and community-based interventions to population-based approaches, while discussing practical strategies and concrete examples of contemporary, evidence-based physical activity interventions. The goal of the course is for students to demonstrate the ability to formulate well-conceived physical activity interventions across a variety of settings and participant populations and learn how to apply theoretical principles and research findings to intervention development.", "prerequisite": "KINES 321"}, {"department": "KINES", "number": "423", "credits": "3 Credits", "description": "Psychological causes and consequences of sports related injuries in athletes.  KINES 423 Psychology of Sports Injuries (3)Using lectures/whole class discussion formats, this course is intended to provide the students with the basic knowledge regarding psychological causes and consequences of sport-related injuries, including concussions. Specific course objectives include: (1) developing the proficiency in initiating interviews and observations of athletes suffering from sport-related injuries; (2) assessing psychological impact of injury on athletes; (3) developing critical-thinking skills related to the probability of developing of psychological trauma in athletes with injuries; (4) developing specific skills of psychological assessment of injured athletes; (5) stimulating thinking about temporary research questions as related to psychology of injury. Evaluation will be based on active engagement in class discussions and administration of quizzes and written examinations according to course syllabus. This class extends but does not duplicate existing courses in the Departments of Kinesiology and Psychology.", "prerequisite": "KINES 321"}, {"department": "KINES", "number": "424", "credits": "3 Credits", "description": "An interdisciplinary approach to contemporary issues related to women and sport from historical, physiological, psychological, and sociological perspectives.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: WMNST 424", "United States Cultures (US)"]}, {"department": "KINES", "number": "425W", "credits": "3 Credits", "description": "This course includes examination of issues related to race, ethnicity, geography, income status, and other social factors across the lifespan for promoting physical activity through public health strategies and will include content on both the influences on activity and health as well as the implications for intervention. Coursework will include an examination of the influences on health and physical activity behavior and will include content on federal initiatives and programs for addressing health disparities, and the influence of race, ethnicity, immigration, social class/income status, urban/rural location, religion, veteran status, ability level, and sexual orientation on physical activity participation. For each influence, content will include interventions and strategies for addressing inequities; cultural tailoring and targeting, intervention planning for diverse populations, and evidence based strategies at the individual, institutional, community and environmental level.", "prerequisite": "KINES 100", "other": ["United States Cultures (US)", "Writing Across the Curriculum"]}, {"department": "KINES", "number": "426", "credits": "3 Credits", "description": "Examines the role of physical activity in public health. Includes population level strategies for promoting physical activity in communities.  KINES 426 Physical Activity and Public Health (3) An examination of the role of physical activity in public health. The first half of the course will provide an introduction to public health and basic epidemiology, measurement, dose-response relationships, chronic disease prevention. We will examine the historical progression of physical activity as a part of public health, including landmark studies showing the relationships between physical activity and chronic disease morbidity and mortality. Current public health guidelines and national policies related to physical activity will be discussed in detail. Students will debate the scientific foundation for current issues in the field, including fitness vs. fatness as a predictor of health outcomes and comparing behavior vs. objectively measured variables. The role of physical activity in preventing cardiovascular disease, type 2 diabetes, obesity, and cancer, colon and prostate cancer will be discussed. We will focus on large scale epidemiologic studies that highlight prevention. The second half of the class will focus on a social ecological framework for promoting physical activity and will address population level approaches through policy and environmental strategies, following the Centers for Disease Control and Prevention Task Force for Community Preventive Services guidelines. We will study how features of the built environment can encourage or discourage walking and biking and refer to current research in the field that examines these relationships in different populations (urban/rural, youth/older adults). We will learn about the challenges associated with assessment and measurement at a population level. Policy level approaches to physical activity promotion; including local, state and national; will also be discussed. We will discuss various community level approaches including: point-of-decision prompts, mass media campaigns, enhancing access to physical activity opportunities and other strategies outlined in the guidelines. Lastly, we will examine how physical activity promotion is addressed in other countries through community, policy and environmental strategies in Canada, Australia, Brazil and throughout Europe.", "prerequisite": "KINES 100"}, {"department": "KINES", "number": "427", "credits": "3 Credits", "description": "Developmental changes in the antecedents and consequences of physical activity across the lifespan.  HD FS (KINES) 427 Developmental Sport & Exercise Psychology (3)Change is constant with physical activity - our reasons for being active change across the lifespan an dour experiences with physical activity change how we view ourselves and those around us. Developmental Sport & Exercise Psychology focuses on developmental changes in the psychosocial antecedents and consequences of physical activity across the lifespan. Specific course objectives include (1) describing theoretical frameworks and methods used to study physical activity-related psychosocial development across the lifespan, (2) describing how self-perceptions develop and influence behavior in movement contexts at different points in life, (3) explaining how contextual factors influence developmental processes associated with physical activity, (4) identifying age-related differences in activity-related antecedents and consequences of physical activity, and (5) developing, reviewing, and critiquing theoretically-grounded interventions to address issues related to developmental processes associated with physical activity across the lifespan. Evaluation will be based on written examinations, submission of a series of reflection papers on reading assignments, a group presentation, and the students' engagement in the class. It extends but does not duplicate existing courses in the Department of Innersole, Human Development & Family Studies, and Psychology.", "prerequisite": "PSYCH 100", "other": ["Cross-listed with: HDFS 427"]}, {"department": "KINES", "number": "428", "credits": "3 Credits", "description": "Theories of motivational and emotional processes and their applications in movement settings.  KINES 428 Motivation and Emotion in Movement (3) Motivation & Emotion in Movement will focus on the psychological processes underlying human motivation and emotion in movement settings. Special attention will be directed to social manipulations that can enhance motivation and emotion, and the consequences thereof. This course will be valuable for students whose career goals relate to education, personal training, rehabilitation, coaching, or psychology. Specific course objectives include (1) distinguishing between motivation and emotion, (2) understanding psychological mechanisms underlying common motivational and emotional processes in movement settings, (3) identifying existing applications of motivation and emotion theories in movement settings, and (4) developing, reviewing, and critiquing theoretically-grounded interventions to address issues related to motivational and emotional processes in movement contexts. It extends but does not duplicate existing courses in the Departments of Kinesiology and Psychology.", "prerequisite": "KINES 321"}, {"department": "KINES", "number": "429", "credits": "3 Credits", "description": "Psychological theories of talent development and performance enhancement in sport. KINES 429 Psychology of Sport Performance (3) Psychology of Sport Performance will provide a psychological perspective on the phenomenon of superior motor performance. The course will cover nature of superior performance, talent development processes, sources of performance crises, and self-regulation strategies used by athletes, coaches, and psychologists to enhance performance. This course will be valuable for students whose career goals involve training athletes or other performers involved in socially-evaluative performance domains. Specific objectives include (a) distinguishing the antecedents and consequences of subjective and objective performances, (b) conceptualizing motor performance and performance problems in a psychological context, and (c) matching psychologically-based performance problems with theoretically-based intervention strategies. It extends but does not duplicate existing courses in the Departments of Kinesiology and Psychology.", "prerequisite": "KINES 321"}, {"department": "KINES", "number": "430W", "credits": "3 Credits", "description": "During involvement in this course, students will be acquainted with how exercisers and athletes interact with the others within small group environments. Notably, athletes and exercisers are commonly structured into tight-knit, interactive, and interdependent groups such as teams, fitness classes, family units, peer groups, neighborhoods, and training groups. These small groups are fundamental to sport and exercise experiences, while also influencing whether or not youth and adults derive value from physical activity. Therefore, identifying and promoting optimal small group environments is a central goal for researchers studying the social psychology of sport. Whereas the construct of group cohesion is the most widely-studied aspect of small groups in this context, rich and emerging lines of research reveal a great deal about group structures (e.g., norms), emergent states (e.g., social identities), and group processes (e.g., teamwork), as well as the outcomes of involvement in groups. This area of research is of general theoretical interest, but is also critical to establish an enhanced practical understanding for fields ranging from coaching to health promotion, education, and psychology. To explore these group processes, the goal of the course entails establishing a foundational understanding of small group dynamics. From this foundation, class members will explore contemporary research and theory about optimizing sport groups (i.e., sport adherence and performance) and physical activity groups (i.e., physical activity maintenance, positive psychosocial perceptions). This exploration will demand that students read and discuss empirical research - demonstrating the capacity to interpret and understand this literature, along with the capacity to critically appraise empirical findings. Students' learning related to group dynamics will be cemented through discussions and activities focused on real-life groups, as well as demonstrations of group processes using group tasks. By the completion of the course, students will have acquired strategies to optimize small group environments and developed skills to communicate group dynamics constructs and theories. Regarding communication, a critical outcome of this writing-intensive course is the capacity to interpret writing from group dynamics experts and communicating these themes through one's own effective writing.", "prerequisite": "KINES 321", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "431", "credits": "3 Credits", "description": "National organizations have identified mild traumatic brain injury, also known as concussion, as a major health concern for injured athletes at high school, collegiate and professional levels. These injured athletes have focused the research and clinical community's efforts into further understanding the pathophysiological underpinnings of the injury as well as its both short and long term effects. It is the overall intention of this course to elicit current understanding the pathophysiology, including its underlying mechanisms, predicting differential evolution and consequences of concussion. The central focus of this course is that symptoms following the concussion (e.g., headache, dizziness, balance, gait and locomotion, executive and neurocognitive function deficits etc.) may be exacerbated and /or triggered by compromised integrity of cortical, subcortical, and other areas of CNS. Thus, this concept will be discussed and elaborated throughout the course development.", "prerequisite": "KINES 321"}, {"department": "KINES", "number": "439W", "credits": "3 Credits", "description": "This course is designed to develop skill in discussing and solving moral dilemmas in sport, dance, exercise, games and play.  At its core, the course efforts to evaluate the moral status of organized sports and athletics in today's culture and identify strategies for raising its moral and non-moral value. This is a writing intensive course. Therefore, a significant portion of this class involves the development of more sophisticated writing skills.", "prerequisite": "KINES 345", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "440", "credits": "3 Credits", "description": "An examination of human nature from the perspective of our participation in sport.", "prerequisite": "KINES 345"}, {"department": "KINES", "number": "441", "credits": "3 Credits", "description": "AMST 441 / KINES 441 History of Sport in American Society study of the background, establishment, and growth of sport in America from colonial times to the present, and the role of American sports in American culture and society. The course will examine the ways that sports have operated in the United States as the country has developed into a modern, mass society. Issues of national identity, commercialism, race, ethnicity, class, and gender will be discussed in relation to the popularity of sports. Another set of issues will center on language and media; students will employ methods of analysis such as ethnography and rhetorical criticism that emphasize the multiple layers of meaning inherent in sports culture.", "prerequisite": "KINES 100", "other": ["Cross-listed with: AMST 441", "United States Cultures (US)"]}, {"department": "KINES", "number": "442", "credits": "3 Credits", "description": "An examination of the continuity of sport in Greek and Roman societies. CAMS 442  / KINES 442 Sport in Ancient Greece and Rome (3) (IL) This course examines the continuity of sport in ancient Greek and Roman societies. It investigates the role of athletic festivals in both cultures as well as the value placed on physical activity as part of the educational process. The objectives of the course are to enable students to gain an appreciation for the continuous involvement of the ancient Greeks in the areas of competitive athletics and gymnastics [Kinesiology] as an important part of their value system. Moreover, the course will provide a comparison of Greek and Roman attitudes of athletics and gymnastics.  Typical topics include athletics during the Minoan /Mycenaean Bronze Age, Athenian and Spartan philosophies regarding education, the importance of spectator sports in Roman society and their link to politics.", "prerequisite": "3 credits in CAMS", "other": ["Cross-listed with: CAMS 442", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "KINES", "number": "445", "credits": "3 Credits", "description": "Principles of integration and coordination of alcohol and drug education programs for health education and other health related professions.", "prerequisite": "6 credits in KINES or BBH"}, {"department": "KINES", "number": "446", "credits": "3 Credits", "description": "History of sport in modern world, ca. A.D. 1500 to present; concentrates on role of sport in societies outside United States.  KINES 446 History of Sport in the Modern World (3) (IL) The History of Sport in the Modern World introduces students to the connections between sporting practices and the broader cultural, political, intellectual and economic patterns that shape societies during the modern period in world history (ca. A.D. 1500 to the present). The course begins with a foray into the transition from traditional to modern forms of sport and society and covers the development of a wide variety of athletic games and pastimes from the sixteenth through twentieth centuries. Students will encounter a variety of historic conceptions of sport and explore the role of sport in the development of European, North American, Latin American, Asian, African and Pacific cultures. Students will learn how sports have been shaped by and have shaped by multiple factors, including modern ideas, science, class structures, gender roles, constructions of race, urbanization, nationalism, political conflicts, international relations, and economic institutions.This is a senior-level course that fills an important historical gap in the Kinesiology Department's sequence of offerings on the history of sport. Other courses in the sequence cover ancient sport, sport in American society, and the Olympic Games. While crucial American developments that impact sports in the modern world are incorporated into this course, this class offers students a global focus that concentrates on the role of sport in societies beyond the borders of the United States. This course also relates to the offerings in the philosophy of sport program by exploring the history of ideas about sport in modern thought. Additionally, the course connects to the science-based offerings in Kinesiology by providing students with and introduction to the history of the scientific study of human performance.The course introduces students to basic readings and knowledge of the history of sport in the modern world. The class provides opportunities to practice the critical reading and thinking techniques that shape the historian's approach to knowledge. This course will be taught once every year with an anticipated enrollment of 50 students. Evaluation methods that test reading and critical thinking skills are employed. No special facilities are required.", "prerequisite": "KINES 100", "other": ["International Cultures (IL)"]}, {"department": "KINES", "number": "447W", "credits": "3 Credits", "description": "Critical, contextual, and theoretical analyses of sport films focusing on popular narratives of social inequalities.", "prerequisite": "KINES 100", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "448", "credits": "1 Credits", "description": "Psychosocial concerns affecting student-athletes as they enter the transition period following sport disengagement, focusing on coping interventions.  KINES 448 Coping with Life after Sport (1) KINES 448 is designed for student athletes who have exhausted their eligibility for or will no longer be participating in their respective sport due to injury or other issues. It is also relevant for students in athletic training or those who plan to pursue a career in coaching. The focus of the course is on the identification of issues and stressors affecting the transition and the development of strategies and coping skills to deal with life after sport. This can often be a very emotional and difficult time for student athletes. Discussion is focused on intervention and coping strategies, goal setting, decision making, career planning, and transferable skills. Student athletes will be able to recognize how their athletic experience has helped them to acquire numerous skills and characteristics highly valued in the workplace. Two sections of the course will be offered each semester. Students will be required to submit a weekly reaction paper, do a review of literature, and compile a comprehensive career plan. The class will be highly interactive with regular in-class assignments and projects.", "prerequisite": "7th semester or higher and major in KINES or 7th semester or higher and minor in KINES or 7th semester or higher and intercollegiate sport participation"}, {"department": "KINES", "number": "449", "credits": "3 Credits", "description": "Recent events in sporting history have precipitated changes in perception for many in Africa relative to the historic legacies of racism and colonial rule. These events lead to pivotal questions -What are the broader social and political meanings of sport in African society? And what does the study of sport in Africa tell us about Africa¿s place in world history? This course uses the lens of sport to examine the social and political histories of Africa and the wider diaspora in historical perspective. From the racial and gendered hierarchies of colonialism to the use of sport to protest against social injustices, students are challenged to analyze the interdisciplinary significance of sport far beyond the playing field. One of the main intellectual goals of this course is to use sport to deepen our understanding of specific outcomes in African sport (e.g. South Africa¿s remarkable transformation from pariah of international sport to host of global events like the 2010 World Cup, and Kenyan running successes) from a variety of perspectives. We also consider how Americans travelled to and engaged with African societies as athletes, ambassadors, and activists. Broadly, this course explores sport and social change in Africa from the late nineteenth century to the present. It examines the sporting lives of African athletes, fans, reporters, coaches, and organizers and then connects them to shifting racial identities and power relationships on the continent as well as elsewhere around the world. These histories shed light on the pivotal role of sport in the everyday lives of people across the continent. In the process, we pay attention to primary sources, analyzing the ways in which Africans thought, talked, and represented themes discussed in assigned readings. Ultimately, this course will strengthen student skills of critical thinking, oral communication, collaboration, research, and writing.", "prerequisite": "KINES 100", "other": ["Cross-listed with: AFR 449", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "KINES", "number": "452", "credits": "3 Credits", "description": "In-depth study of cardiovascular regulation during postural, environmental, and exercise stress.  KINES 452 Applied Cardiovascular Physiology (3)First, the course begins with an intensive review of hemodynamics and basic cardiovascular control mechanisms (neural, hormonal, and local regulation). Second, students compare and contrast these general principles in six important circulations: splanchnic, renal, cerebral, coronary, cutaneous, and muscle. Third, they examine the three stresses which affect the circulation: posture (gravity), environment (especially heat) and exercise. For each stress, students identify the regional circulation(s) most affected and how they contribute to an integrated (systemic) cardiovascular response that is unique for each stress. Finally, combinations of posture, heat, and exercise stress are considered to illustrate competing cardiovascular control mechanisms. At each step students are introduced to seminal research papers illustrating the concept being studied.", "prerequisite": "KINES 350"}, {"department": "KINES", "number": "453", "credits": "3 Credits", "description": "This course examines physiological function of humans at rest and during prolonged or maximal exercise in conjunction with environment stress (heat, cold, altitude, hyperbaria).", "prerequisite": "KINES 350"}, {"department": "KINES", "number": "454", "credits": "3 Credits", "description": "KINES 454 begins with a review of general principles of research conduct and publication, themes that will be carried throughout all material covered in this class. A review of the historical aspect of women's health research and a review of the state of knowledge in women's health in the wake of the contemporary scientific endeavors such as the Women's Health Initiative will also be explored. Students will learn physiology of puberty, menstrual function and bone health and the impact of exercise on these processes. Students will explore current concepts of exercise related to the female athlete and clinical implications of alterations in normal physiology. The impact of oral contraceptives on health and exercise performance will be also discussed. Students will learn menopausal physiology, alterations in clinical status associated with this life stage, and review current research related to the Women's Health Initiative. Finally, a discussion of the effects of gender differences on health and exercise will be discussed. This course is designed for students who wish to develop a richer understanding of the physiological role of exercise in modulating the health of girls and women during different phases of the lifespan, including but not limited to childhood, adolescence, adulthood and later adulthood. At each step, students will be exposed to relevant research methods issues and introduced to seminal research papers illustrating the concept being evaluated. Students will improve their ability to read and summarize original research literature through in depth presentation and discussion of seminal studies. Moreover, students will develop an understanding of how research has informed the state of knowledge on issues covered in this class and students will develop \"language understanding\" appropriate for interpreting and reading research papers.", "prerequisite": "KINES 101"}, {"department": "KINES", "number": "455", "credits": "3 Credits", "description": "KINES 455 reviews the physiological basis of exercise for enhancing health and protecting against chronic diseases. This course is designed for students interested in developing a deeper understanding of the physiological mechanisms behind exercise as medicine. Course content will consist of a mixture of selected book chapters as well as contemporary review and primary research articles. This course begins with an overview of the current exercise deficiency problem, including the societal, behavioral, and economic changes of the past century which have contributed to the modern day epidemic of chronic inactivity-related disease. After developing an appreciation for the scope of these problems, students will be introduced to the \"tools\" needed to critically evaluate the association between exercise and/or inactivity on health and the mechanisms by which these associations may occur, including: basic principles of epidemiology, searching/reviewing scientific literature, and experimental design. The remainder of the course will be focused on how exercise/physical activity modifies molecular/tissue-level and integrative physiological function, and describes the extent to which these modifications confer either preventative or therapeutic benefit. Students will also use the \"tools\" that they learned at the beginning of the semester to demonstrate and share knowledge with others; integration of this information may include a thorough analysis of a chronic condition including the pathophysiology, strength of evidence for exercise is medicine, and physiological actions of exercise in prevention or treatment. Students may also be given the opportunity to translate their knowledge from this course into educational materials (e.g., flyers, pamphlets, screensavers, fitness center displays, social media, etc) for use during \"Exercise is Medicine\" week.", "prerequisite": "KINES 350"}, {"department": "KINES", "number": "456", "credits": "4 Credits", "description": "In KINES 456, students assess the five components of health-related physical fitness through fitness testing measures: body composition, joint flexibility, muscle strength, muscle endurance and cardiorespiratory fitness. The importance of a comprehensive pre-participation health screening, including relevant medical history, physical examination findings, cardiovascular disease risk factor assessment and laboratory testing is emphasized. Several current pre-participation screening instruments are reviewed. The American College of Sports Medicine physical activity guidelines and guidelines for exercise testing and prescription are discussed and grounded in best practices in monitoring signs and symptoms of physical stress leading to test termination. Students explore the role that cardiovascular, pulmonary, renal and metabolic disease risk factors and signs and symptoms play in the development of atherosclerosis and the impact each has on fitness appraisal. Modifications and/or alternative assessments for each health-related component of physical fitness are discussed for clinical populations, children and older adults. The required laboratory allows students practical opportunities to assess these components across the lifespan utilizing both field testing and laboratory testing and interpreting results using normative data. The required laboratory experience reinforces the course content and aids in skill acquisition by requiring that all students participate in the testing procedures as both test administrators and subjects. As EKG interpretation is a valuable skill in fitness appraisal, students receive instruction in basics of EKG interpretation to include: determination of mean electrical axis, heart rate and rhythm, EKG waveform norms, and normal and abnormal EKG responses before, during and after exercise testing. Atrial, junctional and ventricular arrhythmias, heart blocks and bundle branch blocks are included in the latter portion of the course. ACSM metabolic calculations for exercise testing and prescription are reviewed and utilized.", "prerequisite": "KINES 350"}, {"department": "KINES", "number": "457", "credits": "3 Credits", "description": "Principles of exercise prescription; application of fitness appraisal based on current practices using evaluation and discussion of case studies.  KINES 457 Exercise Prescription and Case Studies (3) The major purpose of this course is to provide those students interested in allied medical careers (e.g., cardiac rehabilitation, hospital testing, wellness centers, corporate fitness centers, physical therapy) with skills and practical knowledge regarding exercise diagnostics and prescription. Particular emphasis is placed on clinical diagnostic procedures, interpretation and terminology and this course directly contributes to the knowledge base expected for future employment in this area. At the conclusion of KINES 457, the students will be able to demonstrate on written examinations and in discussions, a knowledge and understanding of basic exercise prescription principles for apparently healthy, at risk and diseased populations, with special- emphasis on the cardiac patient. Inherent in the course goals is an understanding of the chronic physiological adaptations that occur as a result of programs of endurance and resistance exercise in apparently healthy, at risk and diseased populations.This course includes lectures as well as hands-on laboratory sessions. Evaluation is based on student performance on written examinations, written and oral case study presentations, and written assignments. This course will be taken after students have completed KINES 456 and will complete the learning scheme involving fitness appraisal and subsequent prescription of exercise programs.The course is offered fall and spring semesters with an enrollment of 35 students.", "prerequisite": "KINES 350"}, {"department": "KINES", "number": "458", "credits": "3 Credits", "description": "Reading and interpreting electrocardiograms are important skills for an exercise physiologist and many other allied health care practitioners. This skill features prominently in the job task analyses for industry certifications. The electrocardiograph is an instrument that measures electrical potentials on the body surface and generates a record of the electrical currents associated with heart muscle activity. The graphic record generated by the electrocardiograph is called an electrocardiogram (EKG or ECG). The EKG provides information about the rhythm and rate of contraction of heart muscle and the strength, timing and direction of electrical signals as they pass through various areas of the heart. Specific abnormalities of rate and rhythm will produce recognizable patterns in the EKG waveforms. This course will begin with cardiac anatomy and cardiac action potential production and conduction. The course material will progress through normal EKG patterns through common abnormalities in various areas of the heart as well as patterns related to infarction, acute injury and ischemia. The hemodynamic consequences of these abnormalities will be discussed. The effects of exercise, prescription medications and other drugs on the EKG will be explored. Successful completion of this course does not grant the authority to provide a medical diagnosis based upon an EKG interpretation; only a physician can do so", "prerequisite": "KINES 350"}, {"department": "KINES", "number": "459", "credits": "3 Credits", "description": "Community outreach and engagement are two missions of the Department of Kinesiology. Towards these goals this course provides students with an opportunity to gain knowledge and master assessment skills in the teaching laboratory or classroom before providing opportunities for students to practice these skills in diverse populations across the Commonwealth and in neighboring states. The first several weeks of the course will be spent learning how to perform various fitness and health screenings, including but not limited to: tests on treadmills and stationary cycles, blood pressure auscultation, heart rate measurement techniques, fingerstick procedures for blood lipid, blood glucose and HbA1c assessments, body composition measurements, strength testing and flexibility testing. Special emphasis will be placed on measurement techniques across the lifespan including older adults and children. There are potential fees for this course to support travel; such fees are indicated in the course information in the scheduling system.", "prerequisite": "KINES 101"}, {"department": "KINES", "number": "460", "credits": "3 Credits", "description": "Content in this course covers the major peripheral and central movement disorders and methods of their treatment. This course addresses the neuromuscular mechanisms underlying the coordination of voluntary movements, including their changes during development and aging. Disorders of movements, including muscular, systemic neurological, developmental and those related to a spinal cord or brain injury will be covered. Motor rehabilitation and commonly used therapies will be considered.", "prerequisite": "KINES 101"}, {"department": "KINES", "number": "461W", "credits": "2 Credits", "description": "Planning and preparation for research project.  KINES 461W Preparation for Research Project (2) This course prepares students to conduct a research project in KINES 462W. Students will begin by critically examining different research approaches. They will explore the development and assessment of research topics paying special attention to both scientific and philosophical justifications. They will learn how to identify research populations and how a human subjects review protects those involved in research studies. They will identify and critique the various inventories and assessment tools available for the kind of research they propose. Students will complete a research proposal including review of literature and method section, and submit an application to the Institutional Review Board. These goals will be achieved through a series of writing assignments.Students are expected to demonstrate the following outcomes: 1) Communicating and writing ideas relevant to the field of Kinesiology. 2) Understanding and describing the major issues in the field. 3) Understanding the principles of how to conduct research in wellness, fitness and/or associated practice. 4) Understanding and communicating the methods of scientific discovery.Students are evaluated on their research proposal (50% of final grade) which is drafted and revised during the semester. Further writing assignments (50%) assess and enhance student's competency in research methods and statistics. The course is offered every fall semester with a total enrollment of 25 each semester.", "prerequisite": "KINES 260", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "462W", "credits": "2 Credits", "description": "Completion of research topic.  KINES 462W Research Project (2) During this course students will collect and analyze data for a research project. They will trouble shoot any data collection problems and learn how to use computerized programs for statistical analysis of data. They will learn about various presentation modes relevant to the written and oral presentation of research data. Students will prepare and be evaluated on a research paper that reports on their research project. In addition, they will present their work orally in showcase sessions to which fellow students and faculty members are invited. The goal is for students to produce as close as possible to publishable papers. This course is part of a two-course sequence and can only be taken upon successful completion of KINES 461W. It, along with the internship experience, are the culminating experiences in the Exercise Science - Science Emphasis. Facilitates needed will be determined based on the individual research project. This course will be offered only in the spring semester of each year. Enrollment will vary from 1 to 25.", "prerequisite": "KINES 461W", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "463", "credits": "3 Credits", "description": "Examination of principles of motor learning; the application of strategic factors such as: practice types, schedules, augmented information, and motivation.  KINES 463 Acquisition of Motor Skills (3) This course is intended for students interested in the principles of motor learning (learning, retention and transfer) and the application of specific learning strategies such as, practice, feedback, demonstrations, and instructions. Through lectures, discussions, and course readings in addition to writing assignments, the goal is for students to develop a unified conceptual framework for motor learning and its facilitation through intervention strategies.The evaluation for the final grade will be based upon a synthesis of assessment in three areas: a) Term Project (30% of final grade) - a report on a learning experiment or a synthesis paper on a learning principle or a learning strategy; b) Mid-Term Exam (30% of final grade) - questions requiring short 2-3 sentence answers; and, c) Final Exam (40% of final grade) - requiring essay length answers to selected questions that integrate key issues from all the course material.This course will build on the concepts outlined in KINES 171 and 360. It will represent the culminating upper level undergraduate course in motor learning. This course will be an elective available to students who have completed the required KINES 360 course. It can be used to fulfill requirements for the Kinesiology major and the Movement Science, Teacher Preparation, and Athletic Training Options.This course will be available to students outside of the Kinesiology major who may, upon approval, substitute the KINES 360 prerequisite requirement. The course will be offered every spring semester.", "prerequisite": "KINES 360"}, {"department": "KINES", "number": "464", "credits": "3 Credits", "description": "This course is designed to provide students pursuing a health and physical education teacher certification in the Kinesiology degree with the conceptual foundation necessary to develop comprehensive and developmentally appropriate instruction that aligns with the National Association of Sport and Physical Education to students in preschool through twelfth grade (P-12). It will provide students with information on physical education comprehensive programming and contemporary instructional practices. Appropriate planning, instruction, programming and assessment make-up the foundation of this course. Emphasis is placed on the student's ability to create an effective instruction/programming and deliver the content in a preschool through twelfth grade physical education class. The overarching objectives for this course are to develop students' understanding of the different physical education program/curriculum models and applications of the models in a P-12 setting, integration of technology to enhance student learning, and develop advocacy measures for physical education through understanding and communicating the value of quality physical education and its contribution toward student wellness. Students will be able to plan and design program content that targets the psychomotor, cognitive, and affective learning domains and aligns with national standards. Students will design and administer authentic student assessments that align with the cognitive, psychomotor, and affective learning domains. Students will also design curricular scope and sequence overviews that are used to guide comprehensive programming and lesson development from grades P-12.", "prerequisite": "EDPSY 10"}, {"department": "KINES", "number": "465", "credits": "3 Credits", "description": "This course is designed to expose students to the recent topics in motor stroke rehabilitation research through literature.  KINES 465 Neurobiology of Sensorimotor Stroke Rehabilitation (3) This 3-credit course is designed to expose students to the most recent topics in motor stroke rehabilitation research through reading of current literature. The course addresses the neurobiological foundations of motor deficits in stroke, including contralesional and ipsilesional effects, current research on mechanisms of motor recovery, and the most current research on intervention strategies, such as constraint induced therapy, robot aided rehabilitation, virtual reality therapy, and sensory motor interventions. The purpose of the course is to provide an understanding of the neurophysiological and biomechanical foundations of motor deficits that occur with stroke, and of current treatment approaches. Stroke presents a significant social problem that is emphasized in current statistics reported by the American Heart Association indicating that each year, about 780,000 people in the United States experience a new or recurrent stroke. While stroke can produce deficits in perceptual, cognitive, and motor processes, this course is focused on sensorimotor deficits and associated rehabilitation interventions that tend to be employed by physical and occupational therapists in the rehabilitation environment. Sensory-motor strokes often result in weakness and deficits in voluntary movement of the limbs on the opposite side of the body as the damaged hemisphere (Contralesional). These motor deficits currently receive primary focus in occupational and physical therapy treatment for stroke. However, regardless of improvements in contralesional arm function, most patients also show deficits in coordination of the ipsilesional arm that is on the same side of the body as the damaged hemisphere. For many hemiparetic patients, functional recovery relies heavily on this arm. This class will focus on understanding both ipsilesional and contralesional motor deficits in stroke. Physiological and biomechanical mechanisms of dysfunction will be emphasized. Recovery of function will be addressed through analysis of physiological and biomechanical measures that are used to track changes in neural function. In addition, current research that is focused on developing rehabilitation intervention protocols that systematically address remediation of dysfunction, and facilitation of recovery will be discussed. Students will be guided in reading, critiquing, and presenting primary scientific manuscripts and review articles. Active discussions of presented material are encouraged, and grades are based on presentations, quizzes, and participation in class.", "prerequisite": "KINES 360"}, {"department": "KINES", "number": "467", "credits": "3 Credits", "description": "Evidence-based evaluation of performance enhancing substances and methods in sport.  KINES 467 The Science of Performance Enhancement (3) Students will describe and evaluate the evidence base for substances and methods used to improve aerobic power, strength, body composition, metabolism and thermoregulation as they relate to exercise and physical activity. Students will study and develop a rating scheme to describe the quality of evidence and recommendation to use ergogenic aids. This rubric will be utilized throughout the course to evaluate recent and proposed techniques to enhance athletic performance. Topics include, but are not limited to:&bull; Blood boosting: Enhancement of oxygen transport&bull; Androgens, prohormones, and anabolics&bull; Substrate manipulation to increase strength&bull; Nutraceuticals to improve athletic performance and recovery.General pacing of these topics may be modified depending on class interest and issues that emerge in the popular press. Consideration will be given to the regulatory and ethical aspects of their use. Students will develop an understanding of the World Anti-Doping Code, administered by the World Anti-Doping Association and its subsidiaries. Prior familiarity with ethics is essential. Science of Performance Enhancement is designed to emphasize team and individual scholarship in multiple domains, with emphasis on quantitative, qualitative and analytical skills.", "prerequisite": "KINES 345"}, {"department": "KINES", "number": "467H", "credits": "3 Credits/Maximum of 3", "description": "Evidence-based evaluation of performance enhancing substances and methods in sport.  KINES 467 The Science of Performance Enhancement (3) Students will describe and evaluate the evidence base for substances and methods used to improve aerobic power, strength, body composition, metabolism and thermoregulation as they relate to exercise and physical activity. Students will study and develop a rating scheme to describe the quality of evidence and recommendation to use ergogenic aids. This rubric will be utilized throughout the course to evaluate recent and proposed techniques to enhance athletic performance. Topics include, but are not limited to:&bull; Blood boosting: Enhancement of oxygen transport&bull; Androgens, prohormones, and anabolics&bull; Substrate manipulation to increase strength&bull; Nutraceuticals to improve athletic performance and recovery.General pacing of these topics may be modified depending on class interest and issues that emerge in the popular press. Consideration will be given to the regulatory and ethical aspects of their use. Students will develop an understanding of the World Anti-Doping Code, administered by the World Anti-Doping Association and its subsidiaries. Prior familiarity with ethics is essential. Science of Performance Enhancement is designed to emphasize team and individual scholarship in multiple domains, with emphasis on quantitative, qualitative and analytical skills.", "other": ["Honors"]}, {"department": "KINES", "number": "468W", "credits": "3 Credits/Maximum of 3", "description": "Methods, materials, and units of instruction.  KINES 468 Health Instruction in the School-Content and Method (3) This writing-intensive course is designed to provide students pursuing a health and physical education teacher certification in the Kinesiology degree with the conceptual foundation necessary to develop health instruction that aligns with the National Health Education Standards to students in preschool through twelfth grade (P-12). It will provide students with information on health education content, theory, and contemporary instructional practices. An understanding of how to effectively plan and sequence age-appropriate health content and deliver the content using multiple instructional strategies make up the foundations of the course. Emphasis is placed on the student's ability to create an effective lesson plan and deliver the content in a preschool through twelfth grade health education classroom. The overarching objectives for this course are to develop students' health education planning skills, instructional skills, reflection skills, and writing skills. The overarching objectives for this course are to develop Pre-K-12 teacher candidates' health education skills in planning, delivery and instruction, and reflective writing. Students will learn these skills by designing comprehensive preschool through twelfth grade health instruction using interactive learning activities that lead to health literacy and reflecting on their own teaching as well as their peers' teaching abilities. The purpose of this course is to enhance students' writing and oral communication skills for success in health education. Given the importance of clear communication in health and wellness instruction, this course will provide students with the skills necessary to effectively communicate with students, parents, school administrators, and the public. The course will begin with the basics of writing a comprehensive health education lesson plan and will progress to developing increasingly complex written communications and oral presentations.", "prerequisite": "EDPSY 10", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "470", "credits": "3 Credits", "description": "Human genetic variation is ubiquitous and important functionally. How genetic profiles, such as those leading to a high proportion of fast muscle fibers, combined with individualized training environments underlie peak performances will be examined. Similarly, when genetic predispositions are known, lifestyles can be optimized for health through the lifespan. Several hundred genetic loci influence physical performance and health, while allelic variants influencing elite athlete status and/or unusual longevity are about an order of magnitude lower. Only a few individual genetic loci and alleles are associated consistently with elite athletic performance and healthful longevity; many traits important for competitive maxima and general health are multifactorial, involving numerous loci and environmental factors. Each sport has unique physical requirements. Therefore, any study of a favorable genetic background for a given sport should consider the performance components most appropriate. Athletic performance is a complex human trait, involving interaction of multiple body systems (musculoskeletal, cardiovascular, respiratory, nervous, etc.). These include morphology (height and body composition), with specific physiques naturally suited to specific sports. Endurance, strength, and power are other factors underlying athletic performance. Additional complexities affecting athletic performance include cognitive factors and injury susceptibility. Environmental factors (including training and nutrition) also influence various traits. An individual's \"trainability,\" or response to exercise training itself also is dependent partially on genetic factors. The relative importance of environment versus genetic factors in athletic success varies widely among sports. Consequently, elite athletic performance as well as long term health result from interactions among genetically-based physical, and appropriate good environments. This course is focused on preparing students with basic knowledge on how the field of genetics can influence sport and athletic performance, fitness outcomes and health.", "prerequisite": "BIOL 161"}, {"department": "KINES", "number": "471", "credits": "3 Credits/Maximum of 3", "description": "Analysis of the mechanisms underlying the neural control and coordination of voluntary movements. Within this course, the students will get an in-depth knowledge of the mechanisms underlying the neural control and coordination of voluntary movements. The course will include content on the history of movement studies, classical research, and main current theories in the field of motor control. These will include theories based on ideas of motor programming and internal models, control with muscle activation patterns, equilibrium-point control, optimization, dynamic systems, and theory of synergies. The neural control of several everyday motor behaviors will be discussed such as vertical posture, locomotion, reaching, and prehension. Speed-accuracy and speed-difficulty trade-offs and changes in motor control and coordination with practice will be described emphasizing plasticity within the central nervous system. Changes in motor control with healthy aging and fatigue will be discussed. In addition, changes in motor control and coordination will be discussed based on the reviewed theories. The role of specific structures within the central nervous system in motor control will be reviewed with an emphasis on movement disorders associated with dysfunctions of specific structures such as spinal cord injury, stroke, disorders of the basal ganglia and of the cerebellum."}, {"department": "KINES", "number": "481W", "credits": "3 Credits", "description": "Study of age-associated physical changes and the effects of exercise on the aging process.", "prerequisite": "KINES 350", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "483", "credits": "3 Credits", "description": "Development of motor patterns. Fundamentals of movement, basic motor skills, and adaptation of the body to external forces.", "prerequisite": "KINES 202"}, {"department": "KINES", "number": "484", "credits": "3 Credits", "description": "The use of advanced biomechanics to provide an in-depth understanding of the principles which underpin human movement.", "prerequisite": "KINES 384"}, {"department": "KINES", "number": "485", "credits": "3 Credits", "description": "The primary purpose of this course is to provide students interested in applied exercise and health careers (strength and conditioning coaches, group fitness instructors, health and physical education teachers, personal trainers, wellness professionals, physical therapists) with skills and practical knowledge to design as well as instruct safe and effective strength and conditioning techniques for athletes to improve their cardiovascular health, strength, and flexibility. Students will learn how to conduct sport-specific training sessions, demonstrate and teach proper exercise techniques, understand nutrition and performance-enhancing substances and administer exercise tests. Students will gather and apply the current literature regarding the ideal training strategies and practical tips for athletes. They will also learn how to verbally and physically cue and demonstrate the exercises. Strategies for adherence to assist in behavior modification will be a focus throughout the course. At the conclusion of KINES 485, the students will be able to demonstrate a knowledge and understanding of properly training an athlete. In the course goals is an understanding of the adaptations that occur as a result of programs of cardiorespiratory and muscular exercise in the athlete populations. Content knowledge is integrated with application of skills in fitness exercise, and instruction and will be put to use in a learning laboratory setting which students will have the opportunity to engage in hands-on instructional experiences. Additionally, this course can assist in preparing students for the nationally accredited certification exams.", "prerequisite": "KINES 200"}, {"department": "KINES", "number": "486", "credits": "3 Credits", "description": "Contemporary legal issues in sport and their implications for sport managers.", "prerequisite": "seventh-semester standing"}, {"department": "KINES", "number": "488", "credits": "3 Credits", "description": "This course examines the forces and motions characteristic of locomotion, with emphasis on walking, the most common human activity. Walking has been described as the most commonly performed human activity. Diseases or injuries that reduce the ability to walk independently and efficiently are especially likely to adversely affect quality of life. KINES 488 introduces students to the elements of normal walking and how walking motions are affected by changes in age, walking speed, and pathological conditions. Advanced topics covered in this course include other forms of locomotion, including running and cycling, and the use of mathematical models to understand phenomena related to locomotion. Students enrolled in this course learn the particulars of human locomotion, but in so doing they also gain an understanding of kinematics and kinetic analysis, joint mechanics, and the clinical treatment of movement disorders. Basic principles of mechanics are applied to establish how walking motions result from forces produced by muscles, gravity, and contact with the ground. Students planning to pursue graduate study in movement biomechanics or in clinical areas such as physical therapy are especially likely to benefit from the focus on these areas. Laboratories introduce students to current experimental methods used to measure motions, forces, and muscle activity during locomotion. Completion of several case studies during the semester gives students practical experience with the interpretation of motion analysis data, the factors that influence clinical decisions in the treatment of movement disorders, and ethical considerations in biomechanics research.", "prerequisite": "KINES 384"}, {"department": "KINES", "number": "492W", "credits": "3 Credits", "description": "Fundamentals of program development applied to corporate and private physical fitness businesses. KINES 492W Programming for Business and Agencies (3) This course will use an experiential approach to acquire knowledge and skills necessary to assess, plan, implement and evaluate health/wellness/fitness programs within a business/corporate setting. Students will actively participate in a process-oriented, student-centered learning environment that includes cooperative learning, critical thinking, effective communication, assessment, and problem solving. Students will assess, plan, implement and evaluate a health-related program (i.e., wellness fair, career fair, road race, fitness programs). Students will write business letters, operating plans, mini-grants, budgets, flyers, press releases, newspaper articles, surveys, and other written communication projects relevant to the fitness/wellness business. Students will access and evaluate health/wellness resources (i.e., agencies, Internet, media, speakers). This is a writing intensive course and will follow university guidelines for such courses. Most of the assignments will involve group-based problem solving.", "prerequisite": "KINES 100", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "493", "credits": "3 Credits", "description": "The Principle and Ethics of Coaching examines the challenges of today's coaching profession through societal norms and expectations from the past and present. The course begins with a study of the coaching profession covering past and current coaches who have experienced success and failure in the profession. Students learn how the profession has developed as a result of changing values, demands, emphasis and expectations in the athletic world. Students will learn how to work with Title IX, parents, high school and collegiate regulations, season structures and the various roles and responsibilities of today's coach. The course is a upper-level course providing students in Kinesiology with an in depth study of the profession that has historically been associated with careers in Kinesiology. This course relates to other courses in sport ethics, sport philosophy and history of sport as they provide the theoretical background for coaching decisions. In addition, this course demonstrates practical implementation of theories from nutrition as well as activity courses. The course offers students an in depth study of sport and gender specific differences as they relate to the coaching profession. The students observe, question and study current coaches while examining their own backgrounds to develop set of principles to handle today's coaching issues. A coaching experience is an optional opportunity afforded to students while writing skills must be demonstrated by all students through written exams, papers and/or projects. The emphasis on class discussion and interaction with various athletic coaches introduces students to realities of today's coaching profession and the challenges of the 21\" century coach. Video and power point enhance the multi media approach to this course and further enhance the learning environment. Students may only receive credit for KINES 493 or KINES 493W.", "prerequisite": "KINES 100"}, {"department": "KINES", "number": "493W", "credits": "3 Credits", "description": "The Principle and Ethics of Coaching examines the challenges of today's coaching profession through societal norms and expectations from the past and present. The course begins with a study of the coaching profession covering past and current coaches who have experienced success and failure in the profession. Students learn how the profession has developed as a result of changing values, demands, emphasis and expectations in the athletic world. Students will learn how to work with Title IX, parents, high school and collegiate regulations, season structures and the various roles and responsibilities of today's coach. The course is a senior-level course providing students in Kinesiology with an in depth study of the profession that has historically been associated with careers in Kinesiology. This course relates to other courses in sport ethics, sport philosophy and history of sport as they provide the theoretical background for coaching decisions. In addition, this course demonstrates practical implementation of theories from nutrition as well as activity courses. The course offers students an in depth study of sport and gender specific differences as they relate to the coaching profession. The students observe, question and study current coaches while examining their own backgrounds to develop a set of principles to handle today's coaching issues. The emphasis on class discussion and interaction with various athletic coaches introduces students to realities of today's coaching profession and the challenges of the 21st century coach. This course fulfills 3 credits in Writing Across the Curriculum. Students may only receive credit for KINES 493 or KINES 493W.", "prerequisite": "KINES 100", "other": ["Writing Across the Curriculum"]}, {"department": "KINES", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Supervised student activities on honors research projects identified on an individual or small-group basis.", "prerequisite": "Approval of honors thesis advisor", "other": ["Honors"]}, {"department": "KINES", "number": "495", "credits": "1-14 Credits/Maximum of 1"}, {"department": "KINES", "number": "495A", "credits": "12 Credits", "description": "The teacher candidate will be placed in either an elementary or secondary school setting for the first 8 weeks of the student teaching experience, followed by placement in the level not selected first for the last 7 weeks. The teacher candidate will be teaching both health and physical education during each placement. The teacher candidate will be assigned on-site cooperating teachers will be supervised by a university faculty member who makes a minimum of four on-site visits, plus review of teaching via two videotape. During the 15-week semester, there are four seminars of approximately 5 hours each, during which all teacher candidates meet with the coordinator of the student teaching program to discuss topics related to the multiple roles of teachers in public schools and the transition to becoming a professional teacher. In addition, some time in each seminar is devoted to experience sharing and collaborative problem solving. The following topics are covered during the seminars: legal liability and sexual harassment, electronic portfolios, resume and cover letter writing, health and physical education professionals, preparation for employment, interviewing, best teaching practices and sharing, classroom management, and technology in physical education. In addition, the student teachers are required to complete a variety of assignments including: a professional portfolio, unpaid service activity reflection, daily notebook, videotapes and reflection, and Pennsylvania teaching application and essay.", "prerequisite": "3.00 GPA and passing scores in Pennsylvania Department of Education examinations."}, {"department": "KINES", "number": "495B", "credits": "6 Credits", "description": "This is a required course for students in the Movement Science and Applied Exercise Health (AEH) Options within the Kinesiology curriculum. This course requires students to complete gainful leadership and experiential learning in workplaces or research settings with the expectation that these experiences will allow them the opportunity to apply and integrate content from all their courses with success and insight. Students complete practicum requirements at a variety of settings, including but not limited to research laboratories, professional fitness centers, rehabilitation facilities, senior centers, community health and wellness programs, hospitals and collegiate and professional sports venues. They learn the day-to-day requirements of being \"on the job\" or \"in the lab,\" including professional management practices and ethical considerations. Practicums are evaluated on an ongoing basis with the student intern, on-site internship supervisor, and/or faculty member involved in the process. Internships can be completed either on or off-campus", "prerequisite": "KINES 395B"}, {"department": "KINES", "number": "495C", "credits": "3-6 Credits/Maximum of 6", "description": "This course places students in the work place with the expectation that the experience will allow them the opportunity to apply and integrate content from all the courses in the program. They will be placed at professional fitness centers, rehab facilities, senior centers, and wellness centers. They will learn the day-to-day requirements of being \"on the job\" such as time management, record keeping, client interactions, feedback delivery, fitness program establishment and implementations, business and management practices as well as ethical considerations. Their field experience will be focused on four in-class days during which students will collectively explore work place issues. Practicum work will be evaluated on an ongoing basis with the student intern, work place supervisor, and faculty member involved in the process. The course will take place off campus as work sites and no special on-campus facilities are required. It will be offered annually as the last course in the major.", "prerequisite": "KINES 100"}, {"department": "KINES", "number": "495D", "credits": "1-12 Credits/Maximum of 12", "description": "KINES 495D Expanded Field and/or Research Practicum in Kinesiology (1-6) This course, in combination with KINES 495B, places students in the workplaces or research settings with the expectation that these experiences will allow them the opportunity to apply and integrate content from all their courses in the program. They will be placed at a variety of sites, including but not limited to research laboratories, professional fitness centers, rehabilitation facilities, senior centers, community health and wellness programs, and hospitals. They will learn the day-to-day requirements of being 'on the job' or 'in the lab,' including professional management practices and ethical considerations. Practicum work will be evaluated on an ongoing basis with the student intern, work place supervisor, and faculty member involved in the process. The course will take place off campus at work sites and no special on-campus facilities are required. It will be offered annually as the last course in the major.", "prerequisite": "KINES 495B"}, {"department": "KINES", "number": "495E", "credits": "3 Credits", "description": "KINES 495E Advanced Professional Development in Kinesiology (3) This course is designed to provide undergraduate students the opportunities of fitness professional pre-certification preparation via lecture format, professional travel to acquire hands-on skills at a top caliber training facility, and an expert panel round table discussions. Throughout the course, students will have exposure to professional communication with faculty through formats including, but are not limited to the following: faculty/professional/expert discussions, lectures, training sessions, quizzes and examinations that are designed to prepare students to pass a national certification. Students will enhance skills needed to develop exercise leadership characteristics, communicate information effectively, and build a foundation of exercise testing and prescription guidelines which are safe, effective and motivating to clientele. Other class foundational principles include but are not limited to Exercise Programming; Health Risk Assessment; Serial Testing; Metabolic Calculations; Nutrition and Weight Management and Facility Administration. Students will take practical experience and knowledge gained from this professional course and apply principles into their proposed field of study in a safe and effective manner.", "prerequisite": "KINES 100"}, {"department": "KINES", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "KINES", "number": "496F", "credits": "1-6 Credits"}, {"department": "KINES", "number": "496G", "credits": "1-6 Credits"}, {"department": "KINES", "number": "496H", "credits": "1-9 Credits/Maximum of 18", "description": "For non-thesis independent study/research by Schreyer Honors College scholars.", "other": ["Honors"]}, {"department": "KINES", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "KINES", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "KINES", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]