[{"department": "LA", "number": "83", "credits": "1 Credits", "description": "An exploration of a theme through the lens of the humanities, social sciences and diverse cultural perspectives.", "prerequisite": "open only to DUS students", "other": ["First-Year Seminar"]}, {"department": "LA", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LA", "number": "101", "credits": "4 Credits", "description": "Within a liberal arts framework and with attention to public discourse-- speaking, writing, online communication, and visual presentation--this course instructs students in the arts, practices, and principles of rhetoric.  L A 101H Honors Rhetoric and Civic Life (4) (GWS)This course offers students comprehensive training in oral, written, visual, and digital communication for the twenty-first century. It unites these various modes under the flexible art of rhetoric and uses the pedagogies associated with the rhetorical tradition both to strengthen communication skills and to sharpen critical awareness of the challenges and advantages presented by oral, written, visual, and digital modes. Students will read about and discuss rhetorical concepts and situations and put their knowledge immediately to use by analyzing civic rhetoric on campus and in their communities (including their networked communities), by researching current issues, and by developing and presenting arguments in oral, written, visual, and digital form. The course is designed (although not required) for first-year Schreyer Honors College students and Paterno Fellows aspirants in the College of the Liberal Arts. In other words, it appeals to students with well developed communication abilities who might otherwise take English 30 and/or CAS 100H. It is aimed at developing students' skills in composing and delivering purposeful and effective texts. Whether or not those discourses are delivered verbally or visually (on paper, electronically, or orally), students will draw on established rhetorical canons of invention, arrangement, style, memory (tapping the resources of stored knowledge, such as the library), and delivery. Students will also become fluent in the rhetorical appeals of ethos, logos, and pathos in order to shape texts that are ethical yet purposeful. To meet these goals, students will meet in small classes (of no more than twenty students), where they will receive guided instruction in writing, public speaking, and the use of technology in order to learn the distinctive features of oral, written, visual, and electronic rhetoric. Staff for the course will be experienced full time faculty and advanced doctoral candidates in rhetoric drawn from English and CAS. This course will satisfy the Gen Ed Writing/Speaking (GWS) requirement for Schreyer Honors College students and aspiring Paterno Liberal Arts Fellows. Because this four-credit course will substitute for the six-credit ENGL 015/030 plus CAS 100 requirement, students who complete LA 101 will need to take an additional two credits somewhere in order to complete graduation requirements.", "other": ["General Education: Writing/Speaking (GWS)", "Honors"]}, {"department": "LA", "number": "103", "credits": "1 Credits", "description": "This course is designed to provide you with the techniques and information necessary to specify and implement post-graduation educational and career plans. This course is designed to assist students in the College of the Liberal Arts with the process of developing and implementing career plans for after graduation. It helps students understand the process of seeking and gaining employment and how to effectively transition from college to the workplace. This course will help students think about how to make their time at Penn State worthwhile and will be exposed to the various opportunities available to them at the College and University level. Students will hear from staff, alumni, and employers about a range of topics including interviewing, hiring practices, professionalism, social media, networking, post-graduate options, and other professional development topics. Students will start and/or continue to solidify their plans for after college and take steps to create a portfolio of work for the job and internship search. Students will use tools to learn more about themselves and explore career options. They will learn about career fields for students graduating with Liberal Arts degrees and hear from employers, staff, and alumni about how to leverage their education, skills, and knowledge to be successful during the job and internship search and during their time in the workforce. Students will develop a multitude of skills from this class, including identifying abilities, interests, and values and understand how to incorporate these into career decision-making. They will be able to utilize various resources such as informational interviewing and networking to research industries and careers, and inform career decision-making. They will make use of targeted searches, and online job postings to identify potential jobs and internships. Students will spend time writing effective position-specific application materials such as resumes and cover letters and learn to implement effective interviewing techniques during phone, individual, panel, and group interviews. For students who are thinking about post-baccalaureate options, the class will help these students identify and search for graduate programs as well as successfully complete the graduate school application process. This course will help students transition successfully into the professional world, using skills and knowledge to conduct future career decision making and job searches."}, {"department": "LA", "number": "135N", "credits": "3 Credits", "description": "Concentrated on the 21st-century, this course engages students in cutting-edge information about the critical roles the humanities and social sciences play in the high-tech global economy, now and in the future. In this course, students will learn what is vital about the humanities and social sciences in the global economy and society more generally. This class helps students to understand what is meant by the knowledge and creative economies, and why the modern economy's need for the core skills and knowledge developed through a humanities and social science education opens excellent career opportunities to students. Importantly, students will explore both humanistic and social science inquiry that challenges the dominant narratives and distorted facts that relegate the humanities and social sciences as insignificant and turn students away from these majors. Students will also learn to understand and explain in concrete ways the core skills and knowledge that humanities and social science students possess that are in high demand in business and industry so they can hone these skills in college as they prepare for life after college as contributing citizens through  work and public life.", "other": ["General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LA", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LA", "number": "199", "credits": "1-9 Credits/Maximum of 9", "description": "Study in selected foreign countries of the cultural, institutional, and/or social development of the host country.", "other": ["International Cultures (IL)"]}, {"department": "LA", "number": "201W", "credits": "3 Credits", "description": "Students will learn how to assemble a portfolio that reflects their progress, knowledge, and insight into college-level study.  L A 201W Experiential Learning Portfolio (3) This course will instruct students in what has become a distinctive model of performance assessment - a learning portfolio. Students will learn to assemble the components required to demonstrate their progress, articulate their knowledge, and gain insight into the qualities of learning that are expected of college-level study. Students will utilize active engagement and questioning of how we know what we know. The course is designed to assist learners in contextualizing what they have learned and provide them with the skills to contextualize what they learn in the future. By the end of the course, students will have developed an experiential learning portfolio.", "other": ["Writing Across the Curriculum"]}, {"department": "LA", "number": "202", "credits": "3 Credits", "description": "Entrepreneurs and liberal arts graduates share a surprisingly broad array of learned traits. Both rely on well-trained habits of critical, analytical, and systems thinking, effective oral and written communication, perspective taking, coalition building, and intercultural competence to understand, challenge, and transform the limits of conventional systems and practices. For entrepreneurs, this training leads to the creation of new and innovative nonprofit and for-profit ventures; for liberal arts professionals, this training is often used to develop, expand, and alter our understanding and appreciation of the ever-shifting contours of the human experience. When integrated deliberately, this course prepares undergraduate students to imagine innovations and create ventures that add value to our understanding, experience, and expression of the liberal arts. Entrepreneurship, which cultivates self-efficacy and personal agency as professional learning behaviors, is perhaps especially salient for the liberal arts, which tend not to be prescriptively careerist. In this way, students who take this course can more intentionally pursue creative career work that extends the value and experience of their undergraduate liberal arts education."}, {"department": "LA", "number": "235N", "credits": "3 Credits/Maximum of 3", "description": "This course introduces students to the ideas and skills that comprise \"public humanities,\" with a focus on digital media tools. It aims to develop student understanding of how public humanities work can address present-day problems, fostering empathy within and building bridges between persons, groups, and communities. It offers hands-on training in three forms of digital media: documentary film, podcasting, and web publishing. Through honest and respectful engagement with a diverse range of ideas, perspectives, and experiences, students will develop creative and critical thinking and problem-solving skills by locating, analyzing and applying information in project formation and production. This course is cross-listed as COMM 235N.", "other": ["General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "LA", "number": "295", "credits": "1-18 Credits/Maximum of 18", "description": "Approved experience, related to student career objectives, in agencies external to the University."}, {"department": "LA", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "LA", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "LA", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LA", "number": "335", "credits": "3 Credits", "description": "This course is the Capstone Experience for Public Humanities Fellows in the Humanities Institute. The course provides students with hands-on experience applying skills and insight gained during the prerequisite course, Introduction to Public Humanities. Students will gain substantive experience in research, digital media production, and community engagement. The centerpiece of the course is an individual digital public humanities project on a topic of the student's choosing. Students will also participate in public outreach events in conjunction with the Humanities Institute, actively participating in a community engagement plan in coordination with the Institute's documentary film series, HumIn Focus.", "prerequisite": "COMM 235N", "other": ["Cross-listed with: COMM 335"]}, {"department": "LA", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor"}, {"department": "LA", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical of of special interest."}, {"department": "LA", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LA", "number": "402", "credits": "3 Credits", "description": "The course will focus on the fundamentals of fundraising and leadership, including communications, management of events and people, and stewardship.", "prerequisite": "60 undergraduate credits or permission of program"}, {"department": "LA", "number": "403", "credits": "3 Credits", "description": "As mentors, each student will have the opportunity to lead one classroom breakout session of Innovation and Entrepreneurship in the Liberal Arts per week, while the Entrepreneurship Mentoring class as a whole will operate as a production team to co-create and manage logistical, technical, and multimedia support for M & W class lecture sessions. In the breakout sessions, student mentors will apply pedagogical theories and principles to lead classroom discussion based on course readings and talks; incorporate principles of effective just-in-time learning to facilitate, guide, and evaluate challenging student project development and hands-on work; and apply coaching methods to critique student speeches in preparation for collegiate pitch competitions. In lecture sessions, students will be expected to produce, in consultation with the instructor, multimedia slide presentations that will run for 10 minutes leading up to the beginning of each class period; arrange and coordinate logistics and technology for frequent guest speakers; and work with PSU technical staff to set-up and implement classroom technology used to promote interaction, discussion, and feedback (e.g., i-clicker). As mentees, students will be expected to meet weekly for two hours with their instructor to examine a variety of pedagogical and entrepreneurial theories and methods based on outside readings, and apply these concepts and principles to their weekly classroom instruction and mentoring. The instructor will observe one breakout session for each student mentor, and then meet with each student to evaluate the effectiveness of that session. Additionally, students will develop networking skills to identify and build an advising relationship with two thought leaders, innovators, and/or entrepreneurs in the liberal arts over the course of the semester, which they will use to cultivate their intellectual growth as innovative thinkers about profound problems and issues addressed in the liberal arts, and their creative and pragmatic solutions."}, {"department": "LA", "number": "404", "credits": "3 Credits", "description": "This course will guide students through an introduction to the fundraising/advancement profession, including a review of the history and emergence of the profession. The course will also touch on key issues such as professional ethics and the legal environment of the field. Students will learn about the wide array of career paths and sectors in which fundraising and advancement professionals are employed. The course will review current roles within fundraising and advancement and emerging practice areas such as social media fundraising, data analytics, and talent management. Students will acquire specific knowledge and develop some of the skills required to successfully secure entry-level positions such as asking for gifts, drafting newsletter copy, and creating materials to present to a board of trustees. Students will also make connections between life experiences, such as volunteering for a nonprofit organization, and positions in the field. Students should be able to make connections between fundraising and a variety of disciplines from English to psychology to economics. By the end of this course, students will be able to: 1. Describe fundraising as a profession, including a brief history, purpose, laws, ethics, and foundational principles. 2. Describe various positions held by fundraising professionals, including duties and responsibilities, skills and characteristics for success, and various pathways to a career in each position. 3. Practice foundational principles of fundraising as they apply to various fundraising positions. 4. Identify resources for locating fundraising positions and appropriate education and training opportunities. 5. Create professional application materials that reflect the students' ability to differentiate between various roles in fundraising professions. Students enrolled in this course will need to have acquired skills and knowledge in introductory courses, have a connection to an academic discipline, and be career-oriented. As a result, only upper-level students will be eligible to enroll. If academic departments are willing, the course might be added to the list of electives made available to students majoring in various fields such as English, psychology, or economics. Given the dearth of well-educated professionals and the growing number of jobs in the field this course could serve well those students who seek a career in the profession.", "prerequisite": "ENGL 15"}, {"department": "LA", "number": "424", "credits": "3 Credits", "description": "Students who complete this course will be able to create a nonprofit or for-profit liberal arts venture based on the iterative vetting of an original idea rooted in careful and rigorous research; examine the impact of that venture and the resulting services and/or products on themselves, employees, customers, the environment, and local, national, and/or global communities; understand how the ecologies of successful nonprofit and for-profit liberal arts ventures operate; and articulate best practices of successful liberal arts startups and organizations in relation to founder roles and relationships, fundraising, public presentation/pitching, market analysis, product differentiation, financial projecting, sales and marketing strategies, and scaling. Every other summer, this course will be offered in San Francisco, where students will be exposed to and work in one of the most entrepreneurial cities in the world, and meet a number of founders of non-profit and for-profit organizations whose services and solutions are tied to Liberal Arts disciplines."}, {"department": "LA", "number": "494", "credits": "1-12 Credits", "description": "Supervised student activities on research projects identified on an individual or small-group basis.  (No course under L A 294/494 may be offered without approval of the associate dean of liberal arts.  All courses must have a specific title and letter suffix.)"}, {"department": "LA", "number": "494H", "credits": "1-12 Credits", "description": "Supervised student activities on research projects identified on an individual or small-group basis.  (No course under L A 294/494 may be offered without approval of the associate dean of liberal arts.  All courses must have a specific title and letter suffix.)", "other": ["Honors"]}, {"department": "LA", "number": "495", "credits": "1-12 Credits/Maximum of 12", "description": "Approved experience, related to student career objectives, in agencies external to University.", "other": ["Full-Time Equivalent Course"]}, {"department": "LA", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "LA", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "LA", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LA", "number": "499", "credits": "1-9 Credits/Maximum of 9", "description": "Study in selected foreign countries of the cultural, institutional, and/or social development of the host country.", "other": ["International Cultures (IL)"]}]