[{"department": "LARCH", "number": "60", "credits": "3 Credits/Maximum of 3", "description": "LARCH 60 is an introduction to the development of designed outdoor places from the ancient past to present day. Designed landscapes and urban spaces are expressions of cultural values and environmental influences. Underlying all of the designs is the fundamental human connection to, and manipulation of nature as people create spaces that reflect political views, religion, are entertaining or provide personal inspiration and, most recently, show concerns for the health of the earth. While there is discussion of Middle East and East Asian landscapes, the course focuses upon Western civilizations with roughly the last third focusing on North American landscapes. The act of design and art often reveals a culture's beliefs, values, and aspirations. As well, the creation of outdoor places uniquely express a relationship between humans and nature. These designs and the many spaces they provide (e.g. plazas, campuses, gardens, cities, parks, memorials, urban systems, our own backyards, etc.) are aesthetic phenomenon that speak richly of cultural values. This is true throughout history as it is today. The stories these landscapes tell go hand-in-hand with cultural histories, but are not always closely examined. Designed landscapes enrich our daily lives enormously, but are not always observed, or understood as intentional acts of design--in fact they seem effortlessly placed before us. Successful landscape architecture accommodates human and natural functions (as does good building architecture), but the best speak to larger issues: to our minds and spirits. This course addresses the art of understanding the many layers of intent in designed landscapes from the past to present-including those that surround us as we walk through the built environment.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LARCH", "number": "60H", "credits": "3 Credits", "description": "A survey of the historical development of outdoor space in relationship to allied arts from early beginnings to this century.", "other": ["General Education: Arts (GA)", "Honors"]}, {"department": "LARCH", "number": "65", "credits": "3 Credits", "description": "This interdisciplinary course is based on the premise that space is an active structuring element of human experience. Using theoretical orientations from disciplines like Landscape Architecture, Architecture, Urban Planning, Urban Studies, Geography, History, Sociology, Cultural Anthropology among others, this course investigates how social structures are spatially embedded in contemporary built environments, especially cities. We focus on cities, because we live in a rapidly urbanizing world, and since 2008, more than half the world's population have been living in urban areas. In this class we examine how social systems impact places, especially the modern city, and also how we as human beings are impacted by and impact cities. Cities are examined in historical context, starting from the mid 19th century. We study industrial, colonial and global cities. We then focus on enduring themes pertaining to the experience of cities by different groups in society based on factors like gender, race, ethnicity, and socio-economic status. A variety of western and non-western cases are used to understand cities in a variety of contexts. This course will complement LARCH 60 and other courses related to human settlements and urbanization offered by various departments/programs like Architecture, Art History, Geography, History, and Sociology. This course meets the Bachelor of Arts degree requirement, and the intercultural requirement (US/IL).", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "LARCH", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LARCH", "number": "115", "credits": "3 Credits", "description": "Landscape Architecture Studio 1 is the first design studio in the undergraduate Landscape Architecture curriculum. This studio introduces students to foundational concepts and methods in landscape architecture with a primary focus on the principles of spatial composition. Spatial design composition is introduced through lectures and readings and design skill is developed through studio projects that explore the space-making potential of landform, plants and structures in creating human experience in the landscape. Students explore design ideas through sketching in plan, section and perspective and by modeling their ideas in three dimensions. Students are introduced to graphic layout and composition as a means of presenting their design ideas to others."}, {"department": "LARCH", "number": "116", "credits": "3 Credits", "description": "Landscape Architecture Studio 2 - the second design studio in the undergraduate Landscape Architecture curriculum - introduces students to small-scale site design. Students are introduced to essential topics in site design: the importance of understanding and responding to site and program, the fundamentals of pedestrian and vehicular circulation, the necessity of designing within a broader social and natural landscape context, and creating refinement in design form. Students are introduced to fundamental concepts through lectures and readings then presented with design projects intended to provide immediate application of those concepts. At the end of each design project, students develop presentation graphics that explain their final designs and supporting information.", "prerequisite": "LARCH 115"}, {"department": "LARCH", "number": "125", "credits": "1 Credits", "description": "Introductory seminar involving readings on significant issues in landscape architecture. LARCH majors only. LARCH 125 Landscape Architecture Orientation Seminar (1) LARCH 125 is a seminar course, the first of many in an entering student's Penn State career. Seminar classes offer the opportunity to read, think, share ideas through informal discussion, and refine personal thoughts reflection. The seminar is a common and useful tool to explore important ideas and develop critical thinking skills. The design and theory sequence begins with the freshman seminar, LARCH 125, which introduces students to landscape architecture issues.In this seminar students read and discuss the challenges and opportunities faced by contemporary landscape architects. To support student explorations, the class undertakes a series of readings of seminal works in landscape architecture and allied field that students carefully consider, question, and discuss. As a major part of student evaluation, they maintain a journal of their evolving ideas about the course content. Entering landscape architecture majors sometimes have a restricted notion of the wide variety of career directions that face them within the field of landscape architecture. This class proposes that the principal role of the landscape designer and planner is to make \"place\"; - a combination of physical, cultural and compositional cues that imbue built and natural forms with meaning. The goal of this first-year seminar class is for students to understand the type, or types, of place that landscape can be. The course introduces students to concepts of landscape as place, and asks them to ponder, explore, and respond to ideas about various perspectives on landscape \"place\"; This introduces them to the broad range of issues and activities that are addressed in the seemingly simple term, landscape architecture. Course Objectives: a) To become familiar with important issues in contemporary landscape architecture. b) To exercise and hone skills in critical thinking. c) To exercise and hone skills in speaking and writing persuasively. d) To begin to explore roles as future place makers.", "other": ["First-Year Seminar"]}, {"department": "LARCH", "number": "145", "credits": "3 Credits", "description": "LARCH 145 introduces students to plants, their ecological context, threats to ecosystems and the various roles that landscape architects play in the design of healthy ecosystems. Plants are central to landscape architecture. On the one hand, plants are one of the primary form-giving components in the landscape architects' palette. At the same time, plants occupy a central place in the ecosystems with which landscape architects interact on all scales of intervention in the landscape. The course is divided into two parts. The first introduces the concepts of plant communities and ecosystems through lectures while providing an introduction to identifying specific native and ornamental, woody and herbaceous plants through field observation - most within their ecological context. The second part of the course consists of lectures introducing the essential roles that landscape architects play as they interact with ecosystems in the landscape at a variety of scales. Here, students are introduced to ecosystem disturbance, the water cycle, issues related to water in the urban landscape, restoration ecology, ecological restoration, and landscape ecology. Finally, students are presented with a series of case studies that demonstrate how landscape architects, with allied professionals, work to apply ecological principles in build design projects. Knowledge gained in LARCH 145 will be applied throughout the remainder of the landscape architecture curriculum."}, {"department": "LARCH", "number": "155", "credits": "2 Credits", "description": "Landscape Architecture Skills Lab 1 is the skills lab that runs concurrently with the first design studio in the undergraduate Landscape Architecture curriculum. This skills lab introduces students to the fundamentals of visual communication in landscape architecture with a primary focus on 2D and 3D rastor and vector drawing. Spatial design composition is developed through experiencing a variety of approaches to visual communication. Students explore design ideas through sketching in plan, section and perspective and by modeling their ideas in three dimensions. Students are introduced to skills from hand drawing to digital visualization techniques, as well as board and page layouts and effective implementation of photographs in design communication."}, {"department": "LARCH", "number": "156", "credits": "2 Credits", "description": "Landscape Architecture Skills Lab 2 is the skills lab that runs concurrently with the second design studio in the undergraduate Landscape Architecture curriculum. This skills lab will develop students at the intermediate level of visual communication in landscape architecture with a primary focus on 2D and 3D rastor and vector drawing. Spatial design composition is developed through experiencing a variety of approaches to visual communication. Students explore design ideas through sketching in plan, section and perspective and by modeling their ideas in three dimensions.", "prerequisite": "LARCH 155"}, {"department": "LARCH", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LARCH", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LARCH", "number": "215", "credits": "4 Credits", "description": "Landscape Architecture Studio 3 - the third design studio in the undergraduate Landscape Architecture curriculum - follows LARCH 116 (Spatial Design) and further explores site design through expanded complexity of site and program. Students are presented with design projects that include more extensive and complex programs and a broader range of site scales, existing conditions and contexts. Projects also expand the extent and complexity of pedestrian and vehicular circulation. These expanded site and program considerations require students to consider a broader range of design responses while building skill in site design. Throughout the semester, students will continue to develop skills in graphic representation and visualization to explore design ideas and develop presentation graphics. Students are expected to draw upon visualization skills developed in the concurrent LARCH 255.", "prerequisite": "LARCH 116"}, {"department": "LARCH", "number": "216", "credits": "4 Credits", "description": "Landscape Architecture Studio 4 - the fourth studio in the undergraduate Landscape Architecture curriculum - follows LARCH 215 and introduces students to the broader perspective of landscapes as expressions of cultural and natural processes. Theories, methods, and tools for effectively studying and analyzing larger scale landscapes will be explored through readings and studio assignments. Students will be presented with landscapes in different geographic contexts and develop skills in conducting landscape research and analysis and using appropriate tools and techniques for effectively exploring alternative land use scenarios. In support of the expanded complexity of working at a larger scale, students are expected to draw upon their knowledge of ecology and ecosystems from previous coursework (LArch 145 and 245). Students will also draw upon precedent studies they may have conducted in landscape architecture history (LArch 060) and previous design studio courses. Students enrolled in LArch 216 will be concurrently enrolled in the associated skills course (LArch 256) that will develop their knowledge and skills with the tools of landscape planning, specifically geographic information systems (GIS). In addition, students will continue to develop skills in graphic representation and written and oral communication as a means to disseminate their planning and design proposals for review and discussion.", "prerequisite": "LARCH 145"}, {"department": "LARCH", "number": "221", "credits": "1 Credits", "description": "Inquiry-based reading and discussion of design theory literature relevant to the focus and content of LARCH 211.  LARCH 221 Design Theory Seminar (1) Each of the four design studios that constitute the core of the professional curriculum has a companion seminar that provides the vehicle for structured exploration of the theoretical and philosophical framework within which we design and plan. The seminar is a small group setting where directed readings, independent research and reflection are employed to explore the context of contemporary design. LARCH 221 is the first of a four-class sequence of design seminars. LARCH 221 is focused on landscape architectural design. Landscape architectural principles and issues are introduced through studies of design precedents, corollary readings in the sociological, psychological and cultural contexts of design and small-group discussions - the latter frequently related to topics under investigation in the companion studio, LARCH 211. As the curriculum progresses, the issues explored become increasingly complex and build upon prior seminars. The second-year theory seminar content is introductory in nature. The fall semester (LARCH 221) covers introductory writings addressing the broadset principles of landscape design processes, discussions of fundamental ordering principles, and philosophical positions on the interrelationships of landform, plants and structure. They introduce place-awareness through concepts such as genius loci, ordering principles such as the golden section, and experiential responses to landscape from phenomenological viewpoints. Course Objectives:- To become familiar with important issues in contemporary landscape architecture.- To exercise and hone skills in critical thinking.- To exercise and hone skills in speaking and writing persuasively.- To begin to explore the issues that impinge upon and shape 'place.'", "prerequisite": "LARCH 115"}, {"department": "LARCH", "number": "222", "credits": "1 Credits", "description": "Inquiry-based reading and discussion of design theory literature relevant to the focus and content of LARCH 212.  LARCH 222 Design Theory Seminar (1) LARCH 222 is the companion seminar to the design studio LARCH 212. The seminar is a small group setting where directed readings, independent research and reflection are employed to explore the context of contemporary design. Topics in LARCH 222 reflect the projects being explores in the companion studio but, in general, move beyond exploration of basic design concepts to include an emphasis on both natural and cultural elements of place and provides essential background to the processes and principles of site analysis in as much as those reflect the technological and cultural biases that are brought to design.Landscape architectural principles and issues relevant to the design topics being pursued in LARCH 212 are introduced through studies of design precedents, corollary readings in the sociological, psychological, and cultural contexts of design and small-group discussions - the latter frequently related to topics under investigation in the companion studio, LARCH 212. As the curriculum progresses, the issues explores become increasingly complex and build upon prior seminars.The seoncd-year theory seminar content is introductory in nature. The spring semester (LARCH 222) continues to cover introductory writings addressing the broadset principles of landscape design processes, discussions of fundamental ordering principles, and philosophical positions on the interrelationships of landform, plants and structure - increasingly in the context of the design types being explores in LARCH 212. They introduce place-awareness through concepts derived from sociology, social psychology and cultural anthropology.Course Objectives: - To increase familiarity with important issues in contemporary landscape architecture. - To continue to develop skills in critical thinking. - To continue to build skills in speaking and writing persuasively. - To bring focused attention to the issues that impact the design of small, private and public spaces.", "prerequisite": "LARCH 116"}, {"department": "LARCH", "number": "235", "credits": "3 Credits", "description": "Introduction of basic principles and tools supporting landform data, site systems, grading, visualization representation and site circulation. LARCH 235 Design Implementation I: Grading (2) As an introductory design implementation course, this course provides the foundation for site design in landscape architecture. At the core of the course are four general bodies of knowledge: Geometrics, Landform Manipulation, Site Systems, and Computer Applications for Site Analysis and Design.Geometrics: In order to perform landform manipulation, students must be able to efficiently acquire and process basic physical information about a site and are required to understand a suite of measurements. This course will first provide an overview of the digital and paper data sources available to landscape architects. Students will develop basic skills in manipulating or processing these data in order to comply with the requirements of site design. The course will also provide the basic measurements and formulae required for students to efficiently and accurately manipulate landforms.Landform Manipulation: One of the most critical skills landscape architects must acquire as designers is the ability to design landforms to accommodate changes in use and to translate their design ideas into dimensionally precise topographic representations of their designs. This course provides the basic knowledge for students to complete this process. Beginning with a single site element, students are expected to explore the suite of opportunities to place and modify a site to fit a single site element. Increased complexity is added to the suite throughout the remaining portions of the semester, thus enabling students to balance the opportunities and constraints presented by each individual design element and the overall site design.Site Systems: Building on ecological components of the curriculum, this course provides the first site specific and physical understanding of basic site systems critical to every landscape architect's design. Students will primarily focus on the major site features as related to site drainage, such as soil, topography, and surface geology, but will also be expected to recognize regional context in their designs.Computer Applications for Site Analysis and Design: A central component underlying the instruction of the course is providing students with a suite of computer tools.Course objectives: a) To assist in initial efforts in acquiring and processing site data; b) To perform calculations such as cut and fill, spot elevations, and slope calculations; c) To visualize and complete basic manipulation of landforms; d) To understand the interaction of physical site features on individual sites (e.g., soil and topography); and e) To communicate their final site designs according to professional standards", "prerequisite": "LARCH 116"}, {"department": "LARCH", "number": "236", "credits": "3 Credits", "description": "The landscape architect calls upon a rich array of materials to construct the built elements of landscape:walls, ground surfaces, overhead structures and furniture systems. The functional success and durability of many historical and traditional construction methods is based on a learned appreciation of the qualities and behaviors of materials in use in the landscape. Students develop understanding of the fundamental structural qualities of materials and use that knowledge to devise and illustrate their own design details. The same understanding of material behaviors will be used to investigate the qualities of novel construction materials, and will guide the development of construction details that respond to new constraints and opportunities. The main focus of 236 will be on materials and construction detailing, with emphasis on techniques appropriate for an array of design situations. Representation of design ideas using computer-aided-drafting is expected in this class.", "prerequisite": "LARCH 235"}, {"department": "LARCH", "number": "245", "credits": "3 Credits", "description": "This course applies knowledge gained in LARCH 145 by emphasizing planning and design based upon a systems approach to plants, soil and water. The course consists of lectures, campus walks, guest lectures and one day-long field trip to a public garden. The lectures and campus walks focus upon the identification of native plants in the landscape. Guest lectures cover additional, related topics. Students learn about specific native plants and plant communities as the basis for ecological planting design in reference to the ways these plants adapt to local climate, soil and hydrologic regimes. The use of native plant communities in planting design as practiced in this course also promotes the conservation and restoration of biodiversity and the promotion of human wellbeing. It can minimize the use of fertilizer, irrigation, and costly maintenance regimes. Students are also introduced to landscapes that have been shaped by the interactions between people and their environment. The use of native plant communities can be part of the preservation and re-creation important vernacular and historic cultural landscapes. Native plant communities express the identity and beauty of place. A primary goal of the course is to develop students' understanding of the values and uses of native plant communities toward achieving sustainable solutions to the problems of environmental degradation, resource scarcity and global climate change. Course assignments are linked directly to this goal by providing students with experience in designing landscapes where natural processes can function effectively.", "prerequisite": "LARCH 145"}, {"department": "LARCH", "number": "246", "credits": "1 Credits", "description": "LARCH 242 Ridge & Valley Field Study explores the intrinsic links between landform, geophysical and biological processes, vegetation communities, and human manipulation of the landscape through time. It comprises a series of four one-day trips to select locations across our local Ridge & Valley landform region (Appalachian Mountain section), providing the opportunity to examine phenomena at the site level, particularly plants, soils, and landscape contexts. The field experience is immediately preceded by a few skills-building preparatory activities (e.g. workshop(s), test) to establish basic competencies and fore-knowledge. An essential tenet of the course is that layered and interconnected landscape systems learning is something all landscape architects should pursue in their region of practice. Every place possesses a particular relationship between the underlying geology, climate, hydrology, landform, soils, and the plants and animals that inhabit it. Understanding this relationship and learning how to analyze and interpret landscapes is important to all spatial design work-as a source of essential information and as a source of design inspiration. The Ridge & Valley region contains an especially clear, distinct and \"readable\" relationship between the geophysical and the biological-between the geological underpinnings and the plants and animals that inhabit the surface. This makes the Ridge & Valley an outstanding context to learn how to observe these important, sometimes subtle, relationships. Once students understand what to look for and how to observe a landscape, they can apply this method to any landscape in the world. The conditions change from place to place, but the method is transferable.", "prerequisite": "LARCH 145"}, {"department": "LARCH", "number": "255", "credits": "2 Credits", "description": "Landscape Architecture Skills Lab 3 is the skills lab that runs concurrently with the third design studio in the undergraduate Landscape Architecture curriculum. This skills lab will develop students at the advanced level of visual communication in landscape architecture with a primary focus on 2D and 3D rastor and vector drawing. Spatial design composition is developed through experiencing a variety of approaches to visual communication. Students explore design ideas through sketching in plan, section and perspective and by modeling their ideas in three dimensions.", "prerequisite": "LARCH 116"}, {"department": "LARCH", "number": "256", "credits": "2 Credits", "description": "Landscape Architecture Skills Lab 4 is the skills lab that runs concurrently with the fourth design studio in the undergraduate Landscape Architecture curriculum. This skills lab will introduce geographic information system (GIS) as a primary tool in regional analysis and planning. The students will learn to integrate GIS into a broadly-based approach to managing data, developing concepts, and communicating ideas.", "prerequisite": "LARCH 215"}, {"department": "LARCH", "number": "276", "credits": "3 Credits", "description": "The human dimensions of placemaking must consider the types of places people populate. New to civilization, the 21st century has been characterized as the urban century. More people live in urban areas than in rural areas, and this trend is expected to continue especially in Asia and Africa. This course will primarily focus on examining social and cultural issues in landscape architecture and planning. The course will explore rural, urban, and extra-urban sites, the inclusivity and exclusivity of American spaces, and issues of gender and diversity of landscapes. The course will balance lectures, readings, and student presentations. Students will be introduced to methods to identify socio-cultural issues in landscape design, planning, and placemaking.", "prerequisite": "LARCH 60"}, {"department": "LARCH", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "LARCH", "number": "297A", "credits": "3 Credits", "description": "Formal course given on a topical or special interest subject offered infrequently; several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GA/GN GenEd course", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain"]}, {"department": "LARCH", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LARCH", "number": "315", "credits": "4 Credits", "description": "Landscape Architecture Design Studio V - the fifth design studio in the undergraduate Landscape Architecture curriculum - follows LARCH 216 and introduces community and spatial design that accommodates civic and public functions while addressing social and environmental imperatives. It also expands on site design and program that creatively reconciles community-based (i.e. residential and/or public space) agendas. In support of focused explorations of community-oriented design, students are expected to draw on their knowledge of regional and landscape systems from LARCH 216, as well as site design in LARCH 215. In designing public spaces that lie at the heart of thriving communities, students are also expected to draw on technical skills in grading, materials, and planting acquired the implementation sequence. Throughout the semester, students will continue to develop skills in graphic representation and visualization to explore design ideas and develop presentation graphics. Students are expected to draw upon visualization skills developed through the skills lab sequence.", "prerequisite": "LARCH 216"}, {"department": "LARCH", "number": "321", "credits": "1 Credits", "description": "Inquiry-based reading and discussion of design theory literature relevant to the focus and content of LARCH 311.  LARCH 321 Design Theory Seminar (1) LARCH 321 is the companion seminar to the design studio LARCH 311. The seminar is a small group setting where directed readings, independent research and reflection are employed to explore the context of contemporary design.Topics in LARCH 321 reflect the projects being explored in the companion studio. During the third year, theory references build upon the second-year experiences and expand to broader regional investigations. The fall semester (LARCH 311 and 321) covers regional context as a preamble to large-scale master planning in land-use issues. In the seminar, students read broadly about the genesis of regional context as a construct of cultural, as well as biophysical influences. The concept of 'reading' the landscape is fully explored, introducing students to the clues and cues by which the origins of the existing landscape can be discerned.Themes in the third-year theory seminars become increasingly sophisticated. The regional landscape is the setting for some of our most pressing public debates - landscape restoration vs. agro-industry; landscape as economic resource vs. spiritual renewal; landscape as repository of cultural history vs dynamic reflection of current values. These themes are explored through readings that include the fundamental influences of topography; geology; regional ecology and hydrology; the human overlays of land use; transportation; demographics; and the cultural influences and responses seen in landscape history, cultural and visual analysis, etc., are introduced.Course Objectives: - To explore the political and philosophical influences that shape the regional landscape. - To expose students to important debates on the future of the regional landscape. - To continue to develop the ability to engage in public debate of these issues. - To continue to build skills in speaking and writing persuasively.", "prerequisite": "LARCH241 , LARCH212 , LARCH222;  Concurrent:  LARCH311"}, {"department": "LARCH", "number": "322", "credits": "1 Credits", "description": "Inquiry-based reading and discussion of design theory literature relevant to the focus and content of LARCH 312.  LARCH 322 Design Theory Seminar (1) LARCH 322 is the companion seminar to the design studio LARCH 312. The seminar is a small group setting where directed readings, independent research and reflection are employed to explore the context of contemporary design.Topics in LARCH 322 reflect the projects being explored in the companion studio. During the third year, theory references build upon the seond-year experiences and expand to broader regional investigations. The spring semester (LARCH 312 and 322) covers site design issues within a regional context. In the seminar, students gain an understanding of communities and the complex of values that shape them, including the interrelationships of natural, cultural and economic factors on the future development of communities. Habitat management, watershed management, real-estate values, zoning and planning ordinances, individual and community rights are topics of discussions in this seminar.Students develop awareness that even small, individual site design requires an understanding of larger environmental and cultural contexts, and that success in planning at that large scale depends on implementation of wise planning at the site scale. Readings and discussion are supplemented by research and report writing that address contemporary debates on policy and planning.LARCH 322 also provides a setting for joining ideas presented in the context of both small-scale and large-scale design to engender in students a comprehensive view of the world of landscape design as an integrated whole where concepts developed at small scale become the framework and guiding principles for larger scale, vice versa.Course Objectives: - To explore students' values as they shape the designed landscape. - To expose students to important debates on the future shape of the inhabited landscape. - To continue to develop the ability to engage in public debate of these issues. - To continue to build skills in speaking and writing persuasively.", "prerequisite": "LARCH311 , LARCH321;  Concurrent:  LARCH312"}, {"department": "LARCH", "number": "335", "credits": "3 Credits", "description": "The third of four courses in the landscape architecture implementation sequence, this course addresses the applied principles, tools and techniques of planting design implementation, with a focus on landscape planting methods and technically proficient documentation. It relies on students having achieved foundational planting design knowledge and abilities in prior design studios and prerequisite courses. Proceeding briskly through site and contextual analysis and conceptual design, we will concentrate on methodical design development, investigation of planting implementation and management methods, and preparation of planting contract documentation. Upon completion of the course, students will have achieved proficiency in planting design implementation as integral to the overall design process and vital to realizing goals for landscape performance, aesthetics, site functionality, and broader social and environmental values.", "prerequisite": "LARCH 216"}, {"department": "LARCH", "number": "336", "credits": "3 Credits", "description": "This course is the fourth of four studio courses in the implementation sequence, all of which focus upon the more technical aspects of landscape architectural practice. By means of lectures, studio problems, assigned readings, and computer courseware, LArch 336 will present the principles and techniques of: Advanced Landform Design and Site Grading- integration of landform and structure through iterative grading design process; water flow and surface drainage. Site Systems and Stewardship - soil, water, and vegetation interactions and ecology; site protection; site systems management; environmental responsibilities and stewardship. Hydrology and Stormwater Management - basic site hydrology; overview of hydrology and stormwater management concepts, infiltration; surface runoff calculations, surface and subsurface drainage systems design. Production of technical drawings using computer-aided-drafting is expected in this class.", "prerequisite": "LARCH 235"}, {"department": "LARCH", "number": "365W", "credits": "3 Credits", "description": "LARCH 365(W), Contemporary Trends, is a writing-intensive course that enables a more thorough investigation of social, environmental and cultural issues as they relate to design. The course is grounded in three basic concepts: RESEARCH, COMMUNICATION, and theoretical CONTEXT within the discipline of landscape architecture, past and present. The course develops the skills of critical thinking and writing as pertains to contemporary issues in landscape architecture, with an understanding of precedent and evolution of design theory. The goal of this course is to introduce students to a variety of ways that contemporary landscape architects address and use these issues in their work, and to develop their skills in critical thinking, the art of critique, and communicating ideas in both verbal and written methods. The course is devoted to a wide range of relevant issues and topics confronting the profession and discipline of landscape architecture in the 21st century. It investigates the modern designed landscape as a distinct mode of cultural production-with its own materials, medium, codes, ethics, and concerns-in the context of landscape architectural theory's interconnection to evolving societal constructions of nature, social issues, environmentalism, and the city. It begins with the emergence of a modern sensibility about landscape in the late 19th century and tracks developments through modernism, postmodernism, and beyond. Information dissemination will be by lectures, readings, student research in the form of monographs and critique of built work.", "prerequisite": "LARCH 60", "other": ["Writing Across the Curriculum"]}, {"department": "LARCH", "number": "375", "credits": "3 Credits", "description": "Within the practice of landscape architecture, it is critical for designers to consider and integrate the human dimensions of place. Students will continue to learn to identify human dimensional issues and better understand the context of socio-cultural, sometimes controversial or emotionally charged issues in the landscape. This course will focus upon the practice of solving such issues in a contemporary context. The course will explore a variety of tools and strategies for problem solving in human dimensions of design and will teach the students that there are multiple approaches to understanding and solving complex design problems. The students will integrate theory and apply methods as they work through a series of different problems that allow them to apply design thinking to complicated socio-cultural issues. Through a series of exercises and participatory engagements, students will practice making decisions that affect community change through the perspective of design.", "prerequisite": "LARCH 276"}, {"department": "LARCH", "number": "386", "credits": "3 Credits", "description": "An investigation of current professional and business practices in the field of landscape architecture. For Landscape Architecture majors only. LARCH 386 Professional Practice (3) LARCH 386 has a three-part role. It comprises an introduction to the variety of practice opportunities in landscape architecture, their opportunities and drawbacks; it provides an introduction to critical office management practices; and it assists students in the employment application process through coaching on interview technique and guidance on the preparation of supporting material.It is the overarching intent of this course to help students understand what it will mean to be a professional practicing a constantly changing marketplace of ideas. Topics covered include ethics, public relations, office and project-related practices, personal and professional development, and legal aspects of practice: contracts, specifications, liability insurance. Through active participation in the course, students will come to realize the diversity inherent in the profession. Course objectives: - To introduce a range of practice types, including: small, private practice, large-scale corporate practice, federal and state agencies, not-for-profit organizations, and other non-governmental organizations; - To discuss relations with other professionals, including the formation of teams and other strategic alliances, and negotiation of professional fees; - To outline and illustrate the various roles and responsibilities individuals might have both in and outside of an office, including situations of personal vs corporate responsibility; and - To investigate the inherent values or point of view of principals and others that effect how decisions are made and change occurs.", "prerequisite": "LARCH 315"}, {"department": "LARCH", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LARCH", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LARCH", "number": "400", "credits": "5 Credits", "description": "Introductory landscape architectural design and applied theory for IUG students.", "prerequisite": "Admission to the IUG program Enforced Concurrent at Enrollment: LARCH 400A"}, {"department": "LARCH", "number": "405N", "credits": "3 Credits", "description": "KINES 405N, a study abroad course, based in a bicycle friendly European city, provides students with an opportunity to experience the programs, policies, infrastructure (including urban design features) and culture associated with bicycling in what is one of the most bike-friendly cities in the world. Students will have an opportunity to be immersed in the city's bicycle culture, observe bicycle infrastructure and multi-modal transportation solutions, learn from programs and policies that support bicycling and learn about the role of bicycling in sustainable, liveable communities. This course will be taught from a multi-disciplinary perspective to address the complex issues associated with bicycling. Students are expected to apply information and content to other countries and communities.", "prerequisite": "KINES 100", "other": ["Cross-listed with: KINES 405N", "International Cultures (IL)", "General Education: Arts (GA)", "General Education: Health and Wellness (GHW)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LARCH", "number": "414", "credits": "5-15 Credits/Maximum of 15", "description": "Review of landscape architectural theories and issues; supports development of comprehensive design study and/or independent honors (Thesis-Based) design projects.  LARCH Majors only.  LARCH 414 Design and Theory V: Advanced Landscape Architectural Design (5-15) Fourth- and fifth-year design studios are designated 'depth' studios. Each studio is aligned with one of the department's associated research centers or pursues special topical content and continues the development of site-scale planning and design skills for landscape architecture students with larger and more complex sites and programs Students select a topic from the range of options. Students may choose to take a given topic on a maximum of two occasions.Topics are related to issues that have been introduced in previous studios and are as varied as possible from studio to studio. This allows students to select a topic of interest to explore with great intensity and detail. The studio alternatives offered each year are based on faculty expertise and student interest, and are chosen by the department head's review of faculty proposals. To date, studio topics have ranged from historic preservation to recreational landscapes, urban ecology to community planning. The type of project is determined on an individual basis, and will be rigorous and require a high level of depth of thought and a sophisticated product. Project types include regional master planning, large-scale site planning and medium-scale community/housing design. The design issues emphasize urban form, community identity and open-space systems in the United States as a follow-up to urban patterns experienced during the student's previous study abroad. The project types may include such topics as inner-city locations with mixed-use and complex programs that progress from research and planning to site-scale design. Often, students work with an actual client, such as an urban planning commission or a city economic development entity, etc. Issues of urban form as a setting for significant practice opportunities are emphasized. Locations such as brown fields, urban entertainment districts, waterfronts, housing infill, etc., form the basis for design response in context.Course Objectives: -To develop an in-depth understanding of one or another aspect of landscape architecture. -To be exposed to the rigor and challenges of developing and implementing one's own design expertise in the context of a specific environmental concern. -To exercise the design principles, technological tools and communication strategies developed during the course of the specific design studios.", "prerequisite": "LARCH 235"}, {"department": "LARCH", "number": "424", "credits": "3 Credits/Maximum of 9", "description": "Inquiry-based reading and discussion of design theory literature relevant to contemporary landscape architecture issues.  Topics vary each semester.  LARCH 424 Design Theory Seminar (1-3) LARCH 424, Design Theory Seminar, is a companion to the depth studios, LARCH 414. However, unlike the seminars offered during second and third years, LARCH 424 is not tied topically to any particular depth studio. Instead, this seminar provides a vehicle for rigorous and structured exploration of the theoretical and philosophical issues that face landscape architectural designers and planners. The seminar is a small group setting where directed readings, independent research and reflection are employed to explore the context of contemporary design.These seminars, offered to fourth- and fifth-year students, enable professors and students to take their investigations to greater depth. Seminars are offered by different professors each semester and the content is expected to be somewhat aligned with the faculty member's research and scholarship or pursues special landscape architectural topical content of the faculty's choosing. Students select seminars from the range of options offered. This allows students to select a topic of interest to explore with great intensity and detail. Students are required to take up to three seminars to achieve a minimum of three credits.Topics are related to issues that have been introduced in previous studios and seminars and the department ensures that students have access to the widest range of topics. The seminar alternatives offered each year are based on faculty expertise and student interest, and are chosen by the department head's review of faculty proposals. Seminar topics related to our research centers include historic preservation, urban ecology, community planning and watershed stewardship. From time to time topics independent of our research centers, such as the impact of technology on design or the impact of public policy on design and planning, will be addressed. The type of seminar outcome is determined by instructors on an individual basis, and will be rigorous and require a high level of depth of thought and a sophisticated product.Course Objectives: &bull; To further develop an in-depth understanding of the theoretical or socio-political context for one or another aspect of landscape architecture. -To challenge students to articulate their own values in the context of a specific environmental concern. -To examine the means by which designers reconcile their own, their clients', and society's values in the pursuit of particular design or planning goals.", "prerequisite": "LARCH 365W"}, {"department": "LARCH", "number": "450", "credits": "3 Credits", "description": "Interactive geodesign and digital design studio.  LARCH 450 Geodesign: Geospatial Technology for Design (3) This course addresses the role of continually evolving information technologies in landscape architectural research and practice by reference to long legacy of theoretical contributions from the field that have sought to reconcile and benefit from integrating the sciences of society and environment with art, design, and planning. This interactive digital design course is an advanced geodesign methods and principles class that applies digital tools to landscape research, modeling, analysis and design. This course presents a digital process for analyzing, managing, and ultimately designing landscape systems by allowing students to inventory, analyze and evaluate complex spatial datasets. Students will learn to critically evaluate and implement the interplay between various factors and design alternative futures. Lectures will introduce key geodesign principles and techniques. The goal is to investigate an array of geospatial software as a powerful design tool in a broad and integrated manner for all the activities of the landscape architect, designer, planner and architect. Using a variety of geospatial and digital tools, students will develop a process to study, analyze, and plan landscape systems. They will utilize activities from each lesson to develop primary and alternative strategies for their proposed project. The problem-based approach used by this course will encourage cross-cultural contexts for student projects. Geospatial design computing technology enables many alternate approaches to problem-solving, so that students will customize their own learning experiences within the concrete structure of the course. This course brings advanced geospatial and digital analysis and evaluation into the design process, where concepts and ideas are vetted for suitability against a wide array of physical and social, place-based information. This on-the-fly suitability analysis provides a framework for design, giving landscape architects, architects, land-use planners, and others involved with design the tools to directly leverage geospatial information within their design workflows."}, {"department": "LARCH", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "LARCH", "number": "495", "credits": "1-13 Credits/Maximum of 13", "description": "Supervised off-campus, non-group instruction including individual field experiences, practicums or internships. Written and oral critique of activity required.", "prerequisite": "Prior approval of proposed assignment by instructor"}, {"department": "LARCH", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "LARCH", "number": "496H", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Honors"]}, {"department": "LARCH", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "LARCH", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LARCH", "number": "499A", "credits": "1 Credits", "description": "Inquiry-based reading and discussion of design theory literature relevant to the focus and content of the associated design studio course, LARCH 499B. LARCH majors only.", "prerequisite": "LARCH361W; Concurrent: LARCH499B, LARCH499C , LARCH499D", "other": ["International Cultures (IL)"]}, {"department": "LARCH", "number": "499B", "credits": "5 Credits", "description": "Study of and design for sites, programs, and social groups associated with ongoing contemporary landscape architectural concerns.  LARCH majors only.", "prerequisite": "LARCH312 , LARCH361W; Concurrent: LARCH499A, LARCH499C , LARCH499D", "other": ["International Cultures (IL)"]}, {"department": "LARCH", "number": "499D", "credits": "3 Credits", "description": "Special topics related to, and study in conjunction with 499B. Landscape Architecture majors only.", "prerequisite": "LARCH361W;  Concurrent:  LARCH499B", "other": ["International Cultures (IL)"]}]