[{"department": "LDT", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction", "other": ["International Cultures (IL)"]}, {"department": "LDT", "number": "100", "credits": "3 Credits", "description": "LDT 100 World Technologies and Learning (3) (GS;IL) explores the role of technology in learning across international contexts and the impact of these new learning technologies on world cultures. LDT 100 examines the sociocultural impacts of various learning technologies on learning, education, and culture. The course will examine several international cases of learning technologies (both contemporary and historical), as they are used for education and learning and implemented in several world cultures such as the US, UK, India, China, Africa, Europe, and Oceania. The primary objective of the course is to help students understand how learning technologies impact other cultures, and their own; how learning technologies hold the potential to bring change to education and new forms of learning; and how these changes can be predicted, understood, and planned for. The course may offer an important introduction to the area of Learning, Design, and Technology, but it is otherwise not related to specific programs of study. It contributes to the General Education requirements for undergraduates.", "other": ["International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "LDT", "number": "101", "credits": "3 Credits", "description": "Introduction to communication for educators, principles of pedagogical communication including educational communication technologies.  LDT 101 Effective Communication for Educators (3) This course introduces future teachers to effective communication specific to educators' needs. Educators will learn skills for informational lesson planning, persuasive speaking and motivational presentations. This is an introduction to these skills such as lesson planning and effective parent communication, which are then honed later in methods courses. This course will address issues of civic engagement and broad communication for educators focused on educational issues. Included will be the design and presentation of individual communications, email, social media, new media, videos, digital photography, and other forms of emerging educational communications technologies. Assessment includes short quizzes, product review (to include lesson plans, speeches and presentations), online discussion participation, and other activities focused on building the specific skills needed for educators.", "prerequisite": "CAS  100"}, {"department": "LDT", "number": "110N", "credits": "3 Credits", "description": "This course surveys the intersection of art and technology for making in regard to content creation for learning.  Topics covered include maker spaces, DIY communities, online content creation as well as creativity, art, STEM, coding and engineering, and equity and inclusion. Examples include how people learn through creative computing, user-created art content, and livestreaming of making activities. Students will explore academic literature, popular news articles, and other media content. Activities include coding, creativity, crafting, and teaching peers. No programming or prior experience with digital or physical maker toolkits is required. Course materials are designed to be accessible to all levels. The course offers an important introduction to the area of Learning, Design, and Technology, but it is otherwise not related to specific programs of study. It contributes to the General Education requirements for undergraduates.", "other": ["General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LDT", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LDT", "number": "215", "credits": "3 Credits", "description": "This general education course introduces students to basics of the learning design field. The course introduces theories, processes, and techniques that students need to create designs for educational and training programs for formal and informal contexts (including after school clubs, higher education, corporate settings, museums, and non-profit organizations). Students interested in how to design educational artifacts should take this course. This is a hands-on course where students will learn basic skills, ethics, and practices of the learning design field via discussions, activities, writing, and presentations. Throughout the course, students will create a series of products, which can be used in their portfolios for later job searches. There are no prerequisites or technological skills required.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LDT", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LDT", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "LDT", "number": "400", "credits": "1-3 Credits/Maximum of 3", "description": "Use of microcomputers, video, and other media in education; models use technologies including video, audio, print, computer, and telephone.  EDTEC 400 Introduction to Instructional Technology for Educators (1-3) This course introduces classroom teachers to the computer and its educational applications. It is an introductory level course and instruction is based on the premise that participants are novices. Participants first learn how to work in an online environment. They then work in that environment to develop the skills and perspectives needed for the effective application of microcomputers in education, which involves becoming familiar with a wide range of additional educational computing applications and issues. Although it is important for students to develop technology skills, technology must be viewed as more than simply a new subject in the curriculum. Teaching students to use technologies well is a means to a much more important set of ends. Today's technologies offer teachers and their students a powerful means for addressing learning-related issues, and potentially redefining teaching and learning.The potential of technology is most effectively realized when considered in combination with views about how individuals think and learn. The goal of this course, then, is not for participants to become experts in 'technology,' but to become more experts in using technologies to promote teaching and learning. Upon completion of this course participants will be able to: successfully operate available computer hardware and associated peripherals including (but not limited to) keyboards, mice, and printers; demonstrate competency in using information technologies, including electronic mail, the Internet, and the World Wide Web; demonstrate competency in creating multimedia presentations and instruction; demonstrate competency in using word processing programs, basic graphics packages, and desktop publishing applications; demonstrate skills in creating spreadsheets and/or databases; integrate thoughtful applications of technology to address everyday teaching/learning problems; identify problems for which use of varied technologies offer productive alternatives for teachers, students, parents, and communities.Students will demonstrate competence in these areas by developing three unit projects which will use technology to solve a classroom problem of their choosing. The projects address use of computers as communications tools, including the World Wide Web; information processing tools, such as spreadsheets and databases; and interactive multimedia using presentation software or Web-based materials. Each project will include a description of the problem, how the selected technology addresses the problem, a lesson plan demonstrating how the technology would be used, and an artifact which demonstrates the EDTEC 400 student's competency with the technology being used. Students will use Internet tools to share and provide peer reviews of classmates' projects.", "prerequisite": "Bachelor's degree or equivalent; or 5th semester standing; or permission of program"}, {"department": "LDT", "number": "401", "credits": "3 Credits", "description": "Explores role of gaming, video gaming, and simulations in educational contexts including K-12, corporate, informal, non-profit and higher education."}, {"department": "LDT", "number": "410", "credits": "3 Credits", "description": "This course provides students with advanced, practice-based experience in learning experience (LX) design. Students will learn advanced strategies in LX (including requirements, design, and evaluation) as well as situate LX within broader conversations about the role of design in society. The course places a strong focus on application through a design cycle that repeats itself over three collaborative projects, each increasing in scope and sophistication. Students who complete the course will reflect on their design work in a culminating portfolio assignment.", "prerequisite": "LDT 215"}, {"department": "LDT", "number": "415A", "credits": "3 Credits", "description": "Preparation in the use of a nine-step model for systematically analyzing instructional problems and developing validated, practical solutions.  LDT 415A Systematic Instructional Development (3) LDT 415A introduces the instructional design process and then focuses on each step of the model using a project-based approach. It prepares instructional designers and trainers in the corporate, higher-education, and non-profit sectors to apply the instructional design process to create instructional materials, or to modify, alter, or re-design existing materials as needed, for example, to suit a particular context or audience.", "prerequisite": "Bachelor's degree or equivalent; or 5th semester standing; or   permission of program"}, {"department": "LDT", "number": "415B", "credits": "3 Credits", "description": "Preparation of teachers to use a systematic model to design learning environments for K-12 classrooms.  LDT 415B Systematic Instructional Development for Teachers (3) This course focuses on K-12 teachers who will learn how to use the systematic design process for creation of learning environments. This process includes goal, objective and test item writing; text selections; media selections; implementation plans; and evaluation plans for both formative and summative evaluation. Products are turned in each week for feedback and input into the next weeks' assignment. Consideration of the ID4T (Instructional Design for Teachers) model use with standards, constructivist, user-design, and learner-based classrooms is included.", "prerequisite": "6th semester standing in education or equivalent professional   experience"}, {"department": "LDT", "number": "433", "credits": "3 Credits/Maximum of 3", "description": "Explores uses of online technologies for K-12 settings including cybercharter and blended settings. In this course, Teaching and Learning Online for K-12 Educators, students will receive an overview of the current status of K-12 Online Education, including criticisms of the movement and how cyber charter schools are impacting the general educational movement. Students will explore the complexities of school choice movement, the place of cyber charters in that movement and the ways that this movement can help and harm general educational progress. Students will critically examine the cyber charter school money trail so that they may identify various financial implications for the cyber charter movement on public schooling and learn how funding flows from the federal level to states to districts and finally to cyber charters. Students will be guided through the process of transforming their teaching when moving from traditional face-to-face classrooms to online settings.", "prerequisite": "Bachelor's degree or equivalent; or 5th semester standing; or permission of program"}, {"department": "LDT", "number": "440", "credits": "3 Credits", "description": "Technology integration in educational settings.  EDTEC 440 Educational Technology Integration (3)This course introduces educators to broad-based educational computing applications. This course introduces ideas, skills, concepts and strategies for integrating computers into classroom teaching. The focus of the course is on models for integration, but specific applications and how they can be used in the classroom will also be explored.This course is part of a graduate program of study for a Master's of Education (M.Ed.) in Instructional Systems or an M.Ed. in Educational Technology. Within educational settings, technology is not simply an independent curriculum -- i.e., teaching about how to use technology. Rather it is a powerful means for addressing, and potentially redefining, everyday teaching and learning issues. The potential of technology is most effectively realized when considered in combination with views about how individuals think and learn best. The goal of this course, then, is not for you to become an expert in 'technology,' but to become more of an expert in teaching and learning. Technology can be used as a vehicle to help you to further develop this expertise. This course is divided into five units which are based on the following areas of educational computing: (1) Technology Integration Concepts; (2) Productivity Tools; (3) Communication tools; (4) Interactive multimedia; and (5) emerging technologies. Each of these units is designed not only to provide you with the information you need in order to understand what the technology is about and how it functions, but more importantly to stimulate serious reflection upon how you as a teacher can make use of this resource and how using this resource relates to student learning.", "prerequisite": "6th semester standing"}, {"department": "LDT", "number": "441", "credits": "3 Credits/Maximum of 3", "description": "Design, production, and evaluation of instructional materials for delivery on the Internet. This course is designed to provide you with a conceptual and experiential overview of the process of creating stand-alone computer or web-based instruction to facilitate your understanding of the role and potential of Internet technologies as learning systems. This course would be useful to anyone charged with providing online learning, is appropriate as a foundational overview for multi-media developers, and also would be valuable for supervisors of instructional designers and developers. A main feature of the course is a hands-on lesson project carried on throughout the course where you will identify, design, develop, and then evaluate an online stand-alone lesson (e.g., a learning object). Emphasis will be placed on the following goals: Demonstrate research-based message design principles, including navigation, screen design, and the use of color and visuals. Demonstrate basic skills and competencies related to developing instructional materials to be delivered using Internet/intranet technologies to understand the current requirements and also limitations of these approaches. Describe the role of the instructional designer in Internet-based instruction. Describe the advantages and limitations of Internet delivery in order to make informed instructional design decisions. Apply an instructional design model during the design and development of Internet-based instructional materials."}, {"department": "LDT", "number": "447", "credits": "3 Credits/Maximum of 3", "description": "This is an applied skill course about producing and implementing multimedia in instruction and training. By its very nature, instructional multimedia is a collage of media types, and creating this collage requires a thorough understanding of learning strategies, design principles, and technology `obtainability\" (e.g., both using existing media as lesson components as well as developing new learning media objects as needed). Fairly recently, multimedia tools have proliferated on the web and at the same time learners' expectations have also shifted, for example involving the delivery form factor and source, preferred media type, short lesson length, and many others. This course introduces you to the design, development, and delivery of instructional multimedia on modern educational platforms. Specifically, you will create multimedia instructional materials within the context of larger class discussions about Instructional Systems Design, evidenced-based learning strategies, Design Principles, media features, Copyright, Open Educational Resources (OER), Massive Open Online Courses, and the changing landscape of Higher Education."}, {"department": "LDT", "number": "449", "credits": "3 Credits/Maximum of 3", "description": "Skills and knowledge needed to direct the use of video technologies in educational settings.  EDTEC 449 Video in the Classroom (3) This course introduces video and multimedia production for educators based on the premise that participants are novices. The course is intended for teachers and trainers who would like to acquire fundamental theory and skills in designing and producing video and multimedia to support teaching and learning. It introduces the tools of media production (i.e. video, audio, and lighting) and develops basic skills, including production and editing techniques, storyboarding and project planning. Participants in this course will demonstrate: a basic proficiency in the operation and handling of media production tools, including video and audio editing; an understanding of appropriate media use for classroom use; a basic knowledge of the production processes, including conceptualization, storyboarding, scripting, and project management; and a basic proficiency in producing effective educational videos."}, {"department": "LDT", "number": "467", "credits": "3 Credits", "description": "This course examines emerging Web technologies and explores their application to learning and education.", "prerequisite": "5th Semester standing or Graduate Status or Non-degree GRAD status", "other": ["Cross-listed with: EDTEC 467"]}, {"department": "LDT", "number": "471", "credits": "3 Credits/Maximum of 3", "description": "Investigates systems theory and how components of educational systems interact; develops insights on current issues and models in Educational System Design. This course focuses on a systems theory view of public school systems. With an eye toward significant changes in the entire system and examining ways that technology (understood broadly) can be utilized as a lever for significant school change, this course asks learners to examine former waves of educational reform, inform their understanding with a firm grasp of systems theory, and apply those ideas to future suggested K-12 changes.", "prerequisite": "Bachelor's degree or equivalent; or 5th semester standing; or permission of program"}, {"department": "LDT", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "LDT", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]