[{"department": "LST", "number": "83", "credits": "1 Credits", "description": "Students learn to use technology and Libraries resources to access and cite relevant information into academic research projects.  L ST 083S The Twenty-First Century Researcher (1)This course will equip students with research skills for academic success at Penn State. The class will investigate the Libraries' physical facility and scholarly, academic online resources as a single, holistic learning lab, and engage students by providing hands-on experience in how to conduct research across the disciplines and in all formats. Students will develop and use several cutting-edge communications tools, including blogs, podcasts, and personal portals. By the end of the course, students will be able to create and conduct research projects, and integrate their findings into outstanding papers and presentations in a variety of media.", "other": ["First-Year Seminar"]}, {"department": "LST", "number": "250", "credits": "3 Credits", "description": "LST 250 is a research-based class that prepares students to critically think about, use, and produce information. Through a library and information science lens, this class will explore, study, and interrogate the research process. During the semester, students will conduct research, learn about various process for creating, producing, and finding information, and will have the chance to express their findings and frustrations with the other students in the class. By the end of the semester, students will be savvy users of library resources and will have the skills needed to teach others about the research process. This course is well suited for students who are interested in taking a deep dive into the research process, or who have aspirations to do something in the information science field in the future."}, {"department": "LST", "number": "301", "credits": "1 Credits", "description": "Survey of information theories, structures and resources as related to library research methods for social, behavioral sciences and the humanities.", "other": ["Honors"]}, {"department": "LST", "number": "370", "credits": "3 Credits", "description": "Evaluating, retrieving and integrating Federal and Legal Information Resources into scholarly research.  L ST 370 Research Methods for Law and Government Information Resources (3) This course covers basic legal research and government information skills: (1) the structure and types of federal primary and secondary legal sources; (2) the structure and types of federal government information; and (3) electronic and print databases and indices to locate legal and government information. Students will develop research methods for locating and using judicial, executive, and legislative branch information sources in scholarly and disciplinary research.", "prerequisite": "3 credits in Administration of Justice, Political Science,   Communication, History or Sociology"}, {"department": "LST", "number": "490", "credits": "1-3 Credits/Maximum of 3", "description": "Introduction to the principles and procedures in the management of archives and historical manuscripts.", "other": ["Cross-listed with: HIST 490", "Bachelor of Arts: Humanities"]}, {"department": "LST", "number": "495", "credits": "1-9 Credits/Maximum of 9", "description": "Directed internship in library studies, archival administration, rare books curation and/or preservation.", "prerequisite": "L ST 490 or L ST 496"}, {"department": "LST", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses. Students may not register for these courses without prior written approval of a faculty member in the department in which the courses are listed."}]