[{"department": "LTNST", "number": "100", "credits": "3 Credits", "description": "This course provides an interdisciplinary introduction to the study of Latinas/os in the U.S., beginning with a historical overview of the major events in the U.S. southwest, Mexico, and the Caribbean that led to the creation of Latina/o communities in this country. Within this historical context, the course explores a number of themes: 1) the reasons for migration and the effects on identity of movement between countries and within the U.S.; 2) the social protest movements of the 1960s, including Chicano and Puerto Rican nationalism, the farmworker movement, and Latina feminism; and 3) present-day issues as they affect the major Latina/o groups in the U.S., attending to both similarities and differences within and between the major groups.", "other": ["Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LTNST", "number": "127", "credits": "3 Credits", "description": "This course provides an interdisciplinary introduction to the study of Latinas and Latinos in the United States. The course includes a historical overview of the major events in the U.S. Southwest, Mexico, the Caribbean, and Central and South America that led to the creation of Latina/o communities in this country. Students will examine the formation of racial and class hierarchies within U.S. Latina/o communities; the processes of (international and regional) migration; gendered hierarchies and responses to sexism; and the complexities of U.S. Latina/o identity.", "other": ["Cross-listed with: AMST 127, HIST 127", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LTNST", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to eplore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LTNST", "number": "226", "credits": "3 Credits", "description": "English 226 will constitute a wide-ranging examination of contemporary texts (1960-present) central to the construction of contemporary Latino/a culture.  ENGL 226 Latina and Latino Border Theories (3) (GH;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course focuses on contemporary Latina/o cultural production, placing it in historical context and analyzing it through the framework of borders. We make connections between Latina/o groups, showing both similarities and differences. We examine the politics of representation, asking how artistic texts define community and individual identities that are coherent yet also embody the complexity of these identities. The texts cross and claim borders- cultural, sexual, gender, geographical, generational, spiritual, and institutional. We will ask how these art forms work to claim border spaces: How are cultural differences retained without constructing hierarchies of exclusion? What models of identity do these artists propose in response to structures of domination? We'll read novels, short stories, poems, history, and theoretical essays; we will also watch several films. Throughout the course, we will attend to particular histories and cultures of Latina/o groups; it is crucial to both maintain the specificity of each culture (Chicana/o, Puerto Rican, Cuban-American, and Dominican-American) and their connections to each other as Latinas/os in the U.S. Inquiring into these intersections leads one to ask the following: how can Latinos unite against the assault on immigrants and bilingual education without erasing very important differences among Latina/o populations? How can Latinas unite against ongoing sexism and homophobia within their communities and the U.S. in general? How should we view the marketing category \"Hispanic\" and/or \"Latino\" and how do artists offer alternative conceptions of group identity?", "other": ["Cross-listed with: ENGL 226", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)"]}, {"department": "LTNST", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LTNST", "number": "300", "credits": "3 Credits", "description": "WMNST/LTNST 300 Latinx Gender and Sexuality Studies (3) (GH/US/BA) This course examines the historical development, theoretical premises, and political, social, and artistic contributions of Latinx feminisms in the United States. It shows the connections to as well as the divergences from Latin American feminism by beginning with an analysis of how the Spanish conquest, the imposition of Catholicism, and subsequent years of colonialism shaped gender and sexual identities. It examines the contemporary effects of these historical issues and inquires into the common concerns of Latin American feminists and Latinx feminists. It asks how theories and practices have diverged given different geographies, both between the U.S. and Latin America and within the U.S. The course will examine changes in the 1960s and 1970s in the U.S., when Chicano and Puerto Rican nationalist movements also gave rise to a feminist consciousness amongst Latinas; the conjuncture of race, ethnicity, gender, and sexuality is considered, with attention to how Latinas critiqued Anglo feminism's narrow focus on gender. The course will focus on family formations, considering social science and feminist discourse on the issues of patriarchy. How have Latinx feminists valued yet also rearticulated the traditional family? What critiques have made been against heterosexism? How has the LGBTQ community formulated new kinds of families? How does migration shape family relations? The course will explore how Latinx artists in different genres have responded to and resisted traditional gender and sexual roles. Literature, film, poetry, performance art, and hip hop are all examined for their diverse representations of sexual desire.", "prerequisite": "WMNST 100", "other": ["Cross-listed with: WMNST 300", "Bachelor of Arts: Humanities", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "LTNST", "number": "315N", "credits": "3 Credits", "description": "In this course, we investigate various aspects of the language(s) and language behaviors of U.S. Latinos. The course is premised on the idea that language is a crucial component in the formation of identity. To understand Latina/o identity formation in the U.S., then, one must analyze what role languages--Spanish and English--have played in identity formation. The class commences with a brief historical assessment of the various U.S. Latino communities, including Mexican-American, Cuban-American, and Puerto Rican communities. Such a historical purview proves significant in the study of the cultural traditions that persist in these communities, chief among these, the Spanish language. In exploring the Spanish language in U.S. Latino communities, we consider several major sets of questions, among them the following: In what ways do the languages of U.S. Latino communities differ from those of monolingual Spanish- (and English-) speaking communities? What factors contribute to the maintenance and loss of Spanish in these communities? How does language contribute to the creation of individual and societal identity? How is language exploited in the representation of other U.S. Latino cultural traditions? We consider these questions across a variety of genres: poetry, prose (autobiography in particular), film, art, television, and music. These texts reveal how social environments determine language use as well as how artists have used language to reshape social environments, through, for example, the development of new language practices such as Spanish-English code switching. The course also connects these cultural practices to debates on Spanish in public life and policy.", "other": ["Cross-listed with: SPAN 315N", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LTNST", "number": "326", "credits": "3 Credits", "description": "This course examines representations of the U.S.-Mexico border in relation to the actual geographic space. SPAN 326 Reading the Border/Lands (3) (GH;US) This class will center on discussions of the U.S.-Mexico borderlands in cultural theory and practice. \"Borderlands\" is understood as a transcultural space filled with physical, cultural, economic, political, and mythical elements. The aim is to view how different artists from the Borderlands, both northern Mexican and Chicano, mediate their borderlands reality. That is to say, the goal of the class is to examine the different imaginative geographies in the borderlands. We examine a wide-ranging mix of cultural texts that includes prose, poetry, essays, and performance art, as well as film and video art. We explore how writers have historically rethought notions of citizenship, identity, and culture to create more fluid spaces of representation in cultural contact zones. We will in particular, pay close attention to the relationship between national geography and the shaping of regional identities and popular cultures and relationships between the maps that nations draw and the cultural forms that cut across them.", "other": ["Cross-listed with: SPAN 326", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "LTNST", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "LTNST", "number": "403", "credits": "3 Credits", "description": "Literary and other forms of cultural expression (film, music, art, and theater) are compared across different Latina/o communities.  LTNST (CMLIT) 403 Varieties of Latina/o Cultural Expression (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. This course provides students with a multi-faceted comparative view of Latina/o literature in relation to other forms of cultural expression. First, the course presents a variety of cultural expressions to students in an effort to teach them the different ways that form affects content. Each text will be studied in its historical context as well, thereby providing students with a sense of Latina/o cultural history. Second, this course compares works from within the same genre, allowing students to recognize the ways that Latina/o culture has worked to build identity, to deconstruct identity, and to challenge cultural stereotypes. Such comparison further facilitates comparison of the ways that different cultural forms have been used by diverse Latina/o communities. Third, this course compares cultural forms, allowing students to see how Latina/o poetry affects music or how Latina/o theater affects novels Fourth, this course will include texts that represent a variety of linguistic and national contexts, including many countries in Latin America, thereby allowing students to see the relationship between history, culture, language, geography, and identity. These are all themes that are at the center of both Latina/o Studies and Comparative Literature. A comparative perspective facilitates appreciation of the vast and varied ways that Latina/o communities have used cultural expression. A particular point of contact between Latina/o Studies and Comparative Literature is the influence of hybridity. A central issue explored in this course concerns the intricate connections between multiple ways of expressing identity, in the arts, literature, music, etc., in diverse circumstances, such as locations where Latina/o cultures may be in the mainstream (such as in Latin America) and in the minority (in the U.S.). Drawing upon approaches offered by comparative literature and theories such as post-structuralism, feminism, and post-colonialism, we will examine the complex process through which Latina/o culture has been defined, disseminated, contested, and commercialized. Of particular interest from a comparative perspective are the ways that Latina/o cultures are created through hybridization, processes of mutual borrowing and differentiation, as well as through transnational processes of migration, urbanization, and cultural contact. The course's objective is to show not only how complex societies consolidate a shared culture but also how diverse Latina/o communities have produced a multiplicity of cultures that have been expressed via a broad range of cultural registers. These communities often span vast geographical areas, not only in the U.S. but across the Americas as people continue to look to their countries of origin for artistic inspiration.", "prerequisite": "3 credits in the humanities or in any LTNST course, or   4th-semester proficiency in Spanish", "other": ["Cross-listed with: CMLIT 403", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "LTNST", "number": "426", "credits": "3 Credits/Maximum of 3", "description": "An in-depth study of Chicana/Chicano literature, film, and music from the inception of the Chicano Movement (1965-1975) to the present.  ENGL 426 Chicana and Chicano Cultural Production: Literature, Film, and Music (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. ENGL 426 will constitute an in-depth study of Chicano/a literature, film, and music from the inception of the Chicano movement (1965-1975) to the present. In addition to primary aesthetic texts, students will read historical, political, and theoretical essays designed to situate the Chicano/a cultural texts in historical and political context.The aim of the course is to give students a better understanding of Chicano/a cultural production by situating these works of art against other U. S. artistic traditions and within wider historical and political movements. Authors and artists under consideration in this class will vary, but will likely include Luis Valdez, Tomas Rivera, Estella Portillo Trambley, Oscar Zeta Acosta, Corky Gonzales, Gloria Anzaldua, Norma Alarcon, Cherrie Moraga, Richard Rodriguez, Dagoberto Gilb, Rolando Hinojosa, Alfredo Vea, Charlie Trujillo, Diego Vasquez Jr., Joe Rodriguez, Tomas Almaguer, Jose Esteban Munoz, Manuel Ramos, Lucha Corpi, Rudolfo Anaya, Michael Nave. This class will prepare students for advanced courses in Latin/a literatures as well as other academic courses that engage in the verbal and written analysis of complex texts. Students will be evaluated by means of essays written in and out of class, essay exams, group projects, term-long journals, and class participation. Students should expect to complete a minimum of three written assignments in the course of the term. The course may be used as ENGL major elective credit or as credit towards the ENGL minor and will be offered once a year with 40 seats per offering.", "prerequisite": "ENGL 15", "other": ["Cross-listed with: ENGL 426", "Bachelor of Arts: Humanities", "United States Cultures (US)"]}, {"department": "LTNST", "number": "467", "credits": "3 Credits", "description": "Historical development of policies of the United States with regard to Latin- American affairs from colonial times to the present.", "other": ["Cross-listed with: HIST 467", "Bachelor of Arts: Humanities", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "LTNST", "number": "470", "credits": "3 Credits", "description": "Young people have been at the center of political and cultural revolutions around the world and throughout history. For example, revolutions, urban movements, ethnic/racial pride, LGBTQ+, feminist movements, music basaars, DJs and rave parties, and \"barras de futbol\" are only some of the manifestations associated with young people in Latin(a/o) American literature, film, music, and journalism. Nevertheless, the concept of \"youth\" as an academic category only appeared in the 1960's. In this course, we will study different manifestations of youth cultures in the Hemispheric Americas, paying special attention to the Latinx communities in the U.S. and Latin America, since the 1960's and until the contemporary moment.  The key question that will guide us is: How does each of these literary, artistic, and media representations of youth enter into dialogue with political events in which young people have been at the center of efforts to bring about political changes in the U.S. Latinx communities and Latin American? Using short fiction, film and documentaries, songs, blogs, and other cultural materials (YouTube clips, images, graffiti, etc.), we will identify and compare different youth cultures in Latinx communities in the U.S. and Latin America in terms of their productions, representations, and effects in the public sphere. We will enrich our analysis of primary materials with theoretical and critical readings that will help us to contextualize the different manifestations in our study.", "prerequisite": "SPAN 100A", "other": ["Cross-listed with: SPAN 470"]}, {"department": "LTNST", "number": "479", "credits": "3 Credits", "description": "This course is conducted in Spanish and will analyze some of the central themes that shape the diverse Latina/o experiences in the United States. Some of the main topics that the course will address include: the politics of labeling; definitions of displacements; the politics of language; imaginary homelands and geographic spaces; and conceptualizations of race, gender, and sexuality. These themes will be seen through the lens of Latina/o literature and film. The main objective of this course is to help students think critically about the conceptual, theoretical, historical, and social issues that inform the Latina/o experience in the United States.", "prerequisite": "SPAN 100A", "other": ["Cross-listed with: SPAN 479", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "LTNST", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]