[{"department": "MAET", "number": "204W", "credits": "3 Credits", "description": "A hands-on experience course with emphasis on equipment and lab techniques used for microstructural evaluation of metals.  MAE T 204W Structure Characterization Laboratory (3) This is a laboratory course for two year associate degree students with emphasis on equipment and techniques used for microstructural evaluation of metals. The objective is to provide students with practical laboratory skills in metallography and optical microscopy needed to observe and interpret microstructures of various metal alloys. Furthermore, the student gains valuable writing experience in preparing concise and effective technical reports.Lectures, videotapes, and demonstrations are used to introduce students to fundamental concepts and special techniques used in metallography and microstructural analysis of metals. The course begins with a brief overview of metallography and a discussion of safety in the laboratory. Elements of good technical report writing are introduced. Metallographic principles are presented using reference brochures and videotapes. This includes sectioning, mounting, coarse grinding,fine grinding, rough polishing, final polishing and microetching. Added topics cover the fundamentals of metallographs and photomicrography.A review of the iron-iron carbide system is given based upon material presented in MAE T 201 taught in the third semester of the materials program. Supplementary material on copper alloys is introduced latter in the course so that the physical metallurgy of brass and bronze can be better grasped by the student.This course has three laboratory experiments: (1) specimen preparation and optical microscopy, (2) characterization of powdered metal (P/Nl) iron and carbon steel alloys, and (3) characterization of wrought brass, wrought bronze, and sintered bronze alloys. Each experiment requires that the students prepare a technical report that is graded for its grammar, spelling, technical accuracy, and completeness. The student gains valuable experience in preparing metallographic specimens and appreciates the importance of achieving a representative structure. Laboratory work requires observing and interpreting microstructures of both wrought and porous P/N4 iron and carbon steel alloys. Quantitative metallography is used by students to estimate the carbon content of a selected P/M carbon steel alloy. Special metallographic techniques are learned for preparing porous P/1/4 alloys to reveal their true pore structure. The student develops experimental skills in measuring the density P/M samples and the surface hardness of polished metallographic samples. Also, experience at identifying microconstituents in non-ferrous based alloys is of particular value to the student. The technical reports require the presentation of Rockwell hardness and Knoop microhardness data in the form of tables and graphs.", "prerequisite": "M E  442W", "other": ["Writing Across the Curriculum"]}, {"department": "MAET", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]