[{"department": "METEO", "number": "2", "credits": "3 Credits", "description": "A survey of meteorology emphasizing how the nature of our lives, individually/societally, depends upon atmospheric structure, quality, and processes.  METEO 002 Our Changing Atmosphere: Personal and Societal Consequences (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. The primary objective is to provide the student with an understanding of the mechanisms that determine local and regional weather and climate patterns, with emphasis on how these factors impact individuals and society. We focus on the energy balance of the atmosphere and the forces that drive motion and that are ultimately responsible for surface properties such as precipitation and air quality. Cloud microphysical processes are discussed with emphasis on natural and man-made influences. The potential for inadvertent as well as planned modification of precipitation is discussed. Data sets are provided that enable the students to investigate climate change patterns and to assess the causes of these changes. Student teams are required to prepare reports of findings that are presented in class as well as in written form. Finally, we shall explore the governmental policy implications and responses to a variety of climate threats (including global warming, ozone depletion and urban pollution and heat islands). Students are asked to explore a variety of governmental policy initiatives and to assess the soundness of these initiatives. Course readings are selected from popular scientific literature as well as government documents. Students are evaluated on their comprehension of the physical process (as determined by written examinations) and the soundness of their individual and team efforts in a variety of projects. Because of the hands-on nature of this course, we envision an enrollment of no more than 30. The course will be offered every semester.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "METEO", "number": "3", "credits": "3 Credits", "description": "Nontechnical treatment of fundamentals of modern meteorology and the effects of weather and climate. Weather Revealed: Introductory Meteorology meets the Bachelor of Arts degree requirements. The objectives of the course are for students to gain a better understanding of atmospheric structure and processes so they can better apply the weather information they encounter - in essence, to help students become better weather consumers. Students will learn to read the sky so they can make their own short-term forecasts and adjust their behavior accordingly. When presented with a weather forecast containing caveats, students will have a better feeling for what controls the evolution of a developing system so they can understand why a certain degree of hedging is necessary. Students will acquire the foundation to evaluate, in a scientifically rigorous way, the veracity of many claims about weather and climate that they might see on television or the internet.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "METEO", "number": "4", "credits": "3 Credits", "description": "Non-technical introduction to the science and historical development of meteorology, and the role of weather forecasting as a tool for risk management by individuals, businesses, and societies. METEO 4 traces the development of weather forecasting as both a scientific discipline and as a tool for risk management. Beginning from the pre-modern history of weather forecasting as a diverse set of folkloric and ritualistic practices, the emergence of meteorology as a genuine science has enabled the development of powerful tools for managing risks faced by individuals, businesses and societies.Students will learn about the fundamental principles that govern the global atmospheric circulation, and how this circulation shapes weather and climate. They will learn how this scientific understanding has served as the foundation of a global system of weather observation and forecasting, encompassing a worldwide network of atmospheric observing instruments, powerful computer modeling systems, and a highly elaborate system for disseminating information to diverse users. Demand for weather forecasts is driven by the need to manage weather risks confronting agriculture, transportation, the military, insurance, humanitarian relief, and virtually every other sector of society. Examples will be given of how forecasts are incorporated into the decision-making of businesses. This topic leads to a discussion of the economic value of weather information, and the role of public and private providers of information.The treatment is organized around three themes. First, the possibility of generating a forecast of future conditions requires the adoption of the perspective that the natural world has an underlying regularity, and that this regularity can be discovered and organized through research. The second theme is the critical role of instrumentationin providing the quantitative basis for formal scientific forecasting models. Third, developments in weather forecasting have not proceeded solely from improvements in scientific knowledge: rather, society's demand for risk management toolshas acted as a constant spur on efforts to improve forecasting techniques, as part of a feedback loop between the producers and consumers of forecasts.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "METEO", "number": "5", "credits": "3 Credits", "description": "Non-technical introduction to the physical processes important in the formation of various severe and unusual weather phenomena. METEO 5 provides a current, relevant, and scientifically accurate discussion of a wide range of severe and unusual weather. Severe weather has made a major imprint on the world's cultures and economies throughout history (e.g., the drought of the 1930s led to westward migration and changes in agriculture practices in the U.S., utilities in East Coast cities were placed underground after the Blizzard of 1888, and the severe winter of 1941-1942 helped change the momentum of World War II), and also has been prominent in our literature and entertainment (e.g., The Wizard of Oz, The Grapes of Wrath, Twister, The Perfect Storm). Students will learn about the fundamental principles that govern severe and unusual weather. Concepts are taught in a descriptive manner without relying heavily on mathematics; thus, the material is highly accessible to students with a wide variety of backgrounds. It is believed that learning about weather is enhanced by experiencing weather. For this reason, the class frequently draws upon examples of significant historical and recent severe weather events. Students will be able to apply what they have learned immediately to weather events occurring near their homes or around the world. The course has four major themes. The unit on hazardous cold-season phenomena treats the formation of freezing and frozen precipitation, lake-effect snowstorms, and blizzards. The unit on hazardous warm-season weather treats thunderstorms and larger-scale conglomerations of thunderstorms known as convective systems, including hurricanes. Students also will learn about flash floods, lightning, tornadoes, downbursts, and hailstorms. The unit on hazardous weather triggered by mountainous terrain deals with topographically-forced gravity waves, downslope windstorms, and rotors. The final unit treats a wide variety of unusual atmospheric optical phenomena resulting from the interaction of light with raindrops or ice crystals, such as rainbows, glories, and haloes.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "METEO", "number": "6N", "credits": "3 Credits", "description": "In HIST 6N / METEO 6N, we'll survey how weather and history are integrated throughout time. Moving from past to present, the course will use case studies to navigate historical moments where weather shaped the outcome. Each case study will have a historical, cultural, and meteorological analysis of the event so students gain a deeper understanding of the national or international event and the integration of science and history. Weather has shaped the outcome of major world events. For example, a weather forecast led to the delay of the Allied invasion of Normandy (DDay), record cold weather in Florida led to the Challenger Space Shuttle explosion, General George Washington used fog to conceal the withdrawal of his troops at the Battle of Long Island, and the list goes on. The case studies range from the Revolutionary War through present day, and this period of history has been selected because there are firsthand accounts of the weather and/or recorded weather data for each event. The meteorological study examines the event's atmospheric conditions. How or why did they occur? How did they affect the event? Therefore, students will learn basic meteorology and climatology. They will also analyze weather maps and scientific data. The historical study provides context for the event. What lead to the event? What happened during the event? What are the event's lasting impacts? To better understand the decisions that leaders faced, students will be asked to assess risk and make decisions based on the same weather data or information leaders at the time had. Students will also explain the context, cause, and effects of major historical moments in everyday language to an audience of their peers through discussions and/or projects. The cultural study examines each event from a psychological and sociological point of view. What were the mindsets of the people and cultures involved in the event? How does the event connect to or parallel things in today's society? How would a present day culture react? This study will give students a better understanding of cultural differences in the world and how those cultural differences can alter the course of history. Time in the course is equally split between United States and international topics, and there will be frequent discussion of current events.", "other": ["Cross-listed with: HIST 6N", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "METEO", "number": "7", "credits": "3 Credits", "description": "This course provides an overview of factors that serve as the basis for understanding climate change and climate variability. METEO 007: An Introduction to Climate Science: Climate Change, Climate Variability, and Society use an interdisciplinary scientific approach to provide a foundation for understanding the climate system. This course considers changes in the physical climate system over Earth System. It provides insights on past and present climate variability; anthropogenic forcing and their sources; climate feedbacks; climate model projections during the 21st century; impacts of climate change on society; environmental and climate justice; treaties, protocols and policies to address adaption, mitigation of greenhouse gases and geoengineering.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "METEO", "number": "51N", "credits": "3 Credits", "description": "This course examines the inter-relationship between what we know and what we see, through an introductory exploration of art and science. Engaging students in the study of weather formation, mainly clouds, artistic depictions within the genre of landscape, and the expressed practice of painting; fosters the development of observational skills necessary for reading the landscape and interpreting collected data. What we know and what we see is an on-going evolution of development; syncing the old with the new. Therefore, observation and interpretation are essential to critical thinking, making the intersection between art and science a fertile ground for discovery and learning. The exciting part of the course is the large amount of overlap in the general ideas and thought processes used in meteorology and art, especially when using clouds as the connective tissue. Scientists and artists are both detail oriented and worry about the quality of their work. Both involve collecting data to find the best approaches to a problem, and reasoning through challenges that arise. Students will be challenged throughout the course to seek these connections and how perspectives from each discipline inform the other. Meteorology and art have long been aligned in a common quest to understand how the world works, each seeking interpretations and explanations using a range of complementary and contrasting practices and perspectives. Clouds come in a vast array of sizes and shapes, and are depicted in art using a variety of techniques, creating a shared focus for a deeper understanding of both areas of endeavor. Students will learn about the concept of mixing, which is important to cloud formation and to painting. Students will conduct experiments to learn about cloud processes, and will learn and practice artistic techniques to convey atmospheric conditions. Ideas from both perspectives will be integrated in analysis and discussion. Data from instruments and the individual artist will be collected, shared, and analyzed. Learning how clouds form will help with painting, and questions and perspectives that arise from painting will increase the understanding of cloud processes. The common threads in this approach are a curious mind, a strong detail-oriented focus, effective communication, and respect for the creative tension between ambiguity and assurance in the search for a better sense of causes, connections, and incessant changes.", "other": ["Cross-listed with: ART 51N", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "METEO", "number": "97", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "METEO", "number": "101", "credits": "3 Credits", "description": "Fundamental principles of synoptic and physical meteorology, satellite and radar imagery, and data analysis in the setting of mid-latitude weather forecasting.  METEO 101 Introduction to Weather Forecasting (3) (GN)(BA) This course meets the Bachelor of Arts degree requirements. Never before has the quantity of available weather information so far exceeded the quality of the public's understanding of atmospheric science. Meteorology 101: Understanding Weather Forecasting aims to help correct this imbalance by helping students develop the knowledge and skills they need to become critical consumers of weather information. Students who successfully complete Meteorology 101 will be able to apply knowledge of fundamental concepts of atmospheric science to discriminate between reliable and unreliable weather forecasts, and to explain what makes one forecast better than another.To ensure that students develop the knowledge and skills required to critically assess public weather forecasts, Meteorology 101 will provide an apprentice-training environment that will encourage students to learn forecast mid-latitude weather themselves. They will discover that weather forecasting involves sophisticated data analysis techniques, a thorough understanding of atmospheric science, and strong verbal and graphic communication skills. As it develops these competencies, METEO 101 will fulfill the goals established for Penn State General Education courses in the Natural Science knowledge domain.The intended audience includes undergraduate students at University Park and other Penn State campuses, as well as adult learners in the weather information industry and weather hobbyists worldwide. To reach this diverse audience, METEO 101 will be offered through the University's World Campus in a Web-based, instructor-led format. Currently in development in collaboration between the Department of Meteorology, the EMS e-Education Institute, and the World Campus, METEO 101 will combine digital video, audio, simulation models, virtual field trips to on-line weather data resources, text, and interactive quizzes that provide instantaneous feedback. The course will provide unprecedented access to one of the world's most distinguished meteorology programs.METEO 101 will be offered three times each year during the spring, summer, and fall semesters to an expected audience of about 300 annually.", "other": ["Bachelor of Arts: Natural Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "METEO", "number": "122", "credits": "3 Credits", "description": "Atmospheric Environment: Growing in the Wind is for students who are interested in learning about the dynamic effects of weather on plants and animals. It is about how processes at the ground surface and in the air govern weather conditions on Earth. Growing in the Wind focuses on five major weather elements: energy, temperature, moisture, pressure and wind and how these factors influence ecosystems and habitation of our planet. Emphasis is also given to human impacts on weather and climate, and current environmental issues involving the atmosphere. The lectures are organized around the central theme that the unequal distribution of incoming solar energy (both spatially and temporally) produce temperature and pressure contrasts at the Earth's surface and in the atmosphere that in turn cause storms and control the weather and climate.", "other": ["Cross-listed with: AGECO 122", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "METEO", "number": "133N", "credits": "3 Credits", "description": "Climate change is not only a political, economic, and social crisis, it presents one of the great moral problems of our time. This course will cover the science, policy, and ethics of climate change. It fulfills general science requirements by giving an overview of the role played by such diverse scientific disciplines as chemistry, earth systems, ecology, and geology in understanding our changing climate while also exploring mitigation and adaptation strategies being developed in the fields of engineering, forestry, agriculture, and others. It fulfills humanities requirements by delving into the ethical dimensions of climate change, including religious and humanistic theories of human flourishing, deontological and teleological theories of ethics, and analysis of specific choices addressed by international negotiators. A hallmark of this course is using Penn State as a 'living laboratory' by taking advantage of both faculty expertise and the realworld activities of the Office of Physical Plant. Every week, students will interact with experts from various quarters of the University in order to see how climate change is being approached in a multi-disciplinary fashion. The first third of the course will feature guest lectures by EMS faculty working on paleoclimate, modeling, carbon sinks, ocean acidification and other aspects of climate science. The second portion will engage humanists, economists, historians, and artists at Penn State. The third will include tours of Penn State facilities, such as the East Campus Power Plant, and interviews with researchers developing new energy and sequestration technologies. In addition to exams and papers, students will prepare for a mock negotiation by learning about the energy profile and history of assigned countries. They will then have to set specific CO2 and temperature goals and come up with solutions to achieve these. The goal is to understand the role placed by ethical ideals in the pragmatic process of producing an equitable solution. In short, this course will give students the tools to understand the basic science of climate change and its ethical implications. Students will come away with a better sense of the moral dimensions of this phenomenon and the implications for human civilization and for the biosphere.", "other": ["Cross-listed with: PHIL 133N, RLST 133N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "METEO", "number": "201", "credits": "3 Credits", "description": "Introduction to the collection, display, and application of weather observations and numerical forecasts used by the operational meteorologists. Students who have passed both METEO 200A and 200B may not schedule this course for credit."}, {"department": "METEO", "number": "215", "credits": "0.5 Credits/Maximum of 4", "description": "Forecast methods/data discussed prior to nightly weather forecast entry. Satisfactory performance will be determined by attendance and forecast accuracy.  METEO 215 Weather Forecast Preparation Laboratory (0.5 per semester/maximum of 4) Students will learn basic weather forecasting techniques and identify appropriate sources of weather information that will assist them in weather forecast preparation. Forecast accuracy will be judged against peer groups at Penn State and several other institutions of higher learning across the U.S. and Canada through WxChallenge (or a similarly run program), a national weather forecasting contest. The bulk of the class time will be spent preparing weather forecasts for five different U.S. cities, each for two consecutive weeks. Cities from different climate regimes will help familiarize students with forecasting challenges from across the country. In addition, the previous day's weather forecast difficulties and ways to improve forecast accuracy will be discussed. The remaining weeks of the semester will be devoted to in-depth analysis of forecast errors and ways to keep improving forecast quality. Satisfactory performance is determined through attendance records and weather forecast contest results. The course should be taken in BOTH the fall and spring semesters each year for maximum learning potential. METEO 215 may be repeated up to 8 times."}, {"department": "METEO", "number": "241", "credits": "3 Credits", "description": "Applying atmospheric principles to the tropics, with an emphasis on the development, structure, prediction and destructive impact of hurricanes.  METEO 241 Fundamentals of Tropical Forecasting (3) Worldwide, approximately 80 tropical cyclones develop each year. This global annual average of tropical cyclones is small in comparison to the thousands of low-pressure systems that routinely parade across the middle latitudes each year. Yet tropical storms and hurricanes garner far greater attention from meteorologists and the media. The obvious reason for this lopsided focus is that tropical cyclones can inflict great devastation to life and property.One of the primary goals of Meteorology 241: Fundamentals of Tropical Forecasting is to give students a working knowledge of hurricanes and tropical storms so that they can become critical weather consumers. For example, when a hurricane bears down on the coast of the United States, the media often portray the storm as a monster capable of laying waste to anything in its path. In METEO 241, students will understand that the initial fury of a land-falling hurricane is focused within a swath of coastal area approximately 30 miles long or less.To ensure that students develop the knowledge and skills required to critically assess weather forecasts issued by the National Hurricane Center, METEO 241 will provide, like METEO 101, an apprentice-training environment. Under the tutelage of professional weather forecasters, students, in their role as apprentices, will also work toward the goal of creating their own tropical-weather forecasts.In the process, students in METEO 241 will learn about the pitfalls of forecasting the tracks and intensities of tropical storms and hurricanes as they actively work with output from sophisticated numerical models available on the Internet. Moreover, successful students will apply their knowledge of the fundamental concepts of atmospheric science in order to competently evaluate forecasts issued by the National Hurricane Center in Miami and the Joint Typhoon Warning Center in Honolulu.Students will also gain a broad perspective of the general weather and oceanic patterns in the tropics. For example, students will learn about El Nino and La Nina. In the process, they will discover that El Nino and La Nina are not to blame for every unusual weather event that occurs anywhere in the world. It should be noted here that METEO 241 will be one of four courses required for students to earn a Certificate of achievement in Weather Forecasting, a unique online program offered through Penn State's World Campus. The three other courses that will comprise this online program are METEO 101: Understanding Weather Forecasting, METEO 361: Fundamentals of Mesoscale Weather Forecasting and METEO 410: Advanced Topics in Weather Forecasting.To facilitate the learning objectives, METEO 241 will include the use of digital video, audio, simulation models, virtual field trips to on-line resources for weather data, text, and interactive quizzes that provide timely feedback.To demonstrate their mastery of the learning objectives, students will complete automated online quizzes, actively engage in online discussion groups focusing on real-time weather, and publish, to a personal 'e-portfolio', four comprehensive projects that will explore timely case studies related to weather forecasting. The e-portfolio will take the form of a Web site that students initially create during the second course of the program (METEO 241 or METEO 361). Students will augment their e-portfolio as part of the requirements for METEO 241, METEO 361 and METEO 410. They will also use the space to reflect on their learning.At the end of the program, students will make a final e-portfolio entry that highlights their program accomplishments. In this way, the e-portfolio will serve both as a showcase of a student's work for the purpose of course assessment and as a chronicle of a student's achievements during the program. By using their Penn State personal Web space to host their e-portfolios, students will be able to share their work not only with program faculty and students, but also with external audiences, including potential employers. Upon successful completion of the program, graduates will receive a copy of their final e-portfolio on CD-ROM.", "prerequisite": "METEO101"}, {"department": "METEO", "number": "273", "credits": "3 Credits/Maximum of 3", "description": "Algorithm design and implementation for meteorological analysis and forecasting. Algorithm design and implementation for meteorological analysis and forecasting, including access to datasets in meteorological common data formats. The objectives of this course are to introduce the student to fundamental programming concepts, such as variables, flow control, and syntax, to apply those concepts to solve meteorological problems couched in the analysis of datasets in meteorologically-relevant common data formats, and to familiarize students with appropriate programming languages and their application to meteorological analysis or forecasting problems on regional and/or global scales.", "prerequisite": "METEO 101"}, {"department": "METEO", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "METEO", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "METEO", "number": "300", "credits": "4 Credits", "description": "An introduction to the fundamentals of atmospheric dynamics, physics, and chemistry.  METEO 300 Fundamentals of Atmospheric Science (4)This course prepares students for their 400-level meteorology courses by laying a solid foundation in the application of physical, chemical, and mathematical principles to a broad range of atmospheric phenomena. Students are introduced to fundamental concepts and applications of atmospheric thermodynamics, radiative transfer, atmospheric chemistry, cloud microphysics, atmospheric dynamics, and the atmospheric boundary layer. These topics are covered broadly but in enough depth to introduce students to the methods atmospheric scientists use to describe and predict atmospheric phenomena. The course is designed to be taken by sophomore meteorology students as well as by students in related disciplines who have an adequate mathematical and physical background.", "prerequisite": "CHEM 110"}, {"department": "METEO", "number": "332N", "credits": "3 Credits", "description": "This interdomain course introduces students to the science and policy of greenhouse gas emissions. The course focuses on emissions from natural sources, energy production and food production. Policy components will introduce students to the fundamentals of environmental policy and examine key policy options for mitigating and managing emissions. Global in scope, the course will also address how emissions and policy options differ in developed and developing countries. Topics will include overviews of the global carbon cycle, agriculture and land use change emissions, history of global energy use and production, overview of global climate change policy, frontiers in climate, energy and agriculture policy, amongst others.", "prerequisite": "ENGL 015.", "other": ["Cross-listed with: ANSC 332N, GEOG 332N", "General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "METEO", "number": "361", "credits": "3 Credits", "description": "Applying atmospheric principles to small-scale weather systems, with an emphasis on the conceptual modeling and short-range prediction of severe thunderstorms.  METEO 361 Fundamentals of Mesoscale Weather Forecasting (3) When outbreaks of severe weather occur, dire warnings for tornadoes, large hail or damaging straight-line winds urgently scroll across the bottoms of television screens. Simultaneously, television weathercasters warn viewers to \"take cover immediately\". Yet, because of the limited spatial and time scales of severe thunderstorms, the areas affected by tornadoes, large hail and damaging straight-line winds often turns out to be relatively small (sometimes as small a tenth of one percent of the original \"watch area\"). There is no doubt that people should be prepared to take definitive action to protect their lives and the lives of their families when outbreaks of severe weather occur. But the overall impression that entire counties or cities will be destroyed by severe weather can be, and frequently is, misleading. One of the primary goals of METEO 361: Fundamentals of Mesoscale Weather Forecasting is to give students a scientifically grounded perspective of the spatial and time scales of typical outbreaks of severe weather. In the process, students will become better weather consumers. To gain such insights, students will learn conceptual models of the life cycles of severe thunderstorms and will then apply them in real-time outbreaks of severe weather. In the final analysis, students will be able to more accurately weigh the information being disseminated by the media and the Storm Prediction Center in Norman, Oklahoma.To ensure that students develop the knowledge and skills required to critically assess public weather forecasts, METEO 361 will provide, like METEO 101, an apprentice-training environment that will guide students, under the tutelage of professional weather forecasters, to actively learn how to create their own mesoscale-weather forecasts. In the process, METEO 361 will reinforce the notion that weather forecasting involves sophisticated techniques of data analysis and a thorough understanding of atmospheric science. METEO 361 will also stress that the clear communication of the forecast requires strong verbal and graphic communication skills.Using conceptual models and real-time radar and satellite imagery in concert with output from numerical models designed specifically for mesoscale forecasting, students will predict severe weather on time scales of a few hours to one day. For example, students will be given a litany of web-based tools and asked to place their own \"watch box\" for severe weather. Students will then be asked to verify and discuss the outcomes of their forecasts. For more general outlooks of severe weather (time scales of one to two days), students will use output from the numerical models that were introduced in METEO 101 to identify the areas likely to be at risk for severe weather. It should be noted here that METEO 361 will be one of four courses required for students to earn a Certificate of Achievement in Weather Forecasting, a unique online program offered through Penn State's World Campus. The three other courses that will comprise this online program are METEO 101: Understanding Weather Forecasting, METEO 241: Fundamentals of Tropical Forecasting and METEO 410: Advanced Topics in Weather Forecasting.To facilitate the learning objectives, METEO 361 will include the use of digital video, audio, simulation models, virtual field trips to on-line resources for weather data, text, and interactive quizzes that provide timely feedback.To demonstrate their mastery of the learning objectives, students will complete automated online quizzes, actively engage in online discussion groups focusing on real-time weather, and publish, to a personal 'e-portfolio', four comprehensive projects that will explore timely case studies related to weather forecasting. The e-portfolio will take the form of a Web site that students initially create during the second course of the program (METEO 241 or METEO 361). Students will augment their e-portfolio as part of the requirements for METEO 241, METEO 361 and METEO 410. They will also use the space to reflect on their learning.At the end of the program, students will make a final e-portfolio entry that highlights their program accomplishments. In this way, the c-portfolio will serve both as a showcase of a student's work for the purpose of course assessment and as a chronicle of a student's achievements during the program. By using their Penn State personal Web space to host their e-portfolios, students will be able to share their work not only with program faculty and students, but also with external audiences, including potential employers. Upon successful completion of the program, graduates will receive a copy of their final e-portfolio on CD-ROM.", "prerequisite": "METEO101"}, {"department": "METEO", "number": "395", "credits": "3 Credits/Maximum of 6"}, {"department": "METEO", "number": "395A", "credits": "3 Credits/Maximum of 6", "description": "METEO 395A Internship in Meteorological Communication (3 per semester/maximum of 6)A student participates for at least 100 hours in an internship with an agency or company that focuses on communication of weather forecasts or other atmospheric information. This internship is normally completed after the sophomore year. Given the focus of this internship and the paper requirement to relate the internship experience to meteorology coursework, students must have completed the first two required courses covering weather analysis or forecasting and fundamentals of atmospheric science. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO101 , or METEO200A and METEO200B , or METEO201 , and METEO300"}, {"department": "METEO", "number": "395B", "credits": "3 Credits/Maximum of 6", "description": "METEO 395B Private Sector Meteorology Internship (3)A student participates for at least 100 hours in an internship with a private sector company that focuses on problems or applications that use meteorological information. This internship is normally completed after the sophomore year. Given the focus of this internship and the paper requirement to relate the internship experience to meteorology coursework, students must have completed the first two required courses covering weather analysis or forecasting and fundamentals of atmospheric science. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO101 , or METEO200A and METEO200B , or METEO201 , and METEO300"}, {"department": "METEO", "number": "395C", "credits": "3 Credits/Maximum of 6", "description": "METEO 395C Internship in Meteorological Operations (3 per semester/maximum of 6)A student participates for at least 100 hours in an internship in an operational setting that focuses on the creation of time-sensitive meteorological products such as weather or climate forecasts. This internship is normally completed after the sophomore year. Given the focus of this internship and the paper requirement to relate the internship experience to meteorology coursework, students must have completed the first two required courses covering weather analysis or forecasting and fundamentals of atmospheric science. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO101 , or METEO200A and METEO200B , or METEO201 , and METEO300"}, {"department": "METEO", "number": "395D", "credits": "3 Credits/Maximum of 6", "description": "METEO 395D International Meteorological Internship (3)A student participates for at least 100 hours in an internship in an international setting that focuses on applying meteorological knowledge. This internship is normally completed after the sophomore year. Given the focus of this internship and the paper requirement to relate the internship experience to meteorology coursework, students must have completed the first two required courses covering weather analysis or forecasting and fundamentals of atmospheric science. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO101 , or METEO200A and METEO200B , or METEO201 , and METEO300"}, {"department": "METEO", "number": "395E", "credits": "3 Credits/Maximum of 6", "description": "METEO 395E Off-Campus Meteorological Research Internship (3 per semester/maximum of 6)A student participates for at least 100 hours in an internship whose focus is a research project requiring applications of meteorological knowledge. This internship is normally completed after the sophomore year. Given the focus of this internship and the paper requirement to relate the internship experience to meteorology coursework, students must have completed the first two required courses covering weather analysis or forecasting and fundamentals of atmospheric science. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO101 , METEO200A and METEO200B , or METEO201 , and METEO300"}, {"department": "METEO", "number": "410", "credits": "3 Credits", "description": "Exploring highly specialized topics and techniques in weather forecasting that span from mesoscale to planetary spatial scales and short-term to long- range time scales.  METEO 410 Advanced Topics in Weather Forecasting (3) T.H. Huxley's passage from Biogenesis and Abiogenesis -- 'The great tragedy of Science - the slaying of a beautiful hypothesis by an ugly fact' (1870) -- will serve as the springboard for learning in METEO 410. In the spirit of a 'beautiful hypothesis,' forecasters' diagnoses of the present state of the atmosphere and their prognoses for how the atmosphere will evolve with time may be scientifically sound. Yet, local weather can turn out dramatically different than the intent of the forecast (the ugly fact). To compound this 'great tragedy of Science,' weather forecasters routinely spend most of their preparation time on local details, particularly when the weather tends to get more interesting.Nonetheless, there are 'master forecasters' who regularly avoid great tragedies in weather forecasting. Master forecasters will prudently weigh the length of the forecast time as well as interactions between weather features on the hemispheric, synoptic, meso and local scales while, at the same time, they will adroitly use an array of forecasting tools to arrive at a high-quality local forecast. With the prudent and seasoned approach of the master forecaster in mind, METEO 410 will provide students with a master apprenticeship in weather forecasting. As master apprentices, students will learn highly specialized tools and techniques that will help them to hone and expand their overall forecasting skills. For example, students will learn a new technique for forecasting rare and extreme weather that is based on assessing departures of specific meteorological fields from climatological norms. In the process, students will study rare historic events, such as the great ice storm across northern New England and eastern Canada in 1998. Along the way, students will learn some basic statistics, including climatological means and standard deviations. As master apprentices, students will also learn about medium-range forecasting (three to seven days into the future) and medium-range computer models. Students will learn how to implement modern prediction techniques, such as ensemble forecasts from computer models. Master forecasters increasingly take advantage of this avant-garde technique in short to medium-range forecasting. Unique learning modules, which run the gamut from forecasting wildfires to learning about the influence of the North Atlantic Oscillation on long-range forecasts (seven days or more), will provide students with the tools to understand the bases for all the forecasts they see on television, hear on the radio, read in publications such as Weatherwise, or access on the World Wide Web. For example, students will learn about the forecasting products issued by the Climate Prediction Center, which include seasonal outlooks that focus on the seasonal impacts of La Nina and El Nino. To facilitate the learning objectives, METEO 410 will include the use of digital video, audio, simulation models, virtual field trips to on-line resources for weather data, text, and interactive quizzes that provide timely feedback.It should be noted here that METEO 410 will be one of four courses required for students to earn a Certificate of Achievement in Weather Forecasting, a unique online program offered through Penn State's World Campus. The three other courses that will comprise this online program are METEO 101: Understanding Weather Forecasting, METEO 241: Fundamentals of Tropical Forecasting and METEO 361: Fundamentals of Mesoscale Weather Forecasting.To demonstrate their mastery of the learning objectives, students will complete automated online quizzes, actively engage in online discussion groups focusing on real-time weather, and publish, to a personal 'e-portfolio', four comprehensive projects that will explore timely case studies related to weather forecasting. The e-portfolio will take the form of a Web site that students initially create during the second course of the program (METEO 241 or METEO 361). Students will augment their e-portfolio as part of the requirements for METEO 241, METEO 361 and METEO 410. They will also use the space to reflect on their learning. At the end of the program, students will make a final e-portfolio entry that highlights their program accomplishments. In this way, the e-portfolio will serve both as a showcase of a student's work for the purpose of course assessment and as a chronicle of a student's achievements during the program. By using their Penn State personal Web space to host their e-portfolios, students will be able to share their work not only with program faculty and students, but also with external audiences, including potential employers. Upon successful completion of the program, graduates will receive a copy of their final e-portfolio on CD-ROM.", "prerequisite": "METEO101 , METEO241 , METEO361"}, {"department": "METEO", "number": "411", "credits": "4 Credits", "description": "Meteo 411 focuses on the description, analysis, evolution, and prediction of large-scale weather systems such as extratropical cyclones, jet streams, and fronts, with an emphasis on techniques for analyzing synoptic-scale weather situations in three dimensions. Students will develop an understanding of the fundamental underlying processes that lead to the large-scale motions that modulate weather on synoptic scales. Though not intended as a course in weather forecasting, Meteo 411 provides a solid foundation for future forecasting courses. A fundamental goal of Meteo 411 is to provide students with a framework for visualizing the vertical motion field in the atmosphere, both qualitatively and quantitatively. The vertical motion field ultimately determines, depending on the availability of water vapor, where clouds and precipitation form. To that end, students become familiar with the Norwegian cyclone model as a conceptual framework for understanding synoptic-scale weather systems, as well as the role of the upper-level flow in the development and evolution of extratropical cyclones. The principles of conservation of mass, energy, and momentum are also applied as instruments for assessing synoptic-scale motions. Finally, students will develop an understanding of quasi-geostrophy and how this framework can be used to explain the evolution of synoptic-scale weather systems. The course begins with a review of the fundamental assumptions that are commonly invoked on the synoptic scale, including the hydrostatic and geostrophic approximations. The topic of numerical weather prediction is revisited from both the theoretical and the operational standpoints, comparing and contrasting the deterministic and ensemble frameworks. To visualize the structure of synoptic-scale weather systems, a variety of analysis techniques are employed, including cross sections, plan views, three-dimensional models, and satellite and radar imagery. Pattern recognition techniques for identifying synoptic-scale regimes are explored and quantified using various zonal indices and global teleconnection patterns. These techniques are employed in each lab period where students lead a daily weather briefing that includes both an analysis of the current weather situation and a forecast of its future. Students will be able to link the mathematical descriptions of atmospheric motion with a qualitative understanding of physical processes, and apply them to the analysis and prediction of the atmosphere. Within the course framework, the following topics are also covered: thickness and its applications, thermal wind balance, potential temperature, pressure tendency equation, frontogenesis equation, ageostrophic processes, gradient wind, jet streaks, vorticity and vorticity advection, conveyor belts, self-development, quasi-geostrophic theory, potential vorticity and its applications, and the synoptic setup for severe weather.", "prerequisite": "METEO 101"}, {"department": "METEO", "number": "413", "credits": "3 Credits", "description": "Analysis of actual surface weather observations, with emphasis on the Norwegian cyclone model, missing or bad data, and mesoscale phenomena.  METEO 413 Map Analysis (3) METEO 413, Map Analysis, is designed as a professional elective for Meteorology majors and as such it is primarily taken by fourth-year students. Third-year students who have completed METEO 411 may also register for Map Analysis. The course encourages students to tie together concepts learned in prior meteorology courses through analysis of numerous weather maps from across the northern hemisphere both at the surface and above. This is accomplished by improving the student's understanding of the cyclone model and applying that knowledge to 'real-life' analyses where data quality may be compromised and topographic and other mesoscale factors may be important. Grades are based upon the best 13 of 14 lab assignments, 2 or more quizzes, and in-class assignments. Class participation is rewarded on an extra-credit basis. METEO 413 is offered each spring; enrollment is limited to 15 students.", "prerequisite": "METEO411"}, {"department": "METEO", "number": "414", "credits": "4 Credits", "description": "A survey of conceptual models and analysis techniques for mesoscale atmospheric features.", "prerequisite": "METEO411"}, {"department": "METEO", "number": "415", "credits": "3 Credits", "description": "Modern techniques in weather analysis and forecasting.", "prerequisite": "METEO411"}, {"department": "METEO", "number": "416", "credits": "3 Credits", "description": "Competitive, simulated, operational, real-time forecasting is covered.", "prerequisite": "METEO 415"}, {"department": "METEO", "number": "419", "credits": "3 Credits", "description": "Issues relating to the prediction and dispersion of air pollutants are discussed.  METEO 419 Air Quality Forecasting (3) Prediction of air quality is discussed from the perspective of operational weather forecasting. The chemical properties of pollutants for which public forecasts are currently made, fine-scale particulate matter and ozone, are summarized to provide the physical background for making forecasts. The impacts of weather on pollutant concentrations are discussed. Current techniques for forecasting air quality are presented and used by the students to create their own air quality forecasts. Students present air quality weather briefings and post-analysis of significant historical air quality events. To take this course, students must have the background provided in a basic course in chemistry and a basic course in meteorology that covers weather systems governing the transport of air pollution.", "prerequisite": "CHEM 110"}, {"department": "METEO", "number": "421", "credits": "4 Credits", "description": "Balanced and unbalanced flows, vorticity, circulation and potential vorticity, an introduction to wave dynamics and stability analysis, and a quantitative discussion of the general circulation.  Meteo 421 Atmospheric Dynamics (4) This course builds on the foundation laid in METEO 300, Fundamentals of Atmospheric Science, by presenting applications of the equations of motion to the description of a variety of atmospheric motions. The intrinsically rotational aspects of large-scale atmospheric motions are presented through a discussion of vorticity dynamics (including both relative and planetary vorticity) and the related circulation theorems of Kelvin and Bjerknes that culminate in potential vorticity thinking. The contrast between oscillating and unstable atmospheric systems is highlighted using the examples of gravitational, inertial, and shear instability, and the parcel and perturbation methods are introduced for studying these systems. An introduction to wave dynamics presents the concepts of phase and group velocity with applications to gravity, inertial, and Rossby waves, and to geostrophic adjustment. Finally, the general circulation, including the major zonal wind systems (e.g., the mid-latitude westerlies) and the major overturning cells (Hadley and Ferrel cells) is discussed quantitatively to provide a description of planetary-scale motions.", "prerequisite": "METEO 300"}, {"department": "METEO", "number": "422", "credits": "3 Credits", "description": "Survey of advanced dynamical topics including instabilities, numerical modeling, and others of current interest.  METEO 422 Advanced Atmospheric Dynamics (3)This course in atmospheric dynamics covers advanced topics, including instabilities that lead to the development of various atmospheric phenomena at the synoptic and smaller scales, numerical modeling principles and applications, topographic gravity and Rossby waves, understanding of the general circulation that can be used for extended-range forecasting, and frontal structure and frontogensis. Some additional topics will vary at the discretion of the instructor.", "prerequisite": "METEO421"}, {"department": "METEO", "number": "422H", "credits": "4 Credits", "description": "Generalized vertical coordinate systems, vorticity and theory applications, conservation principles and energetics, quasi-geostrophic processes, boundary layer dynamics.", "other": ["Honors"]}, {"department": "METEO", "number": "426", "credits": "3 Credits", "description": "METEO 426 will provide students with a practical understanding of the structure of numerical weather prediction (NWP) models in the context of their application to real world precipitation forecasting. The course combines lecture material on the inner workings of NWP models with a forecasting module that applies the lecture material to daily precipitation forecasts. The course begins with a full description of the mathematical backbone of NWP models - the primitive, or governing, equations. The primitive equations that describe the future state of the atmosphere, given some initial state, are a set of non-linear, partial differential equations that are only solvable by numerical methods. The sophistication of numerical methods, in turn, depends on available computing capacity. A discussion of the historical development of simplified NWP models in the context of limited computing resources follows. While the advent of modern computers allowed for the explicit computation of the primitive equations, their use in operational forecast settings uncovered additional important theoretical limitations on forecast skill. In particular, the future state of the atmosphere is extremely sensitive to initial conditions yet there are insufficient observations to fully initialize an NWP model. Techniques for initializing NWP models - called data assimilation - were and continue to be a key source of model error. As a result, we cover these methods in detail. Beyond initial condition uncertainty, there are fundamental limits on the predictive skill of NWP models. These limits, a consequence of the fundamentally non-linear dynamics of the atmosphere, were first described by Edward Lorenz and usually referred to as \"chaos theory.\" For operational weather forecasting, the implication is that single, deterministic models are necessarily limited in skill, even with near-perfect initial conditions. As a result, operational forecast centers have moved towards ensemble-based forecasting. The development and use of ensemble models are discussed in detail in this class. Next, the model must be moved forward in time. Basic numerical methods used to advance the model in time, typically using finite difference techniques, are described and the recent shift to finite volume methods are introduced and discussed in the context of the latest NWP models. We then describe parameterization schemes that NWP models use to account for phenomena not directly resolved by the model. We discuss several important schemes relevant to precipitation, including convective parameterizations and microphysics, and the planetary boundary layer. The course concludes with a review of one of the latest operational NWP models.", "prerequisite": "METEO 411"}, {"department": "METEO", "number": "431", "credits": "3 Credits", "description": "Classical thermodynamics applied to both the dry and the moist atmosphere.", "prerequisite": "METEO 101"}, {"department": "METEO", "number": "434", "credits": "3 Credits", "description": "In METEO 434, students will learn the basic operating principles and applications of weather radar, a primary observing platform for both operational and research meteorologists. In particular, students will learn the fundamentals of radar data acquisition, signal processing, and interpretation for measurements of weather phenomena. In order to successfully achieve these skills, students will master the following concepts: the basics of radar engineering, design, and operation; the physics of electromagnetic radiation, its propagation through the stratified atmosphere, polarization and phase shifts, and scattering from various hydrometeors; the physical properties of atmospheric scatterers, and how the physical properties of hydrometeors (e.g., size, shape, dielectric constant, orientation) affect the scattering signal. Lectures will frequently involve real-world data examples, theoretical considerations, and practice problems. In addition, several lectures will be devoted to recent technological or scientific advances published within the last 1-2 years, in order to provide students with an updated and working knowledge of the field. When practical, the course will include a field trip to a National Weather Service Doppler radar facility, most likely the system in Moshannon State Forest in central Pennsylvania. With this knowledge and these tools in hand, the remainder of the class will heavily focus on the interpretation of radar signals in weather phenomena, with particular emphasis on the interpretation and applications of dual-polarization weather radar data. To this end, one class per week will involve the discussion and interpretation of student-provided radar images. As the semester progresses, the students are expected to incorporate additional depth of understanding and newly discussed radar variables into these discussions. Students will actively participate in the course through bringing real-world examples of radar observations to class for presentation and discussion. They will be required to access data from the internet or smart phone app, organize it for a computer-based presentation, write a brief description, give the in-class presentation, and lead the subsequent discussion. In addition, the students will work towards a term project that is a case study of a high-impact weather event of their choosing. This project provides students the opportunity to master ordering data from the internet, downloading it, processing it, reading it into common coding languages, and creating graphics for display. In addition, part of the project will involve quantitative data analysis or manipulation, emphasizing computer coding and data handling skills. The semester-long project will culminate in a final presentation and report synthesizing their newly acquired knowledge and skillsets."}, {"department": "METEO", "number": "436", "credits": "3 Credits", "description": "Elements of earth-sun geometry, radiative transfer, photochemistry, remote sensing of the atmosphere, physical climatology, climate forcing.  METEO 436 Radiation and Climate (3)This course covers radiation and how it interacts with the atmosphere and earth's surface to drive motions in the atmosphere. The fundamentals of radiative transfer at the molecular level, including absorption, scattering, transmission, and emission of radiation by matter, are discussed and applied to help describe the earth's energy budget. Crucial to understanding these processes in the atmosphere are the interactions of radiation with water in the vapor, liquid, and solid states. Applications of radiative transfer to the understanding of seasons and of climate and climate change are presented as well.", "prerequisite": "METEO300; Concurrent: METEO431"}, {"department": "METEO", "number": "437", "credits": "3 Credits", "description": "Properties of aerosols and clouds, cloud nucleation and precipitation processes, atmospheric electricity, cloud and precipitation chemistry, biogeochemical cycles.  METEO 437 Atmospheric Chemistry and Cloud Physics (3)This course develops an understanding of how the physical and chemical properties of the atmosphere influence cloud and precipitation formation, as well as how clouds in turn affect the properties of the atmosphere. The roles that chemistry and clouds play in modulating weather, climate, and atmospheric electricity are also treated.", "prerequisite": "METEO300 and METEO431"}, {"department": "METEO", "number": "440W", "credits": "3 Credits", "description": "Theory and practices used in measurement and analysis of meteorological variables.  METEO 440W Principles of Atmospheric Measurements (3) The standard theories and practices used in measurement and analysis of atmospheric variables are surveyed in the lecture portion of the course. The laboratory portion of the course provides students hands-on experience with using standard and self-produced instruments to make reliable measurements and with analyzing meteorological observations to determine their significance. In the laboratory reports, students learn the fundamentals of appropriate scientific writing to summarize the objectives of the lab exercise, to provide an analysis of the observations, and to critique the results. The initial drafts of these reports are evaluated critically by the instructors and teaching assistants and then are revised by the students based on these evaluations. Discussion of scientific writing and of proper report protocols are presented in the course as well.", "prerequisite": "STAT 401", "other": ["Writing Across the Curriculum"]}, {"department": "METEO", "number": "451", "credits": "3 Credits", "description": "Air-sea interaction, wind-driven and thermohaline circulations, upwelling, El Nino, waves, and tides.  METEO 451 Elements of Physical Oceanography (3) The primary objective of this course is to describe the circulation of the ocean and present a theoretical basis for understanding it. The focus is on the large-scale, basin-wide features of the ocean circulation, such as: 1) the subtropical ocean gyres that contain the wind-driven western boundary currents like the Gulf Stream, 2) the equatorial oceans that respond rapidly to external forcing to produce phenomena like El Nino, and 3) the thermohaline circulation that acts as a slow regulator of the earth's climate. A main goal is to demonstrate to meteorology students that the ocean is not a static, passive lower boundary to the atmosphere but a dynamic, evolving entity that is intimately coupled to the atmosphere through the exchange of heat, momentum, and water. Thus the oceans affect weather and climate. Students are evaluated on their comprehension of the relevant physical processes (as determined by written examinations) and by term papers and laboratory reports or a combination of the two. This course will be offered annually with an enrollment of about 12 students.Class size, frequency of offering, and evaluation methods will vary by location and instructor. For these details check the specific course syllabus.", "prerequisite": "METEO421"}, {"department": "METEO", "number": "452", "credits": "3 Credits", "description": "Atmospheric processes in the tropics; mass, heat, energy, momentum, and water vapor budgets, cumulus convection, hurricanes and other disturbances.", "prerequisite": "METEO411 , METEO421"}, {"department": "METEO", "number": "454", "credits": "3 Credits", "description": "Physical processes and their measurement in the lowest layers of the atmosphere; application to hydrology, plant systems, and air pollution.  METEO 454 Introduction to Micrometeorology (3) Students will learn the basic fluid mechanics and thermodynamics of the atmospheric boundary layer (ABL), the lowest few hundred meters to few kilometers of the atmosphere. Specific topics covered include: 1. Introduction to micrometeorology 2. The surface energy budget 3. Radiation balance near the surface 4. Soil heat transfer 5. Air temperature and humidity in the boundary layer 6. Wind distribution in the boundary layer 7. Introduction to viscous flows 8. Introduction to turbulence in the boundary layer 9. Semi-empirical theories of turbulence", "prerequisite": "METEO421 and METEO431 or EME  301"}, {"department": "METEO", "number": "455", "credits": "3 Credits", "description": "The basic principles of atmospheric flow, introduction to the modeling of turbulent diffusion, and the use of EPA dispersion models. METEO 455 Atmospheric Dispersion (3) Students will learn both the theory and current practice of numerical modeling of the turbulent dispersion of effluents from sources in the atmospheric boundary layer. Lab sessions involve hands-on experience with the numerical models used in the applied dispersion community. Classroom sessions cover the boundary-layer meteorology and dispersion theory on which these models are based. In laboratory sessions, students become acquainted with the present practice of short-range atmospheric dispersion modeling through: * exploring the air-quality resources available on the World Wide Web * examining the design of the air-quality models used today in permitting and hazardous-release applications *discussing the input data needed by the models, the nature and reliability of their predictions and the advantages of improved models including AERMOD * running the models SCREEN3 and ISC (the U.S. EPA's Industrial Source Complex model). Lectures on boundary-layer meteorology include: * the atmospheric boundary layer, turbulence, and the surface energy budget * buoyancy, stability and their influence on the atmospheric boundary layer * mass conservation in fluid motion, turbulent and molecular fluxes and their roles in atmospheric dispersion * the contrast between instantaneous and average properties of turbulent flow, the convergence of averages and implications for dispersion models.", "prerequisite": "EGEE 470"}, {"department": "METEO", "number": "460", "credits": "3 Credits", "description": "This course will introduce the role that weather plays as a source of financial and operational risk for businesses, market and other institutions.  METEO 460 Weather Risk and Financial Markets (3)The course introduces students to the role that weather plays as a source of financial and operational risk for business, markets, and other institutions. It also introduces the tools and concepts for weather risk management-the insurance products, financial instruments, and decision tools that organizations use to manage, reduce, and transfer their weather-related risks. Major topics include: (i) The concept of risk and the role of weather as a driver of economic risk; (ii) Probabilistic approaches to weather forecasting; (iii) Techniques for valuation of weather derivatives; (iv) Links between weather and markets for energy and agricultural commodities; and (v) Management of catastrophic hurricane risks. Weekly assignments culminate in a major student project on weather risk management.", "prerequisite": "STAT 401"}, {"department": "METEO", "number": "465", "credits": "3 Credits", "description": "A topical survey of physical, chemical, and dynamical processes at work in the stratosphere and mesosphere (middle atmosphere).", "prerequisite": "METEO421 , METEO431"}, {"department": "METEO", "number": "466", "credits": "3 Credits", "description": "A survey of planetary atmospheres and the chemical and physical processes by which they form and evolve.", "prerequisite": "MATH 141"}, {"department": "METEO", "number": "469", "credits": "3 Credits", "description": "Examination of global warming and climate change: the basic science, projects, impacts, and approaches to mitigation.  METEO 469 From Meteorology to Mitigation: Understanding Global Warming (3) Human-caused climate change represents one of the great environmental challenges of our time. As it is inextricably linked with issues of energy policy, a familiarity with the fundamentals of climate change is therefore critical for those looking to careers in the energy field. To appreciate the societal, environmental, and economic implications of policies governing greenhouse gas emissions, one must further understand the basic underlying science. METEO 469 serves to lay down the fundamental scientific principles behind climate change and global warming. A firm grounding in the science is then used as a launching point for exploring issues involving climate change impacts and mitigation. METEO 469 will introduce students to the basic information necessary for understanding Earth's climate, including the relevant atmospheric processes, and aspects of other key components of the climate system such as the cryosphere, hydrosphere, and biosphere. Students will learn how to do basic computations and to use theoretical models of the climate system of varying complexity to address questions regarding future climate change. Students, further, will explore the impacts of various alternative greenhouse gas emissions scenarios and investigate policies that would allow for appropriate stabilization of future greenhouse gas concentrations. The structure of the course roughly parallels the treatment of the subject matter by the reports of the Intergovernmental Panel on Climate Change (IPCC), focusing first on the basic science, then the future projections and their potential impacts, and finally issues involving adaptation, vulnerability, and mitigation. METEO 469 will combine digital video, audio, simulation models, virtual field trips to on-line data resources, text, and interactive quizzes that provide instantaneous feedback.", "prerequisite": "STAT 200"}, {"department": "METEO", "number": "470", "credits": "3 Credits", "description": "The fundamental principles that govern Earth's climate and their relevance to past and future climate change.  METEO 470 Climate Dynamics (3) Climate Dynamics delves into the fundamental processes that control the earth's climate of the past, present, and future. Fundamentals are developed from concepts of basic dynamic meteorology, radiative transfer, and thermodynamics. Basic atmospheric radioactive transfer, the surface energy and hydrologic budgets, and the atmospheric and oceanic circulation are covered. A survey of the earth's climate through geologic history is also covered, including extinction events and the impacts on climate. The concepts developed in this course are applied to the topic of anthropogenic climate change and how various aspects of the system could be influenced by global warming.", "prerequisite": "METEO300 , METEO421 , METEO431"}, {"department": "METEO", "number": "471W", "credits": "3 Credits", "description": "This upper-level undergraduate course will cover the fundamental physics of light and scattering of light by atmospheric particles. Knowledge of these processes will be applied to understand how they result in optical displays in the sky, including colors in the sky, phenomena associated with refraction of light, scattering by liquid drops and ice crystals, and electrification. The course will guide students to observe, document, and understand these beautiful and sometimes bizarre atmospheric optical phenomena. Students will make their own observations using their eyes, optical cameras, and polarization filters. The students will document their observations through regular written sky journal entries to hone their writing skills. By working together through hands-on activities and discussions, students will unlock the mysteries of these phenomena through applying the fundamental physical principles that underly all topics covered in the course. Throughout the semester, students will research a phenomenon of interest to them, culminating in a final paper on this topic. Students who have completed this course will understand the physical concepts associated with atmospheric optical phenomena and where/how to look for them, observe them, and document them.", "prerequisite": "METEO 411", "other": ["Writing Across the Curriculum"]}, {"department": "METEO", "number": "473", "credits": "3 Credits", "description": "Application of statistical and numerical methods to practical problems in meteorology.", "prerequisite": "CMPSC 101"}, {"department": "METEO", "number": "473H", "credits": "3 Credits", "description": "APPLICATION OF STATISTICAL AND NUMERICAL METHODS TO PRACTICAL PROBLEMS IN METEOROLOGY.", "other": ["Honors"]}, {"department": "METEO", "number": "474", "credits": "3 Credits", "description": "Distribution of scalars and vectors; sampling; regression and correlation in two and three dimensions; time series, statistical forecasting; forecast verification.  METEO 474 Computer Methods of Meteorological Analysis and Forecasting (3) Meteorology 474: Computer Methods of Meteorological Analysis and Forecasting explores the computationally intensive statistical methods used in the development of automated weather analysis and forecasting systems. The focus of the course is on learning to develop and use artificially intelligent automated systems to perform data quality control, quantitative analysis of large meteorological data sets, and weather forecasting. Coverage will include the relevant statistical, mathematical, and computational methods including matrix operations, data quality control, regression analysis, neural network construction, decision tree growth, and forecast system verification. Students will leave the course with an understanding of how to efficiently develop accurate and robust statistical weather analysis and prediction systems. Thus, the course serves as a professional elective for those students wishing to pursue careers in statistical weather forecasting, meteorological data analysis, and associated fields. Meteorology 474 uses a project oriented lecture/lab format to provide students with hands-on experience in developing and testing weather analysis and forecast systems. Students will both code their own forecast system development programs and use off-the-shelf software designed for rapid development and testing of forecast systems. To tackle these assignments, students will team up in pairs using the computer laboratory facilities of the Meteorology Department and meteorological data sets of current interest. A key element of the resulting project reports will be an investigation into the origin of the observed forecast system errors. One section of Meteorology 474 will be offered each year with a capacity of approximately 20 students. The class size is tailored to in-class training with the software tools and open discussion with the instructor and classmates. Grading will be based on the team assignments and on a mid-term and final examination.", "prerequisite": "STAT 401"}, {"department": "METEO", "number": "477", "credits": "3 Credits", "description": "The review of fundamental physical properties leads into discussions of various techniques, including imaging, spectroscopy, radiometry, and active sensing.", "prerequisite": "EE 330", "other": ["Cross-listed with: EE 477"]}, {"department": "METEO", "number": "480M", "credits": "3 Credits", "description": "Undergraduate Research  METEO 480M Undergraduate Research (3) The lecture portion of the course, which accounts for one-third of the course grade, covers topics such as the elements of good scientific writing, the structure of scientific manuscripts, the mechanics of oral and poster presentations at science meetings, scientific peer review, and ethics in science. For the remaining two-thirds of the course grade, students perform research under the guidance of a faculty member. Students select the faculty member based on matching general research interests. A student's academic adviser typically assists in the process of matching a student to a research project supervisor. In consultation with their research project supervisor, students then decide on a specific research topic.", "prerequisite": "junior or senior standing as a Meteorology Major", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "METEO", "number": "480W", "credits": "3 Credits", "description": "A research thesis will be prepared.  A written and oral presentation required.", "prerequisite": "junior or senior standing as a Meteorology Major", "other": ["Writing Across the Curriculum"]}, {"department": "METEO", "number": "481", "credits": "3 Credits", "description": "Multi-instructor weather communications survey including forecasting, science teaching and writing, television and radio broadcasting, climate studies, forensics, industrial applications.", "prerequisite": "METEO201 or METEO101"}, {"department": "METEO", "number": "482", "credits": "3 Credits", "description": "Multi-instructor workshop designed to mimic real-life applications of weather communications in industry, broadcasting, the courtroom, and the classroom.", "prerequisite": "METEO481"}, {"department": "METEO", "number": "483", "credits": "3 Credits", "description": "Individualized course designed for in-depth study of weather communications in industry, broadcasting, the courtroom and/or the classroom.", "prerequisite": "METEO411 , METEO482"}, {"department": "METEO", "number": "486", "credits": "1-2 Credits/Maximum of 3", "description": "An overview of the Pennsylvania State Climate Office and an introduction to various aspects of its operations.  METEO 486 Pennsylvania Climate Studies (1-2) Those interested in climate topics will become thoroughly acquainted with the important process of acquiring and assessing the quality of climate observations. Students will be introduced to the various observational networks and data formats. They will learn to manipulate large climate data fields using both flat and relational database management systems. Each student will contribute to the state climate web page and will conduct a research project during the second half of the semester. This course will be offered in fall and spring semesters.", "prerequisite": "METEO101 , or METEO200A and METEO200B , or METEO201"}, {"department": "METEO", "number": "491", "credits": "1 Credits", "description": "Geared towards rising juniors and seniors, this one-credit course will offer practical advice and ample opportunities for reflection about one's future career within Meteorology and Atmospheric Science. The course will help to develop you professionally for a career in the atmospheric sciences and help to put you in the best possible position for your next step after graduation, be it a job or graduate school. You will develop a better understanding of the range of diversities and commonalities in the atmospheric sciences, the value of improving presentation and writing skills, the importance of developing professional references and networks, and strategies for applying to graduate schools and searching for a job. There will be guest speakers, including alumni and university staff whose participation will enhance the value of the class.", "prerequisite": "5th Semester standing"}, {"department": "METEO", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "METEO", "number": "494H", "credits": "1-12 Credits/Maximum of 999", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "METEO", "number": "494M", "credits": "3 Credits", "description": "METEO 494M Thesis Research (3). In this course, students will write a professionally structured thesis that is grounded in a solid research foundation. In the process, students will learn the elements of excellent technical science writing and effective oral presentation. This course continues the thesis research topic developed in Meteo 494H. This capstone course integrates the key elements of any well-conceived research project: a) a thorough background literature search that identifies the current understanding of a question or topic; b) the articulation of a research hypothesis that is informed by the literature search; c) the design and implementation of a plan to test the hypothesis using theoretical, experimental, and/or computational approaches; and d) conclusions regarding the validity of the hypothesis based on the data obtained in the course of the research. The main characteristic of this course is the execution of the research plan articulated in METEO 494H, interpretation of the data generated by the research in the context of the original hypothesis, and the preparation of the thesis. Research is generally performed in collaboration with faculty and graduate research assistants, using equipment and facilities in the Meteorology and Atmospheric Science department or other departments involved in the research endeavor. Occasionally, the nature of the research may require the student to collaborate with researchers outside of Penn State, perhaps even spending some time in residence at other facilities. The course culminates in the preparation of a thesis detailing the relevance and findings of the research and, at the discretion of the thesis advisor, an oral presentation about the research findings. Close coordination with the thesis advisor is a key to success in METEO 494M. Ideally, a student should meet with the advisor regularly and drafts of parts of the thesis should be shared with the advisor for feedback. Assessment of the student's progress is via grading of all components of the thesis which include the literature review and background, the statement of the problem, the design of the experimental plan, the results and discussion, the conclusions, any recommendations for future work, the reference list, and any appendices and figures. The diligence of the student in performing the research in a professional and timely fashion will also be considered.", "prerequisite": "METEO 494H", "other": ["Honors", "Writing Across the Curriculum"]}, {"department": "METEO", "number": "495", "credits": "3 Credits/Maximum of 6"}, {"department": "METEO", "number": "495A", "credits": "3 Credits/Maximum of 6", "description": "METEO 495A Meteorology Communications Internship (3 per semester/,maximum of 6)A student participates for at least 100 hours in an internship with an agency or company that focuses on communication of weather forecasts or other meteorological information. This internship is normally completed after the junior year. Given the focus of this internship and the paper requirement to relate the internship experience to a 400-level meteorology course, students must have completed the required course on synoptic meteorology. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO411"}, {"department": "METEO", "number": "495B", "credits": "3 Credits/Maximum of 6", "description": "METEO 495B Meteorology Private Sector Internship (3 per semester/maximum of 6)A student participates for at least 100 hours in an internship with a private sector company that focuses on problems or applications that use meteorological information. This internship is normally completed after the junior year. Given the focus of this internship and the paper requirement to relate the internship experience to a 400-level meteorology course, students must have completed the required course on synoptic meteorology. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO411"}, {"department": "METEO", "number": "495C", "credits": "3 Credits/Maximum of 6", "description": "METEO 495C Meteorological Operations Internship (3 per semester/maximum of 6)   A student participates for at least 100 hours in an internship in an operational setting that focuses on the creation of time-sensitive meteorological products such as weather or climate forecasts. This internship is normally completed after the junior year. Given the focus of this internship and the paper requirement to relate the internship experience to a 400-level meteorology course, students must have completed the required course on synoptic meteorology. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "METEO411"}, {"department": "METEO", "number": "495D", "credits": "3 Credits/Maximum of 6", "description": "METEO 495D Meteorological International Internship (3 per semester/maximum of 6)A student participates for at least 100 hours in an internship in an international setting that focuses on applying meteorological knowledge. This internship is normally completed after the junior year. Given the focus of this internship and the paper requirement to relate the internship experience to 400-level meteorology coursework, students must have completed at least six credits of Meteorology courses. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "6 credits of 400-level Meteorology coursework"}, {"department": "METEO", "number": "495E", "credits": "3 Credits/Maximum of 6", "description": "METEO 495E Meteorological Off-Campus Research Internship (3 per semester/maximum of 6)A student participates for at least 100 hours in an internship whose focus is a research project requiring applications of meteorological knowledge. This internship is normally completed after the junior year. To provide sufficient background for performing atmospheric research successfully, students must have completed at least nine credits of 400-level Meteorology courses. After the internship has been completed, the student writes a paper based on the contract posted on the Department of Meteorology website. This paper normally is evaluated by the student's Meteorology Department academic advisor. The course grade depends on this evaluation combined with the assessment provided to the advisor by the student's internship supervisor.", "prerequisite": "9 credits of 400-level Meteorology coursework"}, {"department": "METEO", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "METEO", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "METEO", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]