[{"department": "MIS", "number": "103", "credits": "3 Credits", "description": "Introduction to current business uses of the microcomputer, including spreadsheets, database management, word processing, and decision-making models."}, {"department": "MIS", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "MIS", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "MIS", "number": "204", "credits": "3 Credits", "description": "Introduction to Management Information Systems provides an overview of the role of information systems in business process design, the current technologies used for obtaining, storing, securing, and communicating information in support of operations and decision-making within a business organization, as well as, the concepts and principles for developing and using popular spreadsheet and database tools. Applications focus on the development of quantitative problem-solving skills applied to specific examples of business problems and issues found in business disciplines, including accounting, finance, marketing, supply chain operations, and general management. Problem solving skills will be reinforced by assigning problem sets to students to do on their own.", "other": ["General Education: Quantification (GQ)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "MIS", "number": "204H", "credits": "3 Credits", "description": "Introduction to the use of information systems in business organizations.  MIS 204H Introduction to Management Information Systems Honors (3)This honors section of MIS 204, will provide enhanced, in depth learning for Schreyer Honor students. MIS 204 is an applications-oriented course that provides an overview of (1) the role of information systems in business process design, (2) the current technologies used for obtaining, storing, and communicating information in support of operations and decision-making within a business organizations, and (3) the concepts and principles for programming, developing, and using popular spreadsheet and database tools. Applications focus on important problems and issues found in business disciplines, including accounting, finance, marketing, supply chain operations, and general management. The responsibility to understand and recognize opportunities to use information systems belongs to all managers in an organization, not just the information technology managers. As future business managers in diverse functional areas, our students begin their journey to understand the foundations of information systems and how managers are using these systems to increase the competitiveness of their organizations. As an introductory course, students should be able to come into the class without any prior experience. However, even students with experience will hopefully learn something new. Students will develop a general understanding of how a business functions, understand how information and technology is used within a business and develop new student IT skill sets. In summary, we aim to provide an opportunity for all undergraduate business majors to use IT in their current or future jobs in such a way to ensure the success of their organization. In addition, the Schreyer Honor students will also be exposed to business data mining, a highly intelligent application of information technology in a variety of business contexts that often lead to core competitive advantages.", "other": ["Honors"]}, {"department": "MIS", "number": "250", "credits": "3 Credits", "description": "Introduction to Problem Solving with Spreadsheet Analysis and Information Systems Management introduces students to the use of information technologies for business problem solving and decision-making. This course explores the application of spreadsheet engineering concepts and principles of data management, business modeling, and reporting to business problems. Students demonstrate their understanding and mastery of these concepts through their application in examinations, practical lab exercises and assignments. Concepts are contextualized in a broader discussion of information systems management including: data security, ethical issues, social media, distributed (cloud) services, and emerging trends. The structure of this course intends to provide a well-rounded level of competency in the use of spreadsheet software as a tool while exploring problem decomposition and solution planning and construction. Therefore, the focus of the course is on developing problem-solving strategies while gaining insight on the tactical use of spreadsheets."}, {"department": "MIS", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "MIS", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "MIS", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "MIS", "number": "301", "credits": "3 Credits", "description": "MIS 301 investigates use of databases, basic data mining tools, social networking software, and advanced level of spreadsheet management for analysis of large amounts of data. Learning methods emphasize active learning in the application of methods and tools to real data and the presentation of the results. Topics may include methods for analyzing not only structured data, but also unstructured data from the web, emails, blogs, social networks, click streams, etc. Finally, techniques for visualizing, presenting and communicating information in a useful way will be presented.", "prerequisite": "SCM 200"}, {"department": "MIS", "number": "307", "credits": "3 Credits/Maximum of 3", "description": "Using state-of-art programming language; concepts, program structure and design, documentation, file handling, and elementary data structures are introduced. MIS 307, Algorithmic Concepts , is a required course for information systems majors in the business program. The objective of the course is to present students with the principles of object oriented design and programming using a state-of-the-art programming language such as C++ or Java. Concepts include algorithm development, programming structure, documentation, UML modeling, file management, and elementary data structures such as arrays. This course requires the students to demonstrate their mastery of object oriented design and programming through a series of individual programming assignments. In addition, students are assigned a team project to foster problem solving, communication, and team skills required in the Information Technology work force. MIS 307 will be offered once per semester with multiple sections based on student enrollment and demand.", "prerequisite": "CMPSC 101"}, {"department": "MIS", "number": "315", "credits": "3 Credits", "description": "Students will learn how to program with Python, which is an interpreted, object-oriented, high-level programming language with dynamic semantics. Students will demonstrate how to easily use this for small, large, online and offline projects.Students will utilize Python for web development, simple scripting and data analysis. Students will describe how Python supports modules and packages, which encourages program modularity and code reuse. Students will develop a project with Python's interactive mode combined with the PyPI (Python Package Index). Students will become proficient with Python, which is the leading language of choice for many data scientists."}, {"department": "MIS", "number": "336", "credits": "3 Credits", "description": "Theory and utilization of database management systems in organizations, including data modeling and applications development.", "prerequisite": "MIS 204"}, {"department": "MIS", "number": "344", "credits": "3 Credits", "description": "MIS 344 is an introductory course designed to provide students the concepts of cybersecurity along with a deeper understanding of current information and the need for system protection. This course builds a foundation for understanding the critical issues associated with protecting information assets. It will invlude a hands-on practice that involves protecting work with passwords and applying multiple security through research, application and certification in the field.", "prerequisite": "MIS 204"}, {"department": "MIS", "number": "345", "credits": "3 Credits", "description": "An introduction to data analytics including data preparation, data visualization, dimension reduction, modeling techniques, and applications in different domain areas.", "prerequisite": "SCM 200"}, {"department": "MIS", "number": "387", "credits": "3 Credits", "description": "Applied, hands-on, interdisciplinary website design/administration course. Acquired concepts, techniques and tools are exercised in individual and team projects.  MIS 387 Website Design and Administration (3)This course is designed to teach students how to design, create, deploy, and administer websites. The students will have the opportunity to obtain a solid understanding of some of the tools and techniques, beyond basic HTML, used to publish on the Internet via the World Wide Web. Additionally, the students will learn how to present themselves professionally on the web to a specific target audience. The students' experiences will not be limited to the design and implementation of a website, but will include the opportunity to work within a team, to understand the benefits of working with client organizations to develop a website, and a web implementation plan.", "prerequisite": "MIS 204"}, {"department": "MIS", "number": "390", "credits": "3 Credits", "description": "Specification, design and implementation of information systems directed at aiding decision making in organizations.  MIS 390 Information System Management and Applications (3) INFSY 390, Information Systems Management & Applications, is a required course for Information Systems and Business students. The course covers topics and concepts in Management Information Systems (MIS) and information technology management. Upon successful completion of this course, students will have a broad knowledge of contemporary issues and applications of MIS in business.In addition to exams, students use hands-on case studies and popular information technology applications in the class room. Students in the course also learn how to develop modern computer-based information systems through a business application project that helps them understand the role of MIS in business organizations.Topics covered in the course include information systems in the enterprise, e-business and e-commerce, telecommunications and networking, database management, knowledge management, decision support systems, business value of information systems, and social and ethical issues of information systems.The course prerequisites are IST 110 or MIS 204 & MIS103 or CMPSC203.INFSY 390 will be offered once per semester with multiple sections based on student enrollment and demand.", "prerequisite": "MIS 204"}, {"department": "MIS", "number": "391", "credits": "3 Credits", "description": "Introduction to the fundamental Principles of Electronic Commerce (E-Commerce) technologies, applications, and management of E-Commerce in modern organizations.  MIS 391 Principles of E-Commerce (3) INFSY 391 provides an introduction to the fundamental concepts of e-commerce and serves as a foundation for business undergraduate students to understand e-commerce application and management in modern organizations. The course is designed to appeal to all business undergraduate students. Upon successful completion of this course, the student will have an understanding of the various types of e-commerce utilization and management in organizations throughout the world.INFSY 391 is an elective in the Business program. INFSY 390, Information Systems Management & Applications, is a required course for Information Systems and Business students and is a prerequisite for INFSY 391. In INFSY 391, Business students will continue to explore the inter-relationship between information technology and organizational functions and management.In addition to examinations, students will be assigned to project- and team-based assignments where students will actively examine e-commerce applications as well as management cases and the impact of e-commerce on the modern organization. Student performance will be evaluated using both examinations and team project assignments.INFSY 391 will be offered once per semester with multiple sections based on student enrollment and demand.", "prerequisite": "MIS 390"}, {"department": "MIS", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "MIS", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "MIS", "number": "404", "credits": "3 Credits", "description": "A problem-based, interdisciplinary course on Enterprise Resource Planning (ERP) concepts and business processes.  MIS 404 Introduction to ERP and Business Processes (3)Enterprise Resource Planning (ERP) a group of integrated software modules used to run virtually all business processes in an organization. The course explains and demonstrates how business processes such as sales logistics, production/material management, procurement, and human resources are supported in an ERP software package.", "prerequisite": "MIS 204"}, {"department": "MIS", "number": "405", "credits": "3 Credits", "description": "Strategic design and implementation of Oracle supply chain management information systems in an ERP environment.  MIS 405 Supply Chain Information Systems with Oracle (3) This course involves extensive discussion and study in the design and understanding of supply chain information systems. The vast majority of business data is generated through the use of supply chain information systems. Successful program mangers and business analysts must understand how the data is generated, and how this strategic data is used to integrate various business functions. This course will focus on the implementation and management of supply chain information systems, and will include topics in the following areas: * Inventory Management * Purchasing and Materials Management * Bills of Material and Engineering * Master Scheduling and Material Requirements Planning.This course will include a special focus on Oracle eBusiness suite applications and numerous hands-on exercises that will ensure participants understand implementation strategies, supply chain information system processes, and data analysis.", "prerequisite": "SCM 301"}, {"department": "MIS", "number": "406", "credits": "3 Credits", "description": "A technology-based exploration of the various Oracle Order Management and Customer Relationship Management tools.  MIS 406 Customer Information Systems with Oracle (3) This course provides a detailed explanation of customer relationship and order management within the organizational supply chain. The course demonstrates how Order Management process flows, application functionality, and organizational requirements are utilized to manage and control sales order fulfillment. Additionally the course will demonstrate how Oracle's integrated Customer Relationship Management (CRM) solution provides information-driven sales, service, and marketing support to the organization. Extensive use of state-of-the-art Oracle business software technology is employed.", "prerequisite": "MIS 405"}, {"department": "MIS", "number": "407", "credits": "3 Credits", "description": "This is a technology course focusing on software development in an Oracle eBusiness ERP Environment.  MIS 407 Enterprise Integration with Oracle (3) The Oracle Enterprise Integration course will cover the primary functionality of core business application modules and the flow of data through the major database tables. Students will perform SQL queries of critical Oracle ERP tables. Students will develop PL SQL program units which are the foundation of Oracle business modules. The open interfaces for Oracle Inventory and Oracle Purchasing will be demonstrated via programming sessions.", "prerequisite": "MIS 336"}, {"department": "MIS", "number": "413", "credits": "3 Credits", "description": "The study of interface design emphasizing application and user requirements, development and testing techniques, and information processing issues.  MIS 413MIS 413 Interface Design for Information Systems Applications (3)In order to design an information system, the designer must undertake a thorough task analysis to determine the proper functionality of the system. The designer must give attention to system reliability, security, standardization, portability, integration, and many other issues. While these issues are important, they do not directly address the needs of the system's users. The system's interface is the vehicle with which users interact with the system. It is, in essence, the system from the users' standpoint. A poorly-designed interface will deter people from using the system, while a well-designed interface will encourage system usage.", "prerequisite": "MIS 307"}, {"department": "MIS", "number": "415", "credits": "3 Credits", "description": "Students gain experience and in-depth analysis of social media management, digital marketing, SEO/M, and analytics of current digital business practices.  MIS 415 Social Media Management and Analytics (3) With the rise of social media as a management, marketing and analytics tool, students need to learn how to use these tools to communicate better with customers as well as analyze important data that can help marketers solve digital marketing challenges. In this course, students will learn about the changing nature of digital business practices and will be able to gain experience with social media management, digital marketing, SEO, SEM, and analytics. In-depth analysis will be given on current practices and this course will build a framework from which students can pioneer their own ideas in the growing field of digital marketing. They will also be able to understand current issues in digital marketing and have the tools they need to assess those issues and further strengthen their understanding of this important, emerging field."}, {"department": "MIS", "number": "417", "credits": "3 Credits", "description": "Students will learn how to interpret data with popular data science programming. Students will study inferential statistics to generate information about data. Students will mine data and understand the necessity of data cleansing. Students will generate predictions (ensemble modeling) and understand the need for distributive computing to handle big data (Hadoop).", "prerequisite": "MIS 315"}, {"department": "MIS", "number": "420", "credits": "3 Credits", "description": "This course introduces students to concepts, approaches, and design principles used to identify, model, assess, and improve business processes.  MIS 420 Business Process Management (3) The course builds the foundation for process analysis by focusing on key aspects of business processes, including collaboration, information flow, people, roles and business rules. The main objective is to provide an introduction to various techniques and tools of process analysis and workflow management including process mapping techniques and simulation. The course will utilize cases and examples to strengthen the student's understanding of business processes. At the end of the term students are expected to have the competency required to model and analyze current processes and develop coherent and well thought out improvement plans for redesigning organizational processes."}, {"department": "MIS", "number": "430", "credits": "3 Credits", "description": "Information analysis and the logical specification of the system.", "prerequisite": "MIS 336"}, {"department": "MIS", "number": "431", "credits": "3 Credits", "description": "Management of data including large, complex sets to support business analytics, strategy, and operations.  MIS 431 Business Data Management (3) Business Data Management will enable students to use various database designs to acquire the information needed to make effective business decisions. Successful students will be able to design, create and implement a relational database in MySQL and be able to write SQL statements to obtain information from a database. In addition, students will investigate the next generation approaches for storing, manipulating, and managing web data in unstructured formats. Students will gain an understanding of the advantages and disadvantages among XML, NoSQL, NewSQL, and Relational databases. After completing this course, students should have the knowledge, skills, and abilities to be able to: * have an understanding of SQL by retrieving data from a database using SQL * design a database system including an ER Model, and implement the design in an enterprise database application such as MySQL * have an understanding of NoSQL databases such as MongoDB and Graph databases, XML native databases, NewSQL databases and the advantages and disadvantages of these databases", "prerequisite": "MIS 301"}, {"department": "MIS", "number": "432", "credits": "3 Credits", "description": "The analysis of business information systems and the requirements specifications of redesigned systems.  MIS 432 Business Information System Analysis (3) Business Information Systems Analysis introduces concepts underlying computer based information systems development. The course focuses on object-oriented concepts, project management and principles of systems development using standard UML diagram methodologies. The course develops a solid understanding of information systems development through the analysis of current information systems and the requirement specifications of a redesigned system, and also provides significant hands on experience using current technologies.After completing this course, the student should have the knowledge, skills, and abilities to be able to: -define and document an existing information system; -analyze an existing information system and specify the requirements for a replacement system; -use a specific Computer-Aided Software Engineering (CASE) tool to assist in Systems Analysis; -understand alternative approaches to systems development; -understand the purpose, context and commonly expected \"deliverables\" of systems analysis and -create a substantial project and prepare a professional report. The evaluation of students will be based on tests, lab work, and homework. This is a prescribed course for the M I S major and a support-of-major course for Smeal students M I S 432 will be offered in the fall and spring semesters in sections ranging from 25 to 40 students."}, {"department": "MIS", "number": "433", "credits": "3 Credits", "description": "This course provides students with a real world, hands on introduction to the current industry of Rapid Application Development (RAD) tools and techniques. RAD includes prototyping and end-user development in order to quickly create information system applications. Mendix is one of the platforms that enables employees to work in smaller cross functional-teams and deliver software at a high rate of speed, and encompasses all the tools and environments needed to build and manage applications and their development. It includes project management, modelers, UI development, public app store online support and a strong collaboration approach using the online community.", "prerequisite": "MIS 204"}, {"department": "MIS", "number": "435", "credits": "4 Credits", "description": "MIS 435 Systems Design and Implementation (3)Current systems development methods involve a use-case based, and iterative and incremental approach. This is the approach generally used on object-oriented systems development projects and is the approach taught in this course. Design aspects of the course will emphasize design patterns and their application to systems design using the standard software design notation-The Unified Modeling Language. An Agile (light-weight) approach to systems design will be emphasized. Implementation aspects of the course will focus on object-oriented programming using a modern object-oriented programming language.", "prerequisite": "MIS 430"}, {"department": "MIS", "number": "441", "credits": "3 Credits", "description": "Application of Information Technology based methods and tools to analyze business data and support decision making.  MIS 441 Business Intelligence for Decision Making (3) Business intelligence encompasses the IT tools for exploring, analyzing, integrating, and reporting business data for fact-based, intelligent decision making. This course primarily investigates methods and tools for exploring and analyzing large amounts of business data also called \"Big Data.\" Learning methods emphasize active learning in the application of methods and tools to real data and the presentation of the results. Students will be exposed to a variety of methods for analyzing both structured and unstructured data and they will work with business data sets to understand the value that can be extracted from large data sets. They will also learn how to classify and associate data to discover business rules that can be used to support decision making. The course will also cover methods to analyze social media information and about tools that can facilitate such analysis and discovery. Again they will get a chance to work with data from real social networks to gain an appreciation of how value can be obtained from such networks. Finally, they will learn about techniques for visualizing, presenting and communicating information in a useful way, e.g. through dashboards and with other technologies on various platforms.", "prerequisite": "MIS 431"}, {"department": "MIS", "number": "445", "credits": "4 Credits", "description": "Develops insights and skills related to Business Intelligence, Data Warehousing, Data Mining, Analytics, OLAP, and report generators.  MIS 445 Management Reporting Systems (4) This course develops insights and skills required to analyze management reporting systems, propose improvements, create reports, extract and package data using various software tools, and design data warehouses. It prepares students for the position of a Business Intelligence Specialist who can apply insight and technical competence to the challenges of leveraging Reporting, OLAP, Data Mining, Business Intelligence (BI), and Data Warehouse technologies.", "prerequisite": "MIS 336"}, {"department": "MIS", "number": "446", "credits": "3 Credits", "description": "Strategic use and management of information technology in digital global economy.  MIS 446 Information Technology and Business Strategy (3) This course introduces the basics on the interplay between information technology and business strategies. The course starts with the general topic of strategic use of information technology in business (as enabler, differentiator, and disruptor) using examples from a variety of industries, followed by detailed coverage of the information technology strategy in individual industries including e-logistics, e-tailing, e-marketing, e-finance. The course also covers basics on the business information technology infrastructure and environments (Internet, Web, service-oriented computing, and security and risks). Towards the end, the course discusses the role of information technology in the global economy, business value of the explosively growing digital social networks, and other emerging trends and new technology opportunities. Topics include:  - Information technology strategy. IT-business strategy alignment; IT as enabler, differentiator, and disruptor.- Internet and Web infrastructure; extranet, intranet, hosting strategies; platform independence; eBusiness technology standards; open versus proprietary technologies; interoperability.- Web Services for implementing business applications; software as a service; Services science and services oriented architectures.- Overview of E-Business models, B2B, B2C, (x2y).- E-logistics and supply chain: Analysis of Dell model; Internet auctions, eBay; e-hubs; i-mode, GPS, RFID.- E-tailing: Amazon, eBay, Walmart, recommendation systems, reputation systems.- E-marketing: search engine advertising (Google AdWords/AdSense, Yahoo Search Marketing); database marketing (precision targeting).- E-finance: online brokerage (Schwab, E*Trade), wealth management (e-strategy, technology for churn prediction and customer acquisition/retention), payment technologies (paypal), computational trading strategies.- Collaboration/Community technologies:  Blogs, MySpace, Facebook, YouTube, Voice over IP, videoconferencing, RSS, etc.; Impact on business communication and media industry. - Need for security in ecommerce - threats and solutions.- Globalization and IT. Offshoring and outsourcing.- Emerging trends and technology opportunities.", "prerequisite": "MIS 301"}, {"department": "MIS", "number": "447", "credits": "3 Credits", "description": "This course focuses on fundamental principles and applications of data warehousing. Topics covered include data warehouse planning, design, and implementation.  MIS 447 Data Warehousing (3) This course focuses on fundamental principles and applications of data warehousing. Issues related to data warehouse planning, design, and implementation are also covered in this course. Through case studies in various business domains, course exercises and projects, students will learn practical dimensional modeling techniques, extract/transformation/load (ETL) logic, ETL design considerations, and report generation. Essentially, students will learn how to align multiple sources of data through data warehousing architectures for deriving valuable business insights through subsequent business intelligence operations. The course begins by reviewing basic database modeling principles, and then introduces dimensional modeling in the context of the various data warehousing architectures (e.g., Kimball, Corporate Information Factory, hybrid architectures). Key concepts related to data warehousing including dimensional table characteristics, fact table characteristics and granularity, types of dimensions, types of fact tables, dimension attribute hierarchies, consolidated fact tables, slowly changing dimension techniques, and multivalued dimensions and weighting factors are covered in the course. Also, key advanced database management techniques such as views, procedures, and triggers will be introduced. Building on these core concepts, the course also covers related concepts including the role of online analytical processing (OLAP) and packaged analytic solutions, enterprise data warehouse business architecture and matrix, data warehousing lifecycle, ETL subsystems and tasks, ETL system planning, ETL design and development process and tasks, and data modeling best practices for big data. Case studies from various business domains and processes are included throughout the course. Examples of these domains include retail sales, order management, procurement, accounting, healthcare, insurance, transportation, and telecommunication. The case studies are used to illustrate the concepts as well as provide a context for hands-on exercises. Through course assignments and group projects, students have an opportunity to gain hands-on experience with data warehouse design, development, and prototype implementation.", "prerequisite": "MIS 336"}, {"department": "MIS", "number": "448", "credits": "3 Credits", "description": "Introduces telecommunication concepts, its evolution, and present applications in business. Discusses the software and hardware components of telecommunication networks.", "prerequisite": "MIS 390"}, {"department": "MIS", "number": "450", "credits": "3 Credits", "description": "A project in the design, specification, and programming of a system in an application area.  MIS 450 System Design Project (3)MIS 450, Systems Design Project, is a required course for information systems majors in the business program. MIS 450 is the capstone course. The primary objective of this course is for students to develop Information Systems (IS) solutions to real-life problems by following the entire systems development lifecycle (SDLC). The course allows students to demonstrate their mastery of the SDLC methodologies and analytical skills. Students develop a team project to foster problem solving, communication, and team skills. Individual assessment is evaluated through demonstration of the understanding of IS skills (i.e. application development, oral presentations, and written communication). Individuals are required to prepare professional written documents (i.e. definition document, the solution proposal, and the design document). Then students develop a solution prototype matching the criteria outlined in their requirement documents.", "prerequisite": "MIS 307"}, {"department": "MIS", "number": "461", "credits": "3 Credits", "description": "Fundamentals of Web development for e-business and related project management.  MIS 461 Web Technologies (3) The objectives of this course are to enable students to fully understand the purpose, structure, and components of technologies utilized for e-business applications; to gain substantial hands-on experience, creating applications for e-business; understand how XML and other technologies are revolutionizing the Web and what it will do for complex real-world applications; to make students aware of research issues that apply to Web development; and to strengthen collaborative skills related to project development and management.", "prerequisite": "MIS 307"}, {"department": "MIS", "number": "465", "credits": "3 Credits", "description": "Provides a comparison of techniques, methodology of systems, limitations, and applications of various data base management systems. MIS 465 Database Management (3), is a required course for information systems majors in the business program. The objective of the course is to present database design and development, specifically relational database management systems (RDBMS), along with project work on developing database systems. The course coverage includes conceptual data modeling, relational data model, structured query language (SQL), data normalization, database integrity, and database administration. Advanced topics such as distributed databases and data warehousing are also discussed briefly. The course prerequisite is IST 140 or CMPSC 101 or CMPSC 121 and MIS 390. This course is centered on a group project involving the design and development of a relational DBMS. Student groups also work on case and homework problems related to database design. A suitable relational database package, like ORACLE, is used by students in the group project. Database design and development involving the creation of tables, queries, forms, and reports are the center piece of the group project. MIS 465 will be offered once per semester with multiple sections based on student enrollment and demand.", "prerequisite": "IST 140"}, {"department": "MIS", "number": "466", "credits": "3 Credits", "description": "Advanced programming for WEB-based applications.  MIS 466 Business Programming for the Web (3) The objective of this course is to teach students how to create and maintain business applications on the WEB. Students will learn how to use tags, scripting, and a low-level programming language to support business applications.Students will be encouraged to use the afore mentioned tools to provide useful and well-designed content to the WEB community. The course assumes knowledge of an object-oriented programming language and some introduction to HTML. A state-of-the-art programming language will be used to facilitate learning for project development. Team skills and problem solving, as an important part of the development process, will be emphasized and integrated into project development activities. To be successful in such a work environment, students need to learn how to work together to design, implement and test projects. Electronic commerce, employee training and development, accounting, and finance applications are typical of application areas that will be emphasized.Specific goals of the course are to: 1) expose students to concepts and principles necessary to provide well-designed and useful content on the WEB 2) teach students how to apply programming in a WEB-based environment 3) show students how these techniques increase productivity of complex systems, and 4) further student development of team skills when programming complex systemsINFSY 435 is an elective in the Information Systems program. INFSY 307 or the equivalent, required of all Information System majors.Student performance will be evaluated by means of assignments, examinations, and team-based projects.It is expected that this changed course will be offered two times during each academic year.", "prerequisite": "MIS 307"}, {"department": "MIS", "number": "479W", "credits": "3 Credits", "description": "Management and implementation of enterprise information systems for business integration and supply chain management.  MIS 479W Enterprise Information Systems (3) This course examines enterprise-wide information systems architecture for the business setting and examines current commercial systems, with a special focus on SAP R/3 development tools and techniques. Topics include: - The acquisition, installation and operation of Enterprise Information Systems (EIS), formerly referred to as Enterprise Resource Management (ERP) systems- The strategic decisions regarding approaches business organizations select for the acquisition and integration of EIS components and how executive level support for such endeavors is obtained- The overall management and coordination techniques used in the design, development and implementation of an organization's EIS, including the role that software vendors and other third party's play in the acquisition and implementation of enterprise systems.- The coordination and control of multi-party relationships. Specific analysis and design techniques are taught, including tools and methodologies for analyzing business processes in preparation for implementation of EIS, as well as database and data warehousing requirements.- The methods of determining data communication network requirements- The practical implementation concerns are addressed, such as preparing internal organizational units for migration to a new EIS architecture and to the maintenance and operation of EIS including concerns involving security and control.- The managerial and technical issues involved in the developing and testing of applications and user interfaces and customization of commercial packages.- The career planning issues and ways of obtaining training for specialization and advancement in careers involving EIS. This course is writing intensive. As such, student evaluations will consist of, at a minimum: examinations, position papers, case studies (written and oral), and assignments. Both individual and group assignments will be used. The objective is to enhance writing ability relevant to students preparing for careers in business. Group report writing, brief technical writing, technical documentation, end-user documentation, and memo writing will be covered. The major group writing assignments will be required throughout the semester, as well as individual assignments that will be prepared in preparation for the group. Peer assessments and instructor feedback and evaluation will be provided on a regular basis. This is a prescribed course for the MIS major.", "prerequisite": "MIS 432", "other": ["Writing Across the Curriculum"]}, {"department": "MIS", "number": "481", "credits": "3 Credits", "description": "Advances in computational technologies, coupled with the massive amounts of data available through business activities as well as the surrounding ecosystems, have created an amazing potential for managers to leverage analytics in order to gain organizational and competitive advantages. This course takes a two-fold approach to address Analytics Methodologies. The first section of the course provides a broad understanding of business analytics and the second section demonstrates the managerial best practices for leveraging the analytics. The course covers concepts such as analytics problem framing, data understanding & preparation, as well as descriptive & predictive modeling. The course incorporates applications and real-world datasets from marketing and other business disciplines for a hands-on learning experience. Best practices derived from cases are also incorporated into the course structure in order to learn the strategies required to implement and manage analytics initiatives in businesses. Students are initially introduced to business analytics through a series of examples, use cases, and applications. Next, descriptive analytics through the use of dashboard and business reporting techniques is presented as a means for business performance management. Following this, the overall predictive analytics process is explained with emphasis on framing the analytics problem from an understanding business context. Additionally, fundamental predictive modeling concepts are covered concurrently with the introduction of exemplary modeling techniques. Students then receive an opportunity to apply these techniques through the use of different problem scenarios and real-world datasets. Related topics including overfitting, and visualizing model performance are covered as well. Students are presented an expected value framework to assist approaching business problems with a decision-analytic perspective. The course also covers managerial aspects of integrating business analytics within the enterprise by linking business strategy to business analytics initiatives. Approaches to initiate, manage, and sustain analytics initiatives to gain a competitive advantage are discussed with cases. At the end of the course, students are expected to have the competencies required to analyze possible opportunities for leveraging analytics across the boundaries of functional business domains as well as applying key analytic techniques and interpreting results for decision-making.", "prerequisite": "MIS 345"}, {"department": "MIS", "number": "489", "credits": "3 Credits", "description": "Covers new trends and concepts in information/processing technology and their applications and impact on computer information systems.  MIS 489 Seminar in Information Systems (3) INFSY 489, Seminar in Information Systems , is an elective course for information systems majors in the business program. Information Systems is a rapidly changing discipline and students must be aware of these changes. This course covers new trends and concepts in information/processing technology and their applications and impact on computer information systems. In this course, students are introduced to new methods, tools, applications and terminology. The students develop key skills in the ability to assess new technologies, and the ability to incorporate these technologies into complex information systems.Students learn how to work with business applications in the latest prevalent technology. They work both individually and in groups on problems related to the topic addressed in the seminar. Topics for the seminar can differ with each offering of the course. This course is designed to provide the flexibility to coverage current issues and trend in the Information Technology world. Such topics could be (but not limited to) : advanced networking, mobile computing, wireless infrastructure, security, ERP, SAP, and others. The course prerequisites are INFSY 307 & INFSY 445INFSY 489 will be offered once per semester based on student enrollment and demand. The topics will vary upon it offering.", "prerequisite": "MIS 307"}, {"department": "MIS", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "MIS", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "MIS", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships.  Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Full-Time Equivalent Course"]}, {"department": "MIS", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "MIS", "number": "496A", "credits": "1-6 Credits"}, {"department": "MIS", "number": "496B", "credits": "1-6 Credits"}, {"department": "MIS", "number": "496C", "credits": "1-6 Credits"}, {"department": "MIS", "number": "496D", "credits": "1-6 Credits"}, {"department": "MIS", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "MIS", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]