[{"department": "MNG", "number": "223", "credits": "2 Credits", "description": "Surveying theory and practice applied to mineral lands and mines, traversing, leveling, mapping, underground surveying, microcomputer drafting and graphics.  MNG 223 Mineral Land and Mine Surveying (2) The objective of this course is to introduce students to mine surveying principles, techniques, and products. Topics covered include a brief history of surveying; a brief review of trigonometry and related math needed in applications; review and application of AutoCAD needed for completing assignments; review of coordinate systems in the U.S.; discussion of types of measurements, units, and conversions that will be done; methods for doing the different types of measurements; introduction of surveying equipment and how to operate them; and use of GPS, laser scanning, 3-D imaging and photogrammetric systems. Laboratory assignments emphasize learning by doing, where students perform basic surveying functions by performing field surveying on campus and at a nearby mine, and then perform necessary calculations and plotting. Students will learn about various measurement methods and devices, error calculations, performing field surveying for topographic mapping, construction control, and volume/area measurement in surface and underground environment.", "prerequisite": "2nd semester standing; 1/2 unit of secondary school trigonometry"}, {"department": "MNG", "number": "230", "credits": "3 Credits", "description": "Examination, development, and exploitation of mineral deposits; mining methods; unit operations; mining equipment; fundamentals of explosives."}, {"department": "MNG", "number": "302", "credits": "3 Credits", "description": "The infrastructure of mines includes power systems, communication and tracking systems, and monitoring systems. Larger surface and underground mines often have power systems of similar size and complexity to a large town, but with additional engineering challenges created by the need to move the power system as mining advances, the confined spaces of underground mines, and the possible presence of combustible ores or explosive gases. Specialized communication systems are required in many underground mines because radio waves propagate poorly in these spaces. Personnel tracking systems are sometimes used to provide location information for all miners. Mine-wide monitoring systems are becoming increasingly common to improve personnel safety and equipment maintainability. In total, these mine electrical systems are a vital component of modern mines. Mining engineers take the lead role in the design and specification of these systems, just as they would for the materials handling, ventilation, and other ancillary systems of the mine. The goal of this course is to develop the necessary knowledge and engineering skills so that this work can be performed in a competent and safe manner. Circuit laws and network theorems are reviewed and the analysis of circuits is presented. The use of phasors and impedance diagrams, and the concepts of complex power and the power triangle are introduced. Models for two and three-winding transformers are presented, and the fundamental electromechanical concepts for motors and generators are given. The analysis of balanced three-phase is studied. Next, the basic concepts of power system protection are addressed. Grounding, ground bed design, and related topics are presented. Shock, fire, and explosion hazards are an everyday concern in mines, and the basic approaches for mitigating these hazards are covered. Distribution and utilization system arrangements, and the typical equipment for providing power within mines, are studied. Case studies from surface and underground mines are used to illustrate the concepts. The role of load flow and fault analyses in the design and operation of mine power systems is explained, and these concepts are applied using software tools. The application fundamentals of communications, tracking, and monitoring systems are presented, along with their operational advantages and limitations. The course culminates in a final project in which the mine electrical systems for a specific mine are designed.", "prerequisite": "PHYS 212"}, {"department": "MNG", "number": "331", "credits": "3 Credits", "description": "Ground stresses, laboratory rock properties, laboratory and field instrumentation, rock mass characteristics, subsidence, slope stability, design of mine workings.  MNG 331 Rock Mechanics (3) This course was designed to introduce the student to the subject of rock mechanics. It includes an introduction to experimental stress analysis, the physical properties of rock, underground stresses, laboratory and field instrumentation, model studies, rock mass properties, and the discussion of a number of rock mechanics field applications associated with mining, petroleum and civil engineering, and geoscience. A technical paper written on some field related to the laboratory and/or theoretical aspect of rock mechanics is required. A series of eight laboratory sessions are included. These give the students hands-on experience relative to the concepts and instrumentation problems discussed in lectures.", "prerequisite": "E MCH210"}, {"department": "MNG", "number": "401", "credits": "1 Credits", "description": "The mining industry consists of various stages of prospecting, exploration, beneficiation, development, and processing of naturally occurred solid minerals. These minerals include both metals (copper, iron, zinc, etc.) and nonmetals (coal, potash, limestone etc.), and all of these minerals are closely related to our daily life. For example, the coal still accounts for more than 50% of the electrical energy production. Both surface and underground mining has a long history globally. Modern techniques and large equipment have been applied in mining industry to increase the production effectiveness and create a healthy and safety environment in mining industry. This course offers an introduction to mining operations and related issues. The course will start with the role of minerals and mining in our daily lives and modern society. How should we classify and recognize different types of minerals beneath the earth? The course examines various stages of mining including prospecting, exploration, development, exploitation, and reclamation. From a mining engineer perspective, how to design a mining system form the beginning to the end. Common unit operations in mining, mining equipment, and some of the auxiliary processes are covered. Surface mining methods and surface mine development will be presented, as well the underground mining methods and the development of underground mines. The objective of this course is to introduce students to mining operations through study of basic concepts and equipment that facilitate the extraction of mineral resources. This includes learning about the stages of a mining project and life cycle of a mine, understanding the concepts of ore grades and reserves, mine development, mining methods, and unit operations that are essential to the operation of a mine. Through this course, students should build up the basic structure of mining industry, master the primary stages of developing a surface and underground mine, and enable to select a proper mining method based on the information of geology, deposit condition, mineral properties and so on. Equipment selection and capacity calculation at different mining stages is expected through learning in this course as well.", "prerequisite": "MATH 141"}, {"department": "MNG", "number": "404", "credits": "2 Credits/Maximum of 2", "description": "The objective of this course is to provide students with the basic principles and methodology involved in design of material handling systems used in the mining industry. The course will cover various types of material handling methods and equipment including continuous and cyclic loading and transportation systems. The course will review surface mining equipment including loaders, shovels, draglines, trucks, rail, dozers and scrapers. It will also discuss underground mining and various equipment such as loaders, rail, shuttle cars and coal haulers, panel conveyance and vertical transportation including hoisting and vertical conveyor. The design approaches will be discussed including the calculation of cycles, capacity of the system and equipment selection."}, {"department": "MNG", "number": "410", "credits": "3 Credits", "description": "Underground mine design; extraction techniques; description of auxiliary operations as they relate to the mining methods.  MNG 410 Underground Mining (3) The purpose of this course is to describe the logic and discuss the steps taken in the planning and design of an underground mine. Since every underground mine incorporates a unique combination of technological, economic, legal, social, and environmental factors, the course will stress the auxiliary operations (ventilation, ground control, etc.) which must be accommodated, as well as the unit operations and equipment dealing with resource extraction.", "prerequisite": "MNG  404 , MNG  422 , MNG  331"}, {"department": "MNG", "number": "410H", "credits": "2 Credits", "description": "Underground coal-mine design; extraction techniques; description of the various auxiliary operations as they relate to the mining methods.", "other": ["Honors"]}, {"department": "MNG", "number": "411", "credits": "2 Credits", "description": "This course is aimed at applying operations research and systems methods for decision making in mine operations to improve productivity. The course is designed to introduce the student to the subject of applied operations research and systems methods for efficiently solving various problems in mine design and operations analysis. The major topics include linear programming, the simplex method, transportation problem, network models, critical path method, engineering statistics, regression analysis, simulation techniques. The course uses various mining production and optimization case studies to demonstrate the importance of operation research in the mining production management. The course also use introduce the concept of time study for the multi-process mining operation and use the statistical method for the data analysis.", "prerequisite": "MNG 230"}, {"department": "MNG", "number": "412", "credits": "3 Credits", "description": "Ore reserve estimation using statistics and geostatistics, mine cost estimation, engineering economy concepts applied to mineral deposits. Students are prepared for a comprehensive understanding of how a resource or reserve is assessed in the mining industry. The students learn the following topics: background of mineral exploration (requirements for exploration and data collection, as well as exploration tools and techniques), manual techniques for ore reserve evaluation, computer methods for geostatistics (inverse distance, kriging, and block modeling concepts), reporting (scoping, prefeasibility study, and feasibility study), the time value of money (present, annual, and future value; and rate or return), project evaluation (mutually exclusive and non-mutually exclusive projects), depreciation, depletion, amortization, after tax cash flow, discounted cash flow analysis, after tax investment decision, and uncertainty and risk analysis.", "prerequisite": "STAT 401"}, {"department": "MNG", "number": "422", "credits": "3 Credits", "description": "The objective of this course is to develop for students a thorough understanding and working knowledge of the health, safety, legal, economic, and reliability aspects of mine ventilation and air conditioning systems and their design and analysis. Strong emphasis is placed on engineering design of mine ventilation systems for underground mines. Mining Engineers working in underground mines must have the skills to design, implement, monitor and maintain the ventilation systems in place to ensure a comfortable working environment. The course provides you with the knowledge necessary to do so. This course also includes an overview of basics of thermodynamics. After completing this course, you will be able to decide on fan size, airway geometry, monitor ventilation performance, determine heat loads and design future ventilation plans. The following topics are covered in this course: (1) The Mechanics of Mine Ventilation: Introduction and history of the subject; airflow systems, forcing, exhausting and push-pull configuration; determination of air quantity requirements and measurement of airflow in mine openings; laws of airflow; airway and circuit resistance; ventilation economics; (2) Airflow Planning: Air quantity surveys; pressure surveys, gauge and tube, barometer techniques; ventilation network analysis, numerical methods; simulation programs; (3) Thermodynamics of Mine Ventilation: Basics of thermodynamics, steady-flow relationships; laws of thermodynamics; frictional flow, isothermal, isentropic and polytropic processes; thermodynamics cycles in mine circuits, downcast and upcast shafts, workings, natural ventilation and natural/fan ventilation combined.", "prerequisite": "CE 360"}, {"department": "MNG", "number": "441", "credits": "3 Credits", "description": "Design of surface mining for non-coal and coal minerals, emphasis on open pit, quarry and strip mining planning parameters: unit operations, systems, haul roads, draglines, spoil stability, reclamation, legal requirements, and health and safety. The objective of this course is to provide students with the basic principles and methodology involved in surface mining and design. The topics covered in this course include: 1- surface mining methods, 2- mine design and planning including slope stability, road design and construction, stripping ratio calculations, pit limits, production planning, 3- surface mining operations including overburden removal, drilling and blasting, loading and hauling operation, 4- mine reclamation, environmental consideration, legal requirements, health and safety. The students learn how to utilize software packages for mine design and planning.", "prerequisite": "MNG 230"}, {"department": "MNG", "number": "451W", "credits": "1-5 Credits/Maximum of 5", "description": "Independent and integrative design and report of specific mine evaluation, layout, equipment selection, environmental control, permitting, and financial analysis.", "prerequisite": "MNG 331", "other": ["Writing Across the Curriculum"]}, {"department": "MNG", "number": "494H", "credits": "1-6 Credits/Maximum of 6", "description": "Independent research under the supervision of the Mining Engineering program.", "prerequisite": "prior approval of program", "other": ["Honors"]}, {"department": "MNG", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "MNG", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given on a topical or special interest subject which may be offered infrequently; several different topics may be taught in one year or term."}]