[{"department": "MNGT", "number": "100", "credits": "1 Credits", "description": "Introduction to the underground mining industry including history, terminology, current mining equipment and methods, regulations, organization.  MNG T 100 Mining Technology Orientation (1) 'Mining Technology Orientation' is a first semester introduction to the underground mining industry from past to present. The student will be introduced to basic mining systems and their evolution over the last century. Mining terminology and its unique application will be discussed. The impact of mining regulations will be reviewed. Possible career paths and the organization of mining companies will be included in this orientation. Visits producing coal mines will be required. Students who successfully complete this course will be able to: a. Discuss changes in mining methods over the years. b. Demonstrate knowledge of terminology used in mining industry. c. Explain how state and federal regulations impact mine operation. d. List several career options in mining, and the skills required by each."}, {"department": "MNGT", "number": "110", "credits": "3 Credits", "description": "Introduction to mine organization and management structure, and government regulations regarding permitting, reporting and recordkeeping.  MNG T 110 Mining Administration and Law (3) 'Mining Administration and Law' is a second semester course that provides a framework for the student to understand the mine organization and management structure and organization. It will also introduce the student to the state and federal regulations regarding permitting, and reporting, and record keeping. This course provides a background for and is a prerequisite for MNG T 216. Students who successfully complete this course will be able to: a. Explain the basic organization of a mining operation from the general superintendent to the laborer. b. Know and understand the basic concepts of a safety program. c. Use and apply accident analysis statistics to further improve a safety program. d. Discuss the development of rules and regulations with focus on those that impact the first line supervisor. e. Understand the process for promulgating new rules and regulations. f. Demonstrate basic management techniques that a first line supervisor will use in performance of his/her job."}, {"department": "MNGT", "number": "202", "credits": "3 Credits/Maximum of 3", "description": "Introduction to mine ventilation systems at mine face, mine gases and use of gas detection equipment, state and federal regulations.  MNG T 202 Mining Ventilation (3) 'Mining Ventilation' is an introduction course in mine ventilation systems, equipment and mine gases for students in the productions emphasis only. The course will emphasize ventilation systems used in mining sections at the mine faces. Gas detection devices will be demonstrated and students will become proficient in their uses. The requirements of both state and federal regulations will be discussed and reviewed. General complete mine ventilation will be discussed. CHEM 011 provides a background in combustion and gas reactions, while PHYS 150 provides a background on the static and dynamic forces of moving air. This course requires MNG T 030 as a prerequisite to ensure that students have a basic understanding of background mining methods and equipment. Students who successfully complete this course will be able to: a. Explain role of ventilation in the mining environment. b. Explain and understand section ventilation and long-wall ventilation systems. c. Demonstrate proper use of instruments to measure air pressure, flow rate and air quality, and interpret measured results. d. Describe and interpret federal and state regulations related to mine ventilation. e. Understand ventilation mapping and explain how flow is affected by various mining methods. f. Explain ventilation flow through a mine complex. g. Know all of the mine gases.", "prerequisite": "CHEM 101"}, {"department": "MNGT", "number": "204", "credits": "3 Credits", "description": "Electrical, transportation, ventilation, and other systems required to operate  underground coal mine, and to transport and process coal.", "prerequisite": "PHYS 150"}, {"department": "MNGT", "number": "205W", "credits": "3 Credits", "description": "Comparison of mining methods with focus on preventative maintenance, coal transport, and estimating production and manpower needs.  MNG T 205W Mining Systems Technology (3) Review of the impact of various methods of room & pillar and longwall mining on the mining operation, the systems required to transport coal from the mine, and the needs for preventative maintenance for each. Quantitative methods for evaluating the production capabilities and manpower requirements of each will also be explored.", "prerequisite": "MNG T030", "other": ["Writing Across the Curriculum"]}, {"department": "MNGT", "number": "207", "credits": "3 Credits", "description": "Application of electric power and safety issues related to the installation and maintenance of circuits and various power control devices.  MNG T 207 Electric Mine Machine Circuits (3) 'Electric Mine Machine Circuits' is a fourth semester course for students in the maintenance emphasis only and provides a basic foundation in the application of electric power and safety issues related to the installation and maintenance of circuits and various power control devices from the transformer to the mine face. MNG T 204 is a prerequisite to ensure students have a basic understanding of mine plant equipment. Students who successfully complete this course will be able to: a. Explain the application of AC and DC power in mining, their effect on motors, and the advantages and disadvantages of each. b. Use electrical equations to determine AC and DC power requirements, voltage, amperage, and power factor. c. Understand and use of electrical cables and battery power in the mining industry, the maintenance requirements of each, and the advantages and disadvantages of each. d. Read electrical wiring schematics and identify symbols. Be able to identify differences between schematic and actual wiring. e. Determine the maintenance and record keeping required for electrical face equipment to maintain permissible condition and regulatory compliance.", "prerequisite": "MNG T204"}, {"department": "MNGT", "number": "208", "credits": "3 Credits", "description": "Topics of high voltage curcuits, underground transmission, power stations, power conversion, safety regulations and power devices.  MNG T 208 Mine Power Distribution (3) 'Mine Power Distribution' is a fourth semester course for students in the maintenance emphasis only and provides a background into how to distribute and adequately protect the high voltage electricity supply throughout the mining environment to serve the underground transformer for distribution to the variety of electrical systems used. MNG T 204 is a prerequisite to ensure students have a basic understanding of mine plant equipment. Students who successfully complete this course will be able to: a. Explain state and federal safety requirements in relation to high-voltage mine power systems. b. Calculate total power requirements for given section of connected equipment, including recommended sectionalizing equipment and overload settings. c. Demonstrate knowledge of typical mine power distribution systems, identify the key components and how they function. d. Examine the requirements for splicing and terminating high-voltage mine power cables, and effects of improperly made repairs.", "prerequisite": "MNG T204"}, {"department": "MNGT", "number": "209", "credits": "2 Credits", "description": "Basic principles and applications of solid state, variable frequency, PLC, electro hydraulic and networked controls in mine machinery.  MNG T 209 Mine Machinery Control Methods (2) 'Mine Machinery Control Methods' is a third semester course for students in the Maintenance emphasis and provides information on the current methods used to operate and control the various driven functions of speed in rotating mining equipment. The interface between motors and computer controls, including the safety and automated interlocks will be covered. MNG T 030 is a required prerequisite to provide a technical functional understanding of the operation of the equipment being controlled. MATH 082 and PHYS 150 are required prerequisites to ensure that the students can perform the required performance calculations. Students who successfully complete this course will be able to: a. Investigate various types of networked controls, their function and capability, and list the advantages and disadvantages of each. b. Explain the applicable state and federal regulations related to low, medium, and high voltage systems. c. Troubleshoot various types of control circuits to identify faulty wiring, components, or software. d. Demonstrate ability to install software, set operating parameters, default values, and recommend adjustments to optimize system reliability. e. Investigate the ramification of automated systems in the underground environment, both positive and negative.", "prerequisite": "PHYS 150"}, {"department": "MNGT", "number": "210", "credits": "3 Credits", "description": "Operation and interaction of mechanized equipment used at the coal face including common electrical, hydraulic and mechanical systems.", "prerequisite": "PHYS 150"}, {"department": "MNGT", "number": "211", "credits": "3 Credits", "description": "Field and shop techniques in procedures of electrical, mechanical and ventilation phases of mine maintenance  MNG T 211 Practicum in Mining Technology (3) 'Practicum in Mining Technology' is a fourth semester course that provides students with the practical application of modern equipment and techniques used during the installation, relocation, and repair of complex mining equipment and systems as they are applied in the underground environment. MNG T 204 is a prerequisite to ensure students have a basic understanding of mine plant equipment. Students who successfully complete this course will be able to: a. Plan the installation of all equipment required to successfully install a complete continuous miner section. b. Plan the successful relocation of a modern long-wall mining section from a completed panel to a new panel. c. Demonstrate an ability to conduct or supervise the safe repair of low, medium, and high-voltage equipment in compliance with all regulatory requirements. d. Explain and demonstrate how to safely troubleshoot and/or repair high-pressure mine hydraulic systems. e. Discuss and demonstrate the steps required to conduct ox-acetylene and electric arc-welding repair of equipment in compliance with regulatory requirements. f. Practice the application and safe operation of manual lifting aides and devices used to facilitate the repair of large mining components.", "prerequisite": "MNG T204"}, {"department": "MNGT", "number": "213", "credits": "3 Credits", "description": "Introduce pillar-design parameters, roof control planning, roof bolting, standing supports, rib stability, floor condition problems, and longwall strata control.  MNGT 213 Strata Control Methods (3) Strata Control Methods is designed to introduce pillar-design parameters, roof control planning, roof bolting, standing supports, rib stability, floor condition problems, and longwall strata control in the Mining Environment. Pillar-design parameters, take into account the structural geology features related to mining. The impact of Geologic Data being extremely useful in assessing mining conditions and aiding in indicating necessary control measures to be taken with increased width, destructive stresses resulting in failure may be produced in the mine roof, bottom, and pillars causing serious limitations on pillar width. The effects of pillar design by incorporating Pillar Collapse through Failure Characteristics, Failure Mechanisms, and Failure Prevention, and the impact that may be contributed to Coal Bumps and Gas Outbursts. A review of the basic strata control theories and applications which incorporates Environmental Impacts of both Subsidence and Reclamation. Roof Control Planning reviews the strata control theories and applications by introducing the inter-related system of the mines roof, ribs and floor. The introduction of roof control theory and fundamentals with emphasis placed on ground control being a three part process of proper sizing of openings, proper sizing of pillars and selection of proper artificial supports. Also, within the element of roof control planning, MSHA requirements are introduced and incorporated. Roof Bolting and Standing Supports are brought to the forefront while maintaining an understanding of the three mechanisms of roof bolting which are: Beam Building, Suspension and Keying. Depending on conditions and applications, bolting may range from resin-anchored combination bolts, tensioned rebar, mechanically-anchored resin-assisted systems, cable bolts, and other specialty supplemental supports. The applications of standing supports are discussed in roof support planning as they are used either as remedial measures or throughout gate roads where bolting systems must be coupled with roof-to-floor supports.Rib Stability and Floor Condition Problems are addressed through rib stabilization methods and proper support installation along with floor condition problems, prevention and control. With the sources of Roof/Rib Hazards in Underground coal mines being associated with the two broad categories being Natural and Mining Related, Geologic hazards and high stresses associated with deep cover are addressed allowing for appropriate action to be identified and proper supports to be utilized. Longwall Strata Control theories and methods are discussed as they require special precautions to be taken in response to the elevated stress levels encountered. This is done through properly designed gate entry chain pillars to achieve roof/floor stability and mitigate bumps. Also, included are shields as roof support mechanisms and guarding installation on longwall equipment.", "prerequisite": "GEOSC020"}, {"department": "MNGT", "number": "214", "credits": "3 Credits", "description": "Leadership skill development for supervisors, managing change, tools to plan, organize, control, communicate and monitor effectively.  MNG T 214 Mining Management I (3) 'Mine Management I' will provide students with the introductory skills for individual, group and one-on-one leadership skills to keep up with evolving management roles and responsibilities. This course will explore how supervisors can maintain technical expertise while demonstrating effective leadership. This process includes the tools supervisors use to plan, organize, control communicate and monitor effectively. This course serves as a prerequisite to MNG T 215. Students who successfully complete this course will be able to: a. Succeed in a rapidly changing environment b. Plan, organize, communicate and monitor c. Apply the most appropriate supervisory style to individuals and situations d. Apply appropriate motivational techniques e. Use delegation for effective employee performance and development, time management and motivation f. Create an action plan g. Develop interpersonal skills that help communicate, listen, and handle conflicts h. Analyze their own behavior style and recognize strengths and weaknesses i. Given a labor situation, describe a plan of action toward resolution j. Identify the characteristics of A & B personalities and explain how they might be managed differently k. Explain a given organizational chart and the focus and function at different management levels l. Given an emergency situation at a mining operation, recommend a hypothetical course of action to avoid loss of life and personal injury, and minimize impact on production capability and reserves"}, {"department": "MNGT", "number": "215", "credits": "3 Credits", "description": "Financial management, effective meeting management, critical thinking, project  management and cost and risk control.  MNG T 215 Mining Management II (3) 'Mine Management II' is a follow-up to Mine Management I (Mining Technology 214) for students in production emphasis only. The primary goals of the course are to further explore and develop management skills to be an effective leader in an ever-changing industry. This process includes financial management, effective meeting management, critical thinking, project management and cost and risk control. Students who successfully complete this course will be able to: a. Get a firm grasp of the financial side of the job. b. Understand the business dynamics of dollars and cents. c. Set and meet goals for your projects. d. Understand the principles of process management. e. Apply process management to process issues and customer satisfaction. f. Reduce the need for crisis supplies. g. Identify the actions/approaches you can take to avoid or mitigate risk. h. Build the trust and rapport necessary for effective coaching. i. Effectively conduct meetings. j. Interpret typical income and expense balance sheets. k. Produce preliminary cost estimate (+/- 10%) for given application. l. Demonstrate appropriate oral and written communication skills. m. Prepare hypothetical request for capital improvements required to maintain or improve productivity, complete with financial justification.", "prerequisite": "MNG T214"}, {"department": "MNGT", "number": "216", "credits": "3 Credits", "description": "State and federal mining regulations and application to underground coal mines. Relationship with company policies and consequences of non-compliance.  MNG T 216 'Mine Regulations and Laws' (3) 'Mine Regulations and Laws' is a fourth semester course that builds on the knowledge gained in the prerequisite, MNG T 110, by providing more advanced study into state and federal regulations and company policies regarding equipment and electrical inspection, personnel safety and egress, and measurement of related environmental conditions within the mine. This class includes discussions on the interaction of state and federal regulation and the conflicts created by applying each. The consequences of non-compliance are also discussed. Students who successfully complete this course will be able to: a. This course is designed to familiarize the student with the applicable underground coal mining regulations and how they are interpreted and enforced. b. For a specified situation, find and interpret appropriate sections of PA Bituminous Coal Mining Act. c. Develop and evaluate alternative solutions to a proposed regulatory issue. d. Conduct a discussion with a mining inspector, in regards to a violation and potential monetary penalty.", "prerequisite": "MNG T110"}]