[{"department": "MNPR", "number": "301", "credits": "3 Credits", "description": "Introduction to mineral process engineering. Sampling, sizing, comminution, physical and chemical processes, applications to industrial practice. Pollution control.", "prerequisite": "CHEM 110"}, {"department": "MNPR", "number": "401", "credits": "3 Credits", "description": "Unit operations for processing particulate materials: comminution, screening, classification, slurry pumping, thickening, filtration, etc.; application to mineral processing plant design.", "prerequisite": "MNPR 301"}, {"department": "MNPR", "number": "401H", "credits": "3 Credits", "description": "Unit operations for processing particulate materials: comminution, screening, classification, slurry pumping, thickening, filtration, etc.; application to mineral processing plant design.", "other": ["Honors"]}, {"department": "MNPR", "number": "413", "credits": "1 Credits", "description": "A laboratory study of the chemical and physical principles involved in practical mineral processing operations.", "prerequisite": "MNPR 301"}, {"department": "MNPR", "number": "426", "credits": "3 Credits", "description": "A study of the chemical and engineering principles pertinent to metal processing in aqueous systems:  hydrometallurgical extraction, plating, materials preparation.  MATSE (MN PR) 426 Aqueous Processing (3) This 3-credit course deals with the chemical and engineering principles underlying the aqueous processing of metals: metal extraction from primary and secondary sources, electroplating, and metal finishing, powder synthesis, energy storage and conversion, and treatment of recycling of metal-containing toxic wastes.1. Physico-Chemical Principles - Thermodynamic, chemical kinetic and transport factors which control hydrochemical processes (leaching; precipitation; adsorption; solvent extraction; ion exchange; electrowinning, electrorefining and electroplating; membrane processes; energy storage and conversion); graphical representation of homogeneous and solid/solution equilibria; chemical reagents.2. Engineering Principles - Reactor design and staged operations; ideal batch, continuous stirred-tank and plug-flow reactors; fluidized bed reactors; electrochemical reactors; multistage separation processes (solid-liquid, liquid-liquid, and gas-liquid systems).3. Process Synthesis - Design of metal separation (extraction, refining, waste treatment) materials synthesis, metal finishing, and energy storage/conversion processes and system-integration of unit operations, industrial practice. Emphasis on closing circuits to minimize or eliminate waste effluents.", "prerequisite": "EME 301", "other": ["Cross-listed with: MATSE 426"]}, {"department": "MNPR", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "MNPR", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]