[{"department": "MUSIC", "number": "4", "credits": "3 Credits", "description": "An introductory examination of music's role in Hollywood narrative film from the classic era (1930s and 1940s) to the present. MUSIC 4 Film Music (3) (GA)The course examines the role of music in narrative film, the premier art form of the twentieth and twenty-first centuries. The popularity, significance, and value of film art would not be what it is today if music had not become an integral--indeed, indispensable--part of motion pictures from the outset. Preliminary objectives will include basic musical information (the fundamental elements of music; the broad stylistic eras of western music and their associated characteristics; the culturally encoded language of tonal music and associated musical meaning) and the main techniques of narrative film. The main objectives of the course are: to identify and recognize the principles of nondiegetic music in narrative film; to identify and recognize the purpose and functions of music in narrative film; to recognize some of the historic eras/genres/trends in Hollywood film making; to identify and recognize selected films, directors and composers; to analyze and articulate the role of music in a given scene and in a given film; and to recognize underlying assumptions and values of the culture conveyed through the diegesis. These objectives will be met by addressing such questions as: What are the underlying principles of music in film? What are the functions of music/sound within a particular scene and how does it achieve those functions? What do we see of what we hear, and what do we hear of what we see--and why? What secrets does music tell? To what extent does music influence--even control-- our interpretation of a film? More broadly, to what extent do films reflect our culture, past and present--our interests, our values?", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "MUSIC", "number": "5", "credits": "3 Credits", "description": "MUSIC 5 is a course on listening, with emphasis on the relationship between musical style and historical context. Students will learn the basic skills of informed music-listening: how to hear and describe melody (phrase structure; motive; developmental strategies), harmony (the basic principles of the tonal system), rhythm (meter, tempo, and their application), timbre (including a full knowledge of the instrumental families [strings, winds, brass, percussion] and voice types), and texture (monophony, homophony, polyphony). Students will also become familiar with the eras of western musical history, and to consider relationships between musical style and non-musical developments (e.g. the intellectual environment of the Enlightenment and the Classical style in music). The course begins with an introduction to the elements of music. The goal of this section is to give all students, whether or not they have previous experience as performers, the basic skills necessary to approach any musical work as informed listeners. This activity takes four weeks. The remaining portion of the course is spent surveying the history of western music, with that history treated as a series of case studies: particular works are considered stylistically but also with regard to the historical circumstances of their production and consumption. From this activity students gain experience considering artworks in discipline-specific terms, even as they learn to relate particular artistic features to non-musical factors of culture and society. Two methods of evaluation are used. Examinations (the number determined by the instructor) test the students' mastery of the course material. Concert reports (again in a number determined by the instructor) give students the opportunity to apply that knowledge to the act of listening in an authentic performance setting. Ample time is provided in lectures for questions and discussion of the course material and of repertoire and issues suggested by the students.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "7", "credits": "3 Credits", "description": "Study of the origins and development of jazz as an art form. MUSIC 7 Evolution of Jazz (3) (GA;US)(BA) This course meets the Bachelor of Arts degree requirements. Evolution of Jazz is a course designed to examine the historical and sociological aspects of the American art form¿jazz. This general education course is for non-music majors. The material covered in this course begins with the precursors of jazz and then emphasizes the African American musical traditions and white American (initially European) influences that have shaped jazz as an American art form. This is followed by period studies of the various jazz styles: New Orleans Dixieland, Chicago Style, Swing, Bebop, Cool, Hard Bop, Modal Jazz, Free Jazz, Fusion Jazz, Neo-Bop, Latin Jazz, and the globalization of jazz. The various jazz styles are examined from musical, sociological, and economical perspectives. The major innovators and performers are identified and studied. As new styles are presented, a careful comparison to the previous style is done to help with classification. A major component of the course is listening. Early in the course listening skills are taught. Students learn how to recognize certain instruments, hear the various sections within a group, and identify forms. Evaluation methods may include quizzes, tests, open forums, discussion boards, a live jazz concert review, and a reflection paper. Students will receive GA credit for this course, as well as US designation. The course will not satisfy any requirements for the major or minor in music. For in-class sections of MUSIC 7, the course requires high-quality audio playback equipment, computer/projection, and keyboard/piano availability. For those sections of MUSIC 7 offered online, all pieces, excerpts, examples, videos, and texts will be made available to students online.", "other": ["Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "MUSIC", "number": "8", "credits": "3 Credits", "description": "Introduction to the elements of music: notation, scales, meter, rhythm, intervals; basic chord structure, cadences. MUSIC 8 Rudiments of Music (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Learning the rudiments of music can be compared to the learning of a language. Students must learn to hear melodic, harmonic, and rhythmic patterns (audiation) before they sing, play or write in notation. In this introductory class, students are introduced to melodic, harmonic and rhythmic patterns by imitating the instructor who establishes these patterns at the piano, or by singing or as in the case of rhythm by striking a drum head. Eventually students will take turns \"tossing\" these patterns to teach other. Basic skills of improvisation can also be taught at this level of audiation by having students expand upon the basic patterns. As a result of these creative and aesthetic experiences, students will be able to translate the audiation of patterns into musical notation - moving from the smallest unit of a rhythmic motive towards the creation of a coherent rhythmic phrase. Similarly, at the melodic level, the student will begin with intervallic patterns and move towards the creation of a coherent melodic phrase. Intervals are then combined vertically to form harmonies. At the next stage of learning, students will learn to identify and to write that which they are hearing in dictation.This course in \"musical literacy\" enables students: (1) to deepen their appreciation of music (2) to begin studying a musical instrument and (3) to enter the rigorous study of music theory required of music majors.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "8H", "credits": "3 Credits", "description": "Introduction to the elements of music: notation, scales, meter, rhythm, intervals; basic chord structure.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "Honors"]}, {"department": "MUSIC", "number": "9", "credits": "3 Credits", "description": "This course introduces students to the study of world music as a cultural phenomenon through an examination of the music of Asia, Africa, West Asia, the Americas, and European folk. The course begins with an introduction to methods of examining world music and reframes the study of music as a cultural phenomenon, comprised not only of the music itself but also behavior and conception. This approach helps students move beyond their preconceived understanding of music in order to open their ears and minds to a wide variety of music and cultural concepts, forming the basis for the case studies that follow. The remainder of the course focuses on cultural conceptions of music, examined through the lens of a selection of case studies, including, but not limited to, the music of the Celtic nations, the African continent, Central and West Asia, India, Indonesia, Japan, and the Native American culture groups. The music of these cultures is explored both as a product and reflection of culture and as an aesthetic art form. Through this approach, students not only develop a basic fluency in the characteristics of selected world musics but also gain a broader understanding of the general classifications and geographical divisions of world music and the ways in which music relates to and is a part of all world cultures. Assigned analyses and a final project provide students with the opportunity to explore particular types of world music not covered in the lessons in greater depth, examining both the music itself and the social context in which it is found. These analyses require students to think actively about contemporary musical developments around the world, including how they are affected by current socio-political events and cultural trends. World musics are best understood when students engage in the music and in discussions of the music and culture; thus there is also a class participation/discussion component for the purposes of evaluation. The course utilizes an interactive, multimedia online curriculum, including video-recorded performances, audio examples, and music notation files. The text and all musical examples are available to students online. The course is available for GA credit and also meets the definition of an International Cultures course. It does not satisfy any requirements for the major or minor in music.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "11", "credits": "3 Credits", "description": "This course examines selected works from twenty of the greatest composers of western art music, with emphasis on the baroque, classical and romantic eras. The curriculum combines aspects of two existing courses, Rudiments of Music (MUSIC 8) and Introduction to Western Music (MUSIC 5). Preliminary objectives will include basic musical information associated with tonality (the fundamental elements of music; the broad stylistic eras of western music and their associated characteristics). The main objectives of the course are: to explore techniques of tonal composition in detail, with an emphasis on conceptual understanding; to hear and recognize musical sounds and compositional devices within such comparative contexts as scales v. modes, diatonic v. chromatic, consonance v. dissonance, polyphony v. homophony; to hear and recognize fundamental harmonic relationships between tonic and dominant, as well as their importance in the formal design of tonal music; to enhance appreciation for classical music and to encourage attendance of live performances. While students will necessarily acquire knowledge of fundamental elements of music, they will not be required to learn to read or write notated music to the same extent that is required of students in MUSIC 8. And while students will necessarily acquire knowledge of western music history, they will not study as many composers nor as many pieces as is customary in MUSIC 5. Instead, students will be drawn closer to a smaller number of works, and closer to the performances and the performers. Specific compositional devices (e.g., suspension, sequence, textures, rhythms, harmonies) will be highlighted in detail. These objectives will be met by utilizing an interactive, multimedia online curriculum, including demonstration videos by the author, a virtual keyboard and music notation files (e.g., Sibelius). An essential component of the online curriculum will be the inclusion of selected video-recorded performances, along with commentary from the performers. Twelve members of our performance faculty have been video-recorded in studio performance, allowing students a close-up view of a substantial portion of the repertoire to be examined. The course will be available for GA credit. It will not satisfy any requirements for the major or minor in music. All musical pieces and excerpts will be made available to students online.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "11Z", "credits": "3 Credits", "description": "This course examines selected works from twenty of the greatest composers of western art music, with emphasis on the baroque, classical and romantic eras. The curriculum combines aspects of two existing courses, Rudiments of Music (MUSIC 8) and Introduction to Western Music (MUSIC 5), and includes curricular links to INART 50Z. Preliminary objectives will include basic musical information associated with tonality (the fundamental elements of music; the broad stylistic eras of western music and their associated characteristics). The main objectives of the course are: to explore techniques of tonal composition in detail, with an emphasis on conceptual understanding; to hear and recognize musical sounds and compositional devices within such comparative contexts as scales v. modes, diatonic v. chromatic, consonance v. dissonance, polyphony v. homophony; to hear and recognize fundamental harmonic relationships between tonic and dominant, as well as their importance in the formal design of tonal music; to enhance appreciation for classical music and to encourage attendance of live performances. Students will acquire knowledge of fundamental elements of music but not be required to learn to read or write notated music as fully as are students in MUSIC 8. Students will acquire knowledge of western music history, but they will not study as many composers nor as many pieces as is customary in MUSIC 5. Instead, students will be drawn closer to a smaller number of works, and closer to the performances and the performers. Specific compositional devices (e.g., suspension, sequence, textures, rhythms, harmonies) will be highlighted in detail. Curricular links to INART 50Z will introduce students to the arithmetic relationships between pitches, intervals, and the underlying natural phenomena upon which they are based. These objectives will be met by utilizing an interactive, multimedia online curriculum, including demonstration videos by the author, a virtual keyboard and music notation files (e.g., Sibelius). An essential component of the online curriculum will be the inclusion of selected video-recorded performances, along with commentary from the performers. Members of our performance faculty have been video-recorded in studio performance, allowing students a closeup view of a substantial portion of the repertoire to be examined. The course will be available for GA credit. It will not satisfy any requirements for the major or minor in music. All musical pieces and excerpts will be made available to students online. MUSIC 11Z and INART 50Z are linked courses.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "General Education - Integrative: Linked", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "40", "credits": "1 Credits", "description": "Introduction to the University, the School of Music, the music education degree program, and the music teaching profession.  MUSIC 040S First-Year Seminar in Music Education (1)(BA) This course meets the Bachelor of Arts degree requirements. This course is offered to music majors during their first semester who are intending to apply to the Teacher Certification Degree Program in Music Education. It provides prospective music teachers with an opportunity to:- learn about aspects of and opportunities available at the University in general. - learn about aspects of and opportunities available specifically at the PSU School of Music. - learn about the PSU music education curriculum and program. - gain a general understanding of the music teaching profession. - begin and develop a professional relationship with his/her advisor.", "other": ["Bachelor of Arts: Arts", "First-Year Seminar"]}, {"department": "MUSIC", "number": "50", "credits": "1 Credits", "description": "Introduction to the keyboard, notation, chord progressions, transposition, improvisation, and simple accompanying techniques for the non-music major. An additional fee is required for this course. MUSIC 050 Beginning Piano: Non-Music Major (1) (GA)(BA) This course meets the Bachelor of Arts degree requirements. MUSIC 050 is a course designed to provide the beginning non-music major student with strategies for developing some of the basic skills required for playing the piano. No knowledge of music or piano is assumed and there are no prerequisites for the course. The course emphasizes strategies for learning to read and interpret musical notation from two clefs and musically realize the notation in real time with a healthy physical approach to the keyboard. Practice of these strategies outside the class is expected and checked. Objectives include learning to accurately sight-play a single voice divided between the hands with some extensions and shifts beyond a five-finger position. Special facilities required to teach the course include a 17-keyboard Midi piano lab with visual displays for teacher demonstrations. The course is offered Fall and Spring semesters, often with multiple sections.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "51", "credits": "1 Credits", "description": "Music 51 is course designed to provide the intermediate non-music major student with strategies for developing some of the advanced skills required for playing the piano. Some knowledge of music or piano is assumed and Music 50 or a placement audition is a prerequisite for this course. The course emphasizes strategies for learning to read and interpret musical notation from two clefs and musically realize the notation in real time with a healthy physical approach to the keyboard. Practice of these strategies outside the class is expected and checked. Objectives include learning to accurately sight-play a multiple voice musical texture with many extensions and shifts beyond a five-finger position. Special facilities required to teach the course include a 17-keyboard midi piano lab with visual displays for teacher demonstrations. The course is offered every Fall and Spring semester.", "prerequisite": "MUSIC050 or placement audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "52", "credits": "1 Credits", "description": "Group study emphasizing development of rudimentary skills and their recreational use in a range of popular and art music.  MUSIC 052 Voice Class: Non-Music Major (1) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed to present and apply basic principles of singing. Students learn songs, and address topics such as posture, breathing, tone production, expressiveness, and vocal health. Objectives are proficiency of breath management, a resonant vocal timbre, and effective communication in song. Evaluation is based on accuracy of music learning, improvement in technique and expressiveness, possible writing or listening assignments, and possible written quizzes. The course is offered every spring semester. The maximum enrollment is fifteen.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "MUSIC", "number": "53", "credits": "1 Credits", "description": "Voice study in group and individual formats, consisting of in-class lessons and discussions, enhanced by individual applied instruction from advanced voice pedagogy students. MUSIC 53 Class Voice Practicum (1) (GA)(BA) This course meets the Bachelor of Arts degree requirements. MUSIC 53 is a voice class experience that affords the enrolled student instruction in a class setting and in individual lessons. The weekly class meetings feature demonstration lessons between the enrolled student and his or her teacher (an advanced voice pedagogy student from the voice pedagogy curriculum). These lessons give the course instructor the opportunity to monitor the progress of the enrolled students, supervise and evaluate the teaching of the advanced voice pedagogy students, and make suggestions for further growth. Enrolled students and advanced voice pedagogy students also have the opportunity to learn by observing the demonstration lessons of others in the class. Lesson evaluation forms are completed and turned in at the end of each meeting. Class concerts typically occur at mid-term and at the end of the semester. These performances give the enrolled students the opportunity to display their vocal and musical progress. Individual lessons that enrolled students may receive out-of-class with the advanced voice pedagogy students give them an occasion for concentrated work in a more relaxed atmosphere. It may be of interest that this is the only course offering individual voice instruction in the School of Music that does not carry an additional applied music fee. In addition to the vocal and musical advancement for students enrolled in MUSIC 53, this course also serves as a progressive training ground in teaching for advanced voice pedagogy students. They gain important teaching experience in a closely supervised forum.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "54", "credits": "1 Credits", "description": "Class instruction in guitar for non-music majors. MUSIC 54 Beginning Class Guitar: Non-Music Major (1) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This course provides opportunity to explore various styles of music while developing basic skills for playing guitar. Students will learn to play solo guitar, to perform basic accompaniment techniques, and to read music notation, tablature, and chord symbols. Meter, tonality, harmonic progressions, texture, and form as well as stylistic features of various strumming techniques comprise the core knowledge that is developed through the process of playing guitar. The course assumes no previous formal study of music. Assessments are performance-based with students demonstrating knowledge and skill acquired through individual playing tests scheduled throughout the semester.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "76", "credits": "1 Credits/Maximum of 8", "description": "Chamber orchestra rehearsal and performance.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "77", "credits": "1 Credits/Maximum of 8", "description": "Orchestra rehearsal and performance. MUSIC 77 Philharmonic Orchestra (1 per semester/maximum of 8 (GA)(BA) This course meets the Bachelor of Arts degree requirements. The Philharmonic Orchestra is an auditioned instrumental ensemble that rehearses two times per week to develop student instrumental and musicianship skills as well as to develop individual and ensemble musicality and expression. Repertoire includes the standard literature from the 19th and 20th centuries as well as new music written for symphony orchestra. The ensemble presents at least two on-campus performances per semester, and off-campus performances are scheduled each year. The goals of this course are to develop the instrumental performing skills, music reading abilities, and interpretive capabilities of the class members within a large symphonic orchestra context. Students will be assessed by the use of performance evaluation and assessment of participation and contribution to established goals of the ensemble. The course is for students who have advanced performance skills on standard orchestral string, wind, and percussion instruments. An audition is required.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "78", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of wind repertoire and concert band literature. MUSIC 78 Symphonic Wind Ensemble (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to develop the instrumental performance skills, music reading abilities, and interpretive capabilities of the class members within a wind ensemble (one player per part) concert band setting. The repertoire includes original concert band literature, transcriptions, and concert marches. The available literature covers a range of historical time periods from pre-Baroque to the present. Students are assessed by the use of performance evaluations, assessment of participation and contribution to established goals of the ensemble, and attendance at rehearsals and concerts. The course is designed for those students who have advanced performance skills on standard wind and percussion instruments. The Symphonic Wind Ensemble has performed at the Eastern Division Conference of the College Band Directors National Association, the Pennsylvania Music Educators Association In-Service Conference and the National Association for Music Educators Eastern Division Conference. It was also invited to open the 2005 Flicorno D¿Oro international band festival in Riva del Garda, Italy, the first American band to be so honored. The ensemble has concertized in some of the country's most prestigious performing venues, including Heinz Hall (Pittsburgh), the John F. Kennedy Center for the Performing Arts (Washington D.C.), the Kimmel Center (Philadelphia), The Music Center at Strathmore (North Bethesda, MD) and Lincoln Center (New York). An audition is required.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "79", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of appropriate music and choreography for athletic events. MUSIC 79 Pep Band (1 per semester/maximum of 8) (GA) This course develops the instrumental performance skills of class members within the pep band setting. Objectives are to combine high level musical and visual performance to create interesting and entertaining performances that are suitable for athletic/indoor venues. This course is open to students in all majors. Evaluation is based upon participation, the achievement of individual music, and contribution to the group performance goals. Class meetings occur in the rehearsal space and at various athletic buildings across campus.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "80", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of wind repertoire and concert band literature. MUSIC 80 Symphonic Band (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to develop the instrumental performance skills, music reading abilities, and interpretive capabilities of the class members within a full concert band setting. The repertoire includes original concert band literature, transcriptions, and concert marches. The available literature covers a range of historical time periods from pre-Baroque to contemporary music written by living composers. Students are assessed by the use of performance evaluations, assessment of participation and contribution to established goals of the ensemble, and attendance at rehearsal sand concerts. The course is designed for those students who have advanced performance skills on standard wind and percussion instruments. An audition is required.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "81", "credits": "1 Credits/Maximum of 4", "description": "Rehearsal and performance of appropriate music and maneuvers for football games and related events.  MUSIC 81 Marching Blue Band (1 per semester/maximum of 4) (GA)(BA) This course meets the Bachelor of Arts degree requirements. This course develops the instrumental performance skills and marching skills of class members within the marching band setting. Objectives are to combine high level musical and visual performance with uniform marching style to create interesting and entertaining maneuvers suitable for parades, football games, and other athletic/outdoor venues. This course is open to students in all majors. Evaluation is based upon participation, achievement of individual music and marching performance requirements, and contribution to group performance goals. An audition is required for participation.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "82", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of concert band literature. MUSIC 82 Concert Band (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of the course are to develop the instrumental performance skills, music reading abilities, and interpretive capabilities of the class members within a moderately advanced large concert band setting. The repertoire includes original concert band literature, transcriptions, and concert marches. The available literature covers a range of historical time periods from pre-Baroque to the present. Students are assessed by the use of performance evaluations, assessment of participation and contribution to established goals of the ensemble, and attendance at rehearsals and concerts. The course is designed for those students who have moderate performance skills on standard wind and percussion instruments. An audition is required.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "83", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of concert band literature. MUSIC 83 Campus Band (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of the course are to develop the instrumental performance skills, music reading abilities, and interpretive capabilities of the class members within a modestly advanced large concert band setting. The repertoire includes original concert band literature, transcriptions, and concert marches. The available literature covers a range of historical time periods from pre-Baroque to the present. Students are assessed by the use of performance evaluations, assessment of participation and contribution to established goals of the ensemble, and attendance at rehearsals and concerts. The course is designed for those students who have had only limited experience in instrumental music but who have had previous instruction on their instruments. No audition is required, although basic music literacy is.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "84", "credits": "1 Credits/Maximum of 8", "description": "Survey and performance of historic and contemporary big band styles. MUSIC 84 Jazz Ensemble (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. MUSIC 84, Jazz Ensemble may include as many as three sections at some campuses. For example, at a large campus there could be: Centre Dimensions (001), Inner Dimensions (002), and Outer Dimension (003). Each section of MUSIC 84 will consist of a performance groups of 16 to 20 members. Admission to the groups may be by audition. Students may be placed into sections by ability level. The course consists of the study and performance of big band jazz from the mid 1920s to the present. Important composers of the idiom are routinely represented as well as newer contributors. There is a focus on ensemble group sound as well as individual solo improvisation. Part of the learning process includes working on the fundamentals of jazz playing, rhythm, articulation, and harmony. Each learning segment, or unit, is concluded with public performance of the music studied and learned. At some campuses that may mean one performance at the end of the semester. In addition, at a campus with a School of Music, an ensemble such as Centre Dimensions may represent the School of Music at collegiate jazz festivals as an advanced enhancement of the learning experience. Members are expected to learn their individual parts, attend sectionals and rehearsals, and participate in the performances. Music 84 is offered each fall and spring semester at some campuses; at others, less frequently. Details will vary by campus.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "86", "credits": "1 Credits/Maximum of 8", "description": "Study and performance of percussion chamber music in various instrumental combinations, focusing on the classical and contemporary repertoire. MUSIC 86 Percussion Ensemble (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Percussion Ensemble involves the rehearsal and performance of works for various combinations of percussion instruments in a chamber music setting. It also involves the group study of the various percussion instruments and techniques as described by or demonstrated by the conductor of the ensemble (percussion faculty member). The objectives of the course are to teach the art of ensemble performing (i.e., performing music well in a collaborative sense rather than just individually), to augment the understanding of the role of percussion within the discipline of music, and to foster the skills of organization and cooperation through rehearsal and performance of music requiring (generally) three to twelve players. Due to the nature of this type of musical organization and given the wide variety and large number of instruments which may be involved at any given time, there is also an inherent study of logistics involved when setting up or moving the instruments from one venue to another. Students performing in Percussion Ensemble are generally also involved in performing in other larger heterogeneous instrumental performing groups such as the bands and orchestras. Skills learned in the Percussion Ensemble setting directly affect the ability of these students to contribute a highly developed sense of musical unity in the larger performing groups. They also learn specific skills which are necessary for successfully entry and acceptance into professional music performance circles. The course is offered each semester and the enrollment is generally between six and twelve performers.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "87", "credits": "1 Credits/Maximum of 8", "description": "Study and performance of music for keyboard percussion instruments.", "prerequisite": "Permission of Instructor", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "88", "credits": "1 Credits/Maximum of 8", "description": "Building skills needed for successful choral singing including vocal production, sight singing, ear training, and music fundamentals. MUSIC 88 Campus Choir (1) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to develop the vocal skills and sight-reading abilities of the class members within a choral context. The choral repertoire will include standard vocal and choral selections. Depending on the campus, students may be assessed by the use of periodic quizzes and vocal performance examinations. Audition requirements may vary depending on the campus.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "88H", "credits": "1 Credits/Maximum of 8", "description": "Building skills needed for successful choral singing including vocal production, sight singing, ear training, and music fundamentals.  MUSIC 088 Campus Choir (1) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to develop the vocal skills and sight-reading abilities of the class members within a choral context. The choral repertoire will include standard vocal and choral selections. Students will be assessed by the use of periodic quizzes and vocal performance examinations. The course is designed for those students who have an interest in choral singing but who have limited background. There is no audition necessary.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "Honors"]}, {"department": "MUSIC", "number": "89", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of choral repertoire appropriate to mixed-voice ensemble.  MUSIC 89 University Choir (1 per semester/maximum of 8) (GA)(BA) meets the Bachelor of Arts degree requirements. The choir participates in 1-2 campus performances per semester. Membership is determined by audition and is open to both undergraduate and graduate students. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "90", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of music composed for lower voices from the sixteenth to the twentieth centuries, including sacred and secular compositions. MUSIC 90 Glee Club (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The Glee Club is an auditioned ensemble of 50-65 tenor/bass voices singing music from medieval chant to commissioned twenty-first century choral works. The Glee Club performs on campus at least once per semester, tours yearly and has performed throughout Pennsylvania, the United States, Europe and New Zealand. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc. Grades are determined by a combination of vocal and musicianship assessments (both written and aural) and attendance at rehearsals and performances.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "91", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of choral repertoire for treble voices from the sixteenth to twentieth centuries, including sacred and secular compositions.  MUSIC 091 Oriana Singers (1.0 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Oriana Singers was founded in 1994 to serve the musical needs of highly talented undergraduate and graduate women. The 65-voice ensemble performs repertoire representing every musical period, genre and style in its two campus concerts per semester. The choir has been invited to perform at prestigious regional and national music conferences and has participated in tours within the state of Pennsylvania. Membership is determined by audition. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc. Grades are determined by a combination of vocal and musicianship assessments (both written and aural) and attendance at rehearsals and performances.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "92", "credits": "1 Credits/Maximum of 8", "description": "Select groups of singers performing choral chamber music. MUSIC 92 Chamber Music for Voices (3) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Chamber Music for Voices is a course which includes three small auditioned chamber choirs comprising of members of four large ensembles. The repertoire of these 9-16 member ensembles is selected from a wide range of choral literature. Membership in Section 1 is open to University Choir members. The goal of the ensembles is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, discovery of new means of artistic expression, and the specific skills necessary to sing in a small ensemble with only two or three singers per voice part. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc. Grades are determined by a combination of vocal and musicianship assessments (both written and aural) and attendance at rehearsals and performances.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "93", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of choral repertoire from the African/American tradition.  MUSIC 093 Essence of Joy (3) (GA;US;IL)(BA) This course meets the Bachelor of Arts degree requirements. Essence of Joy is a highly selective mixed choral ensemble that specializes in repertoire written by African-Americans. The repertoire of the 45-voiced ensemble includes all art, folk, and sacred genres within this large field of study, Essence of Joy has performed at numerous prestigious national and regional meetings of music educators and choral conductors. In addition, the choir tours extensively and has presented performances throughout Pennsylvania, the eastern region, the southern region, and eastern Europe. Membership is open to undergraduate and graduate students. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances of African-American choral music. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc. Grades are determined by a combination of vocal and musicianship assessments (both written and aural) and attendance at rehearsals and performances.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "United States Cultures (US)", "General Education: Arts (GA)"]}, {"department": "MUSIC", "number": "94", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of treble choral literature.  MUSIC 094 Women's Chorale (1.0 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Women's Chorale is the largest treble ensemble on the University Park campus. Membership is determined by audition and is open to both undergraduate and graduate students. The choir participates in two campus performances per semester. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc. Grades are determined by a combination of vocal and musicianship assessment (both written and aural) and attendance at rehearsals and performances.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "MUSIC", "number": "100", "credits": "1 Credits/Maximum of 10", "description": "Rehearsal and performance orchestral literature.  MUSIC 100 Campus Orchestra (1-10) (GA) (BA) This course meets the Bachelor of Arts degree requirements. The goals of this course are to develop the instrumental performing skills, music reading abilities, and interpretive capabilities of the class members within a large symphonic orchestra context. The repertoire includes the standard literature from the 18th through 21st centuries as well as new music written for symphony orchestra. Students will be assessed by the use of performance evaluation and assessment of participation and contribution to established goals of the ensemble. The course is for students who have performance skills on standard orchestral string, wind, and percussion instruments. An audition is required.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "MUSIC", "number": "101", "credits": "1 Credits", "description": "Student and faculty recitals, master classes, lectures by faculty and guests, and Common Hour attendance.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "103", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of choral repertoire appropriate to mixed-voice ensemble of approximately forty-five voices. MUSIC 103 Concert Choir (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Repertoire is selected from a wide range of choral literature from medieval chant to commissioned twenty-first century choral works. Membership is open to undergraduate and graduate students. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc. Grades are determined by a combination of vocal and musicianship assessments (both written and aural) and attendance at rehearsals and performances.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "104", "credits": "1 Credits/Maximum of 8", "description": "Rehearsal and performance of choral repertoire appropriate to mixed-voice ensemble of approximately twenty-four voices.  MUSIC 104 Chamber Singers (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Chamber Singers is a premier chamber choir at the University. The repertoire of the 14-voiced ensemble is selected from a wide range of choral literature from medieval chant to commissioned twenty-first century choral works. Membership is open to undergraduate and graduate students. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc, Grades are determined by a combination of vocal and musicianship assessments (both written and aural) and attendance at rehearsals and performances.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "MUSIC", "number": "106", "credits": "1 Credits/Maximum of 8", "description": "Ensemble for the performance and study of Baroque or early music on instruments of the era.  MUSIC 106 Early Music Ensemble (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. The Early Music Ensemble will meet for a single two-hour rehearsal each week. Extra rehearsals may be scheduled when circumstances warrant them, i.e., when visiting ensembles come to Penn State. Membership of the ensemble will remain essentially constant from one semester to the next. Vacancies arising when a student leaves or graduates will be filled as needed. It is integral to the ensemble's activities that faculty and students perform along side each other; thereby providing a unique learning opportunity for the students. A constant membership encourages performers' understanding of early music performance practice. The ensemble will give concerts on campus. Off-campus performances may be considered outreach opportunities and as valuable experiences for the students.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)"]}, {"department": "MUSIC", "number": "109", "credits": "3 Credits", "description": "The Beatles are the most significant musical group in the history of popular music. Their songs are derived from diverse sources, such as rhythm and blues, country and western, rockabilly, rock and roll, Motown, soul, folk rock, the British music hall, and the classical music traditions of Europe and India. MUSIC 109: The Music of the Beatles, an online course, will consider the music of the Fab Four by examining how John Lennon, Paul McCartney, and George Harrison developed as songwriters. Besides an exploration of the Beatles' music, including the artists and styles of music that influenced them, this online course will include a study of the socio-cultural contexts from which the Fab Four emerged and in which they thrived. Finally, the course will introduce students to the fundamentals of music, as well as ways to integrate that knowledge with the interpretation of song texts.", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "110", "credits": "1 Credits", "description": "Introduction to the keyboard, chord progressions, transposition, improvisation, and simple accompanying techniques.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "112", "credits": "0.5 Credits", "description": "Performance and teaching techniques for guitar.  MUSIC 112 Guitar Techniques I (.5)(BA) This course meets the Bachelor of Arts degree requirements. MUSIC 112 is offered for students who are tracking acceptance into the Teacher Education Degree Program in Music. The focus of the course is learning to play the guitar in order to accompany and learning techniques on how to teach the guitar in classroom settings. Topics include: beginning level guitar pedagogy, instrument care and maintenance, classroom structure and materials. The instructional format includes: performance, lecture, large and small group discussion, readings, and musical and teaching examples. Students complete several practical assignments, and present summations of small group discussions. Two practice performances and a final playing and written exam are given.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "113", "credits": "1 Credits", "description": "Group study emphasizing development of sound vocal and musicianship skills fundamental for music theatre. This class is designed for freshman BFA Musical Theatre majors and freshman BFA Acting majors and is the start of a year long exploration of vocal musical production for the stage. The purpose of this class is to lay introductory foundations in singing techniques and skills currently required for a career in the theatre. Students become familiar with the basic concepts of voice production, as well developing an understanding and awareness of vocal health issues. Additionally, students are exposed to a variety of musical theatre and classical sung repertory while they are encouraged to develop perceptive listening skills by interacting and responding to their peers in class and other performers. In MUSIC 113, students are encouraged and required to develop an appreciation of all genres of sung performance from classical to contemporary. Another important element of the course is helping students develop the necessary vocabulary to respond in writing to vocal performance. Toward that goal, attendance at vocal events scheduled around campus and the community is required. These vocal events will include performances by professionals in many genres. Faculty will provide students with lists of approved events. To help students develop their music performance vocabulary, students are required to respond to some vocal events with written critiques. Aesthetically, students are encouraged to appreciate and practice vocal performance in a variety of stage genres. On the practical side, students learn effective practice skills, music reading, and appreciation of all areas of vocal performance. Students are evaluated based on readings, short writing assignments, evaluations of a number of memorized song performances, and classroom attendance and participation.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "114", "credits": "1 Credits", "description": "Group study emphasizing development of sound vocal and musicianship skills fundamental for music theatre.", "prerequisite": "MUSIC113", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "115", "credits": "1 Credits", "description": "Class voice emphasizing the fundamentals of healthy singing technique.  For Music Majors only.  MUSIC 115 Beginning Voice Class (1) Intended for instrumental music education majors.  Introduces instrumental music education majors to the basic skills of singing in preparation for MUSIC 116.  Focus will be on intonation, tone production, breathing and posture, as well as rudimentary presentation and interpretation skills.  Enrollment dependent upon the results of the voice proficiency exam and the recommendation of the music education and voice area faculties. Strongly suggested for the first semester of the music education degree.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "116", "credits": "1 Credits/Maximum of 4", "description": "Class voice, emphasizing pedagogical experiences and techniques for public school music classrooms.  For Music Majors only.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "119", "credits": "2 Credits", "description": "Individual applied instruction and group activities; orientation, area recitals, and studio classes as required by instructor.", "other": ["Bachelor of Arts: Arts", "First-Year Seminar"]}, {"department": "MUSIC", "number": "120", "credits": "1 Credits", "description": "Remedial instruction in theory or musicianship or both."}, {"department": "MUSIC", "number": "121", "credits": "1 Credits", "description": "Elementary sight singing and dictation.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "122", "credits": "1 Credits", "description": "Continuation of Music 121.", "prerequisite": "MUSIC121;  Concurrent:  MUSIC132", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "127", "credits": "1 Credits", "description": "Course Content and Expectations: Introduction to Music Technology is a coursed designed for freshman or first-year students in the BA Music Technology, BFA Sound Design, or BM Music Composition degree programs at Penn State. This course will provide an introduction and overview to the use of technology in creative music making, live sound, and recording engineering. At the completion of this course, students will have a working fundamental knowledge of audio recording hardware and software, concepts in live sound reinforcement, MIDI sequencing, and an understanding of the various ways technology is used in creative music making. These skills will provide students with a foundation for success in future music technology courses. Course Goals and Objectives: Students will complete 13 weekly assignments and one final project. Weekly assignments are sequential and design to gradual build upon the students' knowledge and experience in the field of music technology. These include live sound, recording, mixing, editing, and MIDI sequencing. The final project will demonstrate the students' ability to combine these skills to create a short original composition/recording."}, {"department": "MUSIC", "number": "129S", "credits": "3 Credits", "description": "Individual applied instruction and group activities; orientation, area recitals, and studio classes as required by instructor.", "other": ["Bachelor of Arts: Arts", "First-Year Seminar"]}, {"department": "MUSIC", "number": "131", "credits": "2 Credits", "description": "Review of rudiments; introduction to the fundamental linear and vertical features of tonal music, integration of written and aural skills.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "131H", "credits": "2 Credits", "description": "Review of rudiments; introduction to the fundamental linear and vertical features of tonal music, integration of written and aural skills.", "other": ["Honors"]}, {"department": "MUSIC", "number": "132", "credits": "2 Credits", "description": "Continuation of Music 131.", "prerequisite": "MUSIC131;  Concurrent:  MUSIC122", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "151", "credits": "1 Credits", "description": "Introduction to basic performance techniques on brass instruments; teaching strategies and materials for use in a heterogeneous instrument setting.  MUSIC 151 Brass Techniques I (1)(BA) This course meets the Bachelor of Arts degree requirements. Introduction to basic brass instrument performance techniques taught in a heterogeneous (mixed group of brass instruments) class setting. The course will provide students with basic introduction to embouchure formation, tone production, and executive skills on two brass instruments. Instructor and student modeled teaching strategies and methods for use in elementary school mixed instrument classes will be demonstrated. Published heterogeneous method books will be investigated and procedures for applying research-based tonal and rhythmic development activities to beginning instrumental instruction will be applied.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "152", "credits": "1 Credits", "description": "Introduction to basic performance techniques on percussion instruments; teaching strategies and materials for use in a heterogeneous instrument setting.  MUSIC 152 Percussion Techniques I (1)(BA) This course meets the Bachelor of Arts degree requirements. Introduction to basic percussion instrument performance techniques. The course will provide students with a basic introduction to playing techniques for a variety of percussion instruments. Instructor and student modeled teaching strategies and methods for use in elementary and secondary school mixed instrument classes will be demonstrated. Published method books will be investigated.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "153", "credits": "1 Credits", "description": "Performance techniques on stringed instruments for music education majors.  MUSIC 153 String Techniques I (1)(BA) This course meets the Bachelor of Arts degree requirements. This course is required for students working toward entrance to the Bachelor of Music Education degree program. The purpose of the course is to allow students to develop proper performance techniques on two of the four orchestral bowed stringed instruments (violin, viola, cello, and double bass) at a sufficient level so that they can provide a desirable aural model for beginning and intermediate string students. Grades will be based on students' musical achievement on the instruments. There will be two performance assessments (one midterm and one final) for each instrument during the course. Required repertoire lists and evaluation tools will be provided prior to all assessments. Students must receive a passing grade for both instruments in order to receive an overall passing grade for the course.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "154", "credits": "1 Credits", "description": "Performance and teaching techniques for woodwind instruments.  MUSIC 154 Woodwind Techniques I (1)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed for students pursuing a degree in music education. Principles of teaching public school students to begin to play woodwind instruments will be covered and applied to the five woodwind instruments. Students will have the opportunity to perform on each instrument, and teach their peers using the principles of woodwind pedagogy and instrument-specific techniques. This course is part of a block of courses covering all band and orchestra instruments traditionally offered in public school music programs. Students can elect to take more courses with more in-depth instruction on each instrument in order to further prepare them to teach the instruments in the public schools. Students will be advised to take such courses if their career goals include teaching band and/or orchestra in the public schools.Students will observe teaching techniques for teaching instrument-specific pedagogy through being students themselves. They will keep a journal of observed teaching techniques and instrument resources for future reference as a teacher. They will perform playing tests on their instrument to demonstrate proficiency on the instrument, and engage in peer-teaching activities to demonstrate understanding of pedagogical techniques.Music education majors will take this course as part of a sequence of music education courses. This course is offered as one of the early music education courses, and serves as a model and introduction for the pedagogical techniques and concepts the students will master in future courses.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "162", "credits": "2 Credits", "description": "An introduction to the discipline of music history through the study of representative works. MUSIC 162 Introduction to Music History (2) This course introduces students to the discipline of music history, through study of the core repertoire from the common-practice era: the music of the High Baroque (especially Bach and Handel) through the end of the Classical period and the beginnings of Romanticism (Beethoven). The course objectives focus on acquisition of skills necessary for thinking historically about music. Students learn 1) to describe the main stylistic features of a work (melodic, harmonic, rhythmic, textural, timbral, formal); 2) to associate these features with particular composers and eras; 3) to compare and contrast works from the same period and from different periods; and 4) to relate stylistic features to historical context, social function, performance conditions, and listeners' experience. The course thus emphasizes agents--the people who created, performed, listened to, and paid for the music-in order to illuminate both the musical works and the historical and social factors that shaped those works' distinctive features."}, {"department": "MUSIC", "number": "170", "credits": "1 Credits", "description": "Instruction in secondary chord progressions, transposition, improvisation, accompanying techniques, simple score reading.", "prerequisite": "MUSIC050 , MUSIC110 or placement audition", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "173", "credits": "2 Credits", "description": "Individual composition instruction for freshman composition majors (Fall semester) and group activities.", "other": ["Bachelor of Arts: Arts", "First-Year Seminar"]}, {"department": "MUSIC", "number": "174", "credits": "2 Credits", "description": "Composition instruction for first-year composition majors.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "177", "credits": "1-3 Credits/Maximum of 9", "description": "ROARS (Research of the Arts, Recording, and Sound) lab is a place to do individualized work with students on their areas of focus in music technology and for music technology students as a whole to learn from one another, in a consistent way over time. The learning style will be mixed, resembling at times a masterclass, an engineering lab, an applied lesson, a mathematics lecture, a prototype demonstration, an ensemble performance, or a software tutorial.  Students will normally take ROARS lab for 1 credit, but in the event that transfer students need to do extra work to make up for class time, they can work with the instructor within or outside of class to accomplish this & have their work reflected in greater credit hours earned."}, {"department": "MUSIC", "number": "181", "credits": "2 Credits", "description": "A study of the fundamentals of jazz theory, harmonic functions, and their applications to jazz improvisation.", "prerequisite": "MUSIC132", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "182", "credits": "2 Credits", "description": "A study of advanced harmonic concepts and their application to jazz improvisation.", "prerequisite": "MUSIC181", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "189", "credits": "1 Credits/Maximum of 8", "description": "Preparation and performance of music for like-instrument ensembles such as Clarinet Ensemble, Saxophone Ensemble, Cello Choir, Horn Ensemble, etc. Development of rehearsal and ensemble skills, an increased awareness of musical styles, public performance(s) of works prepared, and the development of the interpersonal skills necessary for the players to operate as a unit. Time allocated to each of these topics will vary depending on the performance level, experience and needs of the ensemble.", "prerequisite": "Permission of program", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "190", "credits": "1 Credits/Maximum of 8", "description": "Preparation for performance of chamber music literature involving string instruments.  MUSIC 190 Chamber Music for Strings (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Chamber Music for Strings meets at least two hours per week - once with the instructor for coaching and at least once for an additional rehearsal without the instructor's presence. Course objectives include, but are not limited to, the development of rehearsal and ensemble skills, an increased awareness of musical styles, public performance(s) of works prepared, and the development of the interpersonal skills necessary for the players to operate as a unit. Chamber music is an integral part of instrumental musical training. It is an important partner with conducted ensembles in the performance preparation of musicians. Evaluation of student work is based on participation in rehearsals, the progress made by the ensemble, and the quality of the ensemble's performances. The course is offered during fall and spring semesters.", "prerequisite": "permission of instructor", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "191", "credits": "1 Credits/Maximum of 8", "description": "Preparation for performance of chamber music literature involving woodwind instruments. MUSIC 191 Chamber Music for Woodwinds (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Chamber Music for Woodwinds meets at east two hours per week - once with the instructor for coaching and at least once for an additional rehearsal without the instructor's presence. Course objectives include, but are not limited to, the development of rehearsal and ensemble skills, an increased awareness of musical styles, public performance(s) of works prepared, and the development of the interpersonal skills necessary for the players to operate as a unit. Chamber music is an integral part of instrumental musical training. It is an important partner with conducted ensembles in the performance preparation of musicians. Evaluation of student work is based on participation in rehearsals, the progress made by the ensemble, and the quality of the ensemble's performances. The course is offered during fall and spring semesters.", "prerequisite": "permission of instructor", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "192", "credits": "1 Credits/Maximum of 8", "description": "Preparation for performance of chamber music literature involving primarily brass instruments. MUSIC 192 Chamber Music for Brass (1 per semester/maximum of 8) (GA)(BA) This course meets the Bachelor of Arts degree requirements. Chamber Music for Brass meets at least two hours per week - once with the instructor for coaching and at least once for an additional rehearsal without the instructor's presence. Course objectives include, but are not limited to, the development of rehearsal and ensemble skills, an increased awareness of musical styles, public performance(s) of works prepared, and the development of the interpersonal skills necessary for the players to operate as a unit. Chamber music is an integral part of instrumental musical training. It is an important partner with conducted ensembles in the performance preparation of musicians. Evaluation of student work is based on participation in rehearsals, the progress made by the ensemble, and the quality of the ensemble's performances. The course is offered during fall and spring semesters.", "prerequisite": "permission of instructor", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "193", "credits": "1 Credits/Maximum of 8", "description": "Preparation for performance of advanced sonata literature for various individual instruments with keyboard.", "prerequisite": "permission of instructor", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "194", "credits": "1 Credits/Maximum of 8", "description": "Keyboard accompaniment of student soloists in the studio and in public performance under faculty supervision.", "prerequisite": "KEYBD 120", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "197", "credits": "1 Credits"}, {"department": "MUSIC", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "MUSIC", "number": "207N", "credits": "3 Credits", "description": "The history and evolution of jazz is a significant cultural manifestation of the African American experience. The music and its artists provide a lens through which to examine questions surrounding the African American experience and what it means to be Black in America, engaging with questions about identity, authenticity, freedom, activism, gender, and sexuality, as well as the role of music in African American life. Drawing upon curricular elements from MUSIC 7, Evolution of Jazz, and AFAM 100, Living While Black: Themes in African American Thought and Experience, this course traces the history of jazz through an examination of the lives and art of thirty great jazz artists, juxtaposed with an examination of seminal writings of twenty African American poets, playwrights, novelists, critics, activists, philosophers, and scholars. Preliminary objectives will include basic musical information associated with tonality and with jazz. The main objectives of the course are: to explore the antecedents of jazz and the social-historical contexts in which they developed; to explore the pioneering artistry of selected twentieth-century jazz musicians, tracing the evolution of jazz styles in the process; to delve into the lives of these jazz artists and the social-historical contexts in which they lived; to explore the writings of historically contemporary African Americans, which articulate many of the major issues that have shaped black life in America; to enhance appreciation for the art of jazz and for the musical and literary contributions of African Americans; to encourage reflection, empathy, and a greater understanding of the cultural-historical circumstances that have informed the lives and art of African Americans. The narrowing of scope allows for a more detailed examination of the selected jazz artists, their music, and their lives. Similarly, the selected writings will allow students to reflect on the relationships and connections between these writings and the artistry and life experiences of the selected jazz artists. These objectives will be met by utilizing an interactive, multimedia online curriculum, including demonstration videos, a virtual keyboard, music notation files (e.g., Sibelius), audio recordings, audio-video recordings, selected readings, open forums, and discussion boards. Evaluation methods will include quizzes, tests, open forums, discussion boards, and reflection papers. Students will receive GA and GS credit for this course, as well as US designation. The course will not satisfy any requirements for the major or minor in music. All pieces, excerpts, examples, videos, and texts will be made available to students online.", "other": ["Cross-listed with: AFAM 207N", "Bachelor of Arts: Arts", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "MUSIC", "number": "209N", "credits": "3 Credits", "description": "The Beatles are the most significant musical group in the history of popular music. Their songs are derived from diverse sources, such as rhythm 'n' blues, rock 'n' roll, country 'n' western, Motown, soul, folk music, folk rock, the British Music Hall, and European and Indian classical music traditions. Two ideas define their work: an emphasis on freedom, and how song texts can be interpreted in different ways. The Beatles had a great impact not only on American popular music during their heyday in the 1960s but also on the country' s popular culture in which they were considered philosopher kings. Beatle albums mirrored changing trends in the culture, from the pre-Vietnam War youthfulness of A Hard Day's Night, to the psychedelia of Revolver and Sgt. Pepper, to the countercultural mindset of The White Album. This inter-domain course will focus on how the Beatles influenced American popular culture from the 1960s to the present day. It will examine how the Beatles were a part of a mid-twentieth-century British youth subculture that was shaped by the cultural attitudes of American rock 'n' roll. The course will then turn its attention to the seismic shift initiated by the Fab Four in both music and pop culture in the US from 1964 to 1970, demonstrating how it has permeated the popular culture of the 1970s to the present day. The course will enhance the appreciation of the Beatles and their music through its interdisciplinary focus, contextualizing the Fab Four's work in order to show how both popular music and culture can influence one another. One way the course will facilitate this goal is through the inclusion of selected readings from English literature and popular culture upon which students will write reflection essays.", "other": ["Cross-listed with: ENGL 208N", "United States Cultures (US)", "General Education: Arts (GA)", "General Education: Humanities (GH)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "MUSIC", "number": "210", "credits": "1 Credits", "description": "Playing accompaniments from chord symbols and full notation, transposition, improvisation, modulation, score-reading, and standard literature.", "prerequisite": "MUSIC170 or placement audition", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "212", "credits": "1 Credits", "description": "Intermediate performance and teaching techniques for guitar.  MUSIC 212 Guitar Techniques II (1) MUSIC 212 is offered as an Individual Emphasis course for students who have been accepted into the Teacher Education Degree Program in Music. The focus of the course is on learning to play the guitar in a group class setting in order to accompany oneself and learning techniques for how to teach the guitar in classroom settings. Topics include: intermediate level guitar pedagogy, instrument care and maintenance, classroom structure and materials. The instructional format includes: performance, lecture, large and small group discussion, readings, and musical and teaching examples. Students complete several practical assignments and present summations of small group discussions. Two practice performances, a final playing and written exam are given, and a formal concert is performed.", "prerequisite": "MUSIC112"}, {"department": "MUSIC", "number": "215", "credits": "3 Credits", "description": "Vocal/respiratory anatomy and function, vocal health, voice classification, and techniques that enhance and develop acting and movement from the singer perspective. Anatomy of the larynx and respiratory system are studied and strengthened through in-class work on vocal and breathing exercises. Focus is placed on good tone production and resonance. Basic differences between Classical and Musical Theatre vocal styles are introduced. Techniques that enhance and develop acting and movement choices are also studied through individual and group exercises and through the performance of songs. This course is designed for students in the INART major, and also for students who are interested in singing but  are not MUSIC or THEATRE majors.", "prerequisite": "THEA 112", "other": ["Bachelor of Arts: Arts", "General Education: Arts (GA)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "MUSIC", "number": "216", "credits": "0.5 Credits", "description": "The nature of singing voices in children from birth through adolescence; strategies for helping all children become successful singers.  MUSIC 216 Care and Nurture of Young Singing Voices (.5) The focus of this course is the nature of child and adolescent singing voices and strategies for assisting all children in learning to sing. Aural identification of various stages of vocal development or children and adolescents will be highlighted as well as strategies for nurturing the young singing voice in a classroom and rehearsal setting. Observations of teachers working with children will be included in the course experiences. This course is for music majors intending to apply to the Teacher Education Degree Program in Music and must be taken prior to entrance to the Degree program, typically during the sophomore year."}, {"department": "MUSIC", "number": "221", "credits": "1 Credits", "description": "Intermediate sight singing and dictation.", "prerequisite": "MUSIC122 Prerequisite or concurrent: MUSIC231", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "222", "credits": "1 Credits", "description": "Continuation of Music 221.", "prerequisite": "MUSIC221 .  Prerequisite or concurrent:", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "231", "credits": "2 Credits", "description": "Intermediate concepts of tonal theory.", "prerequisite": "MUSIC132", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "231H", "credits": "2 Credits", "description": "Intermediate concepts of tonal theory.", "other": ["Bachelor of Arts: Arts", "Honors"]}, {"department": "MUSIC", "number": "240", "credits": "2 Credits", "description": "MUSIC 240 Introduction to Music Education (2)(BA)This course meets the Bachelor of Music Education degree requirements. MUSIC 240 is offered every fall semester for students who are considering the Teacher Certification program in Music Education. This course provides prospective music teachers with an opportunity to develop basic music teaching skills; identify behaviors of effective music teachers; identify their own strengths and weaknesses as a teacher, set goals based on those traits, and apply strategies to improve; develop their ability to reflect on their own teaching; and to understand and apply educational and music education theory to a variety of musical developmental levels. Students complete several practical assignments, present summations of small group discussions, and present micro-teaching lessons with peers in class. A midterm and final exam are typically given.", "prerequisite": "acceptance into Teacher Education Degree Program in Music;  Concurrent:  MUSIC341, MUSIC395A"}, {"department": "MUSIC", "number": "241", "credits": "3 Credits", "description": "Development of competencies for guiding musical experiences of children in the elementary classroom.", "prerequisite": "for students in the K-6 Teacher Certification Program only", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "251A", "credits": "0.5 Credits", "description": "A class setting in which trumpet performance techniques, teaching/diagnostic strategies, instructional materials, and literature are taught, practiced, and developed.  MUSIC 251A Brass Techniques II: Trumpet (.5) This course develops proper performance techniques on the trumpet in a class setting. Teaching techniques and materials specific to the trumpet are demonstrated and applied. Students will develop a performance level that will enable them to provide a desirable aural model for intermediate and advanced trumpet students. Students are introduced to appropriate trumpet teaching techniques; standard trumpet teaching materials including method books, etudes, and solo literature; effective strategies for diagnosing problems in student performances; and recommended instruments and equipment for all levels of trumpet study. Class meetings will occur twice per week for 1/2 semester. Students will be expected to practice outside of class meeting times. Grades will be based on students' musical achievement on the trumpet and understanding of material presented. There will be multiple performance assessments throughout the course. This course is recommended for students working toward entrance to the Teacher Education Program in Music and the Bachelor of Music Education degree.", "prerequisite": "MUSIC151"}, {"department": "MUSIC", "number": "251B", "credits": "0.5 Credits", "description": "A class setting in which horn performance techniques, teaching/diagnostic strategies, instructional materials, and literature are taught, practiced, and developed.  MUSIC 251B Brass Techniques II: Horn (.5) This course develops proper performance techniques on the horn in a class setting. Teaching techniques and materials specific to the horn are demonstrated and applied. Students will develop a performance level that will enable them to provide a desirable aural model for intermediate and advanced horn students. Students are introduced to appropriate horn teaching techniques; standard horn teaching materials including method books, etudes, and solo literature; effective strategies for diagnosing problems in student performances; and recommended instruments and equipment for all levels of horn study. Class meetings will occur twice per week for 1/2 semester. Students will be expected to practice outside of class meeting times. Grades will be based on students' musical achievement on the hornt and understanding of material presented. There will be multiple performance assessments throughout the course. This course is recommended for students working toward entrance to the Teacher Education Program in Music and the Bachelor of Music Education degree.", "prerequisite": "MUSIC151"}, {"department": "MUSIC", "number": "251C", "credits": "0.5 Credits", "description": "A class setting in which trombone performance techniques, teaching/diagnostic strategies, instructional materials, and literature are taught, practiced, and developed.  MUSIC 251C Brass Techniques II: Trombone (.5) This course develops proper performance techniques on the trombone in a class setting. Teaching techniques and materials specific to the trombone are demonstrated and applied. Students will develop a performance level that will enable them to provide a desirable aural model for intermediate and advanced trombone students. Students are introduced to appropriate trombone teaching techniques; standard trombone teaching materials including method books, etudes, and solo literature; effective strategies for diagnosing problems in student performances; and recommended instruments and equipment for all levels of trombone study. Class meetings will occur twice per week for 1/2 semester. Students will be expected to practice outside of class meeting times. Grades will be based on students' musical achievement on the trombone and understanding of material presented. There will be multiple performance assessments throughout the course. This course is recommended for students working toward entrance to the Teacher Education Program in Music and the Bachelor of Music Education degree.", "prerequisite": "MUSIC151"}, {"department": "MUSIC", "number": "251D", "credits": "0.5 Credits", "description": "A class setting in which euphonium and tuba performance techniques, teaching/ diagnostic strategies, instructional materials, and literature are taught, practiced, and developed.  MUSIC 251D Brass Techniques II: Euphonium/Tuba (.5) This course develops proper performance techniques on the euphonium and tuba in a class setting. Teaching techniques and materials specific to the euphonium and tuba are demonstrated and applied. Students will develop a performance level that will enable them to provide a desirable aural model for intermediate and advanced euphonium and tuba students. Students are introduced to appropriate euphonium and tuba teaching techniques; standard euphonium and tuba teaching materials including method books, etudes, and solo literature; effective strategies for diagnosing problems in student performances; and recommended instruments and equipment for all levels of euphonium and tuba study. Class meetings will occur twice per week for 1/2 semester. Students will be expected to practice outside of class meeting times. Grades will be based on students' musical achievement on the euphonium and/or tuba and understanding of material presented. There will be multiple performance assessments throughout the course. This course is recommended for students working toward entrance to the Teacher Education Program in Music and the Bachelor of Music Education degree.", "prerequisite": "MUSIC151"}, {"department": "MUSIC", "number": "253", "credits": "0.5-1 Credits/Maximum of 2", "description": "Performance techniques on violin, viola, cello or string bass for music education majors.  MUSIC 253 String Techniques II (0.5 - 1 per semester/maximum of 2) This course is recommended for students working toward the Bachelor of Music Education degree program, and who hope to teach string/orchestra classes. The purpose of the course is to allow students to develop proper performance techniques on the violin, viola, cello, or string bass at a sufficient level so that they can provide a desirable aural model for intermediate and advanced string students. Grades will be based on students&rsquo; musical achievement on the instrument(s). There will be multiple performance assessments throughout the course. Required repertoire lists and evaluation tools will be provided prior to all assessments.", "prerequisite": "MUSIC153"}, {"department": "MUSIC", "number": "254A", "credits": "0.5 Credits", "description": "Performance and teaching techniques and materials selection for flute.  MUSIC 254A Woodwind Techniques II: Flute (.5) This course is intended for music majors working toward the Teacher Education Degree Program in Music. This course may serve as a music education elective, and is best taken during the junior year. It should only be taken following successful completion of MUSIC 154 Woodwind Techniques I. The purpose of the course is to allow students to develop proper performance techniques in order to produce a characteristic sound on the flute at a sufficient level so that they can provide a desirable aural model for beginning and intermediate string students. Grades will be based largely on the performance achievement on the flute, in addition to development of resources for flute pedagogy and demonstration of appropriate diagnosis and prescription for flute performance problems. There will be two performance assessments during the course. There will be one midterm and one final assessment, weighted as listed:Midterm Assessment (performance and diagnosis) 30% Final Assessment (performance and diagnosis) 50% Resource journal 10%The required repertoire list will be provided approximately two weeks prior to each assessment. Students will also be provided with a copy of the measurement tool to be used in evaluating their performance. Students must receive a passing grade for both assessments in order to receive an overall passing grade for the course.", "prerequisite": "MUSIC154"}, {"department": "MUSIC", "number": "254B", "credits": "0.5 Credits", "description": "Performance and teaching techniques and materials selection for oboe.  MUSIC 254B Woodwind Techniques II: Oboe (.5) This course is intended for music majors working toward the Teacher Education Degree Program in Music. This course may serve as a music education elective, and is best taken during the junior year. It should only be taken following successful completion of MUSIC 154 Woodwind Techniques I. The purpose of the course is to allow students to develop proper performance techniques in order to produce a characteristic sound on the oboe at a sufficient level so that they can provide a desirable aural model for beginning and intermediate string students. Grades will be based largely on the performance achievement on the oboe, in addition to development of resources for oboe pedagogy and demonstration of appropriate diagnosis and prescription for oboe performance problems. There will be two performance assessments during the course. There will be one midterm and one final assessment, weighted as listed:Midterm Assessment (performance and diagnosis) 30% Final Assessment (performance and diagnosis) 50% Resource journal 10%The required repertoire list will be provided approximately two weeks prior to each assessment. Students will also be provided with a copy of the measurement tool to be used in evaluating their performance. Students must receive a passing grade for both assessments in order to receive an overall passing grade for the course.", "prerequisite": "MUSIC154"}, {"department": "MUSIC", "number": "254C", "credits": "0.5 Credits", "description": "Performance and teaching techniques and materials selection for clarinet.  MUSIC 254C Woodwind Techniques II: Clarinet (.5) This course is intended for music majors working toward the Teacher Education Degree Program in Music. This course may serve as a music education elective, and is best taken during the junior year. It should only be taken following successful completion of MUSIC 154 Woodwind Techniques I. The purpose of the course is to allow students to develop proper performance techniques in order to produce a characteristic sound on the clarinet at a sufficient level so that they can provide a desirable aural model for beginning and intermediate string students. Grades will be based largely on the performance achievement on the clarinet, in addition to development of resources for clarinet pedagogy and demonstration of appropriate diagnosis and prescription for clarinet performance problems. There will be two performance assessments during the course. There will be one midterm and one final assessment, weighted as listed:Midterm Assessment (performance and diagnosis) 30% Final Assessment (performance and diagnosis) 50% Resource journal 10%The required repertoire list will be provided approximately two weeks prior to each assessment. Students will also be provided with a copy of the measurement tool to be used in evaluating their performance. Students must receive a passing grade for both assessments in order to receive an overall passing grade for the course.", "prerequisite": "MUSIC154"}, {"department": "MUSIC", "number": "254D", "credits": "0.5 Credits", "description": "Performance and teaching techniques and materials selection for saxophone.  MUSIC 254D Woodwind Techniques II: Saxophone (.5) This course is intended for music majors working toward the Teacher Education Degree Program in Music. This course may serve as a music education elective, and is best taken during the junior year. It should only be taken following successful completion of MUSIC 154 Woodwind Techniques I. The purpose of the course is to allow students to develop proper performance techniques in order to produce a characteristic sound on the saxophone at a sufficient level so that they can provide a desirable aural model for beginning and intermediate string students. Grades will be based largely on the performance achievement on the saxophone, in addition to development of resources for saxophone pedagogy and demonstration of appropriate diagnosis and prescription for saxophone performance problems. There will be two performance assessments during the course. There will be one midterm and one final assessment, weighted as listed:Midterm Assessment (performance and diagnosis) 30% Final Assessment (performance and diagnosis) 50% Resource journal 10%The required repertoire list will be provided approximately two weeks prior to each assessment. Students will also be provided with a copy of the measurement tool to be used in evaluating their performance. Students must receive a passing grade for both assessments in order to receive an overall passing grade for the course.", "prerequisite": "MUSIC154"}, {"department": "MUSIC", "number": "254E", "credits": "0.5 Credits", "description": "Performance and teaching techniques and materials selection for bassoon.  MUSIC 254E Woodwind Techniques II: Bassoon (.5) This course is intended for music majors working toward the Teacher Education Degree Program in Music. This course may serve as a music education elective, and is best taken during the junior year. It should only be taken following successful completion of MUSIC 154 Woodwind Techniques I. The purpose of the course is to allow students to develop proper performance techniques in order to produce a characteristic sound on the bassoon at a sufficient level so that they can provide a desirable aural model for beginning and intermediate string students. Grades will be based largely on the performance achievement on the bassoon, in addition to development for resources for bassoon pedagogy and demonstration of appropriate diagnosis and prescription for bassoon performance problems. There will be two performance assessments during the course. There will be one midterm and one final assessment, weighted as listed:Midterm Assessment (performance) 33% Final Assessment (performance and written exam) 66%", "prerequisite": "MUSIC154"}, {"department": "MUSIC", "number": "255", "credits": "3 Credits", "description": "Continuation of Music 244 with emphasis on keyboard, harmony, chromaticism, analysis, sightsinging and dictation."}, {"department": "MUSIC", "number": "261", "credits": "3 Credits", "description": "The course is a survey of music history from antiquity through the Baroque period, with readings, listening, and lecture. The principal objectives are: to acquaint students with important musical works from this period of European and American history; to place these works in their larger social, cultural, economic, and intellectual contexts; and to introduce analytical methods useful for describing technical musical features and relating those features to extra-musical concerns. As the second course in the music history sequence designed for music majors and minors, Music 261 forms a part of the core music curriculum required for advanced (400-level) study in the discipline. Assignments and evaluation methods are designed to help students develop their critical faculties and communication skills, through listening, reading, in-class discussion, examinations, and writing. There is significant emphasis on intercultural and international competence through study of music from a range of European countries. Musical analysis is integrated with consideration of the historical, social, cultural, religious, and economic circumstances of the works' production. The course stresses development of criteria of aesthetic judgment, with respect to musical style (deployment of the various musical elements: melody, harmony, rhythm, texture, timbre) and the relationship of style to non-musical historical factors.", "prerequisite": "MUSIC131 , MUSIC162", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "262", "credits": "3 Credits", "description": "The course is a survey of music history from ca. 1750 to the present, with readings, listening, and lecture. The principal objectives are: to acquaint students with important musical works from this period of European and American history; to place these works in their larger social, cultural, economic, and intellectual contexts; and to introduce analytical methods useful for describing technical musical features and relating those features to extra-musical concerns. As the third course in the music history sequence designed for music majors and minors, Music 262 forms a part of the core music curriculum required for advanced (400-level) study in the discipline. Assignments and evaluation methods are designed to help students develop their critical faculties and communication skills, through listening, reading, in-class discussion, examinations, and writing. There is significant emphasis on intercultural and international competence through study of music from a range of European countries and the United States. Musical analysis is integrated with consideration of the historical, social, cultural, religious, and economic circumstances of the works' production. The course stresses development of criteria of aesthetic judgment, with respect to musical style (deployment of the various musical elements: melody, harmony, rhythm, texture, timbre) and the relationship of style to non-musical historical factors.", "prerequisite": "MUSIC132 , MUSIC162", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Arts (GA)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "MUSIC", "number": "262H", "credits": "3 Credits", "description": "A survey of music history from 1750 to the present, with readings, listening, and lecture.", "other": ["Honors"]}, {"department": "MUSIC", "number": "266", "credits": "1 Credits", "description": "Basic instruction and practicum in conducting, both choral and instrumental.", "prerequisite": "MUSIC221 , MUSIC231", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "267", "credits": "2 Credits", "description": "Basic instruction in the techniques of composition in all idioms.", "prerequisite": "or concurrent: MUSIC231", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "270", "credits": "1 Credits", "description": "Instruction in secondary chord progressions, transposition, improvisation, accompanying techniques, score reading.", "prerequisite": "MUSIC210 or placement audition", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "273", "credits": "2 Credits", "description": "Composition instruction for second-year composition majors.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "274", "credits": "2 Credits", "description": "Composition instruction for second-year composition majors.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "295A", "credits": "1 Credits/Maximum of 1", "description": "MUSIC 295A Early Field Experience in Music Education (1)(BA) This course meets the Bachelor of Arts degree requirements. This course is offered to music majors during their fourth semester who are intending to apply to the Teacher Education Degree Program in Music. It provides prospective music teachers with an opportunity to observe various components involved in the music teaching process; develop basic music teaching skills; identify behaviors of effective music teachers; identify their own strengths and weaknesses as a teacher, set goals based on those traits, and apply strategies to improve; develop their ability to reflect on their own teaching; observe and interact with children of varying races, religious beliefs, national origins and socioeconomic backgrounds, particularly children for whom English is a second language and who are considered in need of early intervention; continue developing their own sight-singing and piano skills.", "prerequisite": "fourth semester standing, MUSIC115 , MUSIC210", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "MUSIC", "number": "312", "credits": "1 Credits", "description": "Exploration of world instruments and singing through performance and study.  MUSIC 312 Performance of Diverse Musical Styles (1) The focus of the course is participation in a non-Western based music ensemble to gain knowledge of global music traditions and how to apply world music ensemble practices into K-12 teaching. Topics include: cultural knowledge and significance, playing technique and pedagogy, and applications for teaching. The instructional format includes: performance, lecture, small group discussion, readings, and musical examples. Students complete several practical assignments and present summations of small group discussions. A final playing and written exam are given, and a formal concert is performed."}, {"department": "MUSIC", "number": "325", "credits": "3 Credits", "description": "This course teaches students how to use entrepreneurship as a tool in service to their career goal of becoming a music professional. For students who create their own music in some capacity (composing, arranging, performing) or non-creators who desire to support the production and consumption of music in some way, this course provides a solid understanding of entrepreneurial theory and shows how to apply it to the specific goals and interests of each student. This course takes an in-depth look at how the music industry works and helps you, the student, to create a career in music."}, {"department": "MUSIC", "number": "331", "credits": "2 Credits", "description": "Introduction to standard procedures of tonal analysis, including concepts of form and structure.", "prerequisite": "MUSIC221 , MUSIC231", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "332", "credits": "2 Credits", "description": "Application of analytical techniques and compositional theories to music of the twentieth century.", "prerequisite": "MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "336", "credits": "2 Credits", "description": "Scoring for the orchestra.", "prerequisite": "MUSIC222 , MUSIC232", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "341", "credits": "2 Credits", "description": "Exploration of instructional materials and repertoire for use in K-12 music settings. Limited to Music Education majors who have been accepted into the Teacher Education Degree Program in Music.  MUSIC 341 Instructional Materials in Music (2) MUSIC 341 is offered to students who have been accepted into the Teacher Education Degree Program in Music. The focus of this course is to gain knowledge through exploration of the process for selecting instructional materials and repertoire for K-12 music across all settings, choral, general, and instrumental settings. Topics include: the exploration of instructional materials, the criteria for selection of materials, and strategies for arranging musical materials to meet the needs of students. The instructional format includes: lecture, large and small group discussion, readings, and musical examples. Students complete several practical assignments and present summations of small group discussions. A written midterm and final evaluation will be given to assess student learning."}, {"department": "MUSIC", "number": "341B", "credits": "1.5 Credits", "description": "This course provides students with the opportunity to explore instructional materials and repertoire through in-class sessions and observation of Pre- K-12 teachers. Topics include: singing voices of children/youth, music literacy, classroom instruments, musical movement, and issues of curriculum, planning, and assessment. The instructional format includes: large and small group discussion, readings, and musical and teaching examples and experiences. Students complete several practical assignments including off campus observations and development of materials for use in teaching.", "prerequisite": "Acceptance into Teacher Education Degree Program in Music"}, {"department": "MUSIC", "number": "345", "credits": "2 Credits", "description": "For music education students to learn about instrucational techniques and practices for music performance and general music classes.  MUSIC 345 Instructional Practices in Music (2) This course is designed to cover general principles in planning and delivery of instruction for, and assessment of the learning of, students in public school K-12 music rehearsals and classrooms. Further, this course will focus on application and implementation of strategies to specific settings in which students will be certified to teach. Course objectives enable students to develop an understanding of the interaction of planning and delivery of instruction and the assessment of student learning; develop an understanding of principles of presenting and leading students in music activities and performance experiences; develop strategies for planning music lessons and rehearsals; and develop strategies for assessing student learning.Students in the course will select appropriate instructional strategies reflecting technical and musical objectives and needs of the students; plan music lessons and rehearsals reflecting technical and musical objectives and needs of the students; and develop valid tools and procedures for assessing students' music learning. The students in this course will be evaluated on their effectiveness in writing task analyses, lesson and rehearsal plans, designing assessment tools, and implementing plans and assessments in a variety of music settings in peer-teaching situations.Music education majors will take this course as part of a sequence of music education courses. This course is preceded by courses concerning musical development, teaching experiences, and courses in selection and design of instructional materials, and this course precedes a capstone course (MUSIC 441W, MUSIC 442W, MUSIC 443W, MUSIC 444W, MUSIC 445W, or MUSIC 446W) in which students study one instructional setting and curriculum level (choral, band, orchestra, general music; elementary middle school, high school) in greater depth, depending on their future career goals. Approximately 25 students will be enrolled.", "prerequisite": "MUSIC340 , MUSIC341 , MUSIC395A , piano and voice proficiencies passed.;  Concurrent:  MUSIC395B"}, {"department": "MUSIC", "number": "366", "credits": "1 Credits", "description": "Intermediate instruction in conducting; conducting techniques specific to instrumental or choral music; introduction to rehearsal technique.  MUSIC 366 Intermediate Conducting (1)(BA) This course meets the Bachelor of Arts degree requirements. MUSIC 366 focuses on the development of more advanced physical skills and gestures appropriate for conducting expressive performances and rehearsals of music ensembles. The instructional format includes instructor demonstrations, student conducting of the class ensemble, and active participation as a performer and observer for peer conductors. Outside of class, students are expected to practice conducting gestures and use basic score study skills as preparation for conducting assigned music. Students prepare several music scores and conduct the class ensemble in practice episodes and instructor-evaluated performances. Students receive feedback and peer feedback on their performances in both practice and evaluated conducting episodes. Students are graded through instructor evaluation of conducting performances, completion of self-assessments involving review of a video of their performances, and participation in providing feedback for peers.", "prerequisite": "MUSIC266 , MUSIC270 , MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "373", "credits": "3 Credits", "description": "Composition instruction for third-year position majors.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "374", "credits": "3 Credits", "description": "Composition instruction for third-year composition majors.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "387", "credits": "1 Credits", "description": "Intensive drill in the pronunciation, phonetic transcription, and singing of Italian and English.", "prerequisite": "VOICE 170", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "388", "credits": "1 Credits", "description": "Intensive drill in the pronunciation, phonetic transcription, and singing of French.", "prerequisite": "VOICE 170", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "389", "credits": "1 Credits", "description": "Intensive drill in the pronunciation, phonetic transcription, and singing of German.", "prerequisite": "VOICE 170", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "395", "credits": "0.5-1 Credits", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "395A", "credits": "1 Credits/Maximum of 1", "description": "MUSIC 395A Cohort Practicum I (1)(BA)  This course meets the Bachelor of Arts degree requirements. MUSIC 395A is offered for students who are tracking acceptance into the Teacher Education Degree Program in Music. Students will enroll concurrently with the proposed course MUSIC 341 and the revised course MUSIC 340. The focus of the course is to provide students with opportunity to explore instructional materials and repertoire through interviews and observation of K-12 teachers. Topics include: the design and implementation of observational tools, and the leading and teaching of songs in a variety of settings. The instructional format includes: large and small group discussion, readings, and musical and teaching examples and experiences. Students complete several practical assignments including off campus observations, and present summations of small group discussions.", "prerequisite": "Acceptance into Teacher Education Degree Program in Music;  Concurrent:  MUSIC340, MUSIC341", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "395B", "credits": "1 Credits/Maximum of 1", "description": "Observation and teaching experiences in a variety of musical instruction settings.", "prerequisite": "MUSIC 341", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "395C", "credits": "1-5 Credits/Maximum of 5", "description": "Field experiences in music teaching for undergraduate music education majors.", "prerequisite": "acceptance into the School of Music; Concurrent: MUSIC344", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "MUSIC", "number": "400", "credits": "1 Credits", "description": "Required recital for Performer's Certificate.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "404", "credits": "3 Credits/Maximum of 9", "description": "This course enables the participation of non-music majors in a choral ensemble at the 400 level. The course will meet concurrently with EITHER Music 089 or Music 104. The repertoire of the ensemble is selected from a wide range of choral literature from medieval chant to commissioned twenty-first century choral works. The goal of the ensemble is to provide artistic, meaningful, and successful choral performances. To achieve this goal, the learning objectives for individual students include attention toward individual vocal development, increased musicianship skill, and the discovery of new means of artistic expression. In addition to these individual objectives, the conductor of the ensemble also teaches directly toward the objectives of ensemble tone, blend, balance, intonation, dynamics, diction, phrasing, etc. Music 404 students are also required to engage in significant research and/or performance projects, the subject matter of which will be catered towards the students' individual research interests and/or the repertoire being studied each semester. These projects may include the study of the art of choral conducting that will culminate in leading the choir in a concert, the study of a specific composer, composition, performance practice or musical style that is featured in the semester's repertoire that will culminate in a major research paper, class presentations, and program notes on the choir's concerts, or other subject matter approved by the instructor. In addition to this requirement, Music 404 students will analyze and summarize bi-weekly scholarly articles chosen by the instructor, the information in which will be presented in class presentations. In addition, Music 404 students must take on a leadership role within the group by choosing and leading warm-ups and technical exercises under the supervision of the instructor, serving as section leaders, and/or serving as vocal soloists in the repertoire.", "prerequisite": "MUSIC 89"}, {"department": "MUSIC", "number": "412", "credits": "2 Credits", "description": "The development of advanced skills in pedagogy for teaching jazz bands.", "prerequisite": "admission to the Music Education program or certification", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "414", "credits": "1-2 Credits/Maximum of 2", "description": "The development of skills in pedagogy for teaching strings.", "prerequisite": "completion of 300-level strings course", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "415", "credits": "1-2 Credits/Maximum of 2", "description": "The development of skills in pedagogy for teaching woodwinds.", "prerequisite": "completion of 300-level woodwind course", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "416", "credits": "1-2 Credits/Maximum of 2", "description": "The development of skills in pedagogy for teaching brass.", "prerequisite": "completion of 300-level brass course", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "417", "credits": "1-2 Credits/Maximum of 2", "description": "The development of advanced skills in pedagogy for teaching percussion.", "prerequisite": "PERCN 320", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "418", "credits": "2 Credits", "description": "Analysis of techniques of teaching voice and studies of related music literature and pedagogical writings.", "prerequisite": "VOICE 270", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "419", "credits": "2 Credits", "description": "Analysis of beginning teaching methods and teaching strategies for children.", "prerequisite": "KEYBD270 or KEYBD280 ; MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "420", "credits": "3 Credits", "description": "Song composition, arranging and recording in a variety of style genres.  MUSIC 420 Song Writing and Recording (3) This course will take the student through the process of composing and producing a recorded song. The class will consist of a combination of class meetings and individual instruction. Topics will include form, lyric writing, arranging, audio/MIDI recording and sequencing. Familiarity with basic audio sequencing software and music theory concepts is essential. The focus of the class is vernacular song as opposed to classical art song, but all the basic concepts discussed in the class apply to either genre. The course requires the composition of original songs and the creation of high-quality recordings of them and their conversion to MP3 format. The student are expected to enter the class with a basic knowledge of digital audio and MIDI (MUSIC/INART 258 or equivalent).", "prerequisite": "INART258 , MUSIC232"}, {"department": "MUSIC", "number": "420H", "credits": "2 Credits/Maximum of 4", "description": "Instruction focusing on the accompanist's problems of balance, interpretation, and musical communication.", "other": ["Honors"]}, {"department": "MUSIC", "number": "421", "credits": "1 Credits/Maximum of 8", "description": "Study and performance of small group jazz.", "prerequisite": "MUSIC181", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "422", "credits": "3 Credits", "description": "Analysis and composition of jazz tunes and chord progressions; instrumental and vocal arranging in the jazz idiom.", "prerequisite": "MUSIC222 , MUSIC232", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "424", "credits": "2 Credits", "description": "Analysis of techniques of teaching intermediate-early advanced level piano and studies of music literature and pedagogical writings.", "prerequisite": "KEYBD270 or KEYBD280 ; MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "425", "credits": "2 Credits", "description": "Analysis of techniques of teaching voice, supervised teaching, studies of studio materials and related topics.", "prerequisite": "MUSIC418", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "429", "credits": "1 Credits", "description": "An intensive review of the aural skills required for a theoretical understanding of 18th- and 19th-century music.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "431", "credits": "2-3 Credits", "description": "Advanced techniques of musical analysis.", "prerequisite": "MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "432", "credits": "2-3 Credits/Maximum of 3", "description": "The theory and analysis of style in music of the twentieth century.", "prerequisite": "MUSIC262 , MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "433", "credits": "2-3 Credits", "description": "In-depth studies of selected twentieth-century repertoires and/or analytical models.", "prerequisite": "MUSIC262 , MUSIC332", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "434", "credits": "3 Credits/Maximum of 3", "description": "A HISTORY OF ELECTROACOUSTIC MUSIC AS A CONSEQUENCE OF DEVELOPMENTS IN CULTURE AND TECHNOLOGY FROM 1880 to PRESENT. HISTORY OF ELECTROACOUSTIC MUSIC (3) is an introduction to the development of music based in electronics, beginning with the invention of the phonograph and ending with current electronic dance music. The course traces interrelated developments in technology, art, culture, and music, and investigates music through written listening analyses.", "prerequisite": "INART 258A"}, {"department": "MUSIC", "number": "435", "credits": "1 Credits", "description": "Introduction in score reading at the keyboard.", "prerequisite": "MUSIC232 ; piano proficiency passed", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "437", "credits": "3 Credits", "description": "Music Information Retrieval and Computer-Assisted Music have become quite important to electronic musicians recently and will increase in importance over time. The common threads that run through the topics of this course are, first, the mathematics & software that have entered the popular imagination as \"big data\" & \"modeling\" and, second, music. An application of these ideas might look like software in which one can search all of Beethoven's works to determine exactly how often he followed a V7 chord with a vi chord; this would be called Music Information Retrieval (MIR). Using a computer to calculate the possible solutions to a species counterpoint exercise might be computer-assisted music theory. The course will have a seminar-like format in which current research is reviewed and students undertake projects in MIR or CAM."}, {"department": "MUSIC", "number": "438", "credits": "1 Credits/Maximum of 1", "description": "A survey of topics related to a music career in performance, private teaching, and college teaching. This course is a survey of topics related to a career in classical music performance, private teaching, and educational institution teaching. These are the principal means by which the freelance musician earns a living. Topics include résumé writing, biography writing, repertoire list writing, press release writing, website and flyer design, audio and video recordings, auditions, competitions, performance opportunities, networking, professional finances, fundraising, managing all aspects of a private teaching enterprise, and applying for institutional teaching positions. Panel discussions with professional musicians will be scheduled.", "prerequisite": "Fifth-semester standing and permission of instructor"}, {"department": "MUSIC", "number": "441W", "credits": "3 Credits", "description": "This course is intended for Music Education majors in their senior year who have particular interest in working with elementary school children in a general music or choral setting and will involve off-site practicum experiences. Students in this course will develop teaching skills as applied to the elementary general music classroom including the teaching of singing, movement, classroom instruments, creative endeavors, and rhythmic and melodic literacy.", "prerequisite": "MUSIC 341B", "other": ["Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "442W", "credits": "3 Credits", "description": "Emphasis in teaching in secondary general music settings.  MUSIC 442W Emphasis in Secondary General Music (3) MUSIC 442W is offered to students who have been accepted into the Teacher Certification program in Music Education. The focus of this course is to provide students with opportunity to explore secondary general music settings under the close supervision of a faculty member. Topics include: the design and implementation of curriculum in secondary general music, the leading and teaching of songs in these settings, and specific grade-level appropriate pedagogy. The instructional format includes: lecture, small group discussion, readings, musical and teaching examples, and off campus observation and teaching in middle and high school classrooms. Students complete several practical assignments including off campus observations, presentation of the summations of small group discussions, curriculum planning and models, and teaching within public schools in grades 5-12. This is a writing intensive course with focus on a detailed, multi-drafted topic paper relating to specific elements of teaching choral and general music at the secondary level.", "prerequisite": "MUSIC 345", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "443W", "credits": "3 Credits", "description": "MUSIC 443W Choral Emphasis in Secondary Music Education (3). This course meets the Bachelor of Music (Music Education) degree requirements. The course is intended to prepare pre-service teachers to teach secondary choral (vocal) music. Preparation will include observation of current public school teachers and teaching techniques and methods, preparation and implementation of appropriate lessons including assessments, in-depth analysis (case study) of a student currently in the public schools, development of a written philosophy of music education and choir instruction, and consideration of practical matters associated with teaching in the public schools such as scheduling, recruitment and parent interaction. The course serves as a capstone to the prior courses in the music education curriculum. Previous courses in instructional planning, instructional materials, instrument techniques, conducting, piano and vocal technique will have developed necessary prior skills. Skills and concepts from these classes will be applied in this authentic context in the collegiate and public school classrooms. The students will be assessed according to their effectiveness in observation, teaching preparation, teaching and research. Evaluation will be in the form of written and verbal feedback, and completion of rubrics by the instructor and the students themselves (self- and peer-evaluation). Students will complete a field experience component in local middle or high schools.", "other": ["Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "444W", "credits": "3 Credits", "description": "Examination and application of teaching strategies and materials for students planning to teach band in the elementary and middle schools.  MUISC 444W Capstone Experiences in Elementary and Intermediate Band (3)(BA) This course meets the Bachelor of Arts degree requirements. The course is intended to prepare pre-service teachers to teach beginning through intermediate instrumental (band) music. Preparation will include observation of current public school teachers and teaching technique4s and methods, preparation and implementation of appropriate lessons including assessments, in-depth analysis (case study) of a student currently in the public schools, development of a written philosophy of music education and banc instruction, and consideration of practical matters associated with teaching in the public schools such as scheduling, recruitment and parent interaction.The course serves as a capstone to the prior courses in the music education curriculum. Previous courses in instructional planning, instructional materials, instrument techniques, conducting piano and voice use will have developed necessary prior skills. Skills and concepts from these classes will be applied in this authentic context in the collegiate and public school classrooms.The students will be assessed according to their effectiveness in observation, teaching preparation, teaching and research. Evaluation will be in the form of written and verbal feedback, and completion of rubrics by the instructor and the students themselves (self- and peer-evaluation). Enrollment will likely be approximately 5 students each time the course is offered.The students will be spending considerable class time in local elementary and middle schools for field work.", "prerequisite": "MUSIC 345", "other": ["Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "445W", "credits": "3 Credits", "description": "Examination and application of teaching strategies and materials for students planning to teach high school bands.  MUSIC 445W Capstone Experiences in High School Band (3) This course is intended to prepare pre-service teachers to teach high school band. Students will observe, analyze, and discuss the teaching techniques, methods, and materials used by public school teachers in high school band instructional settings. Students will prepare and implement rehearsal plans including assessments, in-depth investigation of appropriate repertoire for use in high school bands and concert programming. Students will develop score analysis skills necessary to plan and guide music making and learning in the band rehearsal. Students will develop materials and strategies that strengthen the connection of instrumental performance to the public school curriculum. Students will develop a written philosophy of music education and the role instrumental performance in band within the music education of high school students. Students will consider practical matters associated with teaching in the public schools such as: scheduling, interaction with parents/teachers/administrators, parental support organizations (music boosters), advocacy, community/school support, and long-range instrumental music program development plans.", "prerequisite": "MUSIC 366", "other": ["Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "446W", "credits": "3 Credits", "description": "Development of teaching techniques for instructing elementary and secondary string/orchestra student musicians for music education majors.  MUSIC 446W Capstone Experiences in Strings and Orchestra (3) This course is intended to prepare pre-service teachers to teach elementary and secondary string instrumental (orchestra) music. Preparation will include observation of current public school teachers and teaching techniques and methods, preparation and implementation of appropriate lessons including assessments, in-depth analysis (case study) of a student currently in the public schools, development of a written philosophy of music education and string/orchestra instruction, and consideration of practical matters associated with teaching in the public schools such as scheduling, recruitment and parent interaction.The course serves as a capstone to the prior courses in the music education curriculum. Previous courses in instructional planning, instructional materials, instrument techniques, conducting, piano and voice use will have developed necessary prior skills. Skills and concepts from these classes will be applied in this authentic context in the collegiate and public school classrooms.The students will be assessed according to their effectiveness in observation, teaching preparation, teaching, and research. Evaluation will be in the form of written and verbal feedback, and completion of rubrics by the instructor and the students themselves (self- and peer-evaluation). Enrollment will likely be approximately 5 students each fall semester. Students will spend considerable class time in local public schools for fieldwork.", "prerequisite": "MUSIC345 , MUSIC395B", "other": ["Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "450", "credits": "2 Credits", "description": "Traditional and contemporary drill design principles, show development strategies, instructional techniques, and organizational procedures involved in teaching marching band.  MUSIC 450 Teaching Marching Band (2)(BA) This course meets the Bachelor of Arts degree requirements. MUSIC 450 is a marching band technique course for music education majors, band directors, and experienced marching band members. This course develops knowledge and skills required to organize and teach marching band with an emphasis on traditional and contemporary drill design and charting. Students are taught an eclectic understanding of drill systems, contemporary drill design, and visual design theory with opportunities to apply drill design computer software (Pyware Java 3D) in developing effective movements for marching units. Course topics include philosophy and role of marching band in the music program, historical perspectives, marching band styles, administration and organization of the marching band and auxiliary units and teaching techniques.", "prerequisite": "MUSIC345 , or three years collegiate marching band experience, or   permission of program", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "451", "credits": "3 Credits/Maximum of 12", "description": "In-depth study of music programming techniques.  MUSIC 451 Computer Programming for Musicians (3 per semester/maximum of 12)This is an in-depth study of a given music programming language or environment. The language/environment will vary from semester to semester, to include languages such as SuperCollider and Max/MSP. Students will be expected to work independently on a series of projects that require increasing levels of difficulty in programming methodology. The course may be repeated for credit. Students will be acquainted with the basics of how the programming environment treats fundamental matters such as signal flow, defining functions, variables and arguments, and music synthesis techniques. These principles will be expanded, with added layers of complexity to the types of problems presented. More complex instruments, processing, and filtering will be covered, along with real-time capabilities (ability of the program to respond to input from audio input or data from an external controller) and the creation of graphical user interfaces (GUIs). Advanced topics will include algorithmic composition and the creation of plug-ins that may be used by other programs. As this is an upper division class, students will be expected to be self-motivated and work independently. Assignments will present problems that may be approached in a number of ways - there is no single right answer; putting it another way, the correct answer is the one that works. Students pursuing the minor in Music Technology (MUTEC) are required to complete two elective courses, one of them upper division. This course will serve those students wishing to apply the minor to areas of software development. Along with MUSIC 455 Technology in Music, this course may also serve as the second part of an elective music technology cognate for students in the graduate and IUG programs in music theory.", "prerequisite": "INART258A , MUSIC455 , or permission of program"}, {"department": "MUSIC", "number": "452", "credits": "3 Credits", "description": "Use of sound synthesis software for music creation.", "prerequisite": "INART258A and INART050", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "453", "credits": "1 Credits", "description": "Training in how to use a  professional multi-track recording studio.  MUSIC 453 Recording Studio Training (1)(BA) This course meets the Bachelor of Arts degree requirements. This is a course in recording studio engineering, directed at students who wish to learn how to operate a professional level multi-track recording studio. Topics include microphone theory, signal flow, audio mixing and mastering, and maintenance issues.", "prerequisite": "THEA 484"}, {"department": "MUSIC", "number": "455", "credits": "1-3 Credits/Maximum of 3", "description": "Survey of how musical information is stored and processed in computer systems.  MUSIC 455 Technology in Music (3)(BA) This course meets the Bachelor of Arts degree requirements. This course provides a survey of how musical information is stored and transmitted in digital devices. It will be divided into three sections.Weeks 1 and 2 are an introduction to acoustical principles such as the nature of sound transmission and measurements of frequency, sound power level, phase, timbre, and localization. Computer basics will also be covered, with topics to include binary number representation and basic computer operation.Weeks 3 through 8 cover the MIDI transmission protocol that enables musical information to be stored and transmitted efficiently. Topics include the nature of the MIDI data structure, the types of messages that may be passed, and the suitability of MIDI for expressive performance. MIDI software is discussed, including notation software, editor/librarian software, and sequencers. The bulk of the course's project component involves working with sequencing programs. Students are also exposed to using MIDI on the web, downloading files and importing them into various applications.Weeks 9 through 15 cover digital audio so that students may understand how instruments capable of understanding MIDI messages are able to translate the instructions into audio signals. Topics include sampling theory, digital vs. analog recording, filters, signal processing, and editing sound files. Projects involving digital audio also use a sequencing program that is able to combine MIDI and audio data.The students are expected to work independently to complete reading assignments according to the schedule outlined in the course syllabus. While due attention will be given to discussion of this material in class, the primary focus of class sessions will be hands-on application, to ensure that students master a set of skills on the computer.", "prerequisite": "CMPSC100 , CMPSC101 , CMPSC121 , or MUSIC231", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "458", "credits": "3 Credits", "description": "An introduction to the art of composition in the electronic audio medium.  MUSIC 458 Electronic Music Composition (3)(BA) This course meets the Bachelor of Arts degree requirements. Music 458 will focus on the creative craft of musical composition in the medium of electronic audio. Topics covered will include but not be limited to: recording, MIDI and digital audio techniques, study of literature and the investigation of the creative process in musical composition. Students are expected to enter the class with strong fundamentals in both music theory and MIDI and digital audio. The student will be expected to complete several projects that demonstrate both their creativity and their technical competence in the medium.", "prerequisite": "INART258A", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "459", "credits": "3 Credits", "description": "Electronic Music Composition II is the second course of a two-semester sequence focused on composition for electronic media. The projects in this course focus on spatial and interactive aspects of computer music, in addition to how these works are realized through the course of performance. The pieces created by students in the course will range from interactive electro-acoustic works realized in real-time to a work for electronic instrument ensemble. Students will become familiar with a variety of software tools and programming languages. The aim of the course is to focus equally on the artistic/compositional merits of your work and provide each student with a thorough knowledge of the technical skills needed to create unique work-specific programs. We will explore a ground-up approach and each student will design distinctive computer tools that support their individual voice as a composer."}, {"department": "MUSIC", "number": "460", "credits": "2 Credits", "description": "Exploration of the world's musical cultures and the implication of and procedures for teaching multicultural music. Limited to upper division music majors or permission of program.", "prerequisite": "MUSIC262 or permission of program"}, {"department": "MUSIC", "number": "461W", "credits": "3 Credits/Maximum of 6", "description": "In-depth study of selected aspects of music and culture from antiquity to 1600, with emphasis on writing and research.", "prerequisite": "MUSIC261 , MUSIC331", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "462W", "credits": "3 Credits/Maximum of 6", "description": "In-depth study of selected aspects of music and culture from 1550-1750, with emphasis on writing and research.", "prerequisite": "MUSIC261 , MUSIC331", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "463W", "credits": "3 Credits/Maximum of 6", "description": "In-depth study of selected aspects of music and culture from 1700-1900, with emphasis on writing and research.", "prerequisite": "MUSIC262 , MUSIC331", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "464W", "credits": "3 Credits/Maximum of 6", "description": "In-depth study of selected aspects of music and culture from 1850 to the present, with emphasis on writing and research.", "prerequisite": "MUSIC262 , MUSIC332", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "465", "credits": "2 Credits", "description": "Advanced instruction in conducting; conducting techniques specific to instrumental or choral music; emphasis on score study and rehearsal technique.", "prerequisite": "MUSIC366", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "466", "credits": "2 Credits/Maximum of 8", "description": "Standard scores of symphonies, tone poems, operas, oratorios, and shorter vocal and instrumental works studied from the viewpoint of the conductor.", "prerequisite": "MUSIC465", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "467", "credits": "1-3 Credits/Maximum of 6", "description": "History, analysis, and production of operas from sixteenth century to present.", "prerequisite": "audition", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "468", "credits": "2 Credits/Maximum of 4", "description": "To help students develop authentic and specific characters/portrayals on stage through physical and emotional awareness. MUSIC 468 Acting for Singers (2) This is a course teaching singers the fundamentals of acting. All types of stage work related to vocal music will be explored from performing in recitals and concerts to the opera and excerpted scenes. The objective of the course is to make singers more comfortable on stage and more realistic/believable in their performances/presentations. This course differs from acting courses offered in other areas because the singer has restrictions placed upon him due to the requirements of the music, especially in regard to timing and the sense of time, and the use of texts which are often in foreign languages. The course is an elective 2 credit course which students may repeat for a maximum of 4 credits. An accompanist will be present to accompany students in their song/aria presentations. Every class meeting will begin with warm-up exercises and then continue with further exercises focusing on helping students develop a sense of timing and enabling them to explore the 'beats' (or central topic) of a scene. Emphasis will be placed on learning how to prepare for a scene, analyze it, and determining the goal(s) of the character. The students will be encouraged to learn how to be specific in their acting and to learn what will 'read' to an audience while accurately reflecting the portrayed emotion. Some work will be solo work, but there will also be opportunities to work with partners. Improvisation will also be incorporated."}, {"department": "MUSIC", "number": "471", "credits": "2 Credits", "description": "Advanced species counterpoint and its application to the sixteenth-century style.", "prerequisite": "MUSIC222 , MUSIC232", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "472", "credits": "2 Credits", "description": "Imitative and nonimitative counterpoint in the style of Bach.", "prerequisite": "MUSIC222 , MUSIC232", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "473", "credits": "3 Credits", "description": "Composition instruction for fourth-year composition majors.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "474", "credits": "3 Credits", "description": "Composition instruction for fourth-year composition majors.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "476W", "credits": "3 Credits", "description": "A semester project appropriate to student's option in B.A. program (e.g., research paper, performance with program notes, or related paper).", "prerequisite": "seventh-semester standing", "other": ["Bachelor of Arts: Arts", "Writing Across the Curriculum"]}, {"department": "MUSIC", "number": "478", "credits": "3 Credits", "description": "Introduction to the literature for solo voice in opera, oratorio, cantata, art song, and chamber music from the baroque to the present.", "prerequisite": "MUSIC262 , MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "480", "credits": "3 Credits", "description": "Studies in the development of the opera from 1600 to the present, treating both libretto and music.", "prerequisite": "MUSIC262 , MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "481", "credits": "3 Credits", "description": "Studies in the development of keyboard music and instruments; a survey of all eras using listening, analysis, and performance.", "prerequisite": "MUSIC262 , MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "483", "credits": "2 Credits", "description": "Survey of literature relevant to the teaching of voice from historical sources through recent pedagogical scholarship.", "prerequisite": "MUSIC418", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "485", "credits": "3 Credits", "description": "Survey of chamber music for strings, winds, and brass instruments from the mid-16th century to the present day.", "prerequisite": "MUSIC262 , MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "487", "credits": "3 Credits", "description": "Survey of orchestral literature.", "prerequisite": "MUSIC262 , MUSIC331", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "488", "credits": "1-2 Credits", "description": "Selected studies in music literature specific to the student's major performance area.  Will include research, analysis and performance.  MUSIC 488 Studies in the Major Performance Area (1-2) The objective of Music 488 is to create a thorough knowledge of the literature and resources in the students' major performance area. The course will be taught in a seminar format. Students will be grouped according by general performance area: i.e., keyboard, strings, woodwinds, brass, percussion, voice. The course will include lectures, research, class presentations and performance. The course will be offered for variable credit in order to meet varying conditions of scheduling and credit requirements. Specific evaluation methods will be determined by the instructor, to include class presentations, class participation, exams and/or written work."}, {"department": "MUSIC", "number": "489", "credits": "1 Credits/Maximum of 4", "description": "Advanced keyboard accompaniment of student soloists in the studio and in public performance under faculty supervision.", "prerequisite": "MUSIC194 or permission of instructor", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "491", "credits": "1 Credits/Maximum of 4", "description": "Preparation and performance of advanced chamber music.  MUSIC 491 Advanced Chamber Ensemble (1 per semester/maximum of 4) Advanced Chamber Ensemble meets at least two hours per week - once with the instructor for coaching and at least once for an additional rehearsal without the instructor's presence. Course objectives include, but are not limited to, the development of rehearsal and ensemble skills, an increased awareness of musical styles, public performance(s) of works prepared, and the development of the interpersonal skills necessary for the players to operate as a unit. Chamber music is an integral part of instrumental musical training. It is an important partner with conducted ensembles in the performance preparation of musicians. Evaluation of student work is based on participation in rehearsals, the progress made by the ensemble, and the quality of the ensemble's performances. The course is offered during fall and spring semesters.", "prerequisite": "MUSIC190 , MUSIC191 , or equivalent and permission of program"}, {"department": "MUSIC", "number": "493", "credits": "1 Credits/Maximum of 4", "description": "Preparation for performance of advanced sonata literature for various individual instruments with keyboard.", "prerequisite": "MUSIC193 or equivalent; permission of instructor", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "494", "credits": "1-3 Credits/Maximum of 6", "description": "Supervised research leading to senior thesis or project.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "494H", "credits": "1-3 Credits/Maximum of 6", "description": "Supervised research leading to senior thesis or project.", "other": ["Bachelor of Arts: Arts", "Honors"]}, {"department": "MUSIC", "number": "495", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "495A", "credits": "5-7 Credits/Maximum of 7", "description": "MUSIC 495A Student Teaching: General Music (6-8)(BA) This course meets the Bachelor of Arts degree requirements. As required by the Pennsylvania Department of Education, all music education students seeking certification must enroll in a culminating student teaching experience which closely approximates a full-time working experience in the public schools of Pennsylvania. The objective of this course is to offer a transition between student life and professional life directly prior to graduation. This total immersion in the field of GENERAL MUSIC allows the student to learn from and work with a mentor teacher in an off-campus setting. During the semester prior to the course, cooperating music teachers and school districts are contacted requesting their participation and music education students interview with the teachers. The students then move to the community in which they will be student teaching and adopt the practices of that mentor teacher within that specific school district.Students are evaluated by both the mentor teacher and a Penn State supervisor who visits a minimum of four times per semester. This course is offered every semester.", "prerequisite": "completion of all courses in the major with a grade of C or   better; Concurrent: MUSIC442", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "495B", "credits": "5-7 Credits/Maximum of 7", "description": "MUSIC 495B Student Teaching: Choral Music (5-7)(BA) This course meets the Bachelor of Arts degree requirements. As required by the Pennsylvania Department of Education, all music education students seeking certification must enroll in a culminating student teaching experience which closely approximates a full-time working experience in the public schools of Pennsylvania. The objective of this course is to offer a transition between student life and professional life directly prior to graduation. This total immersion in the field of CHORAL MUSIC allows the student to learn from and work with a mentor teacher in an off-campus setting. During the semester prior to the course, cooperating music teachers and school districts are contacted requesting their participation and music education students interview with the teachers. The students then move to the community in which they will be student teaching and adopt the practices of that mentor teacher within that specific school district.Students are evaluated by both the mentor teacher and a Penn State supervisor who visits a minimum of four times per semester. This course is offered every semester.", "prerequisite": "completion of all courses in the major with a grade of C or   better; Concurrent: MUSIC443", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "495C", "credits": "5-7 Credits/Maximum of 7", "description": "MUSIC 495C Student Teaching: Instrumental Music (5-7)(BA) This course meets the Bachelor of Arts degree requirements. As required by the Pennsylvania Department of Education, all music education students seeking certification must enroll in a culminating student teaching experience which closely approximates a full-time working experience in the public schools of Pennsylvania. The objective of this course is to offer a transition between student life and professional life directly prior to graduation. This total immersion in the field of INSTRUMENTAL MUSIC allows the student to learn from and work with a mentor teacher in an off-campus setting. During the semester prior to the course, cooperating music teachers and school districts are contacted requesting their participation and music education students interview with the teachers. The students then move to the community in which they will be student teaching and adopt the practices of that mentor teacher within that specific school district.Students are evaluated by both the mentor teacher and a Penn State supervisor who visits a minimum of four times per semester. This course is offered every semester.", "prerequisite": "completion of all courses in the major with a grade of C or   better; Concurrent: MUSIC444", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "496H", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Arts", "Honors"]}, {"department": "MUSIC", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Arts"]}, {"department": "MUSIC", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]