[{"department": "NUCE", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "NUCE", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "NUCE", "number": "301", "credits": "4 Credits", "description": "Nuclear reactions and interactions relevant to nuclear engineering including fission, cross-sections, reaction rate calculations, energy depositions rates, and radioactive decay. This course is designed to acquaint junior-level undergraduate students with knowledge essential to the reactor physics and nuclear reactor systems. Students will learn nuclear reactions including radioactive decay, fission and fusion, reaction rates, energy deposition rates, various nuclear systems, and introductory diffusion theory.", "prerequisite": "MATH 251"}, {"department": "NUCE", "number": "302", "credits": "4 Credits", "description": "Static and dynamic reactor theory applied to basic reactor design problems.", "prerequisite": "NUCE 301"}, {"department": "NUCE", "number": "309", "credits": "3 Credits", "description": "This course is structured to provide students with the necessary analytical techniques and terminology for radiation science, nuclear reactor design, and power system simulation. Students will be taught the basic mathematical methods needed for such topics as simplified reactor physics, fluid mechanics, heat and mass transfer, control theory, shielding, radiation detection, fission product decay, and risk assessment. The course will cover four general mathematical areas: partial differential equations, linear algebra, systems of ordinary differential equations, and probability and statistics. Linear ordinary differential equations are solved using Reduction to Separable Form, Superposition of Solutions, Laplace Transforms, and Numerical Methods. Linear partial differential equations are solved using Separation of Variables. Linear algebra is used to solve sets of linear equations, Least Squares Fit, and Finite Difference Methods. Eigenvalues and Eigenvectors found for a matrix are used to rotate a function to principle coordinates and to solve systems of ordinary differential equations. Probability and statistics includes sampling, permutations and combinations, binomial, Poisson, hypergeometric, and normal distributions. These statistical methods are then applied to radiation counting statistics.", "prerequisite": "MATH 251"}, {"department": "NUCE", "number": "310W", "credits": "2 Credits", "description": "Societal and technical issues facing nuclear engineers, including safety, operations, waste, regulation, public acceptance, economics, ethics, and radiation.", "prerequisite": "Fifth-semester standing", "other": ["Writing Across the Curriculum"]}, {"department": "NUCE", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "NUCE", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "NUCE", "number": "401", "credits": "3 Credits", "description": "Fundamental concepts of nuclear engineering, including fission, reactor theory, shielding, and radioisotopes; intended for other than nuclear engineering students.", "prerequisite": "MATH 250"}, {"department": "NUCE", "number": "403", "credits": "3 Credits", "description": "Physical principles and computational methods for reactor analysis and design. Multigroup diffusion theory; determination of fast and thermal group constants; cell calculations for heterogeneous core lattices.", "prerequisite": "NUCE 302"}, {"department": "NUCE", "number": "403H", "credits": "3 Credits", "description": "Physical principles and computational methods for reactor analysis and design. Multigroup diffusion theory; determination of fast and thermal group constants; cell calculations for heterogeneous core lattices.", "other": ["Honors"]}, {"department": "NUCE", "number": "405", "credits": "3 Credits", "description": "Theory of radioactive decay processes, nuclear properties and structure, nuclear reactions, interactions of radiation with matter, biological effects of radiation. CHEM 406 Nuclear and Radiochemistry (3) CHEM 406 provides a basic introduction to many of the important physical phenomena in nuclear and radiochemistry and the theories that describe them. The exposition of both experimental phenomena and theory complements the content of other upper-level courses in physical chemistry such as CHEM 450 and 452.Specifically, the types of radioactive decay are described, and, using this information, the equations that relate the growth and decay, i. e., the kinetics, of radioactive nuclei are derived. In parallel, a variety of types of nuclear reactions, such as neutron capture are introduced and used to develop the equations that governing the kinetics of nuclear reactions, including the concept of cross section. To describe the nature of nuclear matter, the relationships between energy, binding energy, and mass, are developed and augmented with the introduction of related quantities including the nuclear magnetic-dipole moment, total angular momentum of the nucleus, and Fermi-Dirac and Bose-Einstein statistics. A basic introduction to quantum mechanics, including several problems of increasing complexity, namely, the one-dimensional particle-in-a-box, the three-dimensional particle-in-a-cubic-box, and the particle-in-a-spherical box is then provided. The latter problem forms the basis for developing the single-particle shell-model of the nucleus, which is compared to the single-particle shell-model of the atom, namely, the hydrogen-atom problem. The barrier-penetration theory of alpha-decay, Fermi's phase-space theory of beta-decay, and the selection rules for gamma-ray decay are then presented. Final topics include the interactions of radiation with matter and the biological effects of radiation.", "prerequisite": "CHEM 452", "other": ["Cross-listed with: CHEM 406"]}, {"department": "NUCE", "number": "406", "credits": "3 Credits", "description": "Statistical description of systems composed of large numbers of particles in the context of classical and quantum mechanics; basic concepts of probability theory and thermodynamics as they relate to statistical mechanics.  M E (NUC E) 406 Introduction to Statistical Thermodynamics (3) This course is an introduction to probabilistic and statistical concepts in the physical sciences, which we refer to as 'statistical thermodynamics.' In areas such as design and processing of electronic devices, materials engineering, chemical engineering, and combustion engineering, the science of statistical mechanics is a particularly necessary, powerful, and important tool for the engineer. The underlying foundation of statistical mechanics is developed by (1) reviewing the basic ideas from probability theory, (2) deriving the binomial, Poisson, and Gaussian probability distributions, and (3) using these models to analyze several examples taken from science and engineering. To make a connection between macroscopic quantities and the corresponding probabilistic representation, classical thermodynamics is reviewed using the internal energy, entropy, and free energy functions in the context of the first and second laws. Statistical mechanics for classical and quantum-mechanical systems is presented via the micro-canonical, canonical, and grand canonical ensembles using the associated partition functions. During the syntheses of ideas, applications from various branches of science are presented. Some examples of applications are the Einstein crystal, the Debye crystal, the ideal gas, and black body radiation.This course covers the following program objectives: 1. Demonstrate knowledge of basic chemistry and physics. 2. Demonstrate a knowledge of atomic and nuclear physics. 3. Demonstrate a knowledge of thermodynamics, heat transfer, and fluid flow. 4. Understand and apply the basic concepts of particle transport. 5, Understand and apply thermodynamics and heat transfer principles to the analysis of nuclear power components and systems.", "prerequisite": "ME 300", "other": ["Cross-listed with: ME 406"]}, {"department": "NUCE", "number": "408", "credits": "3 Credits", "description": "Radiation sources in reactor systems; attenuation of gamma rays and neutrons; point kernel methods; deep penetration theories; Monte Carlo methods.", "prerequisite": "NUCE 301"}, {"department": "NUCE", "number": "409", "credits": "3 Credits", "description": "Nuclear reactor materials: relationship between changes in material properties and microstructural evolution of nuclear cladding and fuel under irradiation.  NUC E (MATSE) 409 Nuclear Materials (3) NUC E/MATSE 409 provides a background on the types of materials used in nuclear reactors and their response to neutron irradiation. Most of the materials problems encountered in the operation of nuclear power reactors for energy production are discussed here. The objective of the course is to give nuclear engineering students a background in materials, so they understand the limitations put on reactor operations and reactor design by materials performance. In the first part of the course, we review basic concepts of physical metallurgy, to develop a mechanistic and microstructurally based view of material properties. In the second part of the course, we present the methods to calculate displacement damage to the material produced by exposure to neutron irradiation. The microstructural evolution that results from the reactor exposure (including radiation damage and defect cluster evolution, and changes) is described. The aim is to create a linkage between these changes at the atomistic level and the changes in macroscopic behavior of the material. Special attention is given to property changes that affect fuel performance and operational safety. Both mathematical methods and experimental techniques are emphasized so that theoretical modeling is instructed by experimental data. Students use the TRIM and SPECTER codes to quantitatively evaluate neutron damage, as well as learn simple analytical models that describe microstructural evolution and property changes under irradiation.", "prerequisite": "PHYS 214", "other": ["Cross-listed with: MATSE 409"]}, {"department": "NUCE", "number": "420", "credits": "3 Credits", "description": "Ionizing radiation, biological effects, radiation measurement, dose computational techniques, local and federal regulations, exposure control.", "prerequisite": "NUCE 301"}, {"department": "NUCE", "number": "428", "credits": "3 Credits", "description": "Nature, sources, and control of radioactive wastes; theory and practice of disposal processes.", "prerequisite": "NUCE 301"}, {"department": "NUCE", "number": "430", "credits": "3 Credits", "description": "Nuclear power cycles; heat removal problems; kinetic behavior of nuclear systems; material and structural design problems.  NUC E 430 Design Principles of Reactor Systems (3) This course is designed to provide students in Nuclear Engineering with sufficient background to (a) understand the design of nuclear power reactors, how they work and why, (b) understand and apply design criteria which determine the power level and system efficiency in power reactor cores, (c) become familiar with and understand appropriate power reactor terminology and use, (d) learn how to perform thermal/hydraulic analysis for various reactor operation conditions, (e) learn the different accident classifications and reactor operating limits, and (f) become familiar with basic concepts on the analysis of two-phase flow.", "prerequisite": "NUCE 302"}, {"department": "NUCE", "number": "431W", "credits": "4 Credits", "description": "Technical and economic optimization of nuclear systems.  NUC E 431W Nuclear Reactor Core Design Synthesis (4) This course provides a capstone design experience that will give the student an understanding of the design methodology and considerations applied to systems or components used in nuclear power reactors and/or in nuclear science. Students will learn design principles, understand and apply design criteria to create a synthesized design product, become familiar with and understand appropriate technical and design terminology and its use, and learn how to prepare technical reports and make technical presentations.", "prerequisite": "NUCE 403", "other": ["Writing Across the Curriculum"]}, {"department": "NUCE", "number": "441", "credits": "3 Credits", "description": "Nuclear threat assessment and analysis for non-state actors to nuclear and radiological facilities and supply lines.  NUC E 441 Nuclear Security Threat Analysis and Assessments (3) The primary goal of this course is to educate the student in such a manner that on completion they are able to conduct a threat assessment and analysis for non-state actors (i.e., terrorist and criminal organizations) and the threat which they present to nuclear and radiological facilities and supply lines. Approaching the subject matter in this way forces a student to efficiently and effectively identify security threats and ultimately craft and articulate plausible policy responses to such threats. Specifically, students will focus on threats emanating from nuclear weapons, radiological material, and related technology. After completing this course, the student should be able to:- Analyze current and future nuclear threats from countries and nonstate or sub-state actors and provide recommendations on how to address these security issues.- Define and analyze the various types of transnational threats and targets in order to craft effective policy responses.- Describe nuclear weapons proliferation, including incentives and disincentives for proliferation.- Analyze smuggling methods and counter-proliferation strategies.- Identify materials of concern and the physical characteristics of these materials. Also prioritize these materials based on their attractiveness, location, and the threat they pose.- Understand the history of terrorism, including its causes, motivations, strategies, and tactics, particularly regarding nuclear terrorism.- Explain counterterrorism strategies and policies and the role of intelligence in counterterrorism, with a particular emphasis on the efforts of the United States Government.", "prerequisite": "NUCE 301"}, {"department": "NUCE", "number": "442", "credits": "3 Credits", "description": "Science and engineering associated with the design, evaluation, and implementation of systems to secure nuclear and radiological materials.  NUC E 442 Nuclear Security System Design (3) The primary goal of this course is to educate the student to think with a security perspective such that they can design and evaluate systems to deter, detect, interdict, and respond to threats to the security of nuclear and radiological materials. After completing this course, the student should be able to: -Analyze motivations and capabilities of adversaries (terrorists, criminal groups, protesters, etc.) and be able to characterize a Design Basis Threat (DBT) that can be used to perform a threat-informed security evaluation. -Describe and explain the operation of detection, delay, and response technologies. Understand how to complete a performance evaluation of these technologies. -Evaluate insider threats to nuclear and radiological facilities and incorporate the insider threat in a DBT. -Formulate different response strategies (including deterrence, denial, containment, pursuit, and recapture) for different facilities and considering on-site and/or off-site response. -Use nuclear or radiological material facility characteristics and a DBT to design a performance-based security system for a facility that will be threat-informed, provide defense in depth, and achieve balanced protection while minimizing risk to an acceptable level. -Apply engineering principles to produce a cost benefit analysis for upgrade options for an existing nuclear facility. -Understand the unique security characteristics associated with transportation of nuclear materials, smuggling of nuclear materials, and protection of major public events and be able to apply a risk- and performance-based engineering approach to security systems for these scenarios. -Understand nuclear forensics as a component of a nuclear security system and be able to use nuclear forensics interpretation of measured data to predict infer actor involvement in a nuclear security incident. -Discuss and critique the deterrence characteristics of nuclear security systems.", "prerequisite": "NUCE 302"}, {"department": "NUCE", "number": "446", "credits": "3 Credits", "description": "Introduction to reliability mathematics. Failure data collection and analysis. Components and systems reliability prediction. Effects of maintenance on reliability. Risk Analysis. Case studies in engineering applications. ME 446 / NUCE 446 Reliability and Risk Concepts in Design (3) The course covers materials reliability in design including mechanical, electrical and system aspects. Five main topics will be studied. The course starts by introducing engineering risk and reliability, highlighting its interdisciplinary nature and its significance in system design. The concept of reliability as a probability is introduced and the basic laws of probability are reviewed. The discussion centers on the mathematics needed to understand and analyze complex systems including components in series and parallel. The topics include the independence, mutual exclusivity, truth tables and Venn diagrams. These concepts are then applied to simple systems consisting of one, two and three components in various configurations. The equivalency of the various methods is discussed. The effect of maintenance on a system's reliability is presented along with discussions of various maintenance strategies. Then, the failure modes and effects analysis is introduced and examples discussed. The concept of fault trees and event trees and their application to reliability analysis are presented. Risk analysis is then introduced as a case study in the application of reliability analysis. A nuclear power plant system is analyzed to quantify the risk to the public from its operation.", "prerequisite": "MATH 250", "other": ["Cross-listed with: ME 446"]}, {"department": "NUCE", "number": "450", "credits": "3 Credits", "description": "Theory and laboratory applications of radiation detectors, including proton, neutron, charged particle detectors, NIM devices, and pulse-height analysis.", "prerequisite": "NUCE 301"}, {"department": "NUCE", "number": "451", "credits": "3 Credits", "description": "Acquisition and processing of nuclear and atomic data; application to nucleonic phenomena of importance in nuclear engineering.", "prerequisite": "EE 212"}, {"department": "NUCE", "number": "470", "credits": "3 Credits", "description": "Basic knowledge necessary for intelligent simulation and interpretation of simulations of transients in nuclear power plants.", "prerequisite": "ME 320"}, {"department": "NUCE", "number": "490", "credits": "3 Credits", "description": "This course provides the education on models that are used for description of plasma phenomena as applicable to plasma confinement, plasma assisted materials processing, astrophysical plasmas and plasmas in the near Earth's space environment. It provides practical training in solution of problems involving collisional and collisionless plasmas. In particular, it investigates dynamics of charged particles in specified uniform, non-uniform and time varying electric and magnetic fields. It explores collective behavior of plasmas, including various electrostatic and electromagnetic waves that can be excited and propagate in plasmas parallel and perpendicular to the externally applied magnetic field. The course considers non-linear effects in plasmas, as typically occurring in the sheath regions near the plasma confining walls. It discusses concepts of equilibrium and stability of plasmas, and various models of unstable plasma motions, especially in relation to plasma confinement.", "prerequisite": "EE 330", "other": ["Cross-listed with: AERSP 490, EE 471"]}, {"department": "NUCE", "number": "494", "credits": "1-9 Credits/Maximum of 9", "description": "Students must have approval of a thesis adviser before scheduling this course.  NUC E 494H Senior Thesis (1-9) All Schreyer Scholars are required to complete an undergraduate honors thesis. This work represents the culmination of a student's honors experience. Through the thesis, the student demonstrates a command of relevant scholastic work and a personal contribution to that scholarship.The thesis project can take many forms - from laboratory experiments all the way to artistic creations. The thesis document captures the relevant background, methods and techniques, as well as describing the details of the completion of the individual project. Two Penn State faculty members judge the merits of this Scholar's honors thesis, the student's self-selected thesis supervisor and the department-selected honors adviser in the student's area of honors.", "prerequisite": "Junior or senior status in the University Scholars Program", "other": ["Honors"]}, {"department": "NUCE", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "NUCE", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "NUCE", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}]