[{"department": "PLSC", "number": "1", "credits": "3 Credits", "description": "This course examines the American democracy by looking at the dynamic interaction between the founding ideals of the United States government, the institutions established by the Constitution, and the ongoing contest for power within and through those institutions. Students will learn how Congress, the Presidency and the Supreme Court shape law and public policy; how the electoral process influences the decisions of voters and political parties; and how the media, interest groups, political action committees, and public opinion impact political outcomes. Through these topics the course takes up questions such as, Who has a voice in American politics and why are some political actors more influential than others? Do the electoral and policy making processes uphold democratic values? How responsive is the United States government to public wants? How does the media influence citizens' political preferences and behavior? The course both provides a foundation for further study of politics and equips students with the capacity to act politically on their own behalf and in concert with their communities. Students are empowered to interpret and pursue their interests, rights, and opportunities within the US political system in relation to the values of democratic equality and liberty the system was organized to secure, and to influence the process through which policies that shape their lives in critical ways are made.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "1H", "credits": "3 Credits", "description": "This course examines the American democracy by looking at the dynamic interaction between the founding ideals of the United States government, the institutions established by the Constitution, and the ongoing contest for power within and through those institutions. Students will learn how Congress, the Presidency and the Supreme Court shape law and public policy; how the electoral process influences the decisions of voters and political parties; and how the media, interest groups, political action committees, and public opinion impact political outcomes. Through these topics the course takes up questions such as, Who has a voice in American politics and why are some political actors more influential than others? Do the electoral and policy making processes uphold democratic values? How responsive is the United States government to public wants? How does the media influence citizens¿ political preferences and behavior? The course both provides a foundation for further study of politics and equips students with the capacity to act politically on their own behalf and in concert with their communities. Students are empowered to interpret and pursue their interests, rights, and opportunities within the US political system in relation to the values of democratic equality and liberty the system was organized to secure, and to influence the process through which policies that shape their lives in critical ways are made. The course supports honors students in their progress toward independent research by focusing on what political scientists studying American politics do, the types of questions they ask, and the methods they employ to answer those questions. Engagement with scholarly literature prepares students to draw on existing research to frame their own research questions about American politics.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "1S", "credits": "3 Credits", "description": "This course examines the American democracy by looking at the dynamic interaction between the founding ideals of the United States government, the institutions established by the Constitution, and the ongoing contest for power within and through those institutions. Students will learn how Congress, the Presidency and the Supreme Court shape law and public policy; how the electoral process influences the decisions of voters and political parties; and how the media, interest groups, political action committees, and public opinion impact political outcomes. Through these topics the course takes up questions such as, Who has a voice in American politics and why are some political actors more influential than others? Do the electoral and policy making processes uphold democratic values? How responsive is the United States government to public wants? How does the media influence citizens' political preferences and behavior? The course both provides a foundation for further study of politics and equips students with the capacity to act politically on their own behalf and in concert with their communities. Students are empowered to interpret and pursue their interests, rights, and opportunities within the US political system in relation to the values of democratic equality and liberty the system was organized to secure, and to influence the process through which policies that shape their lives in critical ways are made. As part of First Year Seminar requirements, students will receive brief research assignments to learn how to use library and online resources and will participated in required advising sessions to learn about Penn State degree requirements, career exploration, internships, Penn State study abroad programs, study skills, and the variety of subfields and research interests in political science.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "3", "credits": "3 Credits", "description": "This course examines the variety of ways that people seek and wield power around the world. Through cross national comparison and individual country analysis, the course considers different forms of democratic and authoritarian regimes, sources of stability and change in different regime types, and the relationship between cultural, economic, and social factors and political processes. Students are introduced to the central questions in comparative politics, including What is the state and where did it come from? What is democracy? Why are some countries democracies whereas others are dictatorships? Does the kind of regime a country has affect the prosperity and well-being of its citizens? Why are ethnic groups politicized in some countries but not in others? Why do some countries have many parties whereas some have only a few? How do governments form, and what determines the type of government that takes office? What are the material and normative implications associated with different types of government? The course examines competing answers to questions such as these and evaluates the explanations for their logical consistency and empirical accuracy. Students learn to compare political phenomena across disparate contexts and how to use such comparisons to test claims about the political world. In doing so, they learn about the similarities and differences among countries and a range of approaches to analyzing the political world.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "3H", "credits": "3 Credits", "description": "This course examines the variety of ways that people seek and wield power around the world. Through cross national comparison and individual country analysis, the course considers different forms of democratic and authoritarian regimes, sources of stability and change in different regime types, and the relationship between cultural, economic, and social factors and political processes. Students are introduced to the central questions in comparative politics, including What is the state and where did it come from? What is democracy? Why are some countries democracies whereas others are dictatorships? Does the kind of regime a country has affect the prosperity and well-being of its citizens? Why are ethnic groups politicized in some countries but not in others? Why do some countries have many parties whereas some have only a few? How do governments form, and what determines the type of government that takes office? What are the material and normative implications associated with different types of government? The course examines competing answers to questions such as these and evaluates the explanations for their logical consistency and empirical accuracy. Students learn to compare political phenomena across disparate contexts and how to use such comparisons to test claims about the political world. In doing so, they learn about the similarities and differences among countries and a range of approaches to analyzing the political world. The course supports honors students in their progress toward independent research by focusing on what political scientists studying Comparative Politics do, the types of questions they ask, and the methods they employ to answer those questions, including game theory and statistical analysis. Engagement with scholarly literature prepares students to draw on existing research to frame their own research questions about Comparative Politics.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "7N", "credits": "3 Credits", "description": "This course provides a comparative analysis of the beliefs, values and ideas that constitute the major political ideologies in contemporary politics, such as liberalism, conservatism, socialism, anarchism, fascism and environmentalism. The course focuses on ideologies as traditions of thought developed through contentious political action with attention both to the unique features of each ideology and the ways that they overlap in theory and practice. It considers what ideologies are, what they do, and how we can study them. Each ideology is examined with respect to its historical origin; the major ideas, thinkers, events and political activists associated with its genesis; and how it has developed and changed in response to new circumstances. Students learn to think about ideologies as distinct from parties, regimes and political actors, and to establish criteria for classifying them in order to observe their influence on and through political action and organization. As the belief systems that underlie or justify political action, ideologies include views about human nature, history, and the scope and purpose of government. Ideologies implicitly or explicitly suggest an ideal form of socio-political organization that articulates who owes what to whom and establishes criteria for evaluating the status quo. The course will investigate how different ideologies understand the political community, the role of government, access to knowledge, institutional legitimacy and change. Students will learn to identify the value commitments various ideologies entail, as well as how those values shape the perception of political problems and the actions they necessitate.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "10", "credits": "3 Credits", "description": "This course introduces students to both the scientific study of politics, and the way that a scientific approach to political phenomena advances our understanding of political actors, events, processes, and institutions. It provides information about the elements of scientific reasoning, and introduces systematic approaches to studying politics through the lens of important puzzles and questions about international relations, comparative politics, and American politics. Students learn about relevant data sources, as well as how to interpret data appearing in graphs and tables. The course consists of three parts. The first part of the course offers an overview of the elements of scientific inquiry including causal explanation, empirical verification, theories and hypotheses, and dependent and independent variables. The second part of the course examines dominant approaches to studying politics, including experiments; observational methods such as surveys and elite interviewing; formal models; archival research; and computational methods such as text analysis. Each approach will be presented using a similar format. Students will be introduced to the approach through a combination of lectures and assigned readings. They will then look at and learn about data sources suited to and consider questions or puzzles that can be addressed by each approach. Careers that make use of the analytic skills associated with each approach also will be discussed. The final part of the course considers the benefits of scientific approaches over less systematic analysis and the challenges inherent in trying to explain complex political behavior, institutions, and events. By the end of the course, students will understand what it means to \"do\" political science: i.e., to ask questions about political phenomena, form theories related to those questions, collect data, pick an approach to analyze the data, and draw inferences from the analysis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "PLSC", "number": "14", "credits": "3 Credits", "description": "What causes war and what makes it stop? When is international aid or military intervention effective? Why are some states wealthy and others plagued by poverty and underdevelopment? How does international trade affect developing countries? What can and should states do to protect human rights around the world? This course provides students with the background and conceptual tools to answer these and similar questions. It teaches students to think systematically about the complex relationships that constitute world politics and to critically engage prevailing academic and policy arguments about global affairs. Students are introduced to the international political system as the arena in which states develop foreign policies of cooperation and competition to pursue power, enhance security and develop economically. They explore how various non-state actors (NGOs, social movements, corporations) and international governmental organizations (UN, IMF, World Bank, WHO) influence interactions among states and between states and their citizens in matters such as interstate and civil wars, terrorism, ethnic conflict, human rights, inequality, global trade, resource scarcity and climate change.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "14H", "credits": "3 Credits", "description": "What causes war and what makes it stop? When is international aid or military intervention effective? Why are some states wealthy and others plagued by poverty and underdevelopment? How does international trade affect developing countries? What can and should states do to protect human rights around the world? This course provides students with the background and conceptual tools to answer these and similar questions. It teaches students to think systematically about the complex relationships that constitute world politics and to critically engage prevailing academic and policy arguments about global affairs. Students are introduced to the international political system as the arena in which states develop foreign policies of cooperation and competition with other states to pursue power, enhance security and develop economically. They explore how various non-state actors (NGOs, social movements, corporations) and international governmental organizations (UN, IMF, World Bank, WHO) influence interactions among states and between states and their citizens in matters such as interstate and civil wars, terrorism, ethnic conflict, human rights, inequality, global trade, resource scarcity and climate change. The course supports honors students in their progress toward independent research by focusing on what political scientists studying International Relations do, the types of questions they ask, and the methods they employ to answer those questions, including game theory, statistical analysis and historical and contemporary case studies. Engagement with scholarly literature prepares student to draw on existing research to frame their own research questions about international relations.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "17N", "credits": "3 Credits", "description": "This course focuses on the concepts, principles and values used to explain, justify and challenge the organization and use of collective power. It introduces the field of political theory as an intellectual tradition that combines reflection on what political life is and what it should accomplish with investigation of the values manifest through existing political institutions and how those institutions can be best organized to achieve desired outcomes. Through analysis of selected works of major thinkers, beginning with the Ancient Greeks and extending through the contemporary period, students consider questions and problems that philosophers, political leaders and citizens have grappled with for millennia: What is a political community? What is justice? Who is included in the realm of justice? What is the best form of government? What do I owe to the state? What does the state owe to me? What is the proper purpose and scope of government? Students learn to critically engage arguments in canonical texts to understand both how they contributed to debates in their own time and how subsequent theorists and activists have interpreted them to articulate and challenge various forms of exclusion and oppression. Ultimately, students are invited to see political theory as a conversation across time to clarify concepts that are fundamental to the study and practice of politics yet remain contested, such as freedom, equality, democracy and justice, and to distinguish between the legitimate purposes of government and the arbitrary use of power. Through the course students will learn to employ and evaluate political concepts with care and precision so they can participate in that conversation productively as democratic citizens as well as in further study of political theory. Students may not get credit for both PLSC 17N and PLSC 17W", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "17W", "credits": "3 Credits", "description": "This WAC course focuses on the concepts, principles and values used to explain, justify and challenge the organization and use of collective power. It introduces the field of political theory as an intellectual tradition that combines reflection on what political life is and what it should accomplish with investigation of the values manifest through existing political institutions and how those institutions can be best organized to achieve desired outcomes. Through analysis of selected works of major thinkers, beginning with the Ancient Greeks and extending through the contemporary period, students consider questions and problems that philosophers, political leaders and citizens have grappled with for millennia: What is a political community? What is justice? Who is included in the realm of justice? What is the best form of government? What do I owe to the state? What does the state owe to me? What is the proper purpose and scope of government? Students learn to critically engage arguments in canonical texts to understand both how they contributed to debates in their own time and how subsequent theorists and activists have interpreted them to articulate and challenge various forms of exclusion and oppression. Ultimately, students are invited to see political theory as a conversation across time to clarify concepts that are fundamental to the study and practice of politics yet remain contested, such as freedom, equality, democracy and justice, and to distinguish between the legitimate purposes of government and the arbitrary use of power. Through the course students will learn to employ and evaluate political concepts with care and precision so they can participate in that conversation productively as democratic citizens as well as in further study of political theory. Students may not get credit for both PLSC 17N and PLSC 17W", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "60N", "credits": "3 Credits", "description": "Israel is often portrayed in media and popular society in incomplete or distorted terms. In some cases, it is presented as a troubled, violent, dangerous place, as a place permeated by long-standing hatred between Jews and Muslims, Israelis and Arabs, Israelis and Palestinians. In others, the focus is on the state's role as the center of Judsiam--a home of the \"chosen people\" and the source of inspiration for one of the world's great monotheistic religions. Some present it as a model for how a democracy can succeed under trying demographic, historic, and geopolitical circumstances. Others frame Israel as a place of conflagration (armageddon) that will usher in a messianic period or as a nation-state with a discriminatory regime that privileges its majority population over its minority and administers oppressive policies over Palestinians in the occupied territories it captured in the 1967 War. While there are elements of truth in each of these presentations, the full picture of Israeli society is much richer and more complex. This course teaches students to cut through the mythology, and develop a more accurate understanding of what Israel is in the 21st century. Since Israel is a culturally, ethnically, and religiously diverse society, it is only possible to understand the true nature of modern Israel through exploring the many sub-groups that comprise the Israeli citizenry. The course looks at Ashkenazi and Mizrahi Jews (both religious and secular), Muslim and Christian Palestinian Arab citizens of Israel, Ethiopian-Israelis, Russian-Israelis, Bedouins, and Druze. For each group, it looks at demographics, background histories, migration patterns, institutions, cultural norms, values, and practices. We will look at what is important to each group, how they see and organize themselves, and how they understand and experience the world around them. The course aims to convey an understanding of the geographic, demographic, and social-historical context in which Israelis live as well as the diversity of Israeli culture. Students will be challenged to be critical readers of Israeli society and the way it is represented and to strive for measured, evidence-based analyses.", "other": ["Cross-listed with: ANTH 60N, JST 60N, SOC 60N", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "83S", "credits": "3 Credits", "description": "Exploration of current topics of interest in political science, international relations, and/or political theory. Every first-year seminar in Political Science focuses on several of the major questions of the field. Many of these questions concern the constitutional arrangements of governments: What is it that we want governments to do, and what is the ideal government arrangement? Why does every nation (and every state and city) have somewhat different constitutional provisions for legislation, judicial, military and executive functions of government? What can we learn from careful comparisons of different types of government? What is unique to the American system and what are the consequences of this uniqueness? Other questions concern power: To what extent do wealthy individuals and wealthy organizations have disproportionate power in society? Is this appropriate or not? What is the impact of governmental attempts to limit the influence of the wealthy? We are also very much interested in the international system: What types of foreign policies and diplomatic strategies reduce the likelihood of war? What is the role of international organizations (such as the UN or World Bank) and multinational corporations in shaping conflicts between nations? Finally, we are interested in ordinary citizens: Do citizens know enough to formulate rational opinions on public issues? Why are many citizens apathetic? What motivates citizens to support one candidate over another or to favor particular policies and philosophies? Each first-year seminar will select a special topic of interest and use that topic to explore a subset of these questions in order to provide a challenging introduction to political science. In the course of doing so, each first-year seminar in political science will also introduce students to specialized materials (such as government documents), library resources, and appropriate electronic media. In addition, each seminar will emphasize the standards of evidence, logic, and critical thinking required to develop effective and persuasive reports and oral presentations. Students will write essay exams and one or more written reports on the relevant topic of their own choices. Class participation is required. The course fulfills both a first-year seminar and a general education or Bachelor of Arts social/behavioral science requirement. The course will be offered three times per year with a maximum of 20 seats per offering. In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them, including the opportunity to develop relationships with faculty and other students who share their academic interests.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "PLSC", "number": "90", "credits": "3 Credits", "description": "The study of security issues is more critical than ever, considering a series of global trends. Those reach from violent radicalization to arctic transformation, as well as include technology trends. All of those have an impact on security in our daily lives, in the public sector, and in the private sector. Together, both states and individuals are confronted with many pressing and often competing local, national, and global security challenges that demand thoughtful responses and solutions. Particularly challenging is the need to put in place security measures while ensuring that they do not infringe on the values they aim to protect. The multifaceted security crises of our time is rooted in a broad spectrum of hazards. It among other things stretches across lone wolf terrorists, natural disasters, public health emergencies, transnational organized crime, and cyber attacks; and it includes global counterterrorism, counterproliferation, and environmental change. All of those represent significant problems facing our world today. At the same time, they provide opportunities for us to bring about changes that will significantly increase the ongoing quality of life around the world. In order to do so, it is essential to develop analytical skills for risk assessment, policy analysis and strategy development. Critical thinking skills are also crucial since we need to be able to identify security gaps, unreasonable securitization trends, and point out fallacies of reasoning and misrepresentation of facts that may occur when responding to security threats. In this course, we will review the historical evolution of security studies, national and international security policies and strategies, human security and security management in business and industry. Further, in the rapidly changing world of security studies, it is important to understand the critical differences between concepts like strategic security, counterterrorism, protection, intelligence, homeland security, criminal justice, conflict studies, emergency management, threat assessment, human security, crisis management, disaster management, and related terms. Based on this, students will learn how security issues relate to their chosen academic discipline and professional goals. Using real-world examples, students will develop understanding of the academic, historical, and technological evolutions that gave rise to the field of security studies, and go in-depth to examine the main areas in which security strategists, analysts, and practitioners work.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "111", "credits": "3 Credits", "description": "Students will become acquainted with a variety of political theories and debate their usefulness in considering contemporary political controversies in the US. and another country. PLSC 111 Debating the Purpose of Government (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. Although governments must always attend to urgent matters that cannot be put off, government attention is, and perhaps should be, directed as well toward matters that are of fundamental importance. However, there is substantial disagreement about what those matters are. In this course, through brief summarizing readings and through lectures, students will encounter the arguments of various political philosophers making the case that one or another purpose is most essential to government. Among the candidates for the status of primary purpose of government will be civic and moral education, the defense of life and property, the dismantling of the economic foundations of inequality, and the institution of justice in accordance with universal moral principles. The compatibility of the various conceptions of the purpose of government with the experiences and aspirations of women will receive special attention. After a brief exposure to each perspective, teams of two students each will research and debate the pros and and cons of each perspective in light of what it can contribute to our understanding of contemporary political events and controversies (if there are more than twenty- six students enrolled, some time will be taken from lectures to accommodate debates). Each student will take a turn as debater and a turn at researching, composing, and organizing the content of the team's opening statement. Approximately twenty minutes after each debate will be allocated to questions and comments from students who were not part of either team that day.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "112N", "credits": "3 Credits", "description": "This course meets the Bachelor of Arts degree requirements. It is often said that politics is a dirty business, meaning that unethical behavior is prevalent in politics. But this is often said with a twinge of disappointment, sometimes with bitterness or anger. We wish that it were not so. One part of an effort to improve the ethical character of politics is to strive for a clear understanding of what ethical political action is. This course endeavors to arrive at that understanding by considering some of the most profound and influential ways of understanding ethical action. One example is that which is derived from Aristotle and supplemented by Martha Nussbaum. Another example is that which is derived from the writings of Immanuel Kant. We will use perspectives written at this level of generality in the analysis of detailed case studies of ethical choices made by citizens, government employees, and elected officials.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "114Z", "credits": "3 Credits/Maximum of 3", "description": "The purposes of this course are to introduce students to the comparative study of political systems, some of their parts, and the functioning of those parts, and to develop a capacity for effective, ethical citizenship. Real-world attempts to convince various audiences will be analyzed with respect to their appeals to the emotions of their respective audiences, often through framing the candidacy or policy under consideration in ways intended to stimulate fear, hope, or anxiety in order to command the attention of audiences. The use of words, other symbols, and non-verbal stimuli with strong emotional and normative content will be highlighted. The class will also evaluate efforts to establish credibility with audiences through references to endorsements, demonstrations or claims of expertise, goodwill, and good sense. Lastly, the logical validity of inferences and deductions made in the attempts to convince will be considered so that flattery, manipulation, bargaining, deception, and intimidation can be distinguished from genuine persuasion. Materials presented in Philosophy 10 (GH), \"Critical Thinking,\" to which PLSC 114 is linked, will provide students with the tools to do this. So that students might see how characterizations of attempts to convince might be placed into a provisional context, the study is comparative. It will look at attempts in the U.S. as well as some other country. In general, so that the attempts at winning over audiences might be as comparable and as comprehensible as possible, the issue should be as similar as possible and the other country should be Anglophone. Although systems of elections and governance and controversial issues inevitably vary within and between countries, it is possible to find elections and policy controversies with sufficient similarities to make cross-national comparisons of attempts at convincing their respective audiences a fruitful exercise. For example, one might build the course around the televised debates and campaign ads for the mayoral elections in Vancouver and Seattle and the efforts to generate support and opposition to oil pipelines in the two countries. By looking at the different strategies used in attempts to convince elites, the citizenry and parts of the citizenry in the two countries, it is possible to raise questions about the workings of the political systems in the two countries. Specifically, students can examine some of the ways that historical geopolitical, constitutional, economic, and demographic differences between and within the two countries are manifested in the political processes of the two countries. By leading students to consider such questions, this course can induce them to undertake further study that will equip them with the methodological tools to investigate these issues in greater depth. Moreover, by providing students with the basic outlines of well-supported valid inference and challenging them to detect of the most common informal fallacies in efforts to convince and create an outline for their own attempt at political persuasion, PLSC 114 (GS) will help build capabilities that are necessary for responsible and effective and ethical citizenship.", "other": ["General Education: Social and Behavioral Scien (GS)", "General Education - Integrative: Linked", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "120N", "credits": "3 Credits", "description": "Alexis de Tocqueville called association the ¿mother science¿ of politics and saw voluntary associations as a pillar of American democracy. These associations must compete in what might be called a moral economy of public policy that preserves the value of equality. This course brings together ideas from political philosophy, history, political science, communication, sociology and economics to address an important question: How have voluntary, nongovernmental associations come to shape and implement public policy? The class begins with the core concepts in political thought and traces them through to contemporary ideas about civil society that span the political spectrum. After critically assessing these ideas, we integrate them into a framework for understanding the process of making public policy.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "125", "credits": "3 Credits", "description": "Pennsylvania political processes; executive, legislative, judicial decision- making, and electoral behavior; selected public policies.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "132", "credits": "3 Credits", "description": "Introductory course emphasizing psychological, historical, and political aspects of global intolerance towards minorities. PLSC 132 The Politics of International Intolerance (3) (GS;IL)(BA) This course meets the Bachelor of Arts degree requirements. PLSC 132 is an introductory survey concerning the social phenomenon of \"intolerance\" i. e., attitudes or behaviors that seek to exclude or eliminate groups perceived to be different. Here \"differences\" encompasses such features as nationality, belief, race, gender, or sexual orientation. Often these aspects of the human condition are the targets of majority discrimination or collective violence.The course presumes the following assumptions: (1) Intolerant attitudes are not just \"another point of view\" but also an utterly destructive form of behavior inimical to civilized values. (2) Few, if any, societies have existed without some forms of intolerance. (3) The causes of intolerance are usually multi-causal (economic, political, and psychological) and are understood through social science. (4) \"Politics\" implies both the ideology and organization of intolerant movements and the relation of such movements to public authorities.Students should expect fairly extensive readings involving primary source material, analyses of intolerant behavior drawn from different disciplines, and comparison of intolerance phenomena from a global perspective.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning"]}, {"department": "PLSC", "number": "140", "credits": "3 Credits", "description": "An overview of contemporary topics in international relations.  PLSC 140 Contemporary Controversies in International Relations (3) (GS)  PLSC 140 investigates changes in the international system by focusing on critical ongoing situations. After a brief introduction to key theories international relations, including the concept of one state as a dominant or hegemonic power, we will cover a range of related topics such as drug trafficking, international terrorism, international trade, nuclear weapons proliferation and the role of international organizations such as the United Nations and MF and World Bank.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "155", "credits": "3 Credits", "description": "Exploration of the rationales, methods, and consequences of highly repressive political regimes through novels, films, and memoirs.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "177N", "credits": "1-3 Credits", "description": "The course centers on a Spring Break trip to Washington DC, with students meeting on campus before and after the trip. PLSC 177N Politics and Government in Washington DC (1-3) This course centers on a Spring Break trip to Washington DC, where students will meet with their members of Congress, get briefings at foreign embassies and international organizations, meet with leaders of federal government agencies, participate in seminars led by interest groups and political party officials and consultants, and tour government offices and facilities. The class will meet before the trip to discuss the history, culture, and context of politics and government in the capital city of the United States and will continue to meet after the trip so that students can analyze what they have learned about politics and government in Washington as a result of their experiences during the trip. The course is open to and appropriate for students in all majors.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "178", "credits": "3 Credits", "description": "This course will address laws, politics, and policies related to organized crime issues.  PL SC 178 Organized Crime, Law, and Politics (3) This course addresses the role and impact of organized crime in US laws, politics, and policies over the past century, with particular attention to modern organized crime groups. The course will look at how organized crime syndicates influenced and often cooperated with some political leaders and law enforcement agencies in the twentieth century, while other political leaders became famous for prosecutions of organized crime figures. Modern legal tools in the fight against organized crime will be discussed, such as RICO and witness protection programs. And the course will look at many examples of modern organized crime groups that originated in Europe, Asia, or Latin America, but which now have an impact on US society, and the policies that attempt to limit the influence of modern organized crime. Included in the examination of modern organized crime will be the connection to modern terrorist activities."}, {"department": "PLSC", "number": "183N", "credits": "3 Credits", "description": "The course will focus on the history and politics of the Cold War and its depiction in literature and film, especially in British and American literature, but also in that of other countries. Students will read political science and history texts, novels, short stories, and poetry, and view films. Students will analyze the reasons that the Cold War has been and continues to be a major inspiration for literary production and a transformative influence on literary style. Students will be encouraged to explore alternative methodologies for research on cold war topics including the use of primary sources, for ex. documents from the intelligence community archives that have since been declassified. In addition to a class field trip, students will be encouraged to make additional site visits to appropriate institutions in U.S. intelligence history. They'll be making a series of visits to relevant sites.", "other": ["Cross-listed with: ENGL 183N", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "200N", "credits": "3 Credits", "description": "This course introduces students to the politics and governing institutions of European countries through an historical and comparative perspective. It examines the development of the political systems in Europe during the 20th Century by applying the tools of political science to significant historical events, such as the rise of Nazism, transitions to democracy in Southern Europe, and the collapse of state socialism in Eastern Europe. Students will learn the structure, rules and key actors in different contemporary systems across Europe and in the European Union. They will explore how the design of democratic institutions impacts political representation and a government's accountability to citizens. They will discuss theories of voting, the development of the party system, and non-electoral politics such as protest and social movements. Cross national comparisons enable students to understand differences in voting patterns, types and consequences of collective action, social and economic policy, orientation toward Europe, and business and legal environments among European countries as well as to see the political issues that are relevant to Europe as a whole. The course is a good choice for any student preparing to live and work in a globally interconnected world. It will be particularly appealing to students interested in the organization, development and breakdown of democratic systems and politics -- including US politics as a fruitful point of comparison. For majors, the specific focus on the European context is an effective follow up to PLSC 3, PLSC 14 or PLSC 7.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "201N", "credits": "3 Credits", "description": "Exposes students to the relationship between religion and politics around the world and examines trends in the influence of religion and religious parties on governments and public policy. The relationship and trends will be informed by multiple perspectives from political science, sociology, philosophy, and religion. Students will familiarize themselves with the basic tenets, historical backgrounds, and comparative differences of the main religions that are involved in the political conflicts that will be examined in the course. Students will first examine the principles and values of Christianity (Catholic, Protestant, and Orthodox); Islam; Judaism; Hinduism; and Buddhism. The different religions will be discussed in terms of their beliefs as well as their function in national identities. Discussion of religion will also examine secular critique of religion, from the Enlightenment and the French Revolution to the present. This will include a comparative look at the ways in which science and rational thought have challenged religions' place in different societies and how religions have sought to counter this challenge. Students will then examine political parties, movements, and actors and their role in affecting public policies in different countries in the twentieth and twenty-first centuries. Students will analyze instances where religious disagreements led to internal policy clashes between members of the same religion as well as conflicts between adherents of different religions within the same country. The power of religious parties' and their secular political rivals will be a central part of this discussion. Students will explore instances in a variety of countries, including but not limited to Turkey, Israel, India, Myanmar, Latin America, France, Eastern Europe, and the United States. These examples will serve to elucidate clashes between religious and secular powers within different countries and between majority and minority religions. The discussion will also include the topic of how religion affects policies concerned with gender equality.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "202", "credits": "3 Credits", "description": "This course will examine how policy decisions are made in American politics, including factors that affect policy choices, the policymaking process, and evaluation of existing policies. Instructors will choose several different policy areas for more in depth discussion and analysis of current policies and policy choices. Possible areas of focus include economic and budgetary policies; social welfare policies; environmental and energy policies; civil liberties and civil rights policies; criminal justice policies; education policies; food, drug, and agriculture policies; labor policies; medical and technological policies; regulatory policies; health care policies; security policies; and trade policies.", "prerequisite": "PLSC 1", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "209", "credits": "1 Credits", "description": "Penn State has a special opportunity to create new leaders who learn deliberative approaches to politics and public life. This one-credit course provides a background for this approach to democratic leadership, and it also prepares students for the Nevins Fellows paid internship program. Those who complete this course will have first priority when awarding these internships each year. The centerpiece of this course are day-long workshops that introduce students to effective civic leaders in government or the non-profit sector. Bracketing these workshops are a handful of seminars, which introduce ideas, discuss reading assignments, and reflect on the workshops. In addition to short reaction papers, students will produce a narrative essay at the end of the course that describes how they could see themselves advancing democracy in the United States (or elsewhere) and what kind of internship experience will help them prepare for such a career. For those who opt to seek an internship, this essay will supplement their formal application. Credit for the course requires attendance at every class meeting and workshop, or equivalent makeup assignments, if permitted.", "other": ["Cross-listed with: CAS 209", "Honors"]}, {"department": "PLSC", "number": "210N", "credits": "3 Credits", "description": "This course is an introduction to the emergence and enforcement of rights in the United States. The course provides an overview of how rights have been codified into law and interpreted by the courts. The primary focus is how and why the conception of rights has changed over time. Emphasis is placed on the rights of groups that were denied equal citizenship when the Constitution was ratified. We will examine how these marginalized groups have engaged in a continual struggle for basic rights since the American founding. The course begins with an overview of different types of rights and the role of the legal system in articulating and enforcing them. Students are introduced to debates about the sources of rights, including the implications of conceptions of rights as grounded in natural law and as arising from positive law. They look specifically at the role of rights in the founding documents of United States and how civil rights are interpreted through pivotal Supreme Court cases as ascribing - or denying - particular powers and responsibilities to individuals and groups. The second section of the course focuses on the rights of African Americans and women. It progresses chronologically from slavery to the modern civil rights movement, from coverture to women's rights. Particular attention is given to the NAACP's campaign against racial discrimination in housing, education, and in the criminal justice system. The final part of the course emphasizes campaigns for rights recognition in modern times, including LGBTQ rights and disability rights. The course concludes with a discussion of how context impacts rights, including students' rights and rights during wartime, and examination of the potential and limitations of rights as a basis for political protection. Throughout the course students are introduced to the interdependent political, legal and philosophical dimension of rights and how rights in the United States have come to be recognized and enforced through political action, legal codification, and judicial interpretation.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "210Q", "credits": "3 Credits", "description": "This course is an introduction to the emergence and enforcement of rights in the United States. The course provides an overview of how rights have been codified into law and interpreted by the courts. The primary focus is how and why the conception of rights has changed over time. Emphasis is placed on the rights of groups that were denied equal citizenship when the Constitution was ratified. We will examine how these marginalized groups have engaged in a continual struggle for basic rights since the American founding. The course begins with an overview of different types of rights and the role of the legal system in articulating and enforcing them. Students are introduced to debates about the sources of rights, including the implications of conceptions of rights as grounded in natural law and as arising from positive law. They look specifically at the role of rights in the founding documents of United States and how civil rights are interpreted through pivotal Supreme Court cases as ascribing - or denying - particular powers and responsibilities to individuals and groups. The second section of the course focuses on the rights of African Americans and women. It progresses chronologically from slavery to the modern civil rights movement, from coverture to women's rights. Particular attention is given to the NAACP's campaign against racial discrimination in housing, education, and in the criminal justice system. The final part of the course emphasizes campaigns for rights recognition in modern times, including LGBTQ rights and disability rights. The course concludes with a discussion of how context impacts rights, including students' rights and rights during wartime, and examination of the potential and limitations of rights as a basis for political protection. Throughout the course students are introduced to the interdependent political, legal and philosophical dimension of rights and how rights in the United States have come to be recognized and enforced through political action, legal codification, and judicial interpretation. As an honors course, PLSC 210H provides Schreyer Scholars and aspiring Paterno Fellows with a rigorous and intellectually enriching exploration of the multiple dimensions of rights and the critical role of the struggles for rights in American history. The course material is developed through analysis and discussion of primary texts and scholarly research. The small class size and emphasis on participation and written assignments give students the opportunity for enhanced feedback to refine their reasoning skills, and a sustained experience of the benefits of collaboration, argument, and critical feedback in generating and refining ideas.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "220", "credits": "3 Credits", "description": "The developing world refers to countries with a weak or emerging industrial economy; low per capita income; and low scores on measures of human well-being such as health, education, and human rights security. The developing world includes countries in Africa, Asia, Latin America, and the Middle East. It encompasses a large portion of the world's population and considerable diversity with respect to economic development, political systems, and social conditions. Developing countries often share a history of colonization and problems of poverty, inequality, authoritarianism, corruption, and political instability. This course focuses on the common patterns and differences among these countries in an effort to answer questions such as, Why do some countries develop robust economies and stable democracies while others do not? What is the connection between economic development and democracy? How do ethnic, religious, and cultural divisions interact with development? The course begins by introducing different ways of conceptualizing development. It describes the most prominent explanations of the differences between developing and developed countries and among developing countries. Students will learn the key domestic and international institutions and processes shaping political and economic development. They will explore the sources and consequences of democratization and authoritarianism, and consider the relationship between development and factors such as religion, ethnicity, and gender.", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "222N", "credits": "3 Credits", "description": "The purpose of this course is to explore gender differences in sport and politics that emerge from physiology, culture, history, politics, and policy. The engagement of women in sport has unique physiological considerations and ethical dilemmas as well as a rich history of defining moments and important ties to feminism and politics. In this course, students will learn how physiology differences affect female athletic performance and the effects of exercise on the female body, as well as how cultural, historical, and political forces shaped women's participation in sport. Students will also see how similar historical, cultural, and political forces affect women's involvement in politics. Combined, students will understand how similar forces shape gender norms and participation two different, yet related, aspects of society. Additionally, students will learn about the push for evidence-based policymaking and apply that knowledge to topics including doping, pregnancy, and gender verification. Students will integrate physiology and policy in a final assignment advocating for evidence-based sport policy. They will also educate their peers through a public education project.", "other": ["Cross-listed with: KINES 222N, PUBPL 222N", "General Education: Health and Wellness (GHW)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "223N", "credits": "3 Credits", "description": "This course explores the roles race and ethnicity play in politics and government. Students will learn how social groups organize to achieve political goals, how and why opposition to those goals arises in plural societies, and what policies governments can pursue to defuse tensions between groups. Students will be introduced to research explaining the historical and cultural basis of ethnic identities. Additionally, students will examine and compare case studies of political disputes that arise when groups differentiate themselves from one another. Ethnic and racial politics in the United States will be compared to ethnic and racial politics in other countries, such as Canada, Indonesia, Bosnia, Switzerland, Rwanda, and South Africa, with attention to political movements and government policies. The course will also explore the complex relationship between government and social groups by looking at immigration policy, the role of ethnic groups in shaping foreign policy, and the legacy of settlement and conquest. Through individual cases and cross national comparison, students will critically assess the sources of inter-group conflict, coexistence, and integration to identify best practices in order to achieve peaceful and inclusive plural societies. The course draws upon resources from a variety of disciplines, including political science, anthropology, sociology, economics, history, linguistics, and religious studies.", "prerequisite": "PLSC 1", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "230", "credits": "3 Credits", "description": "Campaigns and elections are the mechanisms used to place people into office in American government. Electoral outcomes are the product of rules that govern who can run and participate in voting, the choices made by candidates and their campaigns, and the individual decisions rendered by voters at the ballot box. This course explores each of these items to provide a comprehensive understanding of how campaigns and elections operate in the United States. The topics covered include how candidates are selected and elected, ballot propositions, election laws and administration, how voters choose among candidates, campaign strategies and advertising, campaign fundraising and spending, and proposed reforms to the American election process. Students are introduced to different types of election systems in the United States and in democratic countries around the world. They will discuss alternatives to the election systems currently used in Pennsylvania and in most places in the United States. The electoral college method of selecting a president will be examined in depth. Various laws that either make it easier or more difficult to vote will be addressed. Students will examine some recent examples of the ballot initiative process and discuss its role in democratic governance. A substantial portion of the course will address which political parties various voter groups tend to prefer and why, how party bases have changed in American history, and why parties other than Democrats and Republicans have had limited success in the past century. Key components of campaign strategies and how candidates raise money, as well as famous political advertisements, will be presented.", "prerequisite": "PLSC 1", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think"]}, {"department": "PLSC", "number": "235", "credits": "3 Credits", "description": "This course explores the political implications of climate change and the increasing scarcity of many of the world's resources. It provides students with an understanding of the actors and issues driving debates over decision-making and the use of natural and economic resources, with a focus on the American political process. The first part of the course presents the frameworks, actions and interests of various policy actors who affect environmental decision-making and the formation and implementation of environmental policies. The second part develops specific environmental issues, including climate change, resource scarcity and waste management. Much of the reading assumes that our civilization faces the twin problems of increasingly serious shortages of resources and a growing ecological crisis that threatens the basis of life. Further, it argues that these twin crises feed upon each other, and that together they pose serious short and long run challenges to survival. Some readings attribute these problems to the dominant values that characterize modern Western society. The course does consider some dissents from this perspective, arguments that things will be just fine. However, it concentrates on problems and predictions of trouble. It recognizes that most of what we learn, read, and see supports the status quo and assumes our civilization and energy-dependent way of life will continue. Consequently, it emphasizes the less frequently argued position that we may be headed for disaster. The class aspires to appeal to students regardless of major or college -- to scientists, engineers, students of the humanities, and even economists and political scientists. It fulfills the University-wide general education requirement in Social Science. Although it discusses the role of politics in general and the role of the American political system in particular in discussing the \"twin crises,\" it mostly grapples with fundamental questions of value that underlie and guide the play of power in our political system and with how the massive changes now taking place globally both affect and are affected by politics.", "other": ["Cross-listed with: STS 235", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "267N", "credits": "3 Credits", "description": "This course provides an introductory overview of the politics of the Middle East. It introduces students to the political development of Middle Eastern countries and the construction of the Middle Eastern state system through a historical examination of the period of Islamic Empires through Colonialism and Independence. It discusses the major political ideological factors that have influenced political development in the Middle East. It examines the political economy of Middle Eastern states as well as the political economy of development of the region. The course studies the politics of gender, ethnicity and other identities in the region. It also covers major political conflicts within the Middle East and between Middle Eastern countries and the outside world.", "other": ["Bachelor of Arts: Arts", "International Cultures (IL)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "290N", "credits": "3 Credits", "description": "This course will cater to the interests of anyone who has ever asked oneself: what are the origins of individual and mass violence and why some parts of the world or one's own country have more of it than others? This course is designed to critically approach this question, based on the broad, cross-disciplinary perspective of security research and new security studies. This course will enable students to understand the distinctions and overlaps between political and criminal violence, analyze the levels from individual to mass violent behaviors, and assess theoretical approaches to studying violence. Students will engage in comparative exploration of different disciplinary perspectives on the origins and types of violent behaviors, including political science, criminal justice, international relations, and others. The course will provide the critical basis (theoretical and empirical) for students to evaluate the puzzle from multiple angles.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "PLSC", "number": "291", "credits": "3 Credits", "description": "This course is an examination of how human beings get into and out of violent conflicts, and how conflicts transform. It sizes up the costs of war, examines the processes and challenges of peace, and reflects on the characteristics of human conflicts at all levels. The course is interdisciplinary, drawing together perspectives from political science, global and international studies, cultural anthropology, psychology, sociology, economics, military history, war game theory, and studies of literature and expressive culture. Course modules engage with diplomacy, nonviolence, failed states, ethnic struggle, gender mainstreaming, psychology and sociology of human aggression, economics of war and peace, globalization and conflict, and cyber warfare.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "PLSC", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "300", "credits": "1-3 Credits", "description": "Introduction to research design, principles of social science research, and development on honors theses research proposal.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"department": "PLSC", "number": "306", "credits": "1-3 Credits/Maximum of 3", "description": "This seminar supports the writing and editing of senior honors theses.  PL SC 306H Senior Thesis Writing Workshop (1-3)(BA) This course meets the Bachelor of Arts degree requirements. This is a workshop for honors students in their senior year writing their thesis in political science. There are no assigned readings or written assignments outside of those necessary for the completion of your thesis. Participants are expected to make progress on their own thesis and to contribute to the collaborative enterprise of discussing thesis progress and problems while critiquing one another's work. Each participant is expected to make progress on their thesis, to collectively discuss and consider the research process during workshop sessions, and come prepared to offer useful feedback and criticism on other participants' research.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"department": "PLSC", "number": "308", "credits": "3 Credits", "description": "Introduction to conceptualization, research design, and measurement in political research.  PL SC 308 Introduction to Political Research (3)This course introduces students to the research process in political science. The course can be taken by itself or as the first in a two course sequence with PL SC 309. It is intended to give political science majors the skills needed to conduct research in political science, or in related fields such as public policy. The course introduces students to the scientific approach to accumulating knowledge, it examines conceptual and theoretical thinking about politics (e.g. understanding what concepts, variables and hypotheses are), it covers different methods of collecting social science data (interviews, surveys, observation, experiments, analysis of documents, etc.) and it provides an introduction to the interpretation of that data. Ethical issues in research are discussed, and students are also introduced to basic statistical concepts. The course typically includes multiple take home and/or in-class assignments that require students to utilize different data collection methods and practice the generation and interpretation of those data.", "prerequisite": "any 3 credits in Political Science"}, {"department": "PLSC", "number": "309", "credits": "3 Credits", "description": "Data analysis and statistical applications in political research, including data processing; inferential statistics; contingency analysis; correlation and regression; multivariate analysis.  PL SC 309 Quantitative Political Analysis (3)This course introduces students to the basic statistical techniques used to study politics quantitatively. It can be taken by itself or as the second course in a two course sequence with PL SC 308. It is required for all Liberal Arts Fellows. Students in 309 learn about developing questions suited to empirical research; constructing hypotheses; measuring political concepts; and conducting basic univariate and multivariate analyses. The course includes sections on the basic principles of probability, sampling, and statistical inference so that students can understand and implement statistical techniques for describing and explaining political phenomena. There is also extensive coverage of the use and application of various statistical techniques. Exercises both in and out of class will require students to engage with and apply various social science concepts, and to undertake quantitative analyses of political and policy-relevant data.", "prerequisite": "any 3 credits in political science", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "309H", "credits": "3 Credits", "description": "This course introduces students to research design and quantitative analysis techniques used in political science with an aim toward developing transferrable skills for future coursework in the political science major, especially the senior thesis process. Students will learn how to construct theories and design studies, how to quantify concepts, and how to test theories using a variety of statistical techniques, including descriptive analysis, correlation, hypothesis testing, and regression analysis. The course will include classroom lectures and computer lab time to enable students to work hands-on with datasets. This course is the first in a three-course sequence for students interested in writing an honors thesis in political science.", "prerequisite": "ANY 3 CREDITS IN POLITICAL SCIENCE", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"department": "PLSC", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "403", "credits": "3 Credits", "description": "Analysis of the policy process within the legislative system; the effects of environmental factors on policy alternatives and legislative decision making.", "prerequisite": "PL SC001 or PL SC003", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "404", "credits": "3 Credits", "description": "This course provides students with the tools to empirically evaluate policy proposals and outcomes in the American states.  PL SC 404 Analyzing Public Policy in the American States (3) Developing public policies is the proximate goal of any government. In the United States national, state, and local lawmakers steeped in their own traditions, procedures, and political environments establish rules that determine their citizen's quality of life. In the states specifically, laws affect citizens's access to and their ability to afford an education; the quality of the roads they travel on; the wages they earn; whether and to what extent they qualify for subsidized health care; how they cast their ballot in elections; and myriad other aspects of their lives. This course focuses on policymaking in the American states and how those policies can be evaluated using social science methods. The course begins with a discussion of what makes states distinct from one another & their populations, governmental institutions, and political values. The focus then shifts to how statistical techniques can be used to describe variation in state policy; to develop causal arguments to explain variation; and to assess the efficacy and value of different approaches to the same social problems. Students learn how to measure and gather data relevant to public policy debates, to describe and categorize policy, to model policy outcomes, and to draw conclusions about alternative approaches to solving the policy problems being addressed. Students then apply this knowledge to major policy debates in state government. The course concludes by with an exploration of the ethical implications of using data to make policy decisions and with attention to how technical and statistical information can be effectively communicated to professional and nonprofessional audiences. Students are required to have an understanding of introductory statistics (equivalent to the knowledge they would gain from PL SC 309 or STAT 200) prior to taking this course.", "prerequisite": "PL SC001 , PL SC309", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "405", "credits": "3 Credits", "description": "An examination of the selection methods for, and powers of, the American presidency, as well as other chief executives.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "405H", "credits": "3 Credits", "description": "An examination of the selection methods for, and powers of, the American presidency, as well as other chief executives.", "other": ["Honors"]}, {"department": "PLSC", "number": "408", "credits": "3 Credits/Maximum of 3", "description": "This course examines advances in democratization around the globe, and compares the performance of democratic and authoritarian governments. This course examines the impacts of international democracy aid around the globe, and compares the performance of democratic and authoritarian governments in promoting citizens' well-being. Democracy assistance for activities such as conducting elections and strengthening civil society has become a key component of foreign aid provided by longstanding democracies. Its use is based on a widespread belief that democracies perform better than autocracies in a number of policy domains. The course focuses on how such aid affects recipient countries, and how performance of democratic and authoritarian regimes actually differs. It traces the expansion of international democracy aid, explores the different types of assistance that donor countries provide, and reviews empirical research on the impacts in recipient countries. It then turns to a comparison of the performance of democratic vs. authoritarian regime type in generating public goods such as economic prosperity, socioeconomic equality, and civic peace.", "prerequisite": "PL SC 001; PL SC 003; PL SC 014; or PL SC 022"}, {"department": "PLSC", "number": "409", "credits": "3 Credits", "description": "Explores the theory and practice of democratic deliberation in elections, town meetings, juries, legislatures, and other public institutions.  CAS (PL SC) 409 Democratic Deliberation (3) Many modern democracies have made strides to become more deliberative in how they make decisions. This course looks closely at the most promising innovations in self-government while also reviewing the persistent anti-deliberative and undemocratic features of modern societies and governments. Topics covered in the course include deliberative democratic theory, political conversation, common forms of public meetings, mediated deliberation, campaigns and elections, the jury system, and deliberative democracy on larger social scales.", "prerequisite": "PLSC 1", "other": ["Cross-listed with: CAS 409"]}, {"department": "PLSC", "number": "410", "credits": "3 Credits", "description": "This course examines political behavior using social choice theory and game theory.  PL SC 410 Strategy and Politics (3)(BA) This course meets the Bachelor of Arts degree requirements. Strategic behavior is central to politics. It is common for political outcomes to be determined by the interaction of individuals seeking goals in an environment in which goal attainment is complicated by the choices of other actors. This course introduces various methods for analyzing strategic behavior using social choice and game theories. We will employ these approaches to better understand a wide range of political phenomena in international politics, comparative politics, and American politics, such as war, terrorism, voting, electoral competition, government formation, and democratic transitions. By the end of the course, students will, among other things, have experience using games to analyze a range of political behaviors and institutions. The course assumes no prior knowledge of social choice theory or game theory.", "prerequisite": "PL SC001 , PL SC003 , or PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "412", "credits": "3 Credits", "description": "The transnational politics of trade, investment, aid, raw materials, and the environment; nation-states, multinational corporations, and the U.N.  PL SC 412 International Political Economy (3)(BA) This course meets the Bachelor of Arts degree requirements. This course is an introduction to the scientific study of international political economy (IPE), an interdisciplinary field related to international politics and international economics. Some exemplary issues IPE addresses include the collective action problem among nation states, the management and openness of international economy, the determinants of foreign economic policies, and the causes and consequences of economic globalization. IPE examines the interaction between politics and economics at the international level as well as between the international and domestic levels, involving various political and economic actors (governments, MNSs, interest groups, as well as individuals). The course aims to develop the analytical skills of students in explaining theoretically international political and economic events.", "prerequisite": "ECON 102", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "413", "credits": "3 Credits", "description": "Background, organization, and operation of the Communist Party and the government of the Soviet Union.", "prerequisite": "3 credits from: PL SC003 , PL SC014 , PL SC155 , or RUS  100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "414", "credits": "3 Credits/Maximum of 3", "description": "Dictators and Their Demise examines the political economy of authoritarian rule.  PL SC 414 Dictators and Their Demise (3) Dictators and Their Demise provides a broad exploration about how non-democratic governments throughout the world rule. We examine: the conditions that give rise to authoritarianism; the variety of authoritarian regimes; the strategies authoritarian leaders use to stay in power; the consequences of different types of authoritarianism for outcomes such as economic growth and human development; and the domestic and international sources of authoritarian demise. The course covers cases of authoritarian rule in: Chile, the Dominican Republic, Egypt, Malaysia, Mexico, and the former Zaire (now the Democratic Republic of the Congo or DRC). The course builds knowledge about the governments under which most people in the Global South lived during the 20th century. Even today, roughly half of the world's population lives under some form of non-democratic government. Yet almost all courses currently in the curriculum, particularly in the field of comparative politics, focus exclusively on democratic forms of government. This course therefore examines a new topic not currently offered in the curriculum. In additional to learning about different types of authoritarian rule, students form an understanding of how common foreign policy tools, such as economic sanctions, foreign aid, and human rights shaming, are likely to affect domestic politics in these countries. This knowledge helps students critically evaluate foreign policy relationships between democracies, such and the United States, and dictatorships. Course materials cover theoretical approaches to the study of authoritarian rule, in-depth case studies (including novels, biographies, and documentary), and empirical research. This course requires student presentations, weekly reading assignments, descriptive analysis of quantitative data in graphs, multiple written assignments, and a final take-home essay exam. Students develop analytic skills through the weekly written homework assignments in which they apply the broad theoretical concepts to analyze counter factual situations from specific cases of authoritarian rule. Oral presentations develop inter-personal skills and require students to research specific cases of authoritarian rule currently in the news. This helps students critically evaluate current events. Finally, the written assignments require students to develop skills working with real data. Students collect and graphically present basic descriptive data about economic and human development in non-democratic countries: economic data, infant mortality, literacy, and indicators of women's well-being. Using real world data to make international comparisons helps students develop skills to form and articulate complex arguments, and teaches them the basics of research design.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "418", "credits": "3 Credits", "description": "A survey of traditional and contemporary conceptual frameworks and theoretical approaches for the analysis of international relations.", "prerequisite": "PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "418H", "credits": "3 Credits", "description": "A survey of traditional and contemporary conceptual frameworks and theoretical approaches for the analysis of international relations.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"department": "PLSC", "number": "418W", "credits": "3 Credits", "description": "A survey of traditional and contemporary conceptual frameworks and theoretical approaches for the analysis of international relations.", "prerequisite": "PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "419", "credits": "3 Credits", "description": "Overview of structural, technological, decision-making, behavioral, and political subsystems of bureaucracy; emphasis on bureaucratic dynamics within larger environmental, interorganizational contexts.", "prerequisite": "PL SC001 , PL SC002 , or PUBPL304W", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "420", "credits": "3 Credits", "description": "Students learn about how national states arise, expand the territory and population they control, and persist or fail.", "prerequisite": "PL SC003 or PL SC014"}, {"department": "PLSC", "number": "421", "credits": "3 Credits", "description": "Why and how do governments regulate cross-border flows of goods, capital, and people? What are the benefits and costs of globalization? What are the social tensions resulting from countries' integration into the world economy? This course examines the complex interplay between politics and the global economy using data and empirical analysis. It has two objectives. First, it will introduce students to topics on international trade, foreign investment and multinational corporations, international finance, economic development, etc. Second, it will teach students quantitative methods to analyze issues related to globalization. The goal of this course is to provide students with substantive knowledge and analytical skills that are necessary to understand the politics of globalization.", "prerequisite": "PLSC 309"}, {"department": "PLSC", "number": "422", "credits": "3 Credits", "description": "Relationships between structure and evolution of city systems and patterns of political behavior.", "prerequisite": "PL SC003 , PL SC020 , PL SC022 , or PL SC417", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "423", "credits": "3 Credits", "description": "Aspects of political transition and institutions of the fifteen Soviet successor republics; emphasis on Russia and republican confederation.", "prerequisite": "PL SC003 , PL SC155 , or RUS  100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "424", "credits": "3 Credits", "description": "Topics in the comparative analysis of representative contemporary Western and non-Western governmental institutions.", "prerequisite": "3 credits from PL SC003 , PL SC020 , PL SC022", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "425", "credits": "3 Credits", "description": "Comparative analysis of political processes; executive, legislative, and judicial decision making and behavior; examination of systems functioning; selected public policies.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "426", "credits": "3 Credits", "description": "Interest group basis of American politics, analysis of party and group behavior in electoral politics and the policy process.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "427", "credits": "3 Credits", "description": "Nature and development of mass attitudes and opinions; political socialization; voting behavior; relation between opinions and public policy.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "428", "credits": "3 Credits", "description": "Gender in politics in the United States and around the world; major areas of women and politics research.  PL SC (WMNST) 428 Gender and Politics (3) (US;IL)(BA) This course meets the Bachelor of Arts degree requirements. This course is designed as an overview to the field of women and politics. It examines the role that women play in politics in the United States and around the world. Students will begin by examining how women are socialized differently from men and how that socialization effects women's political attitudes and participation. Then students will focus on women in different political offices and how their behavior compares to that of their male counterparts. Students will then analyze the women's movement in the United States. Finally, students will turn to different theories of the ideal position of women and men in politics and use those theories to explore the issue of pornography. Students will be evaluated on a final exam, short essays ( 4 3-5 page essays), class participation, and a research paper (15 pages). This is an advanced course with 6 credits prerequisite in Women's Studies or Political Science. This course fulfills the American Politics and Comparative Politics distribution as well as the advanced course requirement for the Political Science major. It is an elective for a Women's Studies major. It also fulfills an International/Intercultural competency requirement. This course will be offered once a year with 35 seats per offering.", "prerequisite": "3 credits in political science or women's studies", "other": ["Cross-listed with: WMNST 428", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "PLSC", "number": "429", "credits": "3 Credits", "description": "The new politics, its technology, and the strategic perspectives that underlie it.  PL SC 429 Analysis of Electoral Politics (3)(BA) This course meets the Bachelor of Arts degree requirements. This course engages students in the empirical study of electoral politics in the United States. Elections in the U.S. are about voters, candidates and the rules that determine what these actors do to structure the course of the election and that lead to the final outcome. In empirical political science, analysis involves the systematic examination and evaluation of relevant data to solve a problem or answer a question. In this course, then, students use data about voters to systematically analyze their actions and decisions in U.S. presidential elections, with an emphasis on understanding why they make the choices they do to produce the resulting election outcomes. Throughout the course, students will draw on a range of publicly available data and use statistical analyses to investigate the \"cost\" of voting; evaluate competing theories of voter choice; examine how candidate evaluations, candidates' issue stances and retrospective evaluations of candidates influence voter choice; assess how vote choice is shaped by an individual's partisan identification; and evaluate how social demographic trends shape election outcomes. At the conclusion of the course, students will have the substantive knowledge and analytic skills to evaluate the assertions and conclusions of politicians, pundits, and political scientists as they contemplate campaigns and election outcomes. Students are required to have an understanding of introductory statistics (equivalent to the knowledge they would gain from PL SC 309 or STAT 200) prior to taking this course.", "prerequisite": "PL SC001 , and PL SC309", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "430", "credits": "3 Credits", "description": "Detailed examination and analysis of a selected major work, thinker, or tradition in the history of political theory.", "prerequisite": "PL SC017 or PL SC007", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "430W", "credits": "3 Credits", "description": "Detailed examination and analysis of a selected major work, thinker, or tradition in the history of political theory.  PL SC 430W Selected Works in the History of Political Theory (3)The course will examine the tradition of 'liberal' political philosophy, focusing principally on the social contract tradition in Western political philosophy. We will examine the work of the 'classic' social contract theorists -Hobbes, Locke, Rousseau, and Kant - and discuss some more recent variants. We will then consider broad contemporary critiques of this tradition. In particular, we will consider charges of exclusion, parochialism, and biased conceptions of the self allegedly manifested in liberal theories, especially as those charges that center on considerations of race and gender.", "prerequisite": "PL SC017 or PL SC007", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "431", "credits": "3 Credits", "description": "Political theories of Plato and Aristotle; selected Greek, Roman, medieval, and Renaissance theorists through Machiavelli.", "prerequisite": "PL SC017 or PL SC007", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "432", "credits": "3 Credits", "description": "Political theories of the seventeenth through the twentieth centuries, including Hobbes, Locke, Rousseau, Marx, Mill, Mosca, Weber, and selected theorists.", "prerequisite": "PL SC017 or PL SC007", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "433", "credits": "3 Credits", "description": "The course introduces students to the major political and philosophical movements that influenced the founders of the early American republic.  PL SC 433 Political Foundations of the Early American Republic (3)The course introduces students to the major political and philosophical movements that influenced the founders of the early American republic. The first section of the course, set in the ancient world, will examine the earliest experiments in democratic government in both Greece and the Roman Republic. In addition to studying the structure and traditions of ancient governments, students will consider competing theories for why these early democratic experiments ultimately failed. The second section of the course traces the gradual evolution of representative democracy in Britain from the signing of Magna Carta to the quiet subjugation of the monarchy in the 19th Century. Recognizing that the theoretical structures of political power remain somewhat fixed in this period, students will consider how legal precedent can gradually transform seemingly static political institutions. The third section of the course examines American efforts to establish stable representative institutions in the aftermath of the Revolutionary War. Looking back at both ancient and modern constitutional traditions, students will examine how prior democratic experiments heavily influenced the deliberations of the founders both at the Constitutional Convention and in the establishment of the new federal republic.", "prerequisite": "PL SC001 or HIST 020 or PL SC017"}, {"department": "PLSC", "number": "434", "credits": "3 Credits", "description": "This course will examine the relationship between war and development in sub-Saharan Africa in the post colonial era. PLSC 434 / AFR 434 War and Development in Africa (3) (IL) This course will examine the relationship between development and war in sub-Saharan Africa in the modern era. Specifically, it will analyze the extent to which the processes of state building, nation building, and international intervention have contributed to the incidence of both civil war and international conflict in Africa. We will begin with a review of several theoretical arguments on the causes of warfare in Africa and then turn to a discussion of theses on African political development. This course complements present offerings in international relations and comparative politics in the PLSC department and can serve as an advanced undergraduate offering in the African Studies concentration in AFR. The course directly complements our present offerings in international conflict given that we don';t have a regularly offered course that focuses on conflict in a specific region. In addition, it will augment our comparative politics offerings with an examination of prominent issues in comparative politics such as political development, democracy, and modernization. The course will fulfill the IL requirement and encourage students understanding of the historical background as well as the political, economic, and cultural factors that influence African politics. African conflicts are often viewed as \"ethnic conflicts\" and in this class students have an opportunity to assess the extent to which ethnic, linguistic, or religious factors influence the likelihood of conflict and contribute to development in African states. Students will also be required to write essays evaluating the contribution of a range of theoretical arguments on Africa';s conflicts in order to assess the degree to which cultural more than political or economic factors contribute to their onset. Students will then have the opportunity to conduct more extensive research on a specific African case to develop their analyses further. These exercises will often require that students reevaluate their beliefs about social identities such as race (e.g. in Rwanda the difference between Tutsi and Hutu is often viewed as a \"racial\" difference between black Africans, which is at odds with most Western conceptions of race). They also require students to challenge stereotypes regarding the subordination of African values in conflicts to a simple concern with \"tribe\". Students will gain a broader knowledge and appreciation of the different values, traditions, and cultures evident in Africa and understand how these can both exacerbate and mitigate conflict. Evaluation in the course will consist largely of examination of the students' brief expository essays and larger case studies for which students will be encouraged to conduct original research. The course should be offered biannually with a class limit of about 40 students.", "prerequisite": "PL SC014 , PL SC003 , AFR  110", "other": ["Cross-listed with: AFR 434", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "435", "credits": "3 Credits", "description": "Political theories of colonial, revolutionary, and constitutional periods presented through works of selected thinkers and analysis of particular political problems.", "prerequisite": "PL SC001 , PL SC017 , or PL SC007", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "436", "credits": "3 Credits", "description": "This course examines factors influencing the onset, duration, severity, termination, recurrence, and consequences of civil wars around the world.  PL SC 436 Civil Wars (3) This course provides a broad exploration of the causes, characteristics, and consequences of civil wars. In particular, it investigates what makes civil wars more likely to occur, what influences how long they last, how severe they are, and how likely they are to recur, while also considering their consequences for the states that experience them. It considers the scholarly research on this topic over the past decade or more, and builds an awareness both for what are the known regularities as well as what are the continuing uncertainties about the place of civil war in the contemporary international system. It does this specifically within the context of scientific research about civil wars, and thus also advances student knowledge about how social scientists learn what they know about how the world works. Building on this perspective, and after absorbing the lessons to be learned from the literature, students will gain even greater appreciation for the quality of knowledge about civil wars by conducting their own detailed analysis of a civil war (each student will study one civil war of their choosing) asking how well the civil war they study fits patterns identified by the literature. This course complements, without duplicating, existing political science courses about militarized political conflict, and qualifies as one course majors can take to satisfy their 400-level course hours requirement. In addition to political science majors, it should be of interest to international politics majors, students in other social science majors, and perhaps Masters students in the School of International Affairs as well.", "prerequisite": "PL SC003 or PL SC014"}, {"department": "PLSC", "number": "437", "credits": "3 Credits", "description": "Causes, resolution, and consequences of crises and wars; testing theories of conflict using both case and statistical studies.", "prerequisite": "PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "438", "credits": "3 Credits", "description": "Impact of national security on U.S. government and foreign policy; roles and interaction of President, Congress, government agencies, interest groups.", "prerequisite": "PL SC001 or PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "439", "credits": "3 Credits", "description": "Analysis of political terrorism as a violent alternative for peaceful change and traditional warfare in the nuclear age.", "prerequisite": "CRIMJ100 or PL SC014 , or permission of program", "other": ["Cross-listed with: CRIMJ 439", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "439H", "credits": "3 Credits", "description": "Analysis of political terrorism as a violent alternative for peaceful change and traditional warfare in the nuclear age.", "other": ["Cross-Listed", "Honors"]}, {"department": "PLSC", "number": "440", "credits": "3 Credits", "description": "This course explores the socioeconomic implications of globalization.", "prerequisite": "AFAM 100N", "other": ["Cross-listed with: AFR 440, IB 440", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "PLSC", "number": "442", "credits": "3 Credits", "description": "Principles of American foreign policy; processes of policy formulation; roles of the President, Congress, the State Department, and other government agencies.", "prerequisite": "PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "443", "credits": "3 Credits", "description": "This course explores the various causes and impacts of ethnic conflicts in the African context.", "other": ["Cross-listed with: AFR 443", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "444", "credits": "3 Credits", "description": "Interactions of governmental and economic activity in American life. Survey of governmental (national, state, local) promotional, regulatory, and ownership policies.", "prerequisite": "3 credits in political science or economics", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "445Y", "credits": "3 Credits", "description": "Examines history, politics, and economics of the use of special programs to advance racial interests in the U.S. PLSC 445Y / AFAM 445Y / LER 445Y Politics of Affirmative Action (3) (US)(BA) This course meets the Bachelor of Arts degree requirements. The objectives of this course are to introduce students to the relationship between affirmative action and other policies purportedly designed to end racial inequality in the U.S. This course approaches the study of affirmative action in the context of the historic racial discrimination and inequality that Black Americans have faced since the founding of the Nation. The purpose of this course is to help students think about how contemporary and historic affirmative action policies relate to race, concepts racial inequality, the historic and continuing causes for racial inequality, public opinion, American politics and economic thought. The course materials will lead students through scholarly and popular articles, books and video presentations on the topic. It is hoped that students will become familiar with the history of affirmative action from its conception. Students will gain an intimate understanding of affirmative action economic and social outcomes on various racial groups. No prior knowledge is assumed, however a knowledge of civil rights history, quantitative methods, and constitutional law will be useful. The Politics of Affirmative Action satisfies the requirements for major and minor electives for the African American Studies, and major and minor electives for Political Science, and Labor Studies and Industrial Relations. Students are evaluated on the basis of an examination, term paper, class participation and class presentations of papers.", "prerequisite": "AAA S 100 level course and PL SC001 or PL SC007", "other": ["Cross-listed with: AFAM 445Y, LER 445Y", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "446", "credits": "3 Credits", "description": "An examination of the interaction between business and government across different types of political systems.  PL SC 446 Business and Government Relations (3) This course examines the interaction between business and government across different types of political systems. Intellectual approaches from various disciplines will be used to understand different dimensions of business and government interactions. Models of interaction to be covered in the course include pluralism, corporatism, business as capital, business as firm models, sectoral models, network models, and clientalism. Particular attention will be given to the interactions of business and government during the policy process, from formation to implementation. Case studies from developed and developing countries, and examples of specific policy proposals will be utilized to help students analyze business interactions with government, and political interactions with business. Specifically, students will analyze variation in the structure of business-government relations across countries' different political systems, economic systems, and development levels. Through this course, students will be able to construct an appropriate framework to evaluate the business and political implications of adopting different business-government models, and construct analytical frameworks to understand the policy implications of adopting different models for the same policy.", "prerequisite": "PL SC001 ; PL SC003 ; or PL SC014"}, {"department": "PLSC", "number": "447", "credits": "3 Credits", "description": "This course engages students in the empirical study of public opinion.  PL SC 447 Analysis of Public Opinion and Political Attitudes (3) The essence of democracy is popular sovereignty. The voice of the people must be freely expressed and send a clear message to elected officials. In turn, those officials must be responsive to citizens. This class focuses on the voice of the people with particular attention to several analytic questions: How do we measure public opinion? Do public opinion polls and other methods provide an accurate measure of public sentiment? How can we know if public opinion has changed? How can we utilize public opinion data to assess political polarization, civic competence, and levels of the public's trust in government? In this course, students will learn how to answer questions like these using the same data reported by the press, utilized by government officials, and examined by political scientists to assess the success of democracy in the United States and throughout the world.The course is organized around a series of contemporary policy topics (such as foreign policy, welfare or education) integrated with specific analytic techniques. By the end of the semester, students will be familiar with public opinion on many contemporary policy debates and they will learn a series of data analytic skills that can be applied to any topic. Students are required to have an understanding of introductory statistics (equivalent to the knowledge they would gain from PL SC 309 or STAT 200) prior to taking this course.", "prerequisite": "PL SC001 and PL SC309"}, {"department": "PLSC", "number": "449", "credits": "3 Credits", "description": "This course examines the fundamental attributes of terrorist psychology, including the motivations, strategies and behaviors of terrorists; the efforts to counter them; and the psychological impact of terrorism on the public. The course operates from a multidisciplinary perspective to consider a variety of topics, including: terrorist ideologies; how people come to join terrorist groups; the making and characteristics of a terrorist; recruitment methods; the leadership of terrorist groups; terrorism tactics, including the use of media and technology; the psychological consequences of terrorism on individuals, communities and global societies; psychological counterterrorism; blowback from counterterrorism; prevention tactics; and disengagement from terrorism. Prior course work in Psychology is not required. This course does not count toward the requirements of the Psychology major or minor.", "prerequisite": "PLSC 14"}, {"department": "PLSC", "number": "450H", "credits": "3 Credits", "description": "This course focuses on the conceptualization and socio-political determinants of genocide and tyrannical regimes, with an emphasis on the Holocaust.", "prerequisite": "HIST 121", "other": ["Cross-listed with: JST 450H", "Honors"]}, {"department": "PLSC", "number": "451", "credits": "3 Credits", "description": "This course examines the politics of human rights and repression, focusing on the causes and consequences of state sponsored violence and human rights violations.", "prerequisite": "PL SC001 , PL SC003 , or PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "452", "credits": "3 Credits", "description": "Politics and society in the Communist Era, the revolutions of 1989, and problems of adjustment to democracy and market.", "prerequisite": "PL SC003 , PL SC020 , PL SC022 , or PL SC155", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "453", "credits": "3 Credits", "description": "Comparative analysis of the political, social, and economic problems characteristic of underdeveloped systems.", "prerequisite": "PL SC003 , PL SC020 , or PL SC022", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "454", "credits": "3 Credits", "description": "Contemporary African politics, institutions, and ideologies; patterns of change, social forces, and nation building in selected African states. PLSC 454 / AFR 454 Government and Politics of Africa (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. In this course, we will discuss the current democratization trend in Africa by focusing on the experiences of African countries.The course is divided into three sections. Part One considers a range of factors that affect politics in Africa. We will discuss in depth the following factors: colonialism, nationalism, the relationship between state and society, ruler-ship, the military, political parties, and economic development. Then, we will consider the experiences of our four cases, to gain a historical background. In part two, we will focus on democratic transitions. We will discuss the factors that enable transitions to occur, as well as the process that transitions follow. Then, we will consider four transitions: two that resulted in the installation of a democratic government (Nigeria in 1979, Sudan in 1986) and two that ended in continued authoritarianism (Angola in 1992, Kenya in 1978). Part three considers the prospects of democracy. We will discuss the probability of a democratic transition occurring in the near future.The goals of this class are four fold. First, students will gain detailed knowledge about four African countries. Second, we will learn how to compare countries. Third, students will have a better understanding of the democratization process in general, and will be able to explain or predict democratization beyond the four cases discussed in this class. Finally, the experiences of these four countries offer a deeper understanding of what democracy is and provide students with greater flexibility to fulfill requirements in either the African and African American Studies major or the Political Science/International Politics major. PLSC 454 / AFR 454 will be offered once per year with 35-50 seats per offering.", "prerequisite": "3 credits from: AFR  110 , PL SC003 , PL SC020 , or PL SC022", "other": ["Cross-listed with: AFR 454", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "455", "credits": "3 Credits", "description": "Comparative analysis of political and governmental structures of major West European nations; main functions and processes of such structures.", "prerequisite": "PL SC003 or PL SC020", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "456", "credits": "3 Credits", "description": "Social forces and processes, governmental institutions, foreign policies of major states of Latin America.", "prerequisite": "HIST 179", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "458", "credits": "3 Credits/Maximum of 3", "description": "This course examines the political systems, institutions, and leadership of East Asian countries. This course examines the political systems, institutions, and leadership of East Asian countries. Students will learn about the nature and extent of political change that has occurred across East Asia, with particular attention to the history of the region, and the regime changes that have occurred in East Asian countries. Students also will compare the political development and experiences of different countries in the region, and consider how their development and experiences compare to countries beyond East Asia. Upon completion of the course, students will have knowledge of the government and politics of East Asian regimes, and the region's role in global politics.", "prerequisite": "3 credits from PL SC003 , PL SC020 , PL SC022", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "459", "credits": "3 Credits", "description": "Role of culture in world politics.", "prerequisite": "PL SC014", "other": ["Cross-listed with: AFR 459", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "PLSC", "number": "460", "credits": "3 Credits", "description": "The all-pervasive importance of science and technology policy in modern societies and mechanisms and processes by which it is made.", "prerequisite": "3 credits in natural sciences or engineering, 3 credits in social   and behavioral sciences", "other": ["Cross-listed with: STS 460", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "461", "credits": "3 Credits", "description": "This course introduces students to the history, institutions and politics of the European Union.  PL SC 461 Politics of the European Union (3) (IL) This course introduces students to the history, institutions and politics of the European Union. We will survey the central theories of political and economic integration, and compare them to how European integration has unfolded. We will analyze the EU's institutions and political processes, and review major EU policy areas.", "prerequisite": "PL SC003 or PL SC020", "other": ["International Cultures (IL)"]}, {"department": "PLSC", "number": "462", "credits": "3 Credits", "description": "Analysis of major problems and key works in the Marxist and Socialist tradition; dialectical materialism, alienation, class warfare, etc.", "prerequisite": "PL SC017 , PL SC007 , PL SC413 , or PL SC452", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "463", "credits": "3 Credits/Maximum of 3", "description": "This course will present an overview of modern Chinese politics since 1949.", "prerequisite": "ASIA 100", "other": ["Cross-listed with: ASIA 463", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "PLSC", "number": "464", "credits": "3 Credits", "description": "Socioeconomic and environmental impacts of extractive industries in Africa.", "prerequisite": "AFR  110 or at least one of the following: PL SC003 or PL SC014 or PL SC022", "other": ["Cross-listed with: AFR 464", "International Cultures (IL)"]}, {"department": "PLSC", "number": "465Y", "credits": "3 Credits", "description": "A course which identifies components of democracy, such as definitions, measures, datasets, and the democratization process.  PL SC (ASIA) 465Y Democratization in Asia (3) (IL) This class is an upper-level seminar on democratization in Asia. How do countries move from having an authoritarian regime to a democratic government? Why are some democratic governments stable while others are not? In this class, we will focus on democratization theory and how it applies to countries in Asia. This course is organized into two parts. In the first part of the course, we will discuss democracy and democratization theory. We will cover such components as: definitions, measures, datasets, and the different stages of the democratization process. In the second part of the course, we will apply these concepts and measures to specific Asian countries. Course topics will be explored through readings from textbooks, articles, datasets, and media sources. By the end of the course, students will have a deep knowledge about a wide range of Asian countries. Students will develop the skills to compare countries, will understand the democratization process within Asia, and will be able to generalize from their knowledge to evaluate democratization events around the world. Finally, students will gain a deeper understanding of what is democracy and how easy or difficult it is to install and maintain. This course fulfills the distribution requirement for comparative politics, as well as the advanced and related course requirements for Political Science majors. In addition, the course fulfills the supporting course requirement for International Politics majors and the related areas requirement for Asian Studies majors. Finally, the course fulfills the requirements for writing across the curriculum and other cultures.", "other": ["Cross-listed with: ASIA 465Y", "International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "466", "credits": "3 Credits", "description": "An interdisciplinary investigation of the major topics and debates characterizing the subfield of political psychology.  PL SC 466 Political Psychology (3) This course offers an interdisciplinary investigation of the major topics and debates characterizing the subfield of political psychology. It draws on research being done in a variety of disciplines and disciplinary subfields including social, developmental and clinical psychology; the cognitive neurosciences; biological anthropology; genetics; evolution; and behavioral economics to examine political behavior. Specifically, the course will examine the thinking and actions of both political elites and the mass public, and consider the reasoning processes they employ in order to make sense of the political world. Topics to be covered include how emotions (e.g., fear, lust) shape human reasoning; how preferences develop; how differences in cognition, emotion and personality inform political judgment and shape political leadership; how prejudices develop and affect war and other conflicts; how political and social identities develop and how they affect individuals' political judgments and decisions; how neurobiological influences operate in conjunction with social and cultural factors to affect how individuals process information; and how genetics and hormones affect individuals political development and behavior. Through these and other topics covered in the course, students will develop an understanding of how political elites and ordinary citizens process information, develop preferences and make decisions, and why, as a consequence, they act as they do. This course fulfills the distribution requirement for American politics and comparative politics, as well as the advanced and related course requirements for Political Science majors. The course also fulfills the supporting course requirement for International Politics majors.", "prerequisite": "PL SC001 , PL SC003 , PL SC014 , or PSYCH100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "467", "credits": "3 Credits", "description": "The international relations of the Middle East, stressing national security policies of regional and outside actors, and major contemporary conflicts.", "prerequisite": "HIST 181", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "468", "credits": "3 Credits", "description": "An examination of how politics and public policy affect and are shaped by the news media, as a political institution, in America.", "prerequisite": "COMM 110", "other": ["Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "469", "credits": "3 Credits", "description": "This course offers an overview of the politics of modern South Asia with specific focus on Afghanistan, India and Pakistan.  ASIA (PL SC) 469 Government and Politics of South Asia (3) (IL) This course provides an overview of the politics of modern South Asia with particular attention to the experiences of Afghanistan, India and Pakistan. It examines theories of political and economic development and ethnic politics, the impact of the British colonial experience on South Asia, the rise of nationalism, and the emergence of independent nation states in the region. Three important themes are explored throughout the course: (1) the state of economic development in the three countries; (2) the relationship between identity politics and violence; and (3 ) the international relations of these countries, with particular attention to terrorism and nuclear policy. Course topics will be explored through readings from textbooks and assigned articles, articles from current news sources and, documentary films from the three countries. By the end of the course, students will have knowledge of the politics of Afghanistan, India and Pakistan and the political factors that have shaped their development over the past century. Students will acquire the tools necessary to evaluate critically the impact of war, the legacy of colonialism, and the challenge in building durable democratic institutions. This course fulfills the distribution requirement for comparative politics, as well as the advanced and related course requirements for Political Science majors. The course also fulfills the supporting course requirement for International Politics majors and the related areas requirement for Asian Studies majors.", "prerequisite": "ASIA 100", "other": ["Cross-listed with: ASIA 469", "International Cultures (IL)"]}, {"department": "PLSC", "number": "470W", "credits": "3 Credits", "description": "Writing of legal briefs as practiced in American courts.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "471", "credits": "3 Credits", "description": "The origins of judicial review, landmark decisions of the Supreme Court, and their impact on the American form of government.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "471H", "credits": "3 Credits", "description": "The origins of judicial review, landmark decisions of the Supreme Court, and their impact on the American form of government.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "472", "credits": "3 Credits", "description": "Analysis of the roles, procedures, and policies characterizing the American legal system.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "473", "credits": "3 Credits", "description": "Analyzes behavior of judges and other participants in the legal process; examines how and why courts function as policymaking bodies.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "474", "credits": "3 Credits", "description": "Fundamental problems relating to civil liberities and due process.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "476", "credits": "3 Credits", "description": "This course engages students in the empirical study of law and the courts.  PL SC 476 Empirical Legal Studies (3) The tools of social science affect both how scholars understand the workings of the judicial system and how lawyers practice law. This course engages students in the empirical study of law and the courts. It provides them with the substantive knowledge, and statistical and analytic skills they need to understand both (1) how social scientists use empirical evidence to make inferences about laws, judges, and legal institutions and (2) how statistical methods are used in legal practice. Through the course, students will undertake statistical analyses and learn how to present these analyses to nontechnical audiences, such as jurors, employers, and the general public. The course begins with an overview of the social scientific study of law and the courts, and then investigates a series of topics, including how social science and empirical evidence are used to make legal claims and establish legal standards, to provide a context for judicial decisions, and to litigate cases.", "prerequisite": "PL SC001 , and PL SC309"}, {"department": "PLSC", "number": "477", "credits": "3 Credits", "description": "The American judicial system has played an active role in policing the rights of disadvantaged groups in American history. In this course, we will draw upon political science and legal approaches to examine the judiciary's approach to ensuring equality through an examination of cases involving same-sex rights, affirmative action, and voting rights. We will explore difficult questions such as: How does the Court define equality? Are justices' decisions driven by law, ideology, or both? Is the current Supreme Court particularly activist? Readings include court cases, newspaper articles, and essays from political science and law journals.", "prerequisite": "PLSC 1", "other": ["United States Cultures (US)"]}, {"department": "PLSC", "number": "478", "credits": "3 Credits", "description": "This course examines China's economic reform and development and its engagement with the world since 1978. It pays close attention to the interplay of politics and economics. The course first examines the initiation and process of China's economic reform. This part of course covers topics including state-owned enterprise reform, township and village enterprises, fiscal decentralization, and tax reform. Then the course explores China's interactions with the world, paying special attention to trade, foreign investment,and development aid. Finally, the course addresses the issues and challenges that China faces for sustainable development, including corruption, income inequality, and environmental deterioration. The goal of this course is to give students a comprehensive view of the political economy of contemporary China and its relationship with the world and to develop students' understanding of ecconomic reform and development in the developing world.", "prerequisite": "PLSC 3", "other": ["Cross-listed with: ASIA 478, GLIS 478", "International Cultures (IL)"]}, {"department": "PLSC", "number": "480W", "credits": "3 Credits", "description": "Basic characteristics and processes of the national legislature and executive; roles and interaction of these institutions in the policy process.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "481", "credits": "3 Credits", "description": "This course examines states, markets, power, production, and the relations between the various transnational agents who act in these areas. Students may not receive credit for PL SC 481 and PL SC 412.  PL SC 481 Global Political Economy (3) Changes in the international system in the 1970s led to increased interest on the part of students of international relations in the political economic processes underlying change. Important debates among scholars in both mainstream theoretical traditions and in critical theory gave rise to International Political Economy as an increasingly visible sub-field in International Relations. This seminar tracks the historical relations between the development of capitalism as an economic system and the emergence and transformation of global politics, using concepts developed in the study of political economy. Seminar discussion, examinations, and a short research paper will be used to evaluate students' learning.", "prerequisite": "PL SC014 or INTST100", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "482", "credits": "3 Credits", "description": "Explores basic characteristics and processes of American state and urban politics; nature of intergovernmental relations involving these governmental levels.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "483", "credits": "3 Credits", "description": "This course provides a comprehensive overview of the process of U.S. national security policy - the principles, practices, and participants in the development and implementation of security strategy and policy. It applies theories and models to the bureaucratic policy making structure of the Executive Branch, looks at the roles of other governmental participants, and evaluates the many factors that constrain decision making. It assesses the impact of non-governmental entities such as the media, interest groups, and public opinion, and considers the effect of changing domestic factors on the process. Finally, it prepares students to be knowledgeable and effective participants in the process and presents them with a practitioner's framework for policymaking. The main themes of this course are that the U.S. Constitution established a federal government of separate institutions sharing powers within an intentionally inefficient system of checks and balances that has evolved by virtue of a dynamic process of Constitutional Amendments, legislative statutes, judicial decisions, and executive actions; and, that national security decisions are best understood by considering the bureaucratic context in which they are made within the Executive Branch, and as a result of the interaction of other governmental and non-governmental participants.", "prerequisite": "seventh-semester standing", "other": ["Cross-listed with: HLS 483, PUBPL 483"]}, {"department": "PLSC", "number": "484W", "credits": "3 Credits", "description": "Relations between Russia and The Newly Independent States (NIS); Russia's relations with selected foreign states and political Institutions; regional impact of the NIS in Baltic, Asian, and Central Asian areas.", "prerequisite": "PL SC003", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Writing Across the Curriculum"]}, {"department": "PLSC", "number": "485", "credits": "3 Credits", "description": "International migration relates to the mobility of humans across international borders for protection, settlement, and/or labor. Over the late 20th century, international migration (both viewed as immigration and emigration) has become a salient issue of national politics across most countries in the world, and different regional and global forums of governance. This course sets to contextualize the political discussion of migration by systematically analyzing the history, theories, and categories of migration. It presents a survey of the many subtopics discussed by the interdisciplinary migration literature that directly relates to broader political issues, including issues of development, immigration, and border control politics, citizenship and integration, the Migration state, migrants' agency, environmental and climate change-induced migration, etc. While covering important aspects of immigration in the United States, and more broadly in the West, it also intentionally looks at migration in the global South, where most migration and displacement occurs. This course also addresses directly ethical and methodological issues related to the study and representation of migration.", "prerequisite": "PLSC 14"}, {"department": "PLSC", "number": "486", "credits": "3 Credits", "description": "Study of the role of culture in East Asian regional and East-West international relations. ASIA 400 (PL SC 486/HIST 489) International Culture in East Asia (3) (IL)(BA) This course meets the Bachelor of Arts degree requirements. This course will examine the place of culture in international history through a comparative look at the role of cultural circulation and exchange in relations among China, Korea, and Japan (and between East Asia and the West) from the propagation of Buddhism in the first century A.D. to present-day circulation of popular music, movies, and comics. We will explore the international politics of culture and the politics of international culture, considering questions of what constitutes culture, whether it is ever entirely separate from politics, and how that separation has evolved over time. These larger themes of the course will be tackled by following the historical movement of concrete objects and people throughout the region. This is a course in international history, but it also seeks to explore aspects of international relations. The goals of the class are not only to gain an understanding of the uses and impact of culture in international relations, but also to develop the skill of building such an understanding through primary and secondary sources, both written and visual. Students in this class will think critically about assigned texts to develop their own interpretations of their meanings. Through readings, discussions, presentations, and the final project, students will enhance their ability to think critically and to express their ideas clearly in both speech and writing. Class work includes some lecture but emphasizes guided discussions, group work, writing exercises, and some student presentations. This participatory approach is intended to deepen students' appreciation of the assigned readings, to help them understand value systems that may differ from those predominant in western cultures, and to assist students in developing both analytic and expressive abilities.", "prerequisite": "ASIA 100", "other": ["Cross-listed with: ASIA 400", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "PLSC", "number": "487", "credits": "3 Credits", "description": "Major topics and issues of international law with special attention to institutional arrangements (international organizations) through which that law operates.  PL SC 487 International Law and Organizations (3) The course is useful in two distinct ways. First, it aids in the understanding of how countries conduct their relations with one another. Second, studying international law-it is a distinct system of law-- helps students to assess whether they might be suited for law school.The course introduces international law and international governmental organizations (the two are closely linked) and their role in the management of peaceful relations among countries as well as during international conflict. Both the contributions and limitations of international law will be analyzed. International law is viewed both as a body of norms countries feel an obligation to follow and as a means of communication among countries.Major topics covered include sources of international law, human rights law, environmental law, economic law, law of the sea, and the use of force. There are several hundred major intergovernmental organizations. Several of the most prominent will be discussed including the UN, the WTO, the European Union, the International Labor Organization, and the International Court of Justice.Examinations are principally of the essay variety although a command of factual information is essential to success in the course. Students also prepare critiques of important international legal cases (many of which have been decided by national courts) and of treaties (the principal modern manifestation of international law).", "prerequisite": "PL SC003 or PL SC014", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "488", "credits": "3 Credits", "description": "Comparative methodology and public policy implementation in postindustrial societies; selected case studies of policy output.  PL SC 488 Comparative Public Policy (3) Comparative Public Policy is an upper level political science course that includes components of comparative politics, public administration, and descriptive economics. The course presumes that developed industrial democracies confront common challenges in meeting human needs and that policy comparison is worthwhile despite distinctive societies and political cultures. For example, government involvement in the provision of health care varies widely from Britain's National Health Service to the largely private approach of the United States. Nevertheless all health care systems confront rising technology costs, an ageing population, and rising performance expectations. A primary purpose of the course is to consider the origin and development of individual country programs while assessing the common challenges. Cross national comparison becomes relevant to the course by including some available data on costs, implementation and outcomes. Because the course includes about six distinct areas, e.g., education, taxation, urban planning income support, and overall macroeconomic policy, the course will depict profiles of policymaking in Europe, North America and Japan. Ideally comparison should help students to evaluate the effectiveness of policy choices of a particular country and government. A second objective of the course will be to examine the national approaches to the relationship between the state and private economic activity. Not only does government expenditure amount to nearly half of some country's total output, government choices create distinctive legal environments for business activity. Antitrust, health, wage, and consumer regulation offer an excellent point of comparing different incentives for economic activity in the United States and Europe. Apart from policy choices mentioned in the first paragraph, the regulation of economic activity has cumulative results for employment and the distribution of income. This portion of the course is intended to be somewhat more elementary than the first because of the probability that students will be less familiar with its content. The primary objective will be to help students understand the variations among market economies and reasons for their description as \"neo-liberal,\" \"social market,\" or \"corporatist.\" Finally, the course will examine some current ideas about recent changes in the global economy and their consequences for national policy. Clearly \"globalization\" has become a matter of political concern owing to its consequences for the creation of wealth, employment, growth and distribution. While the course cannot devote detailed or exclusive to the European Union, Europe's response to rapid movements in short term capital and investment presents an interesting point of comparison with the United States and Japan. The course should enable students to understand the meaning and criticism of \"globalization\" as a factor in shaping some national policies.", "prerequisite": "PL SC003", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "489", "credits": "3 Credits", "description": "A survey of the major approaches to the management of most governmental agencies.  PL SC 489 Public Administration (3) Government Management is a three-credit Political Science course that teaches the role and function of bureaucracy. Although some investigation is made about state and local government functions, the primary focus of the course is on the federal bureaucracy. In particular, the course illustrates how the interrelationship between the three branches of government exists using the various federal agencies as functionaries.The course first examines the basic functions of bureaucratic agencies in the modern world; primarily their distributive, re-distributive and regulatory activities. In addition to these functions, the various external and internal political forces that form the mission of the agencies are examined. Next the internal function of a bureaucracy is examined by highlighting the various roles of the people who comprise a typical large agency. The roles of the political appointee, the career professional, the general civil servant and the union laborer are examined, with the GS system of the federal government used as a guide to show the hierarchy that exists in a large agency.By highlighting both the functions of a typical agency and examining its role in the larger government structure, and by looking inside the bureaucracy to see the various short and long term roles of the people who comprise those agencies, the student appreciates how large bureaucracies are at the same time always changing, and always staying the same.", "prerequisite": "PL SC001", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "490", "credits": "3 Credits", "description": "Advanced analysis of public policy, emphasizing policy evaluation and the factors that determine policy success and failure.", "prerequisite": "PL SC001 , PL SC002 , or PUBPL304W", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "491", "credits": "3 Credits", "description": "Advanced study of major contemporary issues of peace and conflict; includes anthropological, technological, psychological, and economic perspectives.", "prerequisite": "PL SC014 , PL SC091", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "Honors"]}, {"department": "PLSC", "number": "495", "credits": "1-6 Credits/Maximum of 6", "description": "Combining experience in government offices, related agencies, or law firms, with appropriate readings and a research paper/report.", "prerequisite": "prior consent of supervisor, adviser, or department head;   applicable departmental internship requirements such as   satisfactory completion of required 300- or 400-level courses   appropriate for the internship program selected", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "PLSC", "number": "498", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses offered infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "PLSC", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Study, in selected foreign countries, of political institutions.", "prerequisite": "PL SC003 , 3 credits in economics, history, political science, or   sociology", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}]