[{"department": "PORT", "number": "1", "credits": "4 Credits", "description": "For beginners. Grammar, with reading and writing of simple Portuguese; oral and aural work stressed.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "PORT", "number": "2", "credits": "4 Credits", "description": "Grammar, reading, and conversation continued; special emphasis on the language, literature, and life of Brazil.", "prerequisite": "PORT 001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "PORT", "number": "3", "credits": "4 Credits", "description": "Grammar, reading, composition, and conversation.", "prerequisite": "PORT 002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "PORT", "number": "51", "credits": "3 Credits", "description": "Intensive introduction to Portuguese: first half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  PORT 051 Elementary Intensive Portuguese for Graduate Students I (3)This is the first in a series of three courses designed to give students an intensive introduction to Portuguese. This is the first half of elementary sequence in reading, writing, speaking, listening, and cultural contexts. Students will learn the Portuguese vocabulary and will learn to create simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"department": "PORT", "number": "52", "credits": "3 Credits", "description": "Intensive introduction to Portuguese: second half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  PORT 052 Elementary Intensive Portuguese for Graduate Students II (3)This is the second in a series of three courses designed to give students an intensive introduction to Portuguese. This is the second half of graduate intensive sequence in elementary reading, writing, speaking, listening, and cultural contexts. Students will learn the Portuguese vocabulary. Lessons are taught in an authentic cultural context.", "prerequisite": "PORT 051 and graduate standing"}, {"department": "PORT", "number": "53", "credits": "3 Credits", "description": "Continued intensive study of Portuguese at the intermediate level: reading, writing, speaking, listening, cultural contexts.  PORT 053 Intermediate Intensive Portuguese for Graduate Students (3)This is the third in a series of three courses designed to give students an intermediate intensive knowledge of Portuguese. Continued intensive study of Portuguese at the intermediate level: reading, writing, speaking, listening, and cultural contexts. Lessons are taught in an authentic cultural context.", "prerequisite": "PORT 052 or equivalent, and graduate standing"}, {"department": "PORT", "number": "123", "credits": "2-3 Credits", "description": "This course offers an introduction to Brazilian Portuguese for students who already have a good grasp of grammar and vocabulary in Spanish, French, Italian, or Latin. This intensive course will address all four language skills (listening, speaking, reading, and writing) and provide an overall view of Portuguese, its basic linguistic structures, and vocabulary. Emphasis will be placed especially on the differences between Portuguese and Spanish. By building on students' prior knowledge of Romance languages, the class moves quickly to cover the content of the three-semester basic language sequence in a single semester. As students acquire linguistic fluency over the semester, they will gain insight into Brazilian culture by analyzing song lyrics, articles, poems, short stories, and films. Students will gain the language skills necessary to study, live, and work in Brazil, such as reading a variety of literary and non-literary texts, carrying on conversations on a range of personal, academic, and professional topics, write letters and other short pieces in Portuguese, and understand, for the most part, native speakers. Students must have the equivalent of three-semesters of college Spanish, French, Italian, or Latin, or the prior approval of the instructor to take this course. This course counts as 3 credits for undergraduate students and 2 credits for graduate students in the M.A. programs in Spanish literature and Spanish linguistics. Students are asked to register accordingly with the appropriate number of credits.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "PORT", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "PORT", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "PORT", "number": "200", "credits": "3 Credits", "description": "This course provides a more detailed study of the Portuguese language that builds upon the grammar, vocabulary, and communicative abilities developed in the basic language sequence. Students will review and extend their abilities in all four language skills (listening, speaking, reading, and writing) as they learn more about the linguistic and cultural diversity of the Portuguese-speaking world. The course uses a textbook paired with written, audio, and video workbook activities and supplemented by authentic language materials and artistic works that generate communicative exercises that allow students to practice and refine their spoken and written Portuguese. As students improve their understanding of the Portuguese language, they also gain insight into Luso-Afro-Brazilian cultures by analyzing music, films, videos, paintings, photos, essays, chronicles, news articles, short stories, and poems. Students learn about the distinct contexts in which Portuguese is spoken as they examine artistic works and linguistic variations that develop within specific countries and region.  This class serves as a transition course between basic and intermediate language classes and more advanced composition, literature, and culture courses taught at the 300 and 400-level. The class is conducted entirely in Portuguese. Students must have taken Portuguese 3 or 123, or received permission of the instructor, in order to enroll in this course.", "prerequisite": "PORT 3", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "PORT", "number": "210N", "credits": "3 Credits/Maximum of 6", "description": "SPAN 210N Multilingual and Intercultural Communication course will showcase the fundamental components of the intersection of language and culture through humanities and social science. The purpose of this course is to teach the underlying mechanisms of multilingualism through language science principles and develop an understanding of intercultural communication through humanistic approaches. The content of this course focuses on linguistic strategies for succeeding in multilingual environments (e.g. dialect variation, second language acquisition strategies) as well as intercultural communication practices for navigating new environments (e.g. understanding cultural norms, skills for global leadership). The course requires an introductory level understanding of language. Students will learn how language and culture inform each other through the examination of cultures within the United States and internationally, including non-Western cultures.", "prerequisite": "SPAN 3", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "PORT", "number": "297", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "PORT", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "PORT", "number": "365", "credits": "3 Credits", "description": "This course traces the transformation of Brazilian cities, as represented in literature and the arts, from the modernization projects of the late 19th century through the exponential growth of urban areas in recent decades. Studying these urban transformations will provide students with insight into how contemporary Brazil developed into an urban nation with seventeen of its cities featuring populations of one million or more. This class focuses primarily on artistic representations of the global metropolises of Rio de Janeiro and São Paulo, the modernist capital of Brasília, and the northeastern city of Recife. Readings will highlight the diverse experiences and expressions of urban life in essays, poems, short stories, and avant-garde novels. Music, film, and photography will complement students¿ literary tour of an urban Brazil. Critical readings from urban studies, architecture, anthropology, history, and other interdisciplinary fields will allow us to further explore the question of the city in Brazil. This course will be conducted in Portuguese. Students must be able to complete the readings, informal and formal written assignments, and in-class discussion and activities in Portuguese.", "prerequisite": "PORT 200", "other": ["Bachelor of Arts: Foreign/World Lang (12th Unit)", "Bachelor of Arts: Humanities"]}, {"department": "PORT", "number": "397", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "PORT", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "PORT", "number": "405", "credits": "3 Credits", "description": "The course uses essays, news articles, short stories, music, films, and other cultural materials to review key grammatical concepts, to expand vocabulary, and to deepen understanding of the language. Through these activities, students will improve their ability to speak and to write about a variety of topics in Portuguese at an advanced level. Time is divided between the four language skills (writing, speaking, reading, listening) with a particular emphasis on conversation and composition. These skills are addressed every week throughout the semester with more complexity and nuance.", "prerequisite": "PORT 3", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "PORT", "number": "473", "credits": "3 Credits", "description": "This course studies social, political, economic, and cultural issues in the Portuguese-speaking world through the lens of film. This course meets the Bachelor of Arts degree attributes in Humanities and the International Cultures requirement. Through examinations of feature films and documentaries, the class explores how cinema approaches social, cultural, political, and economic realities in Brazil, Portugal, and Lusophone Africa. Students will learn about national histories, political struggles, social movements, and cultural practices of the Luso-Afro-Brazilian world as they gain the skills and appropriate vocabulary to analyze and discuss film. The course materials will invite students to consider how films examine legacies of imperialism, colonialism, and dictatorial regimes, as well as ongoing divisions and injustices on the basis of race, class, gender, and sexuality. Questions to be considered in this course include: How do filmmakers grapple with traumas of the past, questions of memory, and debates around truth and reconciliation? How do forms of fiction and documentary intersect, serve as complements, or contradict each other in film? How does film represent the convergences and divergences between different parts of the Portuguese-speaking world? What are the possibilities and limitations of studying these works in a comparative Lusophone framework? Readings on film, history, and Luso-Afro-Brazilian culture, and interviews with filmmakers will complement our studies of the films. The course will be conducted in English. No prior knowledge of Portuguese is necessary, as the films will have subtitles and required readings will all be in English. Students pursuing the Portuguese minor may receive credit for the minor if they complete all of their written assignments in Portuguese.", "prerequisite": "PORT 200", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)"]}, {"department": "PORT", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "PORT", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "PORT", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "PORT", "number": "496A", "credits": "3-4 Credits", "other": ["Bachelor of Arts: Humanities"]}, {"department": "PORT", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}]