[{"department": "PSU", "number": "1", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "3", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "5", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "6", "credits": "1-3 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.  PSU 006 First Year Seminar in Business Administration (1-3 credits) This course is designed to assist students in examining several areas of the college transition: awareness of self and others; career exploration; majors offered in the Smeal College; and current issues in business. The skills learned in this course will be presented as life-long skills, applicable in the university setting and the corporate environment. The nature of the course requires cooperation, participation, and interaction. This course facilitates learning through experience, lectures and class discussion.The course contains assignments dealing with: 1). Leadership 2). Ethics 3). Celebrating Diversity 4). Diversity in the Workplace 5). Community Service 6). Major and Career Exploration 7). Time Management and Goal Setting 8). Business Case Study", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "6T", "credits": "1-3 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar", "Honors"]}, {"department": "PSU", "number": "7", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "8", "credits": "1-3 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.  PSU 008 First-Year Seminar University College (1-3) From a practical perspective this course will provide an advanced introduction to university life at Penn State, highlighting the many resources available to help students succeed. Topics covered will include the challenges of balancing life and school, academic success strategies, dealing with financial aid, choosing a major, as well as understanding academic discourse and university policy and procedure. In addition, we will read and discuss some of the latest research on the experiences of first year college students. We will think about the particular challenges first year students face, and consider what steps could be taken to address those challenges at the level of university and governmental policy. This is a student-led, discussion-oriented course where we talk about a range of issues in a small, informal setting, and our goal will be to create a collaborative environment in which everyone is comfortable participating. In addition to discussions, we will explore university resources and the pragmatic issues of college through lectures, guest speakers, and hands-on practice.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "8T", "credits": "1-3 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.  PSU 008T First-Year Seminar University College (1-3) Proposed PSU 008 as variable 1-3 credit course is designed to introduce the entering college student to the academic side of college life for honors students, and to help prepare students to negotiate the academic environment from their standpoint. In addition, its purpose is for honor students to look beyond college life to wider communities, gear up skills to focus on Honors level students, societal issues, and toward a considered discernment of one's potential contribution in our complex global society. Accordingly, this course emphasizes academic proficiency; the mission and the values of Penn State University; the application of acquired knowledge; higher level thinking; and social awareness. This is a personal development course focusing on strategies of academic success and the development of related living skills, which go beyond the academic environment.From a practical perspective this course will provide a major focus on in-depth career exploration, also an advanced introduction to university life at Penn State, highlighting the many resources available to help honor students succeed. Topics covered will include the challenges of balancing life and school, academic success strategies, dealing with financial aid, choosing a major, as well as understanding academic discourse and university policy and procedure.Furthermore, we will read and discuss some of the latest research on the experiences of first year honors college students. We will think about the particular challenges first year honors students face, and consider what steps could be taken to address those challenges at the level of university and governmental policy. This is a student-led, discussion-oriented course where we talk about a range of issues in a small, informal setting, and our goal will be to create a collaborative environment in which everyone is comfortable participating. In addition to discussions, we will explore university resources and the pragmatic issues of college through lectures, guest speakers, and hands-on practices.", "other": ["First-Year Seminar", "Honors"]}, {"department": "PSU", "number": "9", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "12", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "14", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "15", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "16", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "17", "credits": "1 Credits", "description": "Facilitate student's adjustment to the high expectations, demanding workload, increased academic liberties, and other aspects of the transition to college life.  PSU 017 First-Year Seminar College of Information Sciences and Technology (1) This course will help students be successful in the College of Information Sciences and Technology (IST) at Penn State University. It involves two elements: how to be a successful learner in general; and how to explore the academic challenges of the information sciences and related technologies. Through lectures, class discussions, assignments, and guest presentations students learn what it takes to be successful in college. Through a group project they learn what IST is about, the majors in the College, the learning formats that they will encounter, and what is expected of them as students and citizens in the College. More broadly, this course is centered on learning: learning about learning and learning about what it means to be a student in IST.", "other": ["First-Year Seminar"]}, {"department": "PSU", "number": "97", "credits": "1-3 Credits", "description": "Formal courses given infrequently to explore a topical of special interest in the context of transitioning to university life."}]