[{"department": "PT", "number": "100", "credits": "3 Credits", "description": "This course is a general introduction into the field of physical therapy. The definition, role and function of physical therapists (PTs), physical therapist assistants (PTAs), and other health care providers as members of the health care team will be covered. The history of physical therapy and the PTA will be presented. The organizational structure and operation of physical therapy service in a variety of settings will be studied. Students will become familiar with values-based behaviors that are essential for PTAs as well as the components of legal, ethical, and safe physical therapy practice. Medical terminology and abbreviations commonly used in physical therapy will be studied and an overview of the diseases/disorders specific to each body system will be presented. Students will become acquainted with the responsibilities of the PTA, including communication, interventions, documentation, and billing. Laboratory topics include basic patient care, infection control procedures, data collection techniques, and mobility and guarding techniques. There are lecture and laboratory components in this class, and students will be expected to pass both written examinations and lab practical examinations. Enrollment is limited to students accepted into the PTA major."}, {"department": "PT", "number": "100S", "credits": "3 Credits", "description": "This course is a general introduction into the field of physical therapy. The definition, role and function of physical therapists (PTs), physical therapist assistants (PTAs), and other health care providers as members of the health care team will be covered. The history of physical therapy and the PTA will be presented. The organization of physical therapy departments and health care teams will be studied. Students will become familiar with values-based behaviors that are essential for PTAs as well as the components of legal, ethical, and safe physical therapy practice. Medical terminology and abbreviations commonly used in physical therapy will be studied and an overview of the diseases/disorders specific to each body system will be presented. Students will become acquainted with the responsibilities of the PTA, including communication, interventions, documentation, and billing. Laboratory topics include basic patient care, infection control procedures, as well as mobility and guarding techniques. The course will include an introduction to campus resources and personnel to help students adjust to student life. This course should help students develop strategies to lead to success in the PTA major. Enrollment is limited to students accepted into the PTA major.", "other": ["First-Year Seminar"]}, {"department": "PT", "number": "101", "credits": "1 Credits", "description": "Introduction to basic computer skills for the physical therapist assistant.", "other": ["First-Year Seminar"]}, {"department": "PT", "number": "120", "credits": "2 Credits", "description": "This course is designed to give the learner a clear understanding of the locations, actions, and innervations of muscles in the human body and provide a foundation for learning and applying the principles of muscle strength testing. Course objectives include: demonstrating knowledge in the properties of muscle tissue and the basic mechanisms for muscle contraction; identifying and naming attachments and innervations of the muscles of the trunk and extremities; demonstrating competence in identifying muscle strength and weakness through manual muscle testing of trunk and skeletal musculature; and identifying different types of muscle contraction and interaction. The specific muscles involved in movement and stability of the appendicular and axial skeleton will be studied in detail. The information in this course is foundational to the application of physical therapy modalities and exercise, which are included in the PTA curriculum. The course will include lecture and laboratory components. Course content will be delivered in lecture and on-line materials. Enrollment is limited to students admitted to the 2PTA major."}, {"department": "PT", "number": "150", "credits": "2 Credits/Maximum of 2", "description": "This course is an introductory study of the general principles for physical therapy interventions including massage, thermal modalities, therapeutic light, ultrasound, and compression therapies. Introductory information regarding modalities and relevant information regarding inflammation and healing will also be covered. The course is designed to give the PTA student a working knowledge in the application and theory of physical agents in order to enhance the rehabilitation process. Interventions will be discussed and practiced in relation to the overall clinical management of patients and their specific disorders. Data collection skills associated with the interventions covered in this course will also be included. By the completion of this course, students should be able to discuss the rationale for and demonstrate the application of various thermal modalities, ultrasound, light therapies, compressive therapies and massage. Course content will be delivered in lecture, laboratory, and on-line materials. This course is available only to students enrolled in the 2 PTA major.", "prerequisite": "PT 100"}, {"department": "PT", "number": "160", "credits": "3 Credits", "description": "This course provides an introduction to the principles of exercise in the management of disease and injury which will help prepare the student for the application of therapeutic exercise during Physical Therapy clinical affiliations which follow the completion of this course. Course content will include, but is not limited to, some or all of the following topics: introduction to therapeutic exercise, range of motion, stretching, manual therapy and peripheral joint mobilization, resistance training, therapeutic protocols for specific conditions, balance and coordination training, interventions for cardiovascular and cardiopulmonary conditions, bony and soft tissue disorders, and specific data collection techniques associated with conditions discussed in this course. Indications and contraindications for the various forms of exercises and equipment will be incorporated in content of this course. This course includes both lecture and lab components. Students will be expected to demonstrate competence in both written and practical examinations. A variety of evaluation tools will be used to assess student performance in this course. Written examinations, quizzes, written assignments, including homework may be utilized to assess cognitive understanding of course content. For assessment of psychomotor skills, lab practical examinations, skill evaluations, and oral questioning may be used. Group projects and peer assessment might also be included at some campuses. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "PT 100"}, {"department": "PT", "number": "201", "credits": "1 Credits", "description": "Preparation for the national PTA licensure examination.  P T 201 Licensure Preparation for the PTA (1) This course is an elective course for PTA students, in preparation for the national licensure examination. The course will consist of a review of the entire PTA curriculum through the use of licensure examination practice tests. The course will also include practice sessions with the computerized licensure tests. A review of strategies for succeeding on multiple choice tests will be presented. Prerequisites for this course are a C or better in the P T 100 and P T 384 courses.Class size, frequency of offering, and evaluation methods will vary by location and instructor, For these details, check the specific course syllabus.", "prerequisite": "PT 250"}, {"department": "PT", "number": "202", "credits": "1 Credits", "description": "A study of physical therapy as it applies to pediatric patients.  P T 202 Pediatric PT (1) This course is an elective course for those Physical Therapists Assistant students interested in further study in pediatric physical therapy. The course will focus on various conditions affecting children, which may include cerebral palsy, spina bifida, and Down syndrome. The students will be given the opportunity to learn about pediatric physical therapy in lecture/discussion sessions and/or laboratory settings, some of which will take place at PSMA and some which may take place at other locations where they will observe children with various disabilities.", "prerequisite": "PT 384"}, {"department": "PT", "number": "204", "credits": "1 Credits", "description": "Specialized physical therapy topics investigated in the framework of clinic visitations and presentations by clinical experts.  P T 204 Seminar in Physical Therapy (1) The purpose of P T 204 is to provide Physical Therapist Assistant students with an opportunity to explore special topics in physical therapy. The format of the course will be seminar based. The course will consist of a series of presentations led by faculty or outside lecturers and may involve travel to hospitals and clinics. Evaluation of student performance will be based on attendance, completion of all criterion and assignments. This course will typically be offered in the last semester of classroom instruction, before the students begin their final clinical affiliations. This class will be limited to 12-16 students per section. This is an optional PTA course, which may be taken to satisfy the elective requirements of the PTA program. Prerequisites for this course are a C or better in the P T 100 and P T 384 courses.Class size, frequency of offering, and evaluation methods will vary by location and instructor. For these details, check the specific course syllabus.", "prerequisite": "PT 384"}, {"department": "PT", "number": "205", "credits": "1-2 Credits", "description": "Comprehensive review of Human Musculature.  P T 205 Human Musculature (1) This course is an elective course for those PTA students interested in a review of human musculature. The course is designed to provide advanced students with a comprehensive review of the human muscles including identification of the muscles, their actions, insertions, origins, and innervations. Students will be graded on preparation, participation, class attendance, and completion of self-assessments. Prerequisites for this course are a C or better in the P T 100, P T 384 and BIOL 129 courses. Class size, frequency of offering, and evaluation methods will vary by location and instructor. For these details, check the specific course syllabus."}, {"department": "PT", "number": "250", "credits": "3 Credits", "description": "The student will be introduced to the basic concepts and principles of spinal traction, neuromuscular excitation, nociception, electrical currents, and electromagnetic fields. The student will develop satisfactory skills in applying electrical stimulation systems, electromyographic biofeedback, iontophoresis, and supine/prone pelvic and cervical traction techniques. Wound care interventions, including the use of electrical stimulation, products and dressings will be addressed. Treatment methods will be discussed and practiced in relation to the overall clinical management of patients and their specific disorders. Data collection skills associated with the interventions covered in this course will also be included. By the completion of this course, students should be able to articulate the basic concepts behind the use of selected physical therapy modalities and demonstrate the safe and effective use of the modalities. In addition, they should be able to discuss and demonstrate appropriate interventions for the PTA regarding wound care. Course content will be delivered in lecture, laboratory, and on-line materials. Enrollment is limited to students accepted in the 2PTA major."}, {"department": "PT", "number": "260", "credits": "3 Credits", "description": "Advanced principles and application of exercise in the treatment of disease and injury will be explored. Students will learn concepts and skills necessary to promote healing through exercise and will be able to apply these skills appropriately for a variety of populations. Topics of instruction may include but are not limited to: pre/post-surgical interventions for specific conditions, exercise as a conservative intervention for orthopedic conditions, women's health, cardiovascular endurance exercise, postural dysfunction, industrial medicine, exercise and interventions for respiratory problems, and aquatic exercise. Specific objectives for this course include students' gaining competence in performing therapeutic skill and discussing the relevance of, indications, contraindications and precautions for interventions in the following areas: soft tissue injuries and disorders, bony and joint disorders, neck and back pain and postural dysfunction, disorders of the peripheral nervous system, respiratory dysfunction, cardiovascular dysfunction, women's health issues, aquatic exercise, industrial medicine, and data collection. This course includes both lecture and lab components and students will be expected to demonstrate competence in both written and practical examinations. Enrollment is limited to students admitted to the 2PTA major."}, {"department": "PT", "number": "270", "credits": "5 Credits", "description": "This course is designed to give the PTA student a working knowledge of the physiology of disease and conditions commonly seen in physical therapy. Basic signs, symptoms, causes, and processes of disease and conditions will be covered. Diagnostic criteria, progression, and interventions, including physical therapy interventions, medical and surgical interventions, and pharmaceutical interventions will be addressed. Areas of study in the course may include, but are not limited to, inflammation and healing, inflection, immunity and immune disorders, and disorders of the following systems: cardiovascular, respiratory, musculoskeletal, integumentary, endocrine, lymphatic, neurological, hematologic, hepatic, gastrointestinal, hepatic and biliary, renal and urological, genital and reproductive. Genetic disorders, cancer, and mental health will also be addressed.. By the completion of this course, a student should be able to: (1) Define and apply terminology used in Pathophysiology and the ICF Disablement Model (2) Discuss inflammation and healing, (3) Discuss the immune system in terms of its function and possible disorders (4) Identify infectious conditions and describe their transmission and progression (5) List and describe conditions affecting the integumentary system and discuss the role of physical therapy in treating skin conditions (6) Discuss conditions of and applications for physical therapy for the following systems: cardiovascular, respiratory, lymphatic, musculoskeletal, neurological, and endocrine. (7) Identify conditions, diseases, and problems with the body systems, including the neurological, hematologic, gastrointestinal, hepatic, biliary, renal and urological, genital and reproductive. (8) Discuss cancer in terms of pathophysiology, risk factors, and various types of cancer. (9) Discuss special considerations for the PTA when working with patients who are geriatric, in specialized acute care units, and with various comorbidities. (10) Identify mental health issues and appropriate interactions and interventions with patients with mental or emotional health issues. Course content will be delivered in lecture and on-line materials. Enrollment is limited to students accepted in the 2PTA major.", "prerequisite": "PT 100"}, {"department": "PT", "number": "270W", "credits": "5 Credits", "description": "This course is designed to give the PTA student a working knowledge of the physiology of disease and conditions commonly seen in physical therapy. Basic signs, symptoms, causes, and processes of disease and conditions will be covered. Diagnostic criteria, progression, and interventions, including physical therapy interventions, medical and surgical interventions, and pharmaceutical interventions will be addressed. Areas of study in the course may include, but are not limited to, inflammation and healing, inflection, immunity and immune disorders, and disorders of the following systems: cardiovascular, respiratory, musculoskeletal, integumentary, endocrine, lymphatic, neurological, hematologic, hepatic, gastrointestinal, hepatic and biliary, renal and urological, genital and reproductive. Genetic disorders, cancer, and mental health will also be addressed.. By the completion of this course, a student should be able to: (1) Define and apply terminology used in Pathophysiology and the ICF Disablement Model (2) Discuss inflammation and healing, (3) Discuss the immune system in terms of its function and possible disorders (4) Identify infectious conditions and describe their transmission and progression (5) List and describe conditions affecting the integumentary system and discuss the role of physical therapy in treating skin conditions (6) Discuss conditions of and applications for physical therapy for the following systems: cardiovascular, respiratory, lymphatic, musculoskeletal, neurological, and endocrine. (7) Identify conditions, diseases, and problems with the body systems, including the neurological, hematologic, gastrointestinal, hepatic, biliary, renal and urological, genital and reproductive. (8) Discuss cancer in terms of pathophysiology, risk factors, and various types of cancer. (9) Discuss special considerations for the PTA when working with patients who are geriatric, in specialized acute care units, and with various comorbidities. (10) Identify mental health issues and appropriate interactions and interventions with patients with mental or emotional health issues. This is a writing intensive course that will include instructor written evaluation and feedback of student's writing. The student writing will be specific to the Physical Therapy discipline and include multiple and varied assignments. Writing will be a factor in the final grade for this course.Course content will be delivered in lecture and on-line materials. Assessment of mastery of content will be determined through any or all of the following methods: written tests and quizzes, papers, individual or group projects, homework, in-class assignments. Enrollment is limited to students accepted in the 2PTA major.", "prerequisite": "PT 100", "other": ["Writing Across the Curriculum"]}, {"department": "PT", "number": "271", "credits": "3 Credits", "description": "This course is designed to give the PTA student a working knowledge of the physiology of disease and conditions commonly seen in physical therapy. Basic signs, symptoms, causes, and processes of disease and conditions will be covered. Diagnostic criteria, progression, and interventions, including physical therapy interventions, medical and surgical interventions, and pharmaceutical interventions will be addressed. Areas of study in the course may include, but are not limited to, inflammation and healing, inflection, immunity and immune disorders, and disorders of the following systems: cardiovascular, respiratory, musculoskeletal, integumentary, endocrine, lymphatic, and neurological. By the completion of this course, a student should be able to: (1) Define and apply terminology used in Pathophysiology and the ICF Disablement Model (2) Discuss inflammation and healing, (3) Discuss the immune system in terms of its function and possible disorders (4) Identify infectious conditions and describe their transmission and progression (5) List and describe conditions affecting the integumentary system and discuss the role of physical therapy in treating skin conditions (6) Discuss conditions of and applications for physical therapy for the following systems: cardiovascular, respiratory, lymphatic, musculoskeletal, neurological, and endocrine. This course is available to students enrolled in the PTA major. Course content will be delivered in lecture and on-line materials.", "prerequisite": "PT 100"}, {"department": "PT", "number": "271W", "credits": "3 Credits", "description": "This course is designed to give the PTA student a working knowledge of the physiology of disease and conditions commonly seen in physical therapy. Basic signs, symptoms, causes, and processes of disease and conditions will be covered. Diagnostic criteria, progression, and interventions, including physical therapy interventions, medical and surgical interventions, and pharmaceutical interventions will be addressed. Areas of study in the course may include, but are not limited to, inflammation and healing, inflection, immunity and immune disorders, and disorders of the following systems: cardiovascular, respiratory, musculoskeletal, integumentary, endocrine, lymphatic, and neurological. By the completion of this course, a student should be able to: (1) Define and apply terminology used in Pathophysiology and the ICF Disablement Model (2) Discuss inflammation and healing, (3) Discuss the immune system in terms of its function and possible disorders (4) Identify infectious conditions and describe their transmission and progression (5) List and describe conditions affecting the integumentary system and discuss the role of physical therapy in treating skin conditions (6) Discuss conditions of and applications for physical therapy for the following systems: cardiovascular, respiratory, lymphatic, musculoskeletal, neurological, and endocrine. This is a writing-intensive course that will include instructor written evaluation and feedback of student writing. Writing assignments will be specific to the Physical Therapy discipline and include multiple and varied assignments. Writing will be a factor in the final grade for this course. Course content will be delivered in lecture and on-line materials. Assessment of mastery of content will be determined through any or all of the following methods: written tests and quizzes, papers, individual or group projects, homework, in-class assignments. This course is available to students enrolled in the PTA major.", "prerequisite": "PT 100", "other": ["Writing Across the Curriculum"]}, {"department": "PT", "number": "272", "credits": "2 Credits", "description": "This course is designed to give the PTA student a working knowledge of the physiology of disease states and conditions commonly seen in physical therapy. Basic signs, symptoms, causes, and processes of disease and conditions will be covered. Diagnostic criteria, progression, and interventions, including physical therapy interventions, medical and surgical interventions, and pharmaceutical interventions will be addressed. Areas of study in the course may include, but are not limited to, disorders of the following systems: neurological, hematologic, hepatic, gastrointestinal, hepatic and biliary, renal and urological, genital and reproductive. Genetic disorders, cancer, and mental health will also be addressed. By the completion of this course, students should be able to: (1) Identify conditions, diseases, and problems with the body systems, including the neurological, hematologic, gastrointestinal, hepatic, biliary, renal and urological, genital and reproductive. (2) Discuss cancer in terms of pathophysiology, risk factors, and various types of cancer. (3) Discuss special considerations for the PTA when working with patients who are geriatric, in specialized acute care units, and with various comorbidities. (4) Identify mental health issues and appropriate interactions and interventions with patients with mental or emotional health issues. Course content will be delivered in lecture and on-line materials. This course is available to students enrolled in the PTA major.", "prerequisite": "PT 271"}, {"department": "PT", "number": "280", "credits": "5 Credits", "description": "This course introduces the basic principles, diagnoses, impairments, and treatment interventions utilized by the PTA in the rehabilitation setting. Participants will review basic skills necessary for treating rehabilitation patients safely and overview common mobility equipment used in a rehabilitation setting. The following topics will be addressed in lecture and/or lab sessions: basic principles of normal movement and neuro-rehabilitation, teaching and learning theories, and motor relearning; data collection techniques and tools associated with neurological rehabilitation; functional mobility and motor function training techniques for patients with varying levels of disability; wheelchair mobility training and appropriate fitting and adaptations; environmental assessment and ADA considerations; gait deviations and training with and without assistive devices; orthotics; amputations and prosthetics; selected diagnoses in neuro-rehabilitation. This course will address rehabilitation techniques for patients with selected conditions seen in physical therapy neurological and rehabilitation settings. Selected neurological conditions will be covered, including etiology, clinical presentation, medical management, and physical therapy interventions. Neurologic conditions and developmental delays associated with pediatric clients will also be included. In this course, neuroanatomy and neurophysiology will be reviewed and principles of specific neuro-rehabilitation techniques, and neuromotor development will be explored. By the completion of this course, students should be able to recognize and verbalize general signs and symptoms of neurological deficit and demonstrate basic skills used in physical therapy for patients with selected neurological disorders and amputations. Students should also be able to identify specific areas in the brain, spinal cord, and peripheral nervous system associated with neurological signs, symptoms, and conditions; perform and discuss the value and use of various data collection tools associated with neuro-rehabilitation; demonstrate safe and effective physical therapy interventions as applied to patients with neurological disorders; discuss and demonstrate basic physical therapy interventions for patients with vestibular dysfunction; discuss the basic developmental milestones associated with human growth and development; and demonstrate and discuss safe and effective handling and positioning principles used with pediatric patients. Gait deviations and interventions, wheelchair fitting and use, and specific physical therapy interventions for various diagnoses will be covered. Using extensive examples, exercises, and real life scenarios, this course teaches students skills to assess, treat and document functional outcomes in a clear and logical progression. Lecture, lab activities, and written assignments will be used to discuss clinical decision-making and intervention strategies for related impairments. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "PT 100"}, {"department": "PT", "number": "280W", "credits": "5 Credits", "description": "This course introduces the basic principles, diagnoses, impairments, and treatment interventions utilized by the PTA in the rehabilitation setting. Participants will review basic skills necessary for treating rehabilitation patients safely and overview common mobility equipment used in a rehabilitation setting. The following topics will be addressed in lecture and/or lab sessions: basic principles of normal movement and neuro-rehabilitation, teaching and learning theories, and motor relearning; data collection techniques and tools associated with neurological rehabilitation; functional mobility and motor function training techniques for patients with varying levels of disability; wheelchair mobility training and appropriate fitting and adaptations; environmental assessment and ADA considerations; gait deviations and training with and without assistive devices; orthotics; amputations and prosthetics; selected diagnoses in neuro-rehabilitation. This course will address rehabilitation techniques for patients with selected conditions seen in physical therapy neurological and rehabilitation settings. Selected neurological conditions will be covered, including etiology, clinical presentation, medical management, and physical therapy interventions. Neurologic conditions and developmental delays associated with pediatric clients will also be included. In this course, neuroanatomy and neurophysiology will be reviewed and principles of specific neuro-rehabilitation techniques, and neuromotor development will be explored. By the completion of this course, students should be able to recognize and verbalize general signs and symptoms of neurological deficit and demonstrate basic skills used in physical therapy for patients with selected neurological disorders and amputations. Students should also be able to identify specific areas in the brain, spinal cord, and peripheral nervous system associated with neurological signs, symptoms, and conditions; perform and discuss the value and use of various data collection tools associated with neuro-rehabilitation; demonstrate safe and effective physical therapy interventions as applied to patients with neurological disorders; discuss and demonstrate basic physical therapy interventions for patients with vestibular dysfunction; discuss the basic developmental milestones associated with human growth and development; and demonstrate and discuss safe and effective handling and positioning principles used with pediatric patients. Gait deviations and interventions, wheelchair fitting and use, and specific physical therapy interventions for various diagnoses will be covered. Using extensive examples, exercises, and real life scenarios, this course teaches students skills to assess, treat and document functional outcomes in a clear and logical progression. Lecture, lab activities, and written assignments will be used to discuss clinical decision-making and intervention strategies for related impairments. This is a writing-intensive course that will include instructor written evaluation and feedback of student writing. Writing assignments will be specific to the Physical Therapy discipline and include multiple and varied assignments. Writing will be a factor in the final grade for this course. Course content will be delivered in lecture and/or on-line materials. A variety of evaluation tools will be used to assess student performance in this course. Written examinations, quizzes, written assignments, including homework may be utilized to assess cognitive understanding of course content. For assessment of psychomotor skills, lab practical examinations, skill evaluations, and oral questioning may be used. Group projects and peer assessment might also be included at some campuses. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "PT 100", "other": ["Writing Across the Curriculum"]}, {"department": "PT", "number": "281", "credits": "2 Credits", "description": "This course introduces the basic principles, diagnoses, impairments, and treatment interventions utilized by the PTA in the rehabilitation setting. Participants will review basic skills necessary for treating rehabilitation patients safely and overview common mobility equipment used in a rehabilitation setting. The following topics will be addressed in lecture and/or lab sessions: basic principles of normal movement and neuro-rehabilitation, teaching and learning theories, and motor relearning; data collection techniques and tools associated with neurological rehabilitation; functional mobility and motor function training techniques for patients with varying levels of disability; wheelchair mobility training and appropriate fitting and adaptations; environmental assessment and ADA considerations; gait deviations and training with and without assistive devices; orthotics; amputations and prosthetics; selected diagnoses in neuro-rehabilitation. By the completion of this course, students should be able to recognize and verbalize general signs and symptoms of neurological deficit and demonstrate basic skills used in physical therapy for patients with selected neurological disorders and amputations. This course includes both lecture and lab components and students will be expected to demonstrate competence in both written and practical examinations. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "PT 100"}, {"department": "PT", "number": "282", "credits": "3 Credits", "description": "In this course, neuroanatomy and neurophysiology will be reviewed and principles of specific neuro-rehabilitation techniques, and neuromotor development will be explored. This course will address rehabilitation techniques for patients with selected conditions seen in physical therapy neurological and rehabilitation settings. Selected neurological conditions will be covered, including etiology, clinical presentation, medical management, and physical therapy interventions. Neurologic conditions and developmental delays associated with pediatric clients will also be included. By the completion of this course, students should be able to identify specific areas in the brain, spinal cord, and peripheral nervous system associated with neurological signs, symptoms, and conditions; perform and discuss the value and use of various data collection tools associated with neuro-rehabilitation; demonstrate safe and effective physical therapy interventions as applied to patients with neurological disorders; discuss and demonstrate basic physical therapy interventions for patients with vestibular dysfunction; discuss the basic developmental milestones associated with human growth and development; and demonstrate and discuss safe and effective handling and positioning principles used with pediatric patients. Gait deviations and interventions, wheelchair fitting and use, and specific physical therapy interventions for various diagnoses will be covered. Using extensive examples, exercises, and real life scenarios, this course teaches students skills to assess, treat and document functional outcomes in a clear and logical progression. Lecture, lab activities, and written assignments will be used to discuss clinical decision-making and intervention strategies for related impairments. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "PT 281"}, {"department": "PT", "number": "282W", "credits": "3 Credits", "description": "In this course, neuroanatomy and neurophysiology will be reviewed and principles of specific neuro-rehabilitation techniques, and neuromotor development will be explored. This course will address rehabilitation techniques for patients with selected conditions seen in physical therapy neurological and rehabilitation settings. Selected neurological conditions will be covered, including etiology, clinical presentation, medical management, and physical therapy interventions. Neurologic conditions and developmental delays associated with pediatric clients will also be included. By the completion of this course, students should be able to identify specific areas in the brain, spinal cord, and peripheral nervous system associated with neurological signs, symptoms, and conditions; perform and discuss the value and use of various data collection tools associated with neuro-rehabilitation; demonstrate safe and effective physical therapy interventions as applied to patients with neurological disorders; discuss and demonstrate basic physical therapy interventions for patients with vestibular dysfunction; discuss the basic developmental milestones associated with human growth and development; and demonstrate and discuss safe and effective handling and positioning principles used with pediatric patients. Gait deviations and interventions, wheelchair fitting and use, and specific physical therapy interventions for various diagnoses will be covered. Using extensive examples, exercises, and real life scenarios, this course teaches students skills to assess, treat and document functional outcomes in a clear and logical progression. Lecture, lab activities, and written assignments will be used to discuss clinical decision-making and intervention strategies for related impairments. This is a writing-intensive course that will include instructor written evaluation and feedback of student writing. Writing assignments will be specific to the Physical Therapy discipline and include multiple and varied assignments. Writing will be a factor in the final grade for this course. Course content will be delivered in lecture and on-line materials.A variety of evaluation tools will be used to assess student performance in this course. Written examinations, quizzes, written assignments, including homework may be utilized to assess cognitive understanding of course content. For assessment of psychomotor skills, lab practical examinations, skill evaluations, and oral questioning may be used. Group projects and peer assessment might also be included at some campuses. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "PT 281", "other": ["Writing Across the Curriculum"]}, {"department": "PT", "number": "285", "credits": "2 Credits", "description": "This course will provide PTA students with opportunities to synthesize, prioritize, and apply rehabilitation principles from many different PTA courses. Students will learn strategies to combine data collection skills, interventions, and techniques in an integrated manner. Communication, documentation skills and therapeutic intervention skills will be developed through activities and class assignments. Patient scenarios will be utilized to afford students opportunities to develop their skills in choosing and applying effective treatment strategies for patients with complex diagnoses and/or cultural or intellectual differences, all while simultaneously addressing their patient's comorbidities, past medical history, family dynamics and anticipated discharge destination. Using extensive examples, exercises, and real life scenarios, this course teaches students skills to assess, treat and document functional outcomes in a clear and logical progression. Additionally, concepts, principles, skills and techniques will be reviewed in preparation for the final clinical experiences and the PTA licensure examination. This course is available to students enrolled in the PTA major.", "prerequisite": "PT 150"}, {"department": "PT", "number": "290", "credits": "2 Credits", "description": "This course is an introduction to the professional issues related to the physical therapist assistant's role in the current health care environment. The course is designed to foster professional development of the physical therapist assistant student and to prepare the student to complete essential competencies and behaviors of health care related to the field of physical therapy. The course will guide the student in preparing the necessary documents for clinical practicum. Areas of study in the course may include but are not limited to, the role of the physical therapist assistant as defined by the American Physical Therapy Association and state practice acts, Values-Based Behaviors for the Physical Therapist Assistant, Standards of Ethical Conduct for the Physical Therapist Assistant, ethical problem solving in healthcare including recognizing and discussing legal and ethical issues in physical therapy, cultural diversity and cultural competence, lifelong learning and continuing competence, professional communication in clinical situations including HIPAA, billing and reimbursement in physical therapy, and medical documentation including the value and necessity of thorough documentation, recognition of the PTA role in documentation, completion of appropriate medical documentation and appropriate use of medical abbreviations. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "PT 100"}, {"department": "PT", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "PT", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "PT", "number": "384", "credits": "3 Credits", "description": "The focus of PT 384, Applied Kinesiology, is to incorporate anatomical structure of the human body, principles of biomechanics, kinetics, and kinematics with the study of human motion and mobility. Areas of instruction include: joint structure and function; arthro- and osteokinematics; muscular kinesiology; posture; normal gait; leverage systems and the forces involved in moving the human body; and joint motion assessment through goniometry and functional measures. This course prepares PTA students for integration of kinesiological concepts into the application of physical therapy interventions. Course objectives include: defining key kinesiological and biomechanical terms and applying concepts to human movement scenarios; demonstrating understanding of: joint configuration and movement; joint motion measurement; muscular kinesiology; posture; and gait. Course content will be delivered in the classroom, laboratory and on-line. The course will include lecture and laboratory components and students will be expected to demonstrate competence in both written and practical examinations. Enrollment is limited to students admitted to the 2PTA major.", "prerequisite": "BIOL 161"}, {"department": "PT", "number": "395E", "credits": "3 Credits", "description": "PT 395E is the beginner level practice of physical therapist assistant skills in a clinical setting under the direction and supervision of a licensed physical therapist and/or physical therapist/physical therapist assistant team. Course expectations include, but are not limited to: understanding and adhering to the Standards of Ethical Conduct for the Physical Therapist Assistant and the Values-Based Behaviors for the Physical Therapist Assistant, demonstration of appropriate verbal, non-verbal and written beginner level communication, safe implementation of beginner level therapeutic interventions and data collection skills with non-complex patients as outlined in the plan of care established by the physical therapist. This course includes both clinical experience and online learning activities that students will be expected to complete. Enrollment is limited to 2PTA major.", "prerequisite": "PT 100"}, {"department": "PT", "number": "395F", "credits": "4 Credits", "description": "PT 395F is the intermediate level practice of physical therapist assistant skills in a clinical setting under the direction and supervision of a licensed physical therapist and/or physical therapist/physical therapist assistant team. Course expectations include, but are not limited to: understanding and adhering to the Standards of Ethical Conduct for the Physical Therapist Assistant and the Values-Based Behaviors for the Physical Therapist Assistant, demonstration of appropriate verbal, non-verbal and written communication, safe and effective implementation at an intermediate skill level with associated therapeutic interventions and data collection with patients of varying complexities as outlined in the plan of care established by the physical therapist. Students will be guided to apply current knowledge, theory and clinical judgement to progress or modify patient treatment within the established plan of care. This course includes both clinical experience and online learning activities that students will be expected to complete. Enrollment is limited to 2PTA major.", "prerequisite": "PT 250"}, {"department": "PT", "number": "395G", "credits": "4 Credits", "description": "P T 395G is the terminal clinical experience of the practice of physical therapist assistant skills under the direction and supervision of a licensed physical therapist and/or physical therapist/physical therapist assistant team culminating in entry level practice. Course expectations include, but are not limited to: understanding and adhering to the Standards of Ethical Conduct for the Physical Therapist Assistant and the Values-Based Behaviors for the Physical Therapist Assistant, demonstration of appropriate verbal, non-verbal and written communication, safe, effective and efficient implementation of therapeutic interventions and data collection with patients of varying complexities as outlined in the plan of care established by the physical therapist. Students will be expected to apply current knowledge, theory and clinical judgement to progress or modify patient treatment within the established plan of care. Essential skills for clinical practice will be emphasized in preparation for career entry into the current healthcare environment. This course includes both clinical experience and online learning activities that students will be expected to complete. Enrollment is limited to 2PTA major.", "prerequisite": "PT 395F"}, {"department": "PT", "number": "395H", "credits": "2 Credits", "description": "PT 395H is the intermediate level practice of physical therapist assistant skills in a clinical setting under the direction and supervision of a licensed physical therapist and/or physical therapist/physical therapist assistant team. Course expectations include, but are not limited to: understanding and adhering to the Standards of Ethical Conduct for the Physical Therapist Assistant and the Values-Based Behaviors for the Physical Therapist Assistant, demonstration of appropriate verbal, non-verbal and written communication, safe and effective implementation at an intermediate skill level with associated therapeutic interventions and data collection with patients of varying complexities as outlined in the plan of care established by the physical therapist. Students will be guided to apply current knowledge, theory and clinical judgement to progress or modify patient treatment within the established plan of care. This course includes both clinical experience and online learning activities that students will be expected to complete. Enrollment is limited to 2PTA major.", "prerequisite": "PT 290"}, {"department": "PT", "number": "395I", "credits": "2 Credits", "description": "PT 395 I is the advanced intermediate level practice of physical therapist assistant skills in a clinical setting under the direction and supervision of a licensed physical therapist and/or physical therapist/physical therapist assistant team. Course expectations include, but are not limited to: understanding and adhering to the Standards of Ethical Conduct for the Physical Therapist Assistant and the Core Values of the PT and PTA, demonstration of appropriate verbal, non-verbal and written communication, safe and effective implementation at an intermediate skill level with associated therapeutic interventions and data collection with patients of varying complexities as outlined in the plan of care established by the physical therapist. Students will be guided to apply current knowledge, theory and clinical judgement to progress or modify patient treatment within the established plan of care. This course includes both clinical experience and online learning activities that students will be expected to complete. Enrollment is limited to 2PTA major.", "prerequisite": "PT 395H"}]