[{"department": "RPTM", "number": "1", "credits": "1.5-3 Credits/Maximum of 12", "description": "Introduction to Outdoor Pursuits (KINES 1/ RPTM 1) is a course that is designed to introduce the student to selected outdoor pursuit activities. The selected activities will depend on the time of the year and availability of resources. The activities could include but are not limited trail day hiking, mountain biking, backpacking, orienteering, kayaking, canoeing, cross country skiing, or to rock climbing experiences. All selected activities will follow the same basic format of skill development and training procedures, history and philosophical underpinnings of the activity, available written resources and professional organizations related to the activity, logistical equipment preparation, appreciation of environmental impact of partaking in the selected activity, safety management / risk assessment and future opportunities to participate in the activity. It is a purpose of this course to allow the student to explore different outdoor pursuit activities and then to make a more informed decision as to which activities they might choose to further develop their skill base and competency necessary to partake in the activity at a more advanced level on a life long basis. Through opportunities to develop camaraderie through collaborative work/ teamwork, students practice safe participation in the selected activities with attention to environmental impact. Students will experience a common skill base from which to engage in the activities. After completion of the course, students are encouraged to engage in adventure recreation programs, and other appropriate courses to help with the continued development of life skills. This course fulfills credits toward the GHW General Education requirement.", "other": ["Cross-listed with: KINES 1", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "RPTM", "number": "1Z", "credits": "1.5-3 Credits/Maximum of 6", "description": "Introduction to Outdoor Pursuits (KINES 1Z/ RPTM 1Z) is a course that is designed to introduce the student to selected outdoor pursuit activities. The selected activities will depend on the time of the year and availability of resources. The activities could include but are not limited trail day hiking, mountain biking, backpacking, orienteering, kayaking, canoeing, cross country skiing, or to rock climbing experiences. All selected activities will follow the same basic format of skill development and training procedures, history and philosophical underpinnings of the activity, available written resources and professional organizations related to the Course Justification activity, logistical equipment preparation, appreciation of environmental impact of partaking in the selected activity, safety management / risk assessment and future opportunities to participate in the activity. It is a purpose of this course to allow the student to explore different outdoor pursuit activities and then to make a more informed decision as to which activities they might choose to further develop their skill base and competency necessary to partake in the activity at a more advanced level on a life-long basis. Through opportunities to develop camaraderie through collaborative work/ teamwork, students practice safe participation in the selected activities with attention to environmental impact. Students will experience a common skill base from which to engage in the activities. After completion of the course, students are encouraged to engage in adventure recreation programs, and other appropriate courses to help with the continued development of life skills. This course fulfills credits toward the GHW General Education requirement. KINES 1Z/RPTM 1Z is linked to ENGL 183Z; the two courses must be taken concurrently.", "prerequisite": "ENGL 183Z", "other": ["General Education: Health and Wellness (GHW)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "RPTM", "number": "98", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest"}, {"department": "RPTM", "number": "100", "credits": "2 Credits", "description": "First year seminar for students enrolled in the Professional Golf Management option of RPTM.  RPTM 100S Introduction to Golf Management (2) This course is designed to provide 1st year students enrolled in RPTM - Professional Golf Management Option, an introduction to the University, to their major / option, and to the Professional Golfers' Association of America. The course objectives are to introduce students to active learning as a way to make the transition to a more demanding academic environment. Students in the class will participate in collaborative group projects, which should also provide opportunities for them to establish relationships with faculty and peers. Students will investigate career opportunities within their field, as well as develop cover letters, resumes and reference sheets that will be necessary in obtaining internships for the summer session following their first year. Course content will also include information to help students become better students, by introducing them to available resources at the University, as well as develop skills in areas such as time management, study skills, note-taking etc. In addition, information will be introduced to help students become responsible members of the University community.", "other": ["First-Year Seminar"]}, {"department": "RPTM", "number": "100A", "credits": "3 Credits/Maximum of 12", "description": "For students enrolled in the PGA Accredited Golf Management Option in RPTM This is a course that will be offered in the fall semester only for students pursuing Professional Golf Management which seeks to provide students with the knowledge and skills necessary to play golf at a high enough level to become a PGA Professional. The primary focus of the course will be on golf movement skills, on-course performance, and mental training for performance. At the completion of this course, students will be equipped to better evaluate each aspect of their golf game and design effective practice strategies that ultimately lead to his/her tournament performance. In addition, students will have the necessary knowledge of how to track his/her performance, and also how to most effectively implement proper practice and training programs that result in improved performance. There are a couple of other unique features of this course. The PGA requires this course to have an 8 to 1 student to PGA instructor ratio. Because of this, the students work with the faculty members and PGA Professionals from the Professional Golf Management Program and also the PGA Professionals from the Penn State Golf Courses. Additionally, students have regular access to the Golf Teaching and Research Center and the Penn State Golf Courses and their practice facilities, also a PGA accreditation requirement."}, {"department": "RPTM", "number": "100B", "credits": "3 Credits/Maximum of 12", "description": "For students enrolled in the PGA Accredited Golf Management Option in RPTM  This is a course that will be offered in the spring semester only for students pursuing Professional Golf Management which seeks to provide students with the knowledge and skills necessary to play golf at a level high enough to become a PGA Professional. The primary focus of the course will be on golf movement skills, on-course performance, and mental training for performance. At the completion of this course, students will be equipped to better evaluate each aspect of their golf game and design effective practice strategies that ultimately lead to his/her tournament performance. In addition, students will have the necessary knowledge of how to track his/her performance, and also how to most effectively implement proper practice and training programs that result in improved performance. There are a couple of other unique features of this course. The PGA requires this course to have an 8 to 1 student to PGA instructor ratio. Because of this, the students work with the faculty members and PGA Professionals from the Professional Golf Management program and also the PGA Professionals from the Penn State Golf Courses. Additionally students have regular access to the Golf Teaching and Research Center and the Penn State Golf Courses and their practice facilities, also a PGA accreditation requirement."}, {"department": "RPTM", "number": "100S", "credits": "2 Credits", "description": "First year seminar for students enrolled in the Professional Golf Management option of RPTM. RPTM 100S Introduction to Golf Management (2) This course is designed to provide 1st year students enrolled in RPTM - Professional Golf Management Option, an introduction to the University, to their major / option, and to the Professional Golfers' Association of America. The course objectives are to introduce students to active learning as a way to make the transition to a more demanding academic environment. Students in the class will participate in collaborative group projects, which should also provide opportunities for them to establish relationships with faculty and peers. Students will investigate career opportunities within their field, as well as develop cover letters, resumes and reference sheets that will be necessary in obtaining internships for the summer session following their first year. Course content will also include information to help students become better students, by introducing them to available resources at the University, as well as develop skills in areas such as time management, study skills, note-taking etc. In addition, information will be introduced to help students become responsible members of the University community.", "other": ["First-Year Seminar"]}, {"department": "RPTM", "number": "101", "credits": "3 Credits", "description": "Introduction to discipline and exploration of professional career models/ paths, historical development of profession, expectations and opportunities in recreation services. The primary objective of this course is to provide students with an understanding of the historical and contemporary perspectives of the recreation and park profession. In addition, the course will provide an exploration of careers in leisure, recreation and parks, or related services with emphasis on the various leisure delivery systems. Main topics typically include: understanding of the roles and significance of leisure and recreation in past and present societies; awareness of the factors contributing to the emergence of specific movements, delivery systems, and agencies within the recreation and parks movement; knowledge of the specific roles assumed by public, private, nonprofit, community and commercial agencies in providing resources and contributing to contemporary participation patterns and lifestyles; awareness of professional career models, expectations, and opportunities; and, an understanding of issues and trends currently affecting the delivery of leisure services. This is a required course for the Recreation, Park and Tourism Management major, usually taken during the freshman or sophomore year. Students in other majors who are exploring Recreation, Park and Tourism Management are encouraged to enroll."}, {"department": "RPTM", "number": "102A", "credits": "3 Credits/Maximum of 12", "description": "RPTM 102A is a course designed to take a deep look into the success of some of the world's best golf operations, including but not limited to facility design and management, business planning, customer experiences, sales and merchandising, tournament operations, and golf tourism.  The travel component for this course takes place over the spring break week each year and provides students with the opportunity to experience the facilities, region, and cultures first-hand, while also meeting with the management and staff of each facility. The out-of-class travel option will give the students an opportunity to experience different cultures, and to apply what was learned in class."}, {"department": "RPTM", "number": "120", "credits": "3 Credits", "description": "Leisure from historical and contemporary perspectives, including forces shaping leisure behavior, and relationships among leisure, the environment, and social institutions.  RPTM 120 Leisure and Human Behavior (3) (GS;US;IL)Leisure and Human Development introduces leisure from historical and contemporary perspective including forces shaping leisure behavior, and relationships among leisure, the environment, and social institutions. Special attention is given to the role of leisure in individual health and wellness. Main topics include: the role of leisure in past and present societies; the ways in which leisure, recreation, and play relate to personal health and wellness, the economy, personal identity, work, religion, sexuality, race, class, socio-economic status, time use patterns, and education; leisure's contribution to human development throughout the life course; the role of leisure in one's life, specialization in leisure activities, leisure careers, serious forms of leisure, and leisure and addiction; and trends in the world economy and culture, technology, urbanization and suburbanization, governance, and demography and how they may influence leisure behavior. Student performance is evaluated through exams and concept maps undertaken in class. Students also examine their own leisure by constructing a one-week time diary. The diary involves providing a detailed account of time allocated to work, personal maintenance, and free time. Students analyze their data, calculate statistics about their time use, and write a reflexive essay that connects their findings to class concepts. The time diary also includes wearing a pedometer for one week to gage physical activity.", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)"]}, {"department": "RPTM", "number": "120S", "credits": "3 Credits", "description": "Leisure and Human Development introduces global concepts regarding leisure and health, from historical and contemporary perspectives, including forces shaping leisure behavior, and relationships among leisure, the environment, social institutions, and holistic well-being. Special attention is given to the role of leisure globally, in individual and societal health and wellness, with applied examples from a U.S. context as well as international perspective. Main topics include: the role of leisure in past and present societies; the ways in which leisure, recreation, and play relate to personal health and wellness, the economy, personal identity, work, religion, sexuality, race, class, socio-economic status, time use patterns, and education; leisure's contribution to human development throughout the life course; the role of leisure in one's life, specialization in leisure activities, leisure careers, serious forms of leisure, and leisure and addiction; and trends in the world economy and culture, technology, urbanization and suburbanization, governance, and demography and how they may influence leisure behavior. Student performance is evaluated through exams and concept maps undertaken in class. Students also examine their own leisure by analyzing their use of time through various reflective writing assignments.", "other": ["International Cultures (IL)", "United States Cultures (US)", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "RPTM", "number": "140", "credits": "2 Credits/Maximum of 6", "description": "To provide students with educational leadership skills and teaching opportunities working with children in an outdoor residential camp setting. RPTM 140 Outdoor School Field Experience (2 per semester/maximum of 4) is cross listed as SCIED 140. The Outdoor School Field Experience course allows students to observe, learn, and apply leadership techniques and teaching methodologies in an experiential, residential education program that occurs off campus. This field-based experience provides students with numerous opportunities to practice and refine their leadership and teaching skills through active participation in one week of Outdoor School Field Experience. Students are provided with the opportunity to explore personal values related to the natural environment, sustainable practices, health and wellness and technology, and to practice behavioral changes as they role model those values to the residential campers.", "prerequisite": "Students must apply for and be accepted into the Outdoor School Field Experience.", "other": ["Cross-listed with: SCIED 140", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "RPTM", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest"}, {"department": "RPTM", "number": "198", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "RPTM", "number": "199", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "RPTM", "number": "201", "credits": "3 Credits", "description": "This course introduces students to the role of community and non-profit recreation agencies in generating benefits for individuals and communities. Using experience industry design/management and social justice perspectives, this course focuses on designing meaningful experiences that serve people from a variety of backgrounds and circumstances. Topics covered in this course include: the history of community and non profit recreation; environmental, economic, health, social and human development benefits of recreation; access and equity issues in recreation and community sport; engaging communities in decision making; the experience industry; and designing community recreation programs and spaces for meaningful experiences. Students will develop their ability to describe the benefits of community and non-profit recreation to individuals and society; identify disparities in access to recreation and the role of community and non-profit recreation in addressing these; describe methods and techniques for engaging community members in decision making; explain how theory informs the design of meaningful experiences; describe ways in which programs and places can be designed to facilitate meaningful experiences; and explain how individual and group characteristics should influence design to result in greater benefits."}, {"department": "RPTM", "number": "210", "credits": "3 Credits", "description": "Introduction to Commercial Recreation and Tourism is designed to introduce students to the historical and contemporary perspectives of the field of commercial recreation and tourism, and to serve as an introduction to the 'Commercial Recreation and Tourism' option within the Recreation, Park, and Tourism Management curriculum. The course will begin by offering a broad overview of this multifaceted field, highlighting the various roles that commercial recreation and tourism play locally, regionally, nationally, and globally. The course then shifts to focus on managerial considerations for practitioners in the field, preparing students to pursue a career in this expansive and exciting field."}, {"department": "RPTM", "number": "220", "credits": "3 Credits", "description": "We live in a world increasingly connected via global processes and social networks, and increasingly challenged by exponential growth in demands on our planet's finite environmental resources. This makes sustainability more of an imperative each day. But what exactly is sustainability? How does it relate to your career in RPTM or to your studies in other departments at Penn State? This course is designed to provide students with strong foundational knowledge about sustainability and how it relates to their career in Recreation, Park and Tourism Management. To develop students' understanding of the concept of sustainability, the course explores how interconnected social, economic, and environmental systems have resulted in the contemporary sustainability challenges we face both globally and locally. Each week students are presented with the large scale, global status of a particular issue related to sustainability before then exploring these challenges in increasingly local contexts of the U.S., Pennsylvania, and a career path in RPTM. In contemplating the broad scope of sustainability, students will become better informed about the many ways that their career in RPTM is influenced by this global context of challenges to social, environmental, and economic sustainability. In exploring how RPTM activities exert an influence on sustainability goals, students will be better equipped to address sustainability challenges within the organizations in which they work as well as in their everyday lives."}, {"department": "RPTM", "number": "230", "credits": "3 Credits", "description": "Learn leadership and teambuilding skills to facilitate group dynamics and adventure, team activities. RPTM 230 Teambuilding Facilitation (3)Through hands-on experience, discussion, and observation students will develop a sound background to the basics of teambuilding. This course will focus on the philosophy of team activities and experiential education, and the skills required to lead and facilitate teambuilding events. In addition to learning skills, the students will be asked to apply their knowledge of teambuilding to lead actual activities for their peers. Finally, students will be exposed to information about career opportunities in the field of teambuilding and adventure education. Main topics include: An introduction to teambuilding philosophy and its relation to the outdoor education field. General concepts to be covered include: challenge by choice, full value contracts, the experiential learning cycle and the adventure wave. Activity understanding to include icebreakers, problem solving activities and trust events; Programming and activity sequencing; Leadership skills and the role of the facilitator; Stages of group development;  Debriefing activities, transfer of learning and metaphoric transfer;  Activity safety: emotional and physical; Risk Management and the elements of good judgment;  Group assessment and program creation;  Program evaluation.  This course is one of the selections for RPTM majors in the adventure-based programming emphasis of the Outdoor Recreation Option. Students in other majors are welcome after RPTM majors have scheduled."}, {"department": "RPTM", "number": "236", "credits": "3 Credits", "description": "Supervision in recreation services, including theories, strategies, group dynamics, applied leadership and decision-making skills. RPTM 236 Leadership and Group Dynamics in Recreation Services (3)The primary objectives of RPTM 236 are for students to examine both leadership and group dynamics as a function of leisure and recreation services. Students in RPTM 236 will be given a variety of leadership opportunities, both in and out of class, to begin to develop leadership skills as well as observe others in recreation leadership positions. Information on leadership theory and group dynamics (group development, roles in groups, group decision making) will be provided through group exercises and hands on experiences. Main topics include: Leadership theory; Approaches to leadership; leadership styles; Definition of group including characteristics and effective group management; Group decision making and problem solving; Recreation leadership skills including behavior management, interpersonal skills and motivation; Teaching as a leadership skill; learning theory; Communication as a leadership skill; Teambuilding RPTM 236 is a required course for RPTM majors. Students in other majors are welcome. It is strongly suggested that RPTM 236 be taken prior to, not concurrent with RPTM 356."}, {"department": "RPTM", "number": "240", "credits": "3 Credits", "description": "Outdoor School is a residential outdoor environmental education program attended by upper elementary-aged school children from school districts throughout central Pennsylvania. While serving as Outdoor School Leaders, RPTM 240 provides students with experience in two main areas, leadership/mentorship as well as residential outdoor environmental education lesson planning and delivery. They are approached in the following manner: - Group management and leadership techniques will be examined regarding working with peers (students taking RPTM 140 who are serving as Outdoor School Counselors) and effectively guiding youth participants in an outdoor setting. Outdoor School Leaders will explore what effective mentorship looks like, working with the Counselors to help them work towards their personal developmental goals by the end of the week. Outdoor School Leaders will also explore the intricacies of teaching outdoors, using the environment to keep the group focused and engaged in the learning process. By stepping into this broader leadership role, students taking this course expand the breadth of their responsibilities compared to RPTM 140. - Students will enhance their residential outdoor environmental education skills by designing lesson plans on natural history topics and implementing these lesson plans in an outdoor setting. Class sessions and assignments are designed to develop skills prior to the immersive field experience of applying these techniques as an Outdoor School Leader. Outdoor School lesson plans include topics such as ecosystem science, sensory experiences in the outdoors, teambuilding, and the basic biology of native Pennsylvania fauna (sometimes taught using live animals). Students build upon the initial teaching experience provided in RPTM 140 by extending the creative process, granting students flexibility in how they plan and deliver lesson content as they develop a personal teaching style. While working towards mastery in the previous two areas, Outdoor School Leaders are also expected to contribute to the daily operations and logistics of their Outdoor School week. This includes items such as understanding relevant emergency protocols, applying sound risk assessment methodologies, and helping general programming run smoothly and safely.", "prerequisite": "RPTM 140"}, {"department": "RPTM", "number": "250", "credits": "2 Credits", "description": "For students enrolled in the PGA Accredited Golf Management Option in RPTM  The PGA of America promotes its members as experts in the game and business of golf. Based on our current PGA Accreditation, RPTM 250 (PGA Facility Management) is a course designed to explore the various responsibilities and tasks associated with administering a full-service golf facility. Students will explore and apply management strategies to Business Planning, Customer Relations, Merchandising & Inventory Management, Tournament Operations, Rules of Golf, Golf Car Fleet Management, and Turfgrass Management. The course focuses on managing the golf operation in a way that delivers upon the business plan, offering the desired level of service to customers while also maintaining a viable, sustainable business. Students learn about the PGA Business Planning Model and use case studies to apply business planning concepts. The course also utilizes the PGA Work Experience Portfolio to document relevant training and experience. Students learn the business value of customer service and describe the components of the PGA Customer Relations Model. The course highlights the information about the importance of the golf car to the customer, the golf professional, and the facility. The course utilizes policies and procedures necessary for the operation of a safe and efficient golf car program. Students learn how golf shop design affects merchandise sales. Students will also learn the key terms used in the Rules of Golf and locate and apply Rules to frequently encountered situations. We will examine staff requirements for tournament operations, how to prepare for an event, and communicate tasks required for tournament execution. Students will also learn the types of grasses and soils, nutrient needs and the impact of climate and traffic stress. The course will also focus on common practices for maintaining healthy turfgrass including mowing, watering, fertilizing, aerating, pest control, and disease management."}, {"department": "RPTM", "number": "254", "credits": "2 Credits", "description": "RPTM 254 is the second course in the PGA of America's education program in the subjects of golf teaching and coaching. This is a required course for program accreditation. Upon successful completion of the course, students will understand how various types of feedback function and influence performance, the effects of various communication styles, design appropriate practice conditions including the use of various swing methodologies, assess physical capabilities of golfers, and make necessary basic golf equipment adjustments. Students will have the knowledge to proficiently teach the game of golf to a variety of populations, knowledge required of all Professional Golf Management graduates. The final major topic, player development programs, teaches students how to identify the components of comprehensive player development programs and understand the needs and interests of diverse populations. This course continues to build upon the learning objectives of the PGA Teaching and Coaching 1 course (KINES 93), and is followed up by the PGA Teaching and Coaching 3 course (RPTM 354).", "prerequisite": "KINES 93"}, {"department": "RPTM", "number": "277", "credits": "3 Credits", "description": "The course provides a review of leisure services and programs designed to be inclusive of individuals from underrepresented groups and an overview of professional, legal, and ethical issues. Students receive information about the history of social movements toward inclusive leisure services and acquire knowledge about people who experience oppression, marginalization, and are disenfranchised as well as strategies to enhance their leisure. The course highlights information about the psychological and sociological significance of discretionary time, recreation, and leisure for all people. In addition, the course provides details on social, psychological and physical circumstances that create barriers to leisure engagement. The course addresses current issues related to inclusive leisure services and ethical and professional behavior in the reduction of barriers and subsequent delivery of such services. The course focuses on increasing students' awareness of the needs and interests of diverse populations as well as promotes understanding of principles and procedures for effective social, cultural and environmental design of leisure services, areas, and facilities that facilitate inclusion. Students learn about legal foundations and responsibilities of leisure service providers in serving all people and develop an understanding of ways to comply with professional, legal, and regulatory standards. The course provides students with guidelines to follow so that they help people experience the psychological, social, and physical benefits of leisure. Students receive information on ways to endorse people's culture, with culture used broadly to include characteristics such as ethnicity, religion, sexual orientation, and race. In this course, students explore various characteristics such as people's abilities, age, gender, economic resources, and family and the influence that these aspects of their lives have on their leisure and how to design community leisure services that address challenges in any of these areas. The course is based on ethical principles including the belief that everyone is deserving of respect and has right to be self-determined and that no one can be reduced to a single characteristic. Another cluster of ethical principles focus on the notion that inclusion is good and diversity enriches our world. Finally, since service providers have substantial power and responsibility, they are encouraged to have ethical beliefs drive their behaviors as they consider perspectives other than their own and engage in critical and constructive thinking to contribute to a more just society. Students are exposed to the historical background, development, and current configurations of various groups in our pluralistic American culture. Such exposure will promote an understanding of complex issues of inter-group relations and many kinds of cultural contributions that have shaped our nation. The course strives to increase students' understanding of contemporary United States society.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "RPTM", "number": "280", "credits": "1 Credits", "description": "Wilderness First Aid focuses on the basic skills of Response and Assessment, Musculoskeletal Imjuries, Environmental Emergencies, Survival Skills, Soft Tissue Injuries, and Medical Emergencies. Successful completion of this course includes a certification in Wilderness First Aid by an outside, certifying organization.", "other": ["General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "RPTM", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "RPTM", "number": "295", "credits": "1-4 Credits", "description": "RPTM 295A Introduction to Golf Management (1)The primary objective of this course is to complete a 40-hour per week internship at an approved golf property. While on internship the student will complete assignments involving the United States Golf Association's rules of golf. The student will also complete a variety of assignments associated with tournament operations and the teaching of the game of golf to both adults and juniors. Another primary objective involves golfer development programs. Main topics include: *Rules of Golf: officiating, rules clinic, newsletters, tips, and course clinic * Tournament Operations: budgeting, staffing, publicity, course preparation, health and safety issues, tournament operations software, and evaluation * Introduction to Teaching Golf: research teaching styles, lesson observation, and conducting a series of lessons * Development of Golfer Programs: program design, planning, budgeting, scheduling, problem solving, and program evaluation This is a required course for all students in the Golf Management Option that are majoring in Recreation, Park and Tourism Management. The internship is not open to students of other majors."}, {"department": "RPTM", "number": "295A", "credits": "1-4 Credits/Maximum of 4", "description": "Introduction to various phases of golf operations in public, private, municipal, or military settings.", "prerequisite": "2.00 cumulative grade point average", "other": ["Full-Time Equivalent Course"]}, {"department": "RPTM", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "RPTM", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "RPTM", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Foreign Studies in RPTM.", "prerequisite": "RPTM 199", "other": ["International Cultures (IL)"]}, {"department": "RPTM", "number": "300Y", "credits": "3 Credits", "description": "Examination of the impact of recreational sociocultural, governmental, economic, and physical environment on the leisure traveler within the tourism industry. RPTM 300 Tourism and Leisure Behavior (3) (IL)The objective of this course is to help students understand the tourism concept from a national and international perspective. The students will debate the motivations that lead people to engage in tourism and in hosting tourists. They will also examine the social, economic and ecological impacts that tourism development can bring to host communities and to tourists. The students will finally apply all the learned materials to conceptualize sustainable development strategies that aim at improving the quality of live of host communities, provide quality experiences to visitors, and protect the existing cultural and ecological resources of the destination. Main topics typically include:; History - How people engage in tourism throughout all periods of history and the influence of major historic events on modem tourism; Socio-cultural impacts - How host cultures are transformed through tourism; Economic impacts - Revenues and costs to host economies due to tourism; Ecological impacts - Ways in which tourism helps and hurts the environment; International terrorism and peace - Why tourism is called the peace industry and how it is affected by terrorism and political instability; Sex tourism - Why tourism can alleviate or aggravate the exploitation of vulnerable segments of society; Tourism planning and policy - How to plan and manage tourism in ways that it produces sustainable benefits to the host community This is a required course for RPTM majors in the Community and Commercial Recreation option. Students in other majors are welcome.", "other": ["International Cultures (IL)", "Writing Across the Curriculum"]}, {"department": "RPTM", "number": "320", "credits": "3 Credits", "description": "Relationship between leisure behavior and natural environment.  Exploration of natural resources which enhance leisure. RPTM 320 Recreation Resource Planning and Management (3)This course is an introduction to managing the recreational use of U.S. lands, waters, and wildlife. Course objectives include providing students with an awareness of the scope of outdoor recreation resources and major outdoor activities; knowledge about outdoor recreation resource agencies, their mandates, and their resources; an understanding of key outdoor recreation issues and impacts and their relationships to activity type and visitor behavior; knowledge about appropriate management tools for addressing impacts; and an understanding of the contribution of planning to effective recreation resource management. Main topics typically include: Introduction to the scope of outdoor recreation in the U.S., key characteristics of major user groups, visitor motivations and benefits, and phases of the recreation experience; The recreation resource base; Federal, state, local, and private recreation resource providers; Ecological impacts of outdoor recreation; Conflict, crowding, and equal access in outdoor recreation; Recreation carrying capacity, direct and indirect management techniques, and concentrating versus dispersing; visitor use; Facilities and design of recreation sites; Visitor use limits, permits, and fees; Information, education, and programs for visitors; Visitor use monitoring; Planning frameworks for outdoor recreation This is a required course for RPTM majors in the Outdoor Recreation Option. The course is open to students in all majors."}, {"department": "RPTM", "number": "325", "credits": "3 Credits", "description": "Introduction, history, practice, and principles of contemporary interpretive activities common to natural and cultural history program sites. RPTM 325 Principles of Environmental Interpretation (3)The primary objective of this course is to provide students with an overview of the field of environmental interpretation with special emphasis in understanding and applying the principles inherent in effective programs and presentations. The second objective is to provide information about career opportunities in the interpretive profession. The third objective is to provide students with a variety of service learning opportunities to help them refine their career aspirations. Main topics typically include: Becoming aware of the history, professional resources and best practices in the field of environmental interpretation; Creating and using effective interpretive materials including exhibits and visuals aids in non-formal programs; Demonstrating sound interpretive methods and techniques by conducting short presentations; Gaining an awareness of the operation of a visitor center and the experience of using live animals in interpretive programming; Demonstrating a competency in program development by participating in the planning, presenting and evaluation of the Children's Halloween Trail at Shaver's Creek Environment Center. This course is one of the selections for RPTM majors in the Environmental Interpretation emphasis and the Adventure-based Programming emphasis of the Outdoor Recreation Option. Students in other majors are welcome. This course is a pre-requisite for RPTM 326, 327, 425, and 430."}, {"department": "RPTM", "number": "326", "credits": "3 Credits", "description": "Methods, techniques, resources to acquire knowledge of natural history.  Field identification, projects of an applied nature, and seasonal application.  RPTM 326 Natural History Interpretation (3)The primary objective of this course is to give students the basic skills and resources to research and interpret the natural history of a given park or natural area. Building on the prerequisite course (RPTM 325: Principles of Environmental Interpretation), students continue to apply and practice principles that help create effective outdoor programming. The second objective is to provide students with a variety of service learning opportunities to help them refine their career aspirations. Main topics typically include: *Learning the skills and available resources to identify common fauna and flora found in Central PA including birds, mammals, amphibians, trees and wildflowers *Imparting a basic understanding of the ecology of the Eastern Forest landscape and the ability to interpret that understanding to a general audience. *Writing a short natural history interpretive article for a general audience. *Demonstrating sound interpretive methods and techniques by conducting short presentations. *Gaining an awareness of the operation of a visitor center and the experience of using live birds of prey in interpretive programming. *Demonstrating a competency in program development by planning, researching, and presenting a natural history program in an outdoor setting to their peers. This course is one of the selections for RPTM majors in the Environmental Interpretation emphasis of the Outdoor Recreation Option. Students in other majors are welcome providing they have met the pre-requisite (RPTM 325).", "prerequisite": "RPTM 325"}, {"department": "RPTM", "number": "327", "credits": "3 Credits", "description": "Methods, skills, and techniques necessary for the programming of historical sites and areas.  RPTM 327 Cultural History Interpretation (3)The purpose of this course is to provide students with an understanding of the cultural resources within central Pennsylvania and to learn how to effectively interpret these resources through interactive programs and experiences. Building on the prerequisite course (RPTM 325: Principles of Environmental Interpretation), students continue to apply and practice principles that help create effective outdoor programming. Main topics typically include: *Demonstrating sound interpretive methods and techniques by conducting short presentations *Demonstrating a competency in program development by planning, researching, and presenting two different 1st Person Interpretation -living history programs in an outdoor setting to the general public and to school groups. *Participation, planning and presenting a Maple Sugaring Lesson at the community attended Maple Harvest Festival. *Engaging in research and writing of a Historical Character Paper. Learning how and where to conduct cultural history research in any community by utilizing historical societies, historical sites, libraries, and personal interviews. *Observation of professional cultural history interpreters. This course is one of three selections for RPTM majors in the environmental interpretation emphasis of the Outdoor Recreation Option. It is included as part of the 'Discovery Semester' block of courses taught by faculty at the Shaver's Creek Environmental Center.", "prerequisite": "RPTM 325"}, {"department": "RPTM", "number": "330", "credits": "3 Credits", "description": "Both theoretical and experiential components are included as the role of the leader in adventure-based programs is examined. This course will focus on the philosophy, leadership techniques, ethics, and current practices in the area of adventure-based programming. Focus of instruction will be upon developing skills for facilitating personal growth and providing leadership for outdoor pursuits within a plethora of different outdoor pursuits. Main topics to be covered: outdoor leadership skills and behavioral styles and they pertain to leading groups, creating community through team building and debriefing activities,  inderstanding the value of balancing technical with interpersonal and judgement skills, decision making, conflict management, and assessing and planning for risk in the field. A one-night retreat is included in the course curriculum. RPTM 330 is one of the selections for RPTM majors in the Adventure Recreation Pathway of the Outdoor Recreation Option. The course is open to students from all majors."}, {"department": "RPTM", "number": "334", "credits": "3 Credits", "description": "Recreation agencies in voluntary and semiprivate sectors will be investigated through membership strategies, fund raising, volunteer management, etc. case studies.  RPTM 334 Non-Profit Recreation Agency Operations (3)The primary objective of this course is to expose students to the operational practices and missions of nonprofit recreation and tourism organizations. In particular, this course will allow students to investigate voluntary and semi-private sectors through membership strategies, fundraising and development roles, and volunteer management. Primary topics taught in this course will typically include the following: *The role of non-profit organizations in providing park, recreation and tourism opportunities *Missions, governance procedures, and societal roles associated with non-profit organizations *Program support functions and non-profit fundraising strategies *Skills and roles of professional staff in non-profit organizations This course is a requirement for RPTM majors in the park management emphasis of the Outdoor Recreation Option. This is also a supporting course (i.e., department list) for RPTM majors in the Commercial and Community Recreation Management Option. Students in other majors are welcome after all RPTM majors have been scheduled."}, {"department": "RPTM", "number": "335", "credits": "3 Credits", "description": "The purpose of the Outdoor Recreation Consortium is to provide students with hands-on exposure to outdoor recreation resources management in a National Park. It is designed to increase students' understanding and appreciation of outdoor recreation resources, the agencies managing those resources, the management strategies used, and the factors affecting management, including issues related to the nearby \"gateway communities\" and the park's broader environment. The course format is one which focuses on problem solving, encourages a high level of interaction among participating students, faculty, managers, and gives participants an opportunity to connect with nature."}, {"department": "RPTM", "number": "336", "credits": "3 Credits", "description": "This course provides the student with the core knowledge needed to understand the kinds of data generated by the financial systems of recreation operations, prepare budgets, perform forecasting and breakeven analysis, and provide control over the financial aspects of the recreation/park/tourism business. Main topics typically include: Introduction to managerial decision-making; Cost behavior analysis; Cost, volume and profit analysis; Pricing decisions; Preparation of operational budgets; Calculation and interpretation of cost and revenue variances; Preparation of cash budgets and control over cash; Preparation of the statement of cash flows; and Preparation of financial statements in the recreation/park/tourism industry."}, {"department": "RPTM", "number": "345", "credits": "3-6 Credits/Maximum of 6", "description": "The purpose of the Guest Activities Practicum is to provide students with hands-on exposure to the guest experiences industry within commercial recreation settings. Students interact with faculty, other students and professionals from industry in the collaboration and sharing of ideas. The course is designed to increase students' understanding and appreciation of the guest experience, the issues related to delivering recreation services in commercial recreation settings, principles of tourism, management strategies, and the factors affecting guest services. The course format is one that focuses on problem solving, encourages a high level of interaction among participating students, faculty, industry partners, and gives participants an opportunity to actively engage with customers. The course includes an embedded travel component in which students and faculty visit a guest experiences focused commercial recreation such as a resort or cruise ship and then work with industry. partners on a designated project with student recommendations that might be implemented on site. The course includes course fees for travel.", "prerequisite": "RPTM 120"}, {"department": "RPTM", "number": "350", "credits": "2 Credits", "description": "Based on our current PGA Accrediation Standards and Criteria, RPTM 350 (PGA Facility Management Level 3) is a course designed to continue to explore the various responsibilities and tasks associated with administering a full-service golf facility. Students will explore and apply management strategies to business planning, golf operations, merchandising and inventory management, golf car fleet management, supervising and delegating, turfgrass management, food and beverage control, and career enhancement. The course focuses on managing the golf operation in a way that delivers upon the business plan, implementing operational policies and procedures while maintaining a viable, sustainable business. Students learn about assessing the current state of business and analyze financial history to create a financial forecast and operating budget. The course aligns and implements operational policies and procedures and technology systems to support the business plan. Students will learn about merchandise assortment plans, ordering and receiving merchandise, and promotional campaigns and events to sell through merchandise. Students will also learn to project golf car fleet  revenue, cost, and profit, and identify how budgeting changes will impact the bottom line. Students will learn how to describe the performance system for supervising and delegating and use elements to the performance system to delegate assignments and how performance problems are managed appropriately.  The course will also examine practices that improve the golf course while protecting the environment and students will learn about the process to design a new golf course or renovate an existing course. We will examine the features and benefits of a successful food and beverage operation and identify areas where food services and the golf operations should coordinate efforts. Students will also learn the components of an employment agreement or contract, negotiation strategies for compensation packages, and how to access PGA employment resources.", "prerequisite": "RPTM 250"}, {"department": "RPTM", "number": "354", "credits": "2 Credits", "description": "Based on our current PGA accreditation standards and criteria, RPTM 354 is the final course in the PGA of America's education program in the subject of golf instruction. This is a required course for program accreditation. Upon successful completion of the course, students will be able to explain how learning occurs in the process of golf skill development as well as the theories and factors that influence the transfer of learning. Students will be able to use a variety of techniques to measure performance levels of golfers and also understand the effects of golf club fitting on ball flight and golfer performance. The final major topic, player development programs, teaches students how player development programs contribute to facility operations and will be able to develop, market, and promote comprehensive player development programs.", "prerequisite": "RPTM 254"}, {"department": "RPTM", "number": "360", "credits": "3 Credits", "description": "The course will focus on business planning, budgeting, inventory management, and financial controls within golf operations.  RPTM 360 Golf Operations Management (3)The primary purpose of this course is to prepare a student in the fundamentals of retail management pertaining to effectively operating a golf shop. Although successful retail management of a golf shop requires many different considerations, this course specifically emphasizes the planning and controlling of both the operational and merchandising effort. The first objective is to teach the student about the planning process that is necessary to effectively manage a retail business. The second objective is to provide a student with an understanding of the practices and procedures in operating a golf shop. The third objective is to teach the student effective merchandising and pricing techniques. Main topics typically include: Types of plans that are needed in order to operate a retail business effectively; Developing strategic plans and business plans; Effective merchandising techniques for purchasing, pricing and selling; Planning techniques concerning both the purchasing and selling process; Quantitative open-to-buy planning as well as effective assortment planning procedures; Vendor selection and relations as well as negotiable terms of sale; Techniques regarding pricing, merchandise presentation and promotion. This is a required course for RPTM majors in the Golf Management Option. It is usually scheduled during the student's sixth semester. Students from other majors may enroll after RPTM majors have registered.", "prerequisite": "BA 304"}, {"department": "RPTM", "number": "370", "credits": "3 Credits", "description": "Introduction to arena and facilities management including operations, budgeting, marketing and staffing.  Course is taught on site at a sports/ entertainment arena (ex: the Bryce Jordan Center).  RPTM 370 Introduction to Arena Management (3) Introduction to Arena Management introduces students to the complex skills and duties required to manage a sports/entertainment arena. The course is taught on-site at the Bryce Jordan Center at University Park. Main topics include: facility design and facility law; event planning and production; history of the touring industry; entertainment and sports booking; ticketing; marketing and public relations; crowd management, safety and implications of the Americans with Disabilities Act; technology and ticketing systems; professional and collegiate sports management; and partner agencies i.e. food and beverage. Student performance is evaluated through exams and special projects, including a formal small group presentation. Students are provided with exposure to a variety of experiential learning opportunities in service departments throughout the arena. Assignments are targeted to current events in the arena management industry.", "prerequisite": "RPTM 120"}, {"department": "RPTM", "number": "390", "credits": "3 Credits", "description": "The primary objective of this course is to examine the governmental systems that influence the delivery of recreational services. The formal structure of government is considered along with the day-to-day political processes that determine public policy. All three levels of government-federal, state, and local'are studied. Particular attention is given to the judicial systems of these governments. The course also gives considerable attention to tort liability by examining case law as it relates to recreation facilities and services. The course also explores federal and state laws pertaining to employer/employee relations and administrative responsibilities. Main topics include: The Court Systems, legislative branches; planning and development: historical perspective, land use, zoning, mandatory dedication, easements, building codes; liability: elements of negligence, situations giving rise to law suit, product liability, defenses & risk management, review; personnel laws; Federal laws, State Human Relations Acts, Civil Service, Hatch Act, FLSA, finance, garnishment & bankruptcy; the Americans with Disabilities Act; Public Relations Law: copyright, photography, lotteries, libel, slander, privacy; Administrative Law: purchasing, entrepreneurship, Federal Tax laws. This is a required course for all students majoring in Recreation, Park and Tourism Management. It is open to students of other majors, providing they have met the pre-requisite.", "prerequisite": "RPTM 120"}, {"department": "RPTM", "number": "394", "credits": "1 Credits", "description": "Plan and prepare for internship in Recreation Services. Analyze career opportunities, internship process, and associated requirements.  For RPTM majors only.  RPTM 394 Orientation to Internship (1) The primary objective of this course is to assist students with planning and preparing for their professional Practicum experience. The supporting objectives are: to provide awareness of the role and significance of the Practicum experience, including its relationship with professional practice; assist students in their understanding of the placement process, including prerequisites for placement; provide students with a working knowledge of their requirements while on Practicum, including contractual arrangements, on-site professional conduct, written assignments, evaluation procedures and evaluation criteria; and to provide the students with knowledge of post-practicum concerns, including resources for professional employment and professional certifications.Main topics typically include: � Introduction to the practicum experience and pre-requisite requirements � Personal and professional needs assessments and the importance of determining deficit skill and competency areas as related to the student's intended career. � Development of career and practicum goals and their relative importance to practicum site research and selection. � Preparation of a professional cover letter and resume. � Searching for and selecting possible practicum sites � Professional approaches to contacting, communicating and following-up with prospective practicum agencies. � Interviewing skills, including various interview formats, commonly asked questions, appropriate body language, and professionalism. � Practicum requirements, including assignments, communication with the university and agency supervisor, and academic and performance evaluation. � Post-practicum concerns, including graduation, employment, and professional certifications.This course is required of RPTM majors (except Golf Management Option), and is usually taken two semesters prior to the semester that a student plans to participate in RPTM 495A (Internship in Recreation Services). The course is not open to students from other majors.Students are evaluated by performance on written assignments and quizzes.This course is offered both spring and fall semesters with typical enrollments of 70-90 in the fall and 50-70 in the spring.", "prerequisite": "5th semester standing"}, {"department": "RPTM", "number": "395A", "credits": "1-3 Credits", "description": "The internship provides a paraprofessional experience in which students simultaneously acquire skills in the field while using classroom knowledge to solve problems and generate new ideas in a commercial recreation, event or tourism setting. Under the guidance of the agency supervisor and the faculty coordinator, students will develop management and leadership skills as well as be exposed to strategic planning. The internships provide opportunities to increase knowledge and develop skills in event and program design, site and program management and approaches to assessments and evaluation. In addition, students will practice the art of customer service and stakeholder management. In addition to developing professional knowledge, students have the opportunity to develop professional performance (e.g. goal setting and achieving, time management, problem-solving), professional demeanor (e.g. professional courtesy, appearance, interpersonal communication) and professional attitudes (e.g. professional curiosity, respecting departmental policies, accepting direction and constructive criticism, and maintaining productivity and efficiency in age of distraction)."}, {"department": "RPTM", "number": "395B", "credits": "1-4 Credits/Maximum of 4", "description": "RPTM 395B Participation in Golf Management (1-4)The primary objective of this course is to complete a 40-hour per week internship at an approved golf property. While on internship the student will complete assignments involving: turfgrass management, analysis of the golf swing, and pre-work in merchandising and inventory management. Main topics include:  Turfgrass Management: routine and non-routine maintenance, practices, traffic management, environmental issues, pest control, communications with superintendent.  Analysis of the Golf Swing: video lessons, business plan for teaching, clubfitting systems.  Merchandising and Inventory Management (pre-work): explore OTB practices, compare product lines, profile vendors, pricing methods, and evaluation of merchandise displays This is a required course for RPTM majors in the Golf Management Option. The internship is not open to students in other majors.", "prerequisite": "RPTM 295A", "other": ["Full-Time Equivalent Course"]}, {"department": "RPTM", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "RPTM", "number": "399", "credits": "1-12 Credits", "description": "Foreign Studies in RPTM.", "other": ["International Cultures (IL)"]}, {"department": "RPTM", "number": "410", "credits": "3 Credits", "description": "Theoretical/practical application of marketing/advertising strategies in the development/delivery of recreation services. RPTM 410 Marketing of Recreation Services (3)The primary objective of this course is to provide students with an overview of marketing in general and recreation/tourism marketing in particular. Supplemental objectives are to (a) provide students with a review of different marketing theories and practices and (b) help students apply marketing principles to practical recreation/tourism situations. Main topics typically include: Introduction to marketing and its evolution; Parameters of the recreation/tourism experience and how this affects marketing practices; Defining and segmenting the consumer market; The marketing mix; Conducting marketing research in an effort to develop effective marketing strategy; Service quality and its impact on marketing strategy; Customer loyalty and its impact on marketing strategy; Recognizing and responding to the changing needs of consumer markets. This is a required course for RPTM majors, generally taken after completion of the introductory courses in the major. Students in other majors, including those pursuing the Liberal Arts Business minor, are welcome after RPTM majors have scheduled.", "prerequisite": "5th semester standing"}, {"department": "RPTM", "number": "415", "credits": "3 Credits", "description": "Planning, developing, and managing profit-oriented recreation opportunities.  RPTM 415 Commercial Recreation Management (3)Building upon subject matter presented in many of the core RPTM courses, the primary objective of this course is to provide students with an understanding of strategic management processes and how they apply to recreation/tourism businesses. A second objective is to develop students' decision-making and analytical abilities. Main topics typically include: An overview of the strategic management process; Having the mindset of an entrepreneur/intrapraneur; The \"ins and outs\" of conducting feasibility studies; The pros and cons of different forms of business; Generating and setting short- and long-term goals and objectives for recreation/tourism businesses; Capitalizing, financing and budgeting for recreation/tourism businesses; Planning, organizing, managing and controlling recreation/tourism businesses; Regulations, taxation and licensure of recreation/tourism businesses; Recognizing the importance of developing and maintaining relationships with various constituencies; Options for strategic growth This course is required of RPTM majors in the Commercial and Community Recreation Management option. Students take this course after or concurrent with RPTM 410. Students in other majors who have met the pre-requisites, including those pursuing the Liberal Arts Business minor, are welcome after RPTM majors have scheduled.", "prerequisite": "RPTM 210"}, {"department": "RPTM", "number": "425", "credits": "3 Credits", "description": "Principles, practices, application of non-personal interpretive activities common to natural/cultural history, including exhibits, audio-visual and illustrative materials.  RPTM 425 Principles of Interpretive Materials (3) The primary objective of this course is for students to follow the exhibit creation process from conceptualization through construction to completion. Along the way, students will present their works-in-progress to fellow students and instructors for modification and improvement. Their final products will be used in a practical environment in the exhibit room at Shaver's Creek Environmental Center and at various educational functions around the state - PA State Farm Show, Central PA Festival of the Arts, Penn State's Ag Progress Days, etc.Main topics to be covered: *Topics vs. Themes: narrowing the unifying concepts in exhibit design *Flow in an exhibit and museum space: how to guide logical progression of thought in both an exhibit and exhibition area *Color Schemes *Computer aided design techniques *Woodworking skills This course is one of the selections for RPTM majors in the environmental interpretation emphasis of the Outdoor Recreation option. Students from other majors may enroll in this course if they have met the pre-requisite (RPTM 325).", "prerequisite": "RPTM 325"}, {"department": "RPTM", "number": "430", "credits": "3 Credits", "description": "Methods and materials for developing, implementing, and evaluating environmental education programs within formal and non-formal educational settings.  RPTM (AEE) 430 Environmental Education Methods and Materials (3)The primary objective of this course is to provide students with an introduction to Environmental Education (EE) methods (pedagogy) and materials for both formal and non-formal settings. A second objective is to provide the student with an opportunity to apply specific methods and materials to practical situations at Shaver's Creek Environmental Center. These opportunities include Outdoor School, School Day Programs, Maple Harvest Festival, and Scout Programs. A third objective is to provide information about gaining access to EE materials through web-based, written, and personal contacts. Main topics typically include: Introduction to the history, definition, and philosophy of Environmental Education (EE); Differences between formal and non-formal EE settings; PDE Environment & Ecology Standards; Models of EE pedagogy; Place-based-education labs covering: The Land, Water Resources, Fauna, and Flora; Keystone Aquatic Resource Education; teacher resource workshop (or other national curricula- i.e. P WILD, PLT, Project WET, etc.); EE Resources available at SCEC, the web, and other EE centers.  This course is one of the selections for RPTM majors in the environmental interpretation emphasis and adventure-based programming emphasis within the Outdoor Recreation option. Students from other majors may enroll in this course if they have met the pre-requisite (RPTM 325).", "prerequisite": "RPTM 325"}, {"department": "RPTM", "number": "433W", "credits": "3 Credits", "description": "Systematic, structured problem-solving process for decision making in recreation and parks. Research techniques/evaluation procedures; quantitative, qualitative methodologies; deductive, inductive reasoning.  RPTM 433 Program Evaluation and Research Services (3)The goal of this course is to provide students with the background necessary to understand and evaluate research reports and to conduct research projects of moderate complexity in the field of recreation, parks, and tourism management. The research focus of the class is on evaluation and assessment. Class topics include introductions to the philosophy of science, including the nature of theories, hypotheses, concepts and constructs, to measurement theory, to applied sampling techniques, and to methods of scale construction. Both quantitative and qualitative research methods are addressed. In-class activities include the conceptualization and execution of an applied evaluation project. This project involves practice in interviewing, in-class focus groups, survey questionnaire development, data collection, and data analysis. The course will provide students with a conceptual map of how research is conducted, the resources available to them, the vocabulary of research, and guidance in writing a research report. Additionally, this is a Writing Across the Curriculum class. Students will prepare several short writing projects, some based on interviews or observational studies that they have conducted, as well as a final report based on the evaluation research conducted by the entire class. The course material is divided into units of study with topical areas within each unit sequentially presented to parallel the research process itself. Students are expected to have read assigned materials and to attend class prepared to discuss them. Classes involve lectures, discussions, and in-class activities such as focus groups, survey questionnaire development and presentations of research results. This class is required of all undergraduate majors in Recreation, Park and Tourism Management. RPTM 356 and a 3-credit course in statistics are prerequisites for this course. Students from other majors are welcome in this course, providing they have met the pre-requisites.", "prerequisite": "5th semester standing", "other": ["Writing Across the Curriculum"]}, {"department": "RPTM", "number": "435", "credits": "3 Credits", "description": "Planning and management of selected facilities with emphasis upon maintenance, activity, and support provisions. RPTM 435 Recreation Facilities Planning and Management (3) The purpose of this course is to introduce students to planning, design, and maintenance practices at recreation and park facilities. This course will emphasize the activity and support provisions of recreation facilities and will identify standards of design and maintenance. Compliance with accepted risk management practices and the Americans with Disabilities Act (ADA) will also be stressed in this course. Specific topics covered in this course include: Maintenance management practices and risk management procedures; Monitoring and reporting recreation and park facility use; General planning considerations of selected recreation facilities, parks and tourism attractions; Special materials and apparatus required for specific park and recreation facilities; Support facilities necessary to complement developments that offer these activities (e.g., vehicular circulation and parking, lighting, emergency provisions, etc.). This is a required course for RPTM majors in the park management emphasis within the Outdoor Recreation Option. The course is also on the department list of the Commercial and Community Recreation Option. Students in other majors are welcome providing there are seats available after RPTM majors have been scheduled.", "prerequisite": "5th semester standing"}, {"department": "RPTM", "number": "440", "credits": "3 Credits", "description": "The first objective of this course is to promote understanding of the history and evolution of adventure-based programming and to look at how this process has impacted the state of programming today in USA and beyond. This leads to the second objective- to be able to articulate the range of theories that influence practices of adventure based programming and place that understanding within socio cultural historical contexts. Third, students will be able to identify schools of thought in theories of ethics, how these apply in different outdoor contexts for different groups and have an understanding of adventure education as a moral endeavor. Fourth, students are expected to critically analyze various topics related to current issues in the field, discussed and consider various positions prior to looking at the future trends of adventure-based programming. In all aspects of the course students will familiarize themselves with seminal and current literature in relation to theory, practice and policy. Main topics to be covered - Indicative Content: History of Experiential Education/Adventure-based Programming; organization level risk management; Programming for various audiences: youth at risk, elderly people with disabilities, women, college student orientation programs, and experiential education in the classroom; Ethical issues and ethical principles; Current Issues: controversial issues, and budgets/strategic planning. RPTM 440 is a selection for RPTM majors in the outdoor experiential learning emphasis of the Outdoor Recreation option. The pre-requisite for this course is RPTM 330.", "prerequisite": "RPTM 330"}, {"department": "RPTM", "number": "456", "credits": "3 Credits", "description": "This course is designed to provide students with information and practical experience required to successfully design, promote, implement, and evaluate programs and special events. There are several course objectives, including: (a) increasing students' knowledge of key concepts in program planning and an understanding how they impact programming decisions; (b) increasing students' knowledge of decision factors involved in analyzing and designing a recreation program or special event; and (c) increasing students' skills associated with key management functions required to implement a recreational program or special event. Students are required to work in teams to design, promote, implement and evaluate a special event that will benefit participants and the sponsoring agency objectives. The course serves as a capstone course in the RPTM major. Main topics covered in the course include programming concepts, including programmer, program contexts, benefits-based programming, programming approaches, comprehensive programming cycle, and program formats; management structures, including organization of teams into committee structures with clear roles, responsibilities, and reporting structure; program design, including program concept, program purpose, goals and objectives, and development of themed events; situation analysis, including analysis of internal and external factors/ resources, potential participants¿ needs and interests, and program-related research; budget development and sponsorship, including direct fixed and variable costs associated with event, differential pricing, and sponsorship; promotion, including purposes for promotion, types of promotional tools, and development of a promotional plan; Event logistics, including development of a schedule of events, equipment and supplies, volunteers and staffing, registration, site layout, and event logistics; Risk management, including safety check, policies and procedures, staff/volunteer orientation, and overall risk management plan; program evaluation, including summative and formative, process and outcome evaluation. This is a required course for majors in Recreation, Park, and Tourism Management. Students from other majors may enroll in this course, providing they have met the pre-requisites.", "prerequisite": "RPTM 236"}, {"department": "RPTM", "number": "457", "credits": "2 Credits", "description": "The purpose of the peer-mentoring course is to provide students who have successfully completed and demonstrated leadership ability in RPTM 456 with an opportunity to gain additional leadership and event planning skills by mentoring a group of students currently enrolled in the class. Peer mentors serve as facilitators to teams of students in RPTM 456 who are charged with planning, promoting, implementing and evaluating a special event for a community or campus-based organization. Peer mentors are expected to help teach a minimum of 2 classes during the semester. Peer mentors take a leadership role in helping students understand and apply course content. Additionally, peer mentors serve as a liaison between the course instructor, the agency supervisor they are working with, and their assigned team.", "prerequisite": "RPTM 236"}, {"department": "RPTM", "number": "470", "credits": "3 Credits", "description": "Management of recreation and park services in public/non-profit settings; planning, budgeting fiscal development, resources allocation, decision- , making, computer applications.  RPTM 470 Recreation and Park Management (3)The primary objective of this course is to provide advanced standing RPTM students with an understanding of management and administration procedures that are essential to operating and managing park facilities and recreation programs. Secondarily, students will be given an opportunity to be exposed to park and recreation governance processes and will be asked to synthesize the roles that key stakeholders play in the management of public-sector park and recreation organizations. Key topics covered in this course include: *A historical account of park and recreation operating environment as well as trends in park support and positioning of the field *Inter-organizational partnerships and collaborations in the park and recreation field *Financing, budgeting and fiscal control processes *Human resource management principles and policies *Creating effective working relationships with community stakeholders and park and recreation board members *Comprehensive recreation, park and open space planning This course is required for RPTM majors in the park management emphasis within the Outdoor Recreation Option. Students in other majors are welcome providing there are seats available after RPTM majors have been scheduled.", "prerequisite": "RPTM 320"}, {"department": "RPTM", "number": "475", "credits": "3 Credits", "description": "Advanced Arena Management develops advanced skills and understanding in arena and live entertainment management fields including operations, budgeting, marketing and staffing. Course is taught on site at a sports/ entertainment arena and also includes off-campus site visits to at least two (2) major live entertainment venues. Off campus travel with the class group is required for this course. Topics include; developing events from inception to delivery; booking, contract negotiation, scheduling, ticketing, food/beverage and alcohol service, safety and security, fan experience, risk management, and business management. Students are provided with management level exposure to a variety of departments throughout the arena and are given the opportunity to learn directly from department managers.", "prerequisite": "RPTM 370"}, {"department": "RPTM", "number": "494", "credits": "1-6 Credits/Maximum of 6", "description": "Senior Honors Thesis", "other": ["Honors"]}, {"department": "RPTM", "number": "495A", "credits": "3-12 Credits/Maximum of 12", "description": "The Recreation, Park and Tourism Management's Internship provides students with the opportunity to gain experience in the field while under the supervision of both the on-site supervisor and a faculty supervisor. The primary purpose of the RPTM Internship is to enable each student to meet his or her educational objectives through participation in a well-planned and organized practical experience. Students will gain access to direct recreation service delivery; program, personnel and facilities management; risk management; event planning; marketing and program evaluation. In most instances, students are engaged in an off-campus learning experience that aligns with their specific field of study within the field of Recreation, Park, Tourism and Event Management.", "prerequisite": "RPTM 394"}, {"department": "RPTM", "number": "495B", "credits": "1-4 Credits/Maximum of 12", "description": "Observation and participation under supervision in golf operations in public, private, municipal, or military settings.", "prerequisite": "RPTM 395B", "other": ["Full-Time Equivalent Course"]}, {"department": "RPTM", "number": "495C", "credits": "1-4 Credits/Maximum of 4", "description": "Observation and participation under supervision in golf operations in public, private, municipal, or military settings.", "prerequisite": "RPTM 495B", "other": ["Full-Time Equivalent Course"]}, {"department": "RPTM", "number": "495D", "credits": "1-4 Credits/Maximum of 4", "description": "Observation and participation under supervision in golf operations in public, private, municipal, or military settings.", "prerequisite": "RPTM 495C", "other": ["Full-Time Equivalent Course"]}, {"department": "RPTM", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "RPTM", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "RPTM", "number": "497P", "credits": "3 Credits/Maximum of 9", "description": "RPTM Practicum Special Topics"}, {"department": "RPTM", "number": "498", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "RPTM", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Foreign Studies in RPTM.", "prerequisite": "RPTM 199", "other": ["International Cultures (IL)"]}]