[{"department": "SC", "number": "60N", "credits": "3 Credits", "description": "This course will foster appreciation of art and the natural world through exploration of the flora, fauna, geology, and water systems. Students will use scientific and artistic observation skills to understand, relate, and respond to connections in nature. Students will learn how to identify species in the field and gain a base knowledge of natural history. Students will develop observational skills and a deeper awareness of their natural surroundings through scientific observation, visual expressions, and writing responses. Using a common visual language, utilizing the elements and principles of design, students will begin to develop an aesthetic awareness through observational collecting. Nature presents an installation ready to analyze, deepening the students' natural curiosity and ability to make connections. Most course work will be in the field and will include use of tools such as binoculars, microscopes, cameras, and sketchbooks. Goals for this course will include enhancing effective communication and critical and creative thinking. Students will use visual, oral, and written communication to express their observations of the natural world. Critical and creative thinking will be used to analyze and synthesize observations to develop independent research projects and presentations.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SC", "number": "100", "credits": "1 Credits", "description": "Introduces essential elements of laboratory safety, laboratory techniques, research ethics, and scientific communication skills.  Especially for undergraduate research students.  SC 100 Introduction to Research (1) The main objective of the course is to prepare students for a fulfilling and successful learning experience in the research laboratory. Students who engage in undergraduate research often continue to project for four to six semesters. This course provides students with the necessary introductory information to the undergraduate research experience so that the entire experience is more satisfying and productive for the students. A corollary goal is to introduce research students to other, like-minded students. Several in-class activities will involve group work combined with an explicit discussion of productive group dynamics. The course will cover four major issues associated with a sustained research project: safety, techniques, ethics, and communication. The course will make students more cognizant of the importance of each of these areas and will provide justification for the importance of each activity in the research enterprise. Students will be evaluated via a series of assignments in which the students reflect on the components of each area and the importance of that area to the continuation of scientific knowledge. Students will be quizzed on safe laboratory practices, usually with a laboratory practical on safety. Students will be assessed on the satisfactory performance common laboratory techniques such as using a pipette, using an analytical balance, using a power source, and proper handling of large equipment like super speed centrifuges. Ethics will be assessed via assignments that require students to contemplate a variety of ethical issues. As part of ethical conduct students will be expected to learn the proper composition of a laboratory notebook. The notebook will provide a segue between ethics and communication skills. Students will examine several recent scientific research articles and discuss the way in which the article is written. They will be assessed on their ability to summarize and critique the article in writing. A book on scientific writing could be assigned for this portion of the course because a student would find use of such a resource as they progress on an independent research project. The laboratory technicians or laboratory managers might assist the faculty member who is teaching the course."}, {"department": "SC", "number": "101", "credits": "1 Credits", "description": "Strategies and skills designed to identify career/life goals and implement career decisions.", "other": ["Cross-listed with: AG 100"]}, {"department": "SC", "number": "103N", "credits": "3 Credits", "description": "The student will become an effective generator and consumer of the data visualizations that saturate public and professional discourse. The student will examine the rules of design and how they can be used to construct compelling visualizations of data. The student will use this knowledge to critique data visualizations from the media and their peers. The student will produce data visualizations of their own using data sets that they generate and analyze. Though the focus throughout the course will be on natural science, we will also consider data relevant to areas such as business, science, history, education, and politics. The student will emerge from this course with an appreciation of how data visualizations influence their life, as well as the skill set to craft persuasive visualizations to support issues of interest to them. For the purposes of this course no prior knowledge is assumed in science, data handling, or design. We will build the knowledge and vocabulary needed in order to pair these two domains and equip you with a lifelong tool for creating persuasive data-driven explanations.", "prerequisite": "MATH 21", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SC", "number": "120N", "credits": "3 Credits", "description": "Students learn about plants from the perspective of sustainability, agriculture, food, genetics, textiles, and medicine, across history and around the globe, after spending a few weeks learning about basic plant biology. Students engage with a group project in collaboration with other students to deepen their understanding and appreciation of plant biological and historical connections with human civilization. Students share these projects with the class in a peer-teaching and learning exercise in the final weeks of class.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SC", "number": "125N", "credits": "3 Credits", "description": "Infectious diseases once thought to be nearly eradicated have seen a resurgence in recent years. The majority of the cases arose from people who deliberately chose not to vaccinate their children against these disease. Even in the twenty-first century the nature of disease and how to prevent it is not merely a matter of science, but an issue laden with cultural, political, and religious concerns. This course charts the history of disease both as a subject of scientific inquiry and a cultural and religious phenomenon. We will begin with early Greek and Egyptian attempts to understand disease as a foreign entity attacking the body and end in the twenty-first century with current ideas surrounding the use of antibiotics, vaccines, and emerging threats throughout the world. Along the way we will discuss the impact of significant epidemics - for example, Bubonic Plague, Syphilis, and Influenza - as well as changing scientific thinking of both how to deal with disease and how to understand the natural world. In tandem with the historical background key scientific ideas necessary for studying disease - including current understanding of the microbial world, microscopy techniques, and modern gene theory - will be presented to the students through classroom instruction and virtual laboratories.", "other": ["Cross-listed with: HIST 125N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SC", "number": "135N", "credits": "3 Credits", "description": "Society and Disease Management is an interdisciplinary general education course to educate students in the biological mechanisms of diseases, treatment of individual patients, and how disease burden is managed within communities. In addition to studying how infectious diseases spread through populations, societal impacts and global health approaches to managing disease interventions will be examined. Foundations of this course include the basics of the human immune system, development of vaccines and antibiotics, emergence of drug resistant diseases, as well as applications from economics, systems theory, and health policy. Specific diseases will be examined within a historical context leading to a survey of present day concerns relating to treatments, and then explore issues regarding future methods to control or eradicate disease. This longitudinal approach will provide students with a full awareness of disease management from its beginnings, to both early and modern treatment methods, culminating in how to potentially combat a disease using advances in genomic medicine and biotechnology all within the cultural framework of a community.", "other": ["General Education:  Natural Sciences (GN)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SC", "number": "142N", "credits": "3 Credits", "description": "The course explores two streams in parallel. Students will examine selected historic landmarks in science (e.g. evolution, atomic energy/weapons, climate change, biotechnology), with a focus on common misconceptions about the facts and practice of science. The course will also examine the development of literary and popular portrayals of science and scientists in their political, economic, social and cultural contexts, paired to these particular scientific developments. By considering past and current scientific problems, students will refine their quantitative and analytical skills. By considering scientific writing, novels, short stories, graphic novels, cinema, poetry, and other forms, students will refine their critical and reflective writing and speaking about both the rhetorical and discursive practices of science writing, and the social and cultural impact of literature in popular understandings of science.", "other": ["Cross-listed with: ENGL 142N", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "SC", "number": "145N", "credits": "3 Credits", "description": "This course uses the field of anatomical illustration to explore the history of medicine and our understanding of the human body. Charting the influence of visual art and imaging systems as essential aspects of medicine, this survey of art and historical imagery connects the study of human anatomy with principles of visual literacy and design. In addition to researching historical publications through writing and discussions, students will produce a research portfolio based on illustrations examined in the course. Lab activities with human cadavers will help students learn the basics of human anatomy within a historical context. No fine arts skills are required to take this course: only an enthusiasm for the study of human anatomy and its visual history. Scientific research is often concerned with a constant progress toward future discoveries - but it is vital to understand the research and discoveries that came before our time. For medicine, this history is uniquely linked to the evolution of art, printing technology, and education. Any scientist would be well served by some knowledge of art and design. Experiments rarely change the world on their own, and much can be gained and lost in the communication of their results. But anatomy is especially reliant on images and illustrations (even after the invention of photography). In order to explore the unique relationship between medical discovery and art history, we have designed this course to be a space for interdisciplinary research. Co-taught by an artist and an anatomist, we will take advantage of an on-site cadaver lab and digital media resources to reimagine the history course as a site of discovery, design, and discussion.", "other": ["General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Creative Thinking", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SC", "number": "183Q", "credits": "3 Credits", "description": "In this honors course, we'll explore changing perspectives on life and approaches to studying life. More specifically, we'll examine, through an historical lens, humankind's quest to describe and explain and, ultimately, to expand the diversity of the living world. We begin with early attempts to classify living things for example, Aristotle and Pliny. We then see how medieval bestiaries appropriated classical ideas about nature while adding to them in the context of Christian historia. In the Enlightenment, Linnaeus's taxonomic work provided a new way of naming and systematizing organisms. On the other hand, the nascent scientific methods of Sir Francis Bacon anticipate the shift from the descriptive to the theoretical and mechanistic that accompanied Darwin's first sketch of a phylogenetic tree and the theory of evolution. We consider new theories, methods, and language in our examination of Watson and Crick and the double helix, molecular biology, and genomics. The course concludes with a glimpse at future possibilities enabled by what was studied previously in the course: genetic engineering, synthetic biology, and de-extinction. The course's original structure offers the experiential engagement of the sciences through laboratory experiments and fieldwork along with the workshop and directed discussions characteristic of the humanities seminar. The content and type of \"readings\" also reflect both areas and include primary and secondary sources in a variety of media. A visit to a natural history museum and/or zoo provides important physical contexts where students learn about type specimens, live specimens, and how scientists today use collections. They will assemble and curate their own zoological collection, juxtaposing various approaches to describing and classifying animals. The integration of the humanities and the sciences into a single course, along with the incorporation of significant experiential work, helps students gain a broad and deep understanding of and appreciation for each of these intellectual disciplines and for life itself.", "other": ["Cross-listed with: CMLIT 183Q", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "Honors", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "SC", "number": "197Q", "credits": "3 Credits/Maximum of 3", "description": "Formal course given on a topical or special interest subject offered infrequently; several different topics may be taught in one year or semester. This Special Topics is an Inter-Domain GA/GN GenEd course.", "other": ["Cross-listed with: INART 197Q", "General Education: Arts (GA)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "Honors"]}, {"department": "SC", "number": "200", "credits": "3 Credits", "description": "A science appreciation course, aimed at making non-scientists more informed consumers of science. Science is frequently in the news. That's because it affects our everyday lives, shapes our view of the world and our place in it, and will have a profound impact on our future. This course teaches an appreciation of science and scientific thinking. It is aimed at making non-scientists more informed consumers of science by improving their ability to distinguish good science from bad science, and science from non-science. Students will be evaluated in part on their analysis of news stories that appear during the course of the semester. The course assumes no background knowledge. It is not for future scientists. Content is delivered by case studies of controversies within science and/or the public domain, some of which are resolved, some of which are not. These case studies will vary by semester and instructor. The course illustrates general principles of science by studying arguments now largely resolved, but which still resonate, such as child health and IQ, smoking, and why the peacock has such a ridiculous tail. The course will also examine unresolved scientific controversies which might include personalized genetic medicine, passive smoking, nanotechnology, the effects of gun laws on violence and suicide, or deer management in Pennsylvania. The course will also evaluate unresolved scientific issues in the contemporary media: why it is in the news, what are the scientists involved actually doing and arguing about, and how is the media is handling the science? The course will include an analysis of media reaction to a scientific paper published by PSU faculty. The course will discuss paradigm shifts which have occurred during the students' lifetimes, particularly those involving our view of ourselves and our universe, and include speculation on the paradigm shifts that could occur in the next twenty years. The course will draw on experts from within and outside of PSU. Throughout, the focus is on the nature of the debates, looking at how scientists evaluate problems, and why that can generate controversy within science and beyond science-but at the same time, generate trustworthy knowledge which profoundly affects our well being and our understanding of ourselves.", "other": ["General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SC", "number": "201", "credits": "1 Credits", "description": "Learn about the different medical professions and related subjects.  SC 201 Medical Professions (1)The purpose of this course is to provide students with general information on the different health professions and various related subjects as potential career options. Many students come to the university with an interest in pursing a health profession but do not have a clear idea of what kind of work is involved in the particular profession of their choice. Moreover, students often are not aware that there are other health career options available. This one-credit course is targeted to all students that have a general interest in health and science, and may include students in the following majors: premedicine, science, biology, chemistry, biochemistry and molecular biology, forensic science, nursing, kinesiology, nutrition, and biobehavioral health. Some of the professions discussed are: allopathic and osteopathic medicine, physical therapy, occupational therapy, physician assistant, nurse practitioner, dentistry, maxillo-facial surgery, optometry, audiology, genetic counseling, nursing, podiatry, and pharmacy. In addition to describing the professions, time is spent talking about academic preparation for specific professions and the application process for admission to health profession schools. Furthermore, the nature of various health profession training programs are described , as well as how students obtain tuition funds for payment of such programs. One week's topic generally focuses on health profession training outside the United States (e.g., foreign medical schools). This course is structured as a seminar course; all lectures are given by invited speakers. The speakers talk about the profession in general and may give specific information about the particular school they attend or currently work at. Students are encouraged to ask questions about the health careers and also to interact with the speakers after the class, where they might ask specific questions pertaining to their suitability as an applicant. The course will meet in the evenings, for one hour, one day a week, for 15 weeks. The students that enroll in this course receive a satisfactory or unsatisfactory grade based on attendance only (there are no exams, quizzes or written reports). Students may miss up to three classes during the fifteen week session. Therefore, students that attend twelve of the fifteen lectures will receive a satisfactory grade. If a student needs to miss class due to an evening exam, they will need to fill out an Excused Absence Form, which can be obtained from the instructor (no other activities are excusable except for athletic competitions for students in varsity teams)."}, {"department": "SC", "number": "205N", "credits": "3 Credits", "description": "The course will consider the ways statements are used for aims other than to convey accurate information. This disregard for truth results in the increasingly difficult task of identifying bias and falsehood in the age of information. There are three areas most corrosive to knowledge: language, science, and statistics. The course will examine the appeal of rhetorical arguments and the role of bias in assessing claims; various ways evidence fails to support a conclusion; and the manipulation of data to make information appear more compelling than it is. Students will learn to evaluate the truth of arguments based on philosophical and scientific criteria, and use a variety of skills to identify bias and falsehood in the media.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "SC", "number": "210", "credits": "2 Credits", "description": "Covers topics related to success in upper level courses including critical thinking, library resources, reading primary literature, and communication skills.  SC 210 Sophomore Science Seminar (2) The main objective of this course is to serve as a bridge between the first two years of a science program and the last two years. Sophomore students need to understand that upper-level coursework in the sciences requires higher order cognitive skills as well as an intellectual maturity that enables the student to meet the challenge of upper level coursework. Students also require an ability to access the multitude of scientific information available on the web and in library databases therefore students will be expected to demonstrate their ability to retrieve information. Sophomore students are faced with many exciting possibilities that they should be aware of including undergraduate research and cooperative education. This course will enable students to make more informed decisions about how to best structure their own educational needs while meeting the demands of upper level coursework. Students will be assessed via a variety of methods including participation in discussion, actively seeking information from seminar guest speakers (in the form of questions), written reports (interview with faculty member, summary of scientific article, synthesis of newspaper reports about recent discoveries, individually selected research topic), and oral presentations (critique of recent science information in newspapers, independent topic, interview with faculty member)."}, {"department": "SC", "number": "220", "credits": "1 Credits/Maximum of 1", "description": "This course is designed to prepare undergraduate peer-learning mentors for their role in facilitating student centered learning activities. This course is designed to prepare peer-learning mentors for their role in facilitating student centered learning activities. The course content includes a blend of strategies for effective teaching and learning coupled with the opportunity to practice strategies of effective mentorship and feedback to peers and faculty. Through selected readings and course discussions students are introduced to the basic tenants of learning: the role of prior knowledge, the organization of knowledge into networks, the role motivation plays in learning, tools for the development of gaining mastery, effective practice and feedback, the importance of course climate, and the role metacognition plays in achieving self-regulated learning. Each of these topics is covered in one of the seven class periods. The students who have completed this course will be able to understand: - How prior knowledge affects learning and suggest alternate examples to help peers see the information through another perspective - How the organization of knowledge affects long term learning and share with peers the knowledge networks most commonly utilized in STEM disciplines - Factors that motivate student learning and apply this knowledge to assist faculty in motivating student engagement - How students develop mastery and assist peers to engage in activities that promote mastery through directed practice - How practice and feedback enhance learning and provide effective feedback when working with their peers - How course climate affects learning and provide faculty with valuable feedback in regard to the climate of their course learning spaces - How learners develop stronger metacognitive skills to be able to reflect on their own learning experiences and share this with their peers. Student mastery of the material is typically assessed through weekly written reflection assignments based on the readings and in class discussions. These reflections are graded and feedback is provided to assist students in growth in becoming effective learning facilitators. A final reflection assignment is typically given in which the students are asked to describe how these course topics will be put to use in the assignment as a learning assistant."}, {"department": "SC", "number": "240", "credits": "1-2 Credits/Maximum of 8", "description": "This course is experiential training in facilitating collaborative active learning in science. The students in this experiential learning course are selected by the course instructors to participate as a part of their instructional team to facilitate active learning activities in their classroom and or laboratory courses. Students engaged in this experience must have demonstrated mastery of the course material covered in the course they are facilitating. These students encourage and guide group work, lead problem solving sessions, and provide faculty with student feedback. They are required to attend all laboratory or course sessions as well as attend weekly team meetings to debrief on the week's activities and prepare for upcoming activities.", "prerequisite": "SC 220"}, {"department": "SC", "number": "290", "credits": "3 Credits/Maximum of 3", "description": "Renewable energy sources are essentially carbon-free and more sustainable than fossil or nuclear fuels. This course reflects the remarkable progress that has been made in the field in recent years. We will spend about one-third of our time in \"the classroom,\" studying renewable energy systems, their underlying physical and technological principles, their economics, their environmental impact and how they can be integrated into the World's energy systems. The rest of the time will be in the field, getting our hands dirty, learning by doing. While Costa Rica is well known as a World leader for conservation policies and eco-tourism, the Central American country also stands out for its environmentally oriented policies and its success in mainstreaming energy sustainability into national policy. Currently, 99.2% of the total primary energy supply in Costa Rica is of renewable type, with geothermal accounting for over a third, hydroelectric dependency not exceeding 50%, and a very small share from fossil fuels (0.6% non-sustainable biomass, and 0.2% from oil). Students learn about renewable energy technologies for the developing World in Costa Rica, one of only a few countries in the region that have taken a concerted structural approach to the issue of sustainable development.", "other": ["International Cultures (IL)", "General Education:  Natural Sciences (GN)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SC", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "SC", "number": "295", "credits": "1-3 Credits/Maximum of 3", "description": "A supervised work experience where the student is employed in a scientific position.  To be offered for SA/UN grading.", "prerequisite": "acceptance into the Eberly College of Science co-op program", "other": ["Full-Time Equivalent Course"]}, {"department": "SC", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "SC", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "SC", "number": "306", "credits": "1 Credits/Maximum of 3", "description": "This course is designed for students enrolled in the Science BS/MBA IUG degree program. It will provide an opportunity for students to become familiar with key MBA common terms and concepts that will be useful for their required co-ops, internships, and their transition into work in the Smeal MBA part of the degree program. During the course, instructors will introduce or reinforce learning about hard skills of supply chain management, finance, business planning and marketing, and soft skills associated with leadership, organizational dynamics and modern management. The course will improve student ability to formulate and present strategies and communicate effectively as a leader and team member. The course will expand the number of occasions for the BS/MBA class cohort to experience inter-class interaction and it will provide mutual support opportunities. In order to facilitate these inter-class interactions, it is designed to be repeatable so students in later years of the program can work with the students just beginning the program. The course will augment the integrative learning that was established in first year seminars and extracurricular BS/MBA enrichment programs. The course is designed to facilitate continued student development as self-directed learners. The course will advance student perspectives of professional and career development."}, {"department": "SC", "number": "306W", "credits": "1 Credits/Maximum of 3", "description": "This course is designed for students enrolled in the Science BS/MBA IUG degree program. It will provide an opportunity for students to become familiar with key MBA common terms and concepts that will be useful for their required co-ops, internships, and their transition into work in the Smeal MBA part of the degree program. During the course, instructors will introduce or reinforce learning about hard skills of supply chain management, finance, business planning and marketing, and soft skills associated with leadership, organizational dynamics and modern management. The course will improve student ability to formulate and present strategies and communicate effectively as a leader and team member. The course will expand the number of occasions for the BS/MBA class cohort to experience inter-class interaction and it will provide mutual support opportunities. In order to facilitate these inter-class interactions, it is designed to be repeatable so students in later years of the program can work with the students just beginning the program. The course will augment the integrative learning that was established in first year seminars and extracurricular BS/MBA enrichment programs. The course is designed to facilitate continued student development as self-directed learners. The course will advance student perspectives of professional and career development.", "other": ["Writing Across the Curriculum"]}, {"department": "SC", "number": "395", "credits": "1-3 Credits/Maximum of 3", "description": "A supervised work experience where the student is employed in a scientific position.  To be offered for SA/UN grading.", "prerequisite": "SC 295", "other": ["Full-Time Equivalent Course"]}, {"department": "SC", "number": "400", "credits": "1 Credits", "description": "A series of lecture/discussions in which science faculty members show the social implications of their research specialty."}, {"department": "SC", "number": "401", "credits": "1 Credits", "description": "Clinical aspects of various disease and how basic scientific information contributes towards understanding and treating disease.  SC 401 Basic Science and Disease (1)The purpose of this course is to provide students with some general background on the symptoms, risk factors, prevention, and treatment of various diseases. Along with the clinical aspects of the diseases, we examine how basic scientific research studies contribute information towards helping to understand the mechanisms underlying disease development and control. This one-credit course is targeted to all students that have a general interest in health and science, and may include students in the following majors: premedicine, science, biology, chemistry, biochemistry and molecular biology, forensic science, biobehavioral health nursing, kinesiology and nutrition. Enrollment priority is given to students with fourth semester or above status. Examples of topics discussed are: Hypertension, Osteoporosis, Infectious Diseases, Asthma, Chronic Obstructive Pulmonary Disease, Cancer, Diabetes, Sickle Cell Anemia/Anemia, Blood Disorders, Hypercoagulability, Coronary Artery Disease, Alcoholism/Alcohol Poisoning, HIV/AIDS, Tuberculosis, Irritable Bowel Syndrome, Hepatitis, Thyroid Disease, Congestive Heart Failure, Parkinson's Disease, and Arthritis This course is structured as a seminar. Most lectures are powerpoint presentations by invited speakers, which usually will be local physicians sometimes paired with Penn State research faculty. The speakers introduce the disease topic by discussing the basic anatomy and physiology of the system or body part most affected by the disease. (e.g. lungs, heart, kidneys, etc). Once the foundation is established the pathophysiology is discussed. Risk factors and prevention are also highlighted. One important goal of each seminar is to indicate to students how advances in basic science research can impact the understanding and treatment of disease. Students are encouraged to ask questions after the lecture. The speaker(s) remain afterwards to allow students to ask more specific questions about the disease topic. On occasion, speaker physicians also talk about their medical school training and/or life as a practicing physician. The students that enroll in this course receive a letter grade based on attendance (students must attend 9 out of 10 classes), quizzes and a 2-3 page reaction paper on one of the disease topics. Random short-answer quizzes are sometimes administered at the end of a seminar, testing on information presented during the seminar. Also, reading assignments are sometimes given prior to a seminar, or information handout materials are provided during the seminar. If a student needs to miss class due to an evening exam they need to fill out an Excused Absence Form, which can be obtained from the instructor (no other activities are excusable except for athletic competitions for students in varsity sports).", "prerequisite": "4th semester standing or higher"}, {"department": "SC", "number": "402", "credits": "1-3 Credits/Maximum of 3", "description": "Present undergraduate and graduate students with information and skills necessary for success in science-related job positions available in industry.", "prerequisite": "5th semester standing or permission of program"}, {"department": "SC", "number": "451", "credits": "1 Credits", "description": "SC 451 will provide students with the skills and experience necessary to design outreach activities based on their research and interests, communicate their science in multiple modes, and engage with diverse audiences. Lectures will provide foundational material via a focus on the fundamentals of science communication and outreach, as well as some of the pedagogical basics of science education. Guest speakers will build upon this groundwork by leading modules on lesson planning for effective outreach and communicating with audiences through a variety of platforms, including social media, personal or professional blogs, media interviews, and press releases. These guest modules will be supplemented by panel discussions (with outreach and research professionals from Penn State) on science engagement in different settings (e.g., museums, extension meetings, public science lectures, K-12 classrooms, etc.), disseminating research via social media, and creating and integrating research-related outreach into broader impact statements for grant proposals. The design of student outreach projects will provide a unifying thread throughout the semester, as students work in small groups to create, refine, and implement unique outreach activities following best practices outlined in lectures and panel discussions. Students will be encouraged to choose topics outside of their normal studies, expanding their ability to communicate science with which they are less familiar. Students will have multiple opportunities to both receive feedback from their peers and instructors and offer feedback on their peers¿ projects. Students will exhibit their activities at an event, and in doing so, practice the communication and engagement skills they developed throughout the semester. Through this process, students will gain experience disseminating science, as well as confidence in their ability to accomplish successful science outreach. Afterward, students will evaluate and reflect on their experience and use this self-evaluation to refine their activities for future use.", "prerequisite": "ENGL 15"}, {"department": "SC", "number": "475N", "credits": "3 Credits", "description": "Anatomy is more than learning to name structures. Students will practice critical thinking and analytical skills, and develop key literacies while studying human cadavers and learning to predict a structure's function by observing its shape, texture, and tissues. Students will practice critical and integrative thinking while discussing the historical circumstances that gave rise to, supported, and sometimes hindered the development of anatomy as a science by synthesizing original arguments (written and oral) that explore the evolution of anatomic science within the context of Italian history, politics, and culture. Students will also study the ethics of acquiring cadavers within contemporary and renaissance contexts, identify individual graphics and historical sculptures that demonstrate anatomic understanding, and discuss their origins and implications for renaissance-era society. Students will also develop their communication skills: presenting original posters, leading class discussions, writing term papers, and creating webcasts as part of a service project. During spring break, students will travel with the instructors to Italy and study: anatomic wax specimens born through collaborations between anatomists and artists; Michelangelo's hidden anatomy in the Sistine Chapel; and the history of medicine. As preparation for their study abroad experience, students must concurrently enroll in IT 197: Italian Language and Culture for Study Abroad", "prerequisite": "BIOL 128", "other": ["General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SC", "number": "476", "credits": "3 Credits", "description": "Field experience in five or more medical settings; complementary exposure to the scientific literature; weekly discussions.  SC 476 Human Dimensions of Health Care (3) This course, delivered jointly by Penn State and the local medical community, is designed to provide field experience for students with plans for a future in the health professions. The course is structured around rotations through multiple no less than five medical settings, which may include Community Medicine, Dentistry, Emergency Room, Family Medicine, Hospice Care, Oncology, Optometry, Palliative Care, Pediatrics, Physical Therapy, Senior Services, Wound Care, and other specialties. The first four weeks consist of an introduction and orientation to the goals each setting. The purpose of these sessions is to acquaint the students with the requirements of the course as well as expectations for the on-site rotations. During this time, the students become familiar with the health care issues associated with each setting through literature specific to particular medical settings. At the end of these sessions the students write a course plan, in which they review the major issues common to each setting, and project how they expect to gain and how they expect to contribute in each setting. During the next nine weeks, the students rotate through the medical settings, spending two afternoons per week in rotation. Students are scheduled to assignments with one of the medical settings for the afternoon. At these times the students are under direct supervision of the setting's staff. Where feasible, students may also sit in on physicians' staff meetings, attend lectures, or receive other forms of special instruction provided by medical staff. All students will maintain a logbook of activities during the rotations. Weekly meetings on campus are devoted to reports of experiences by each of the students, discussions based on the questions developed during the orientation period, and resolution of issues which may arise. In this way, students assigned to each rotation inform those students who will later enter that setting.", "prerequisite": "BIOL 230W"}, {"department": "SC", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "SC", "number": "494H", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Honors"]}, {"department": "SC", "number": "495", "credits": "1-3 Credits/Maximum of 3", "description": "A supervised work experience where the student is employed in a scientific position.  To be offered for SA/UN grading.", "prerequisite": "SC 395", "other": ["Full-Time Equivalent Course"]}, {"department": "SC", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]