[{"department": "SOCW", "number": "195", "credits": "3 Credits", "description": "This course provides an introduction to the social work profession through a historical, ethical, and value-based exploration within a transcultural perspective. A focus on the skills and knowledge base of the profession as well its advocacy foundation with at-risk, disenfranchised, and marginalized populations will be presented. Students will also have an introduction to field education through required pre-practicum hours. Course objectives and format methodology is based upon the core competencies and practice behaviors designed by the CSWE.  1. To construct a beginning understanding and demonstrate ethical and professional behaviors in social work practice.  2. To demonstrate an understanding of how the social work generalist practitioner engages in diversity and difference in practice.  3. To understand how the social work generalist practitioner advances human rights and social, economic, and environmental justice.  4. To construct a beginning understanding of how the social work generalist practitioner engages in practice-informed research and research-informed practice.  5. To demonstrate an understanding of the role policy play in the practice of generalist social workers.  6. To construct an understanding of how social workers, intervene with individuals, families, groups, organizations, and communities.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SOCW", "number": "205", "credits": "3 Credits", "description": "This course will provide social work students with the knowledge, skills, and values necessary to engage in culturally competent social work practice at the generalist level. An emphasis on activism, advocacy, anti-racism, anti-discrimination, culture, ethnicity, international social work, and social justice within diverse communities and practice settings will be examined. According to the National Association of Social Workers Code of Ethics, cultural competence and social diversity have three primary components:  1. Social workers should demonstrate an understanding of culture and its function in human behavior and society, recognizing the strengths that exist in all cultures.  2. Social workers should demonstrate knowledge that guides practice with clients of various cultures and be able to demonstrate skills in the provision of culturally informed services that empower marginalized individuals and groups. Social workers must act against oppression, racism, discrimination, and inequities, and acknowledge personal privilege.  3. Social workers should demonstrate awareness and cultural humility by engaging in critical self-reflection (understanding their own bias and engaging in self-correction), recognizing clients as experts of their own culture, committing to lifelong learning, and holding institutions accountable for advancing cultural humility.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SOCW", "number": "215", "credits": "3 Credits", "description": "This course familiarizes students with the historical development of social welfare history, policy, programs, and services. This section will provide students with a national and global perspective to better understand social welfare concepts at the generalist level. Elements of advocacy, human rights, social, political, and economic justice are essential reoccurring themes embedded in the course. SOCW 215 assists students in developing an understanding of how the implementation of social welfare policies, programs, and services are funded, influenced, and regulated at the local, state, and federal levels. Students will be introduced to multiple historical periods in American society that are relevant to the foundation of social welfare programming and the social work profession. Key figures and pioneers of the social work profession will also be discussed including Jane Addams, Mary Richmond, Dr. Dorothy Height, Clara Barton, Whitney M. Young Jr., Cesar Chavez, and other influential leaders.", "other": ["United States Cultures (US)", "General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SOCW", "number": "290", "credits": "3 Credits", "description": "This course provides students with a conceptual framework to acquire knowledge of human behavior and the social environment with an emphasis on human growth and development theories throughout the life span. Special attention to biopsychosocial functioning and spiritual factors will be examined from a social work practice perspective. SOCW 290 will assist students in identifying indicators of normal and abnormal development in addition to better understanding person-in-environment (PIE) theory and other multidisciplinary theoretical frameworks relevant to social work. Competent social work practitioners view human behavior in the social environment through a resiliency, risk, and vulnerability model. By examining human behavior throughout the lifespan, SOCW 290 provides a foundation for students to organize thoughts about the challenges and needs of diverse client populations to better provide social work-related interventions, services, support, and resources. Theories discussed in this course will be connected to cultural, developmental, and social issues that are experienced throughout each stage of life. Students are expected to utilize acquired knowledge and skills gained in this course to better understand the interactions between clients and their environment by examining the major domains of human development from a social work lens. This course is designed to address CSWE competency requirements. SOCW 290 is a requirement for SOCW majors.", "prerequisite": "SOCW 195", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SOCW", "number": "300", "credits": "3 Credits", "description": "The primary focus of this course is to introduce students to direct practice with individuals. Strength based strategies, which value client self-determination while helping clients to obtain their highest functioning level, are an important underpinning of ethical social work practice and as such must be presented and understood by social work students if they are to become successful change agents. This course will provide an introduction on client engagement, assessment, goal setting, intervention and termination processes in challenging practice environments and within a multicultural perspective. The course will be framed within the nine competencies and practice behaviors as outlined by the Council for Social work Education that are appropriate for an advanced level course. Course Objectives and Format Methodology based upon the Core Competencies and Practice Behaviors of Social Work Education 1. Demonstrate the knowledge of social work ethical and professional values the social service delivery system to be able to make an informed decision about entry into the field of social work. 2. Identify how the social work generalist practitioner advances human rights and social, economic, and environmental justice within a micro and macro practice with individuals. 3. Describe the types or forms of human diversity (e.g. culture, gender) encountered in social work practice and describe principles and guidelines for responding to human differences. 3. Define the roles and functions of social work practice to engage and evaluate individuals, families, groups, organizations, and communities. 4. Develop the ability to understand the multiple methods used by generalist social workers with systems of all sizes. 5. Employ in understanding how the social work generalist practitioner engages in diversity and difference in practice with individuals. 6. Apply empowering practices and ways of working collaboratively. 7. Identify and describe key social work values, knowledge, principles, and skills within an ethical framework as defined in the NASW Code of Ethics. Cognitive Methods Students will effectively and discriminately classify, synthesize and convert knowledge and understanding gained from course readings, lectures, videos/digital content, and guest lectures into informed class participation and reflective class assignments. Affective Methods Students will examine and challenge their value assumptions as they attempt to analyze contemporary theories of human development. They will explore practical implications of their values and the prevailing social values within this culture as they relate to the provision of social work. This will be achieved through class discussion and as such it is essential that students participate in class. Experiential Methods Students will experiment with various analytical and practice skills as they relate to theory and research methods in small and large group experiences, discussions and a variety of class presentations.", "prerequisite": "SOCW 195"}, {"department": "SOCW", "number": "301", "credits": "3 Credits", "description": "The primary focus of this course is to introduce students to the importance of group work with a variety of client populations as well as provide a foundation in group work theories, modalities and facilitation. Social work students are in many instances most often comfortable working with individuals or family units and have little to no experience in group leadership. Since group work regularly occurs within a micro or clinical context as well as in larger macro practice settings it is imperative that social work students become familiar with and proficient in group work. This course discusses planning for, conducting, and evaluating several types of groups including skills, support, treatment, psychoeducational, task orientated, macro practice, anti-oppressive, eating disorder, elementary school conflict resolution and teen pregnancy groups. Additional group work with disenfranchised populations including immigrants and people with HIV/AIDS. Students will be asked to apply critical thinking to inform and communicate professional judgments. The course will be framed within eight of the nine competencies and practice behaviors as outlined by the Council for Social work Education that are appropriate for an advanced level course.", "prerequisite": "SOCW 195"}, {"department": "SOCW", "number": "302", "credits": "3 Credits", "description": "The primary focus of this course is to introduce students to the importance of work with families and to provide a foundational platform from which to practice. Students and professionals in the field of social work usually can easily identify deficiencies and issues within a family system. What is not as easily discernible is the strengths which all families possess. Understanding how individuals and families, not only survive, but can thrive under adverse conditions can enable social workers to move families toward healing. Therefore, students must not only study family dynamics and theories of family therapy but must first understand the concept of resiliency as it is rooted in the strength's perspective. Students will be asked to apply critical thinking to inform and communicate professional judgments. The course will be framed within the nine competencies and practice behaviors as outlined by the Council for Social work Education that are appropriate for an advanced level course.", "prerequisite": "SOCW 195"}, {"department": "SOCW", "number": "303", "credits": "3 Credits", "description": "This course will examine the interventions, research, and theories that generalist social workers use in macro practice settings while working with communities, groups, organizations, and public policy. Students will develop skills in community activism, advocacy, development, empowerment, mobilizing, organizing, and organizational leadership. SOCW 303 students will also learn how to create a community action plan, needs assessment, program budget, grant proposal, logic model, and SWOT analysis to further develop administrative and leadership skills. As a course requirement, students will be expected to engage with communities and organizations outside of the classroom. Therefore, the following background clearances may be required: PA child abuse clearance, PA criminal background check, and an IdentoGO/FBI fingerprint clearance. Upon successful completion of this course, students will foster a better understanding of how macro-level social workers employ various approaches to engage, assess, intervene, and evaluate diverse populations and organizations from a generalist practice perspective.", "prerequisite": "SOCW 195"}, {"department": "SOCW", "number": "315", "credits": "3 Credits", "description": "This course will provide students with an overview of the necessary skills, strategies, techniques, theories, and values associated with social work interviewing and case management. Students will learn how to monitor, plan, and seek services for clients at the micro, mezzo, and macro levels. Other topics explored will include clinical interviewing, conducting assessments, and initiating the referral process. Clinical interviewing is an important skill for all social workers to achieve due to its nature of fostering effective communication patterns between the client and practitioner. Students will master how to apply social work interviewing skills to practice through engaging in a variety of techniques: Basic listening, clarifying, confronting, feedback, focusing, supporting, reflecting, reframing, redirecting, validating, among others. According to the National Association of Social Workers, case management dates its development back to the emergence of the social work profession and it still remains integral to contemporary social work practice. The National Association of Social Workers' benchmark study of licensed social workers in the United States documented that case management is a component of many social work positions, and that a significant number of social workers report spending more than half their time on case management-related responsibilities. Social workers must be competently skilled in interviewing and generalist case management techniques to effectively meet the needs of their client populations.", "prerequisite": "SOCW 195"}, {"department": "SOCW", "number": "407", "credits": "3 Credits", "description": "This course introduces students to the methods and processes of social work research. A major emphasis of this course is the integration of practiceinformed research and research-informed practice. Social work students will learn how to utilize research evidence to inform policy and practice through scientific inquiry. Students will analyze research designs, develop qualitative and quantitative skills, engage in hypothesis formation and testing, and evaluate social work program outcomes. Throughout this section, students will assess multiple practice-based research studies relevant to social work practice. Developing and conducting a social work-related research project through the application of newly developed skills in this course is expected. Upon completion of SOCW 407, students will develop an understanding of how research is an integral part of the problem-solving process in social work practice settings. Ethical considerations in the conduction of research with human subjects will also be explored. SOCW 407 is a required course for all social work majors enrolled in the BSW program.", "prerequisite": "SOCW 195"}, {"department": "SOCW", "number": "495A", "credits": "3 Credits", "description": "The social work internship is intended to give aspiring social workers experience in clinical settings and non-profit agencies. They will have the opportunity to apply their knowledge to real-world situations and deepen their experiences through field studies.", "prerequisite": "SOCW 195"}, {"department": "SOCW", "number": "495B", "credits": "9 Credits", "description": "This addvanced internship is an immersive field experience for students pursuring the BSW. Students will be placed in clinical sites and non-profit agencies to deepen their experiences through field work.", "prerequisite": "SOCW 195"}]