[{"department": "SODA", "number": "308", "credits": "3 Credits", "description": "This course engages students in the study and use of research design tools for the analysis of \"big data.\"  SODA 308 Research Design for Social Data Analytics (3) The tools of social science and social data analytics affect how data scientists and social scientists understand the world. This course engages students in the study and use of research design tools for the analysis of social systems and \"big data.\" Topics to be addressed include: how the scientific method relates to a practice of establishing the validity of propositions and the role that analytics can play in that process when the observations are vast and varied; how the validity of systematic patterns in data are assessed as well as how spurious or biased patterns in the data are ruled out; and how the scientific method can guide the use of exploratory techniques such as machine learning and visual analytics. Through the course, students will learn to develop innovative research designs in an effort to improve the statistical analyses used with social data and how to present these analyses to nontechnical audiences, such as non-profits, employers, and the general public. Course requirements include several short memoranda that require the development and presentation of a research design and data analysis plan. Students will also gain practical experience working with several \"big data\" sets. Students are required to have an understanding of introductory statistics (equivalent to the knowledge they would gain from PL SC 309) prior to taking this course.", "prerequisite": "PL SC309"}, {"department": "SODA", "number": "496", "credits": "1-18 Credits/Maximum of 999", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "SODA", "number": "497", "credits": "1-9 Credits/Maximum of 999", "description": "Formal courses offered infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]