[{"department": "SPAN", "number": "1", "credits": "4 Credits", "description": "Audio-lingual approach to basic Spanish; writing. Students who have received high school credit for two or more years of Spanish may not schedule this course for credit, without the permission of the department.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "2", "credits": "4 Credits", "description": "Audio-lingual approach to basic Spanish continued; writing. Students who have received high school credit for four years of Spanish may not schedule this course for credit, without the permission of the department.", "prerequisite": "SPAN 001", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "3", "credits": "4 Credits", "description": "Audio-lingual review of structure; writing; reading.", "prerequisite": "SPAN 002", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "SPAN", "number": "10", "credits": "6 Credits", "description": "Basic Spanish grammar, oral, aural, and writing skills (essentially equivalent to SPAN 001 and first half of SPAN 002).", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "20", "credits": "6 Credits", "description": "Basic and intermediate Spanish grammar, oral, aural, and writing skills (essentially equivalent to second half of SPAN 002 and all of SPAN 003).", "prerequisite": "SPAN 010", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Foreign/World Lang (12th Unit)"]}, {"department": "SPAN", "number": "51", "credits": "3 Credits", "description": "Intensive introduction to Spanish: first half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  SPAN 051 Elementary Intensive Spanish for Graduate Students I (3)This is the first in a series of three courses designed to give students an intensive introduction to Spanish. This is the first half of elementary sequence in reading, writing, speaking. listening, and cultural contexts. Students will learn the Spanish vocabulary and will learn to create simple sentences. Lessons are taught in an authentic cultural context.", "prerequisite": "graduate standing"}, {"department": "SPAN", "number": "52", "credits": "3 Credits", "description": "Intensive introduction to Spanish: second half of graduate intensive sequence in elementary reading, writing, speaking, listening, cultural contexts.  SPAN 052 Elementary Intensive Spanish for Graduate Students II (3)This is the second in a series of three courses designed to give students an intensive introduction to Spanish. This is the second half of graduate intensive sequence in elementary reading, writing, speaking, listening, and cultural contexts. Students will learn the Spanish vocabulary. Lessons are taught in an authentic cultural context.", "prerequisite": "SPAN 051 or equivalent, and graduate standing"}, {"department": "SPAN", "number": "53", "credits": "3 Credits", "description": "Continued intensive study of Spanish at the intermediate level: reading, writing, speaking, listening, cultural contexts.  SPAN 053 Intermediate Intensive Spanish for Graduate Students (3)This is the third in a series of three courses designed to give students an intermediate intensive knowledge of Spanish. Continued intensive study of Spanish at the intermediate level: reading, writing, speaking, listening, and cultural contexts. Lessons are taught in an authentic cultural context.", "prerequisite": "SPAN 052 or equivalent, and graduate standing"}, {"department": "SPAN", "number": "83", "credits": "3 Credits", "description": "Introduction to the study of Hispanic literatures and cultures.  SPAN 083S First-Year Seminar in Hispanic Literatures and Cultures (3) (GH;FYS;IL)(BA) This course meets the Bachelor of Arts degree requirements.The first-year seminar in Spanish will introduce students to the study of Hispanic literatures and culture in their first semester at the University. Students will read (in English) significant literary texts, view art works (including films and videos), listen to music and explore the Hispanic world in general. These experiences will help prepare them for additional courses in literature and in Spanish, but will also serve as an introduction to things Hispanic, and as a point of comparison with U.S. culture. In addition to the academic topic and issues of this course, students can expect to gain a general introduction to the University as an academic community and have the opportunity to explore their responsibilities as members of that community. Students will develop an understanding of the learning tools and resources available to them including the opportunity to develop relationships with faculty and other students who share their academic interests. This course will introduce students to the study of Hispanic literatures and culture in their first semester at the University. This experience will help prepare them for additional courses in literature and in Spanish. The course satisfies both the first-year seminar and a general education humanities or Bachelor of Arts humanities requirement.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "First-Year Seminar", "General Education: Humanities (GH)"]}, {"department": "SPAN", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "SPAN", "number": "100", "credits": "3 Credits", "description": "An intermediate level grammar review that also incorporates directed and original composition exercises.", "prerequisite": "SPAN 003 or SPAN 020", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "100A", "credits": "3 Credits", "description": "A review of grammar and practice with composition focusing on needs and problems specific to Spanish-speaking bilinguals.", "prerequisite": "placement", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "100B", "credits": "3 Credits", "description": "Intermediate Grammar and Composition for Students in Medical-Related Fields.  SPAN 100B Intermediate Grammar and Composition for Students in Medical-Related Fields (3) The main goals of the course are to help students develop their competence in using medical terminology in Spanish and to become familiar with the cultural aspects in the health care of Latinos/Hispanics in the United States. In addition, the course will review intermediate level Spanish-language grammar and will provide structure to improve students receptive (listening and reading) and productive (speaking and writing) skills needed for this specialized vocabulary. During the semester students will learn and practice health terminology in Spanish, and they will apply the specialized vocabulary through case scenarios, noticias (news) and readings. Participants will be exposed to Spanish from the first day and are expected to stay up-to date with the current health news as it relates to the Hispanic/Latino population of the United States. The course is intended for those who are beyond the basic level of Spanish (must have taken Span 003), but participants are not expected to be fluent speakers.", "prerequisite": "SPAN 003 or SPAN 020"}, {"department": "SPAN", "number": "100C", "credits": "3 Credits", "description": "This course focused on grammar and the media environment replaces Spanish 100 for students going into Communication majors.  SPAN 100C Intermediate Grammar and Composition for Students in Communication-related Fields (3) Intermediate Grammar and Composition for Students in Communication-related fields (Spanish in the Media) is an online content-based course for Spanish majors aimed to develop communication skills through a focus on mass media in Hispanic culture. This online course is a perfect match for double majors in Spanish and Media (Advertising/Public Relations, Media Studies, Journalism, etc). This course is restricted to students who are Communication majors or pre-majors. Completing this course achieves 15th credit level proficiency and replaces SPAN 100.", "prerequisite": "SPAN 003 or SPAN 020"}, {"department": "SPAN", "number": "100H", "credits": "3 Credits", "description": "An intermediate level grammar review that also incorporates directed and original composition exercises.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Honors"]}, {"department": "SPAN", "number": "105", "credits": "4 Credits", "description": "The course covers basic Spanish, grammar, and oral, aural, and writing skills for students in the Agricultural Sciences. Students who have received high school credit for two or more years of Spanish may not schedule this course for credit without the permission of the instructor. This course does not count toward Spanish majors or the Spanish minor.  SPAN 105 Elementary Spanish I for Students in the Agricultural Sciences (4)(BA) This course meets the Bachelor of Arts degree requirements. The class will focus on the development of basic language skills, socio-cultural awareness and discourse. The class periods will be used to develop: (1) the student's knowledge of Spanish as a linguistic code through mastery of a personalized vocabulary as well as common idiomatic language structures important to the student's ability to communicate with Spanish speakers employed in their area of agricultural interest; (2) the student's understanding of major grammatical concepts critical to effective communication in work management within the food, agriculture and natural resources industries; (3) the student's cultural awareness of the varied Spanish speaking cultures with which the student will come into contact in the workplace; and (4) the student's ability to be creative with their knowledge of the language as it relates to the development of self-confidence and effective communicative proficiency in Spanish. Frequent short quizzes and the collection and grading of are important components of the course as they are used to encourage the use of Spanish on a daily basis. Classroom activities will be designed to require students to use and develop their communication skills in Spanish to communicate efficiently and relate personally to Spanish speakers. Students will be evaluated based on homework, quizzes, exams, and class participation. Students who have received high school credit for four years of Spanish may not schedule this course for credit, without the permission of the instructor. This course does not count toward Spanish majors or the Spanish minor.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "106", "credits": "4 Credits", "description": "Further development of basic Spanish skills and the cultural awareness needed to work with Spanish speakers in the agricultural industries.  SPAN 106 Elementary Spanish II for Students in the Agricultural Sciences (4) The class will focus on further development of the elementary language skills, socio-cultural awareness and discourse introduced in SPAN 105. It will also build on the agricultural concepts introduced in Spanish 105. The class periods will be used to develop further: (1) the student's knowledge of Spanish as a linguistic code through further mastery of a personalized vocabulary as well as common idiomatic language structures important to the student's ability to communicate with Spanish speakers employed in their area of agricultural interest; (2) the student's understanding of major grammatical concepts critical to effective communication in work management within the food, agriculture and natural resources industries; (3) the student's cultural awareness of the varied Spanish speaking cultures with which the student will come into contact in the workplace; and (4) the student's ability to be creative with their knowledge of the language as it relates to the development of self-confidence and effective communicative proficiency in Spanish. Frequent short quizzes and the collection and grading homework assignments are important components of the course as they are used to encourage the use of Spanish on a daily basis. Classroom activities will be designed to require students to use and develop their communication skills in Spanish to communicate efficiently and relate personally to Spanish speakers. Students will be evaluated based on homework, quizzes, exams, and class participation. Students who have received high school credit for four years of Spanish may not schedule this course for credit, without the permission of the instructor. This course does not count toward Spanish majors or the Spanish minor.", "prerequisite": "SPAN 105"}, {"department": "SPAN", "number": "110", "credits": "3 Credits", "description": "Practice in oral expression in Spanish, with emphasis on aural comprehension, idiomatic usage, and fluency. Use of journalistic materials.", "prerequisite": "SPAN 003 or SPAN 020", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "120", "credits": "3 Credits", "description": "Emphasis on rapid reading comprehension. Selected readings from contemporary Hispanic literature, social sciences, current events, etc.", "prerequisite": "SPAN 003 or SPAN 020", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "130", "credits": "3 Credits", "description": "Spanish 130 is a general education course on Iberian culture and civilization. The goal of this course is to provide the student with a broad, general introduction to the lands, peoples, history, and cultures of the area known as Spain and Portugal; to inform the student about the region¿s ethnic diversity, cultural heritages, and problems of development; to investigate vital symbols, myths, figures, icons, superstitions, and faiths; to foster critical thinking and associative skills; to suggest continuity and draw parallels between past and present; and to allow for a framework for undertaking further study. This course will survey the civilizations of these European lands and we will get an overview of the main historical events that make up this rich and complex history.The course is designed to expose students to the full range of Iberian history and diversity. Since we are covering centuries of history and several other variables (linguistic, artistic, ethnic, religious, political, economic, geographic, biologic, etc.), this tour will of necessity be pretty rudimentary. However, students will acquire an understanding of the diverse cultural currents and historical milestones that contributed to the creation of modern Spain and Portugal.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SPAN", "number": "131", "credits": "3 Credits", "description": "SPAN 131 Ibero American Civilization (3) (GH; IL; US) (BA): Spanish American and Brazilian life from the Conquest to the present; including studies of literature, art, the indigenous heritage, and contemporary problems. This course meets the Bachelor of Arts degree requirements.The nations and peoples of Latin America have a unique, interesting history and cultural heritage that are rooted in the traditions, beliefs, experiences, values, and struggles of Native American, European, African and other populations. As close neighbors and major trading partners of the United States, Latin American republics have both benefited and suffered from the proximity and foreign policies of the northern capitalist democracy, and have contributed to its strength and growing ethno-racial diversity. This course aims to provide the student with a broad, general introduction to the lands, peoples, and history of Latin America; to inform the student about the region's ethnic diversity, cultural background, and problems of development; and to promote appreciation for the values and practices of other cultures, and a better understanding of relations between the nations of the region and the United States. Traditional resident classes will usually combine presentation of content and discussion of reading assignments, with an expectation of high student participation. Films, videos, and recordings will enhance and illustrate readings. This course will fulfill the Humanities Breadth and Cultural Diversity requirements. The course does not count toward credits in the major or minor in Spanish because it is taught in English. Nevertheless, it will complement the department's offerings by providing students with a greater appreciation of Latin America's cultural origins, socioeconomic development, and everyday realities.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SPAN", "number": "131Y", "credits": "3 Credits", "description": "Spanish American and Brazilian life from the Conquest to the present; including studies of literature, art, the indigenous heritage, and contemporary problems. The nations and peoples of Latin America have a unique, interesting history and cultural heritage that are rooted in the traditions, beliefs, experiences, values, and struggles of Native American, European, African and other populations. As close neighbors and major trading partners of the United States, Latin American republics have both benefited and suffered from the proximity and foreign policies of the northern capitalist democracy, and have contributed to its strength and growing ethno-racial diversity. This course aims to provide the student with a broad, general introduction to the lands, peoples, and history of Latin America; to inform the student about the region's ethnic diversity, cultural background, and problems of development; and to promote appreciation for the values and practices of other cultures, and a better understanding of relations between the nations of the region and the United States. Traditional resident classes will usually combine presentation of content and discussion of reading assignments, with an expectation of high student participation. Films, videos, and recordings will enhance and illustrate readings. This course meets the Bachelor of Arts degree requirements and is a WritingAcross the Curriculum course. As such, students should expect assessments to require a significant amount of writing. This course will fulfill the Humanities Breadth and Cultural Diversity requirements. The course does not count toward credits in the major or minor in Spanish because it is taught in English. Nevertheless, it will complement the department's offerings by providing students with a greater appreciation of Latin America's cultural origins, socioeconomic development, and everyday realities.", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "Writing Across the Curriculum"]}, {"department": "SPAN", "number": "132", "credits": "3 Credits", "description": "A general introduction to human and cultural elements of African origin in Spanish- and Portuguese-speaking countries of Latin America. SPAN 132 / AFR 132 / AFAM 132 Afro-Hispanic Civilization (3) (IL) (BA) This course meets the Bachelor of Arts degree requirements. The nations and peoples of Latin America have a unique, interesting historyand cultural heritage that are rooted in the traditions, beliefs, experiences,values, and struggles of Native American, European, African and otherpopulations. This course focuses on the presence and participation of Africanpeoples and their descendants in the formation and development of societies andcultures in representative areas of the Caribbean, South America, and CentralAmerica and on the evolution, diversity, and richness of the African heritagetherein. Course content includes the African background, the experience andimpact of slavery, the social, cultural, and economic heritage of slavery, therole of race in Latin America, and Afro-Hispanic intellectual, literary, andartistic developments (e.g., aspects of folklore, music). The course aims toprovide students with a general introduction to human and cultural elements ofAfrican origin within the Spanish- and Portuguese-speaking nations of theAmericas so that they may be more knowledgeable of the meaning, significanceand widespread influence of the African diaspora. It proposes to provide thestudent with a better understanding of Africa's contribution to Latin Americanidentity, diversity, culture, and development; to promote appreciation for thevalues and practices of other cultures, and greater awareness of the relationsbetween the nations of the region and the United States.", "other": ["Cross-listed with: AFAM 132, AFR 132", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "SPAN", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "199", "credits": "3 Credits", "description": "Grammar review and practice in oral expression and aural comprehension.", "other": ["International Cultures (IL)"]}, {"department": "SPAN", "number": "200", "credits": "3 Credits", "description": "Intensive grammar review; composition. Designed primarily for majors and prospective majors.", "prerequisite": "SPAN 100", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "210", "credits": "3 Credits", "description": "Intermediate level Spanish readings dealing with Iberian life from pre-historic times to the present.", "prerequisite": "SPAN 200", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "210N", "credits": "3 Credits/Maximum of 6", "description": "SPAN 210N Multilingual and Intercultural Communication course will showcase the fundamental components of the intersection of language and culture through humanities and social science. The purpose of this course is to teach the underlying mechanisms of multilingualism through language science principles and develop an understanding of intercultural communication through humanistic approaches. The content of this course focuses on linguistic strategies for succeeding in multilingual environments (e.g. dialect variation, second language acquisition strategies) as well as intercultural communication practices for navigating new environments (e.g. understanding cultural norms, skills for global leadership). The course requires an introductory level understanding of language. Students will learn how language and culture inform each other through the examination of cultures within the United States and internationally, including non-Western cultures.", "prerequisite": "SPAN 3", "other": ["Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures", "Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "SPAN", "number": "215", "credits": "3 Credits", "description": "Introduction to the fundamental components of linguistics using data from the Spanish language.  SPAN 215 Introduction to Spanish Linguistics (3) Spanish 215 will introduce students to the fundamental components of linguistics (phonology, morphology, syntax, lexicon, and semantics) using data from the Spanish language. The course requires no previous knowledge of linguistics, but presupposes familiarity with Spanish at the 15 credit level or higher. The underlying purpose is to awaken students' interest in Spanish linguistics; to provide them with a foundation in the terminology and concepts necessary for studying higher level courses that are part of Spanish major and minor curricula; and to help them to decide which of the upper level classes they would be most interested in taking. Student performance in the course will be evaluated by (a) exams designed to verify their familiarity and understanding of linguistic terminology and concepts, their skill in doing phonetic transcription, and their ability to solve problems in phonology, morphology, syntax, and semantics, and (b) their preparedness and participation in classroom activities.", "prerequisite": "SPAN 100"}, {"department": "SPAN", "number": "220", "credits": "3 Credits", "description": "Intermediate level Spanish readings dealing with Ibero-American life from the pre-conquest to the present.", "prerequisite": "SPAN 200", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "230", "credits": "3 Credits", "description": "Study of works and authors of international importance; lectures, readings, and written works in English.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)"]}, {"department": "SPAN", "number": "253W", "credits": "3 Credits", "description": "Introduction to generic distinctions, critical methods, and approaches to Hispanic literature.  SPAN 253W Introduction to Hispanic Literature (3)(BA) This course meets the Bachelor of Arts degree requirements. During the semester students will learn how to write, and will practice writing, critical and analytical essays based upon the different genres of literature studied in class. All students will write three compositions during the semester, which will be written twice incorporating in the final draft suggestions made by their peer editors and by their instructor. The writing of the second version will be preceded by a conference with the instructor in which s/he will make comments and suggestions to the students about how to avoid the same errors made in the first draft. The themes for all papers must be chosen in consultation with the professor.", "prerequisite": "SPAN 100", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Writing Across the Curriculum"]}, {"department": "SPAN", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "299", "credits": "3 Credits", "description": "Grammar review and practice in oral expression and aural comprehension.", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "SPAN", "number": "300", "credits": "3 Credits", "description": "Development of advanced grammar and composition skills through reading texts by native speakers and adapting their techniques for original compositions.", "prerequisite": "SPAN 215", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "300B", "credits": "3 Credits/Maximum of 3", "description": "Advanced Grammar and Composition for Students in Medical-related Fields.", "prerequisite": "SPAN 100B"}, {"department": "SPAN", "number": "301", "credits": "3 Credits", "description": "This course will enhance writing proficiency in Spanish of Spanish speaking students by targeting common problems characteristic of Spanish speakers.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "305", "credits": "3 Credits", "description": "Provides practical language applications for students going to social work, psychology, and the legal and medical professions.  SPAN 305 Spanish for Social Services (3) SPAN 305 Spanish for Social Services (3) provides practical language applications for students going into social work, psychology, and the legal and medical professions. At the same time, there is an emphasis on the wide range of historic, linguistic and cultural influences that make up the Hispanic community in the US today.", "other": ["Prerequisite SPAN 215 or 253W"]}, {"department": "SPAN", "number": "305H", "credits": "3 Credits", "description": "Practical Spanish for social workers, medical personnel, law enforcement officers, etc.; emphasis on Puerto Rican vocabulary, idiom, and pronunciation.", "other": ["Honors"]}, {"department": "SPAN", "number": "310", "credits": "3 Credits", "description": "No description."}, {"department": "SPAN", "number": "314", "credits": "3 Credits", "description": "Spanish phonetics and phonemics; systematic means of correcting pronunciation defects; other audio-lingual applications.", "other": ["Prerequisite SPAN 215"]}, {"department": "SPAN", "number": "315N", "credits": "3 Credits", "description": "In this course, we investigate various aspects of the language(s) and language behaviors of U.S. Latinos. The course is premised on the idea that language is a crucial component in the formation of identity. To understand Latina/o identity formation in the U.S., then, one must analyze what role languages--Spanish and English--have played in identity formation. The class commences with a brief historical assessment of the various U.S. Latino communities, including Mexican-American, Cuban-American, and Puerto Rican communities. Such a historical purview proves significant in the study of the cultural traditions that persist in these communities, chief among these, the Spanish language. In exploring the Spanish language in U.S. Latino communities, we consider several major sets of questions, among them the following: In what ways do the languages of U.S. Latino communities differ from those of monolingual Spanish- (and English-) speaking communities? What factors contribute to the maintenance and loss of Spanish in these communities? How does language contribute to the creation of individual and societal identity? How is language exploited in the representation of other U.S. Latino cultural traditions? We consider these questions across a variety of genres: poetry, prose (autobiography in particular), film, art, television, and music. These texts reveal how social environments determine language use as well as how artists have used language to reshape social environments, through, for example, the development of new language practices such as Spanish-English code switching. The course also connects these cultural practices to debates on Spanish in public life and policy.", "other": ["Cross-listed with: LTNST 315N", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "SPAN", "number": "316", "credits": "3 Credits", "description": "Building words and sentences in Spanish. Analysis of Spanish work structure and its relationship to syntactic structures.  SPAN 316 Building Words and Sentences in Spanish (3) \"Building words and sentences in Spanish\" is an introduction to the study of Spanish morphology and syntax. In linguistics, morphology is the study of the morphemes (e.g. affixes, words, roots) of language and how they combine together to form words. Syntax is the study of how words combine together to form phrases and sentences. Because this course is for Spanish majors and minors, the focus in this course is on the structure of words, phrases, and sentences in Spanish, how Spanish compares to other languages, and how morphology and syntax vary across Spanish dialects. Special focus will be made on explaining the kinds of errors typical of English-speaking learners of Spanish as a second language, and a primary goal of the course is for students to improve their proficiency in using Spanish morphosyntax. The course is taught in Spanish.", "other": ["Prerequisite SPAN 215"]}, {"department": "SPAN", "number": "326", "credits": "3 Credits", "description": "This course examines representations of the U.S.-Mexico border in relation to the actual geographic space. SPAN 326 Reading the Border/Lands (3) (GH;US) This class will center on discussions of the U.S.-Mexico borderlands in cultural theory and practice. \"Borderlands\" is understood as a transcultural space filled with physical, cultural, economic, political, and mythical elements. The aim is to view how different artists from the Borderlands, both northern Mexican and Chicano, mediate their borderlands reality. That is to say, the goal of the class is to examine the different imaginative geographies in the borderlands. We examine a wide-ranging mix of cultural texts that includes prose, poetry, essays, and performance art, as well as film and video art. We explore how writers have historically rethought notions of citizenship, identity, and culture to create more fluid spaces of representation in cultural contact zones. We will in particular, pay close attention to the relationship between national geography and the shaping of regional identities and popular cultures and relationships between the maps that nations draw and the cultural forms that cut across them.", "other": ["Cross-listed with: LTNST 326", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "SPAN", "number": "353", "credits": "3 Credits", "description": "This course offers a comparative study of the literature, artistic manifestations, intellectual traditions, and cultural productions of Spain. This course offers a comparative study of the literature, artistic manifestations, intellectual traditions, and cultural productions of Spain. Depending on the semester focus, topics related to  literary movements, comparative approaches to genre, and/or connections between textual representation and politics, social movements, and/or Spain's long and complex history (both locally and globally) may be at the center of discussion.  Additionally, varied issues of gender, race and ethnicity, rural and urban environments, religion, and evolving conceptions of nationhood may be included as overarching themes.  Particular literary genres and representative works may be foregrounded in yet another iteration of the course, wherein students will study and discuss principal readings against cultural backdrops framed by exposure to art, film, music, and/or other historical, intellectual, sociopolitical, and/or media-based materials of relevance to the semester-specific context at hand.", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "354", "credits": "3 Credits", "description": "This course offers a study of borders as key sites of contact, exchange, conflict, hybridity, and identity production in and across varied contexts of Spanish, Latin American, and/or Latina/o culture(s).  This course offers a study of borders - geopolitical, social, intellectual, literary, artistic, and/or historical - as key sites of contact, exchange, conflict, hybridity, and identity production in and across varied contexts of Spanish, Latin American, and/or Latina/o culture(s). While diverse variables (including diaspora, gender, race and ethnicity, sexuality, colonialism, nationhood and transnationalism) will inform particular iterations of the course, approaches and text selection will be shaped by an understanding of borders as constructs defined by conditions of dynamic interaction and transformation. Materials to be considered in the course, which will vary according the focus, may include literary, artistic, and intellectual works, film, media-based texts, music, and/or historical documents", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "355", "credits": "3 Credits", "description": "This course offers a comparative study of the literatures, artistic manifestations, intellectual traditions, and cultural productions of the Latin American region. This course offers a comparative study of the literatures, artistic manifestations, intellectual traditions, and cultural productions of the Latin American region. Throughout the course, we will reflect on the (im)possibility of characterizing a vast region by taking into account ongoing factors its broader history and culture, as well as national and local particularities. Topics will vary by semester and may include: literary and artistic periods and movements, (post)coloniality and decoloniality, the politics of race, gender, and sexuality, urban and rural sociopolitical movements, (self-)representations in old and new media, discourses of the political (populisms, revolutions, dictatorships, and neoliberalism), and migration studies. Students will engage with literary texts, historic documents, art, music, and other materials in order to understand different kinds of writing and forms of representation. While most materials will be in Spanish, the course may also include works in translation from Brazil, as well as the English- and/or French-speaking Caribbean.", "prerequisite": "SPAN 200", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "356", "credits": "3 Credits", "description": "This course offers a comparative study of the literatures and cultures of the Americas, bringing Latin America into dialogue with the United States (and in some instances Canada). This course offers a comparative study of the literatures and cultures of the Americas, bringing Latin America into dialogue with the United States (and, in some instances, Canada). Throughout the course, we will explore the (dis) continuities that both connect and divide the hemisphere, and we will trace the movement of people, artistic practices, and ideas across borders while paying attention to the distinctive aspects of national and local cultures. Topics will vary by semester and may include: empire and colonialism, the literary and cultural legacies of slavery, the figure of the \"native,\" crime literature or science fiction in the Americas, theater of the Americas, literatures and cultures of the Spanish-American War, media and the U.S./Mexico border, and cultures of the Caribbean diaspora. Although the course may cover English-language materials, or works in translation from Brazil and/or the French-speaking Caribbean, most of the texts/recordings/films will be in Spanish, as will all assignments written by students.", "prerequisite": "SPAN 200", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "395", "credits": "1-18 Credits/Maximum of 18", "description": "Supervised off-campus, nongroup instruction including field experiences, practica, or internships. Written and oral critique of activity required.", "prerequisite": "prior approval of proposed assignment by instructor", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "397", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Advanced training in Spanish language skills.", "prerequisite": "SPAN 003", "other": ["International Cultures (IL)"]}, {"department": "SPAN", "number": "410", "credits": "3 Credits", "description": "Emphasis on achieving practical command of spoken Spanish and the comprehension of native speech. Use of journalistic materials.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "410H", "credits": "3 Credits", "description": "Emphasis on achieving practical command of spoken Spanish and the comprehension of native speech. Use of journalistic materials.", "other": ["Honors"]}, {"department": "SPAN", "number": "411", "credits": "3 Credits/Maximum of 6", "description": "In SPAN 411, students will learn to understand the bilingual landscape of the Spanish-speaking world and its consequences for communities and individuals. SPAN 411 the ABCs of Bilingualism: Acquisition, Brain, and Community will showcase the fundamental components of bilingualism (first language acquisition, language mixing, language and society, language contact, and cognitive consequences of bilingualism) situating them in the Spanish speaking world. The course requires an introductory level understanding of linguistics and presupposes familiarity with Spanish at the 15-credit level or higher. The purpose of this course is to adopt an understanding of the underlying mechanisms of bilingualism and what it means to be a bilingual speaker, as well as understand the community-level impact of speaking multiple languages. Students will learn theories surrounding the study of bilingualism and apply linguistic knowledge to better understand bilingual communities that are new to them.", "prerequisite": "SPAN 215", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)"]}, {"department": "SPAN", "number": "412", "credits": "3 Credits", "description": "Techniques of written translation from Spanish to English and vice versa, particularly for business, literature, and social work. Students will learn translation theory and best practices, as well as strategies for overcoming the most common translation problems in Spanish-English translation. Some time will be spent on a review of grammar issues that most commonly result in errors in translation. Students will also learn how to deal with colloquial language and cultural references in a Spanish source text, and will be taught to consider the function of dialect, style and register in a source text and their impact in translation. In the final weeks of the semester, the focus shifts from the theoretical to the practical, as students apply their skills to the translation in advertising, scientific and technical texts, documents, and literary and artistic translation.", "prerequisite": "SPAN 100A"}, {"department": "SPAN", "number": "412H", "credits": "3 Credits", "description": "Techniques of oral and written translation from Spanish to English and vice versa, particularly for business, literature, and social work.", "other": ["Honors"]}, {"department": "SPAN", "number": "413", "credits": "3 Credits", "description": "Introduction to the art of interpretation, with particular attention to the professions for which it is most commonly required.  SPAN 413 Interpretation (3) Spanish 413 will provide students with demonstrations and exercises designed to develop the skills required in sight translation and in consecutive, simultaneous and summary interpretation. The course does not presume to provide the training needed for entrance into the profession; it is intended to give students sufficient understanding of the rigors and demands of the profession and to help them determine whether they have the interest and skills to pursue further training in this area. At the same time, it will provide students with a unique opportunity to improve their listening comprehension and fluency in the target language, whether English or Spanish.", "prerequisite": "SPAN 412"}, {"department": "SPAN", "number": "417", "credits": "3 Credits", "description": "This class is a linguistics course that focuses on language acquisition in children and adults. Linguistics is the scientific study of language and its structure, and linguistic inquiry focuses on various levels of language: phonology examines the sounds of language, morphology examines the structure of words (e.g., root words and their inflections), and syntax focuses on the structure of phrases and sentences. Using the tools of phonology, morphology, and syntax, this course will address the following questions. What is unique about human language? How is language learned in infancy? How do humans learn additional languages after they have learned their first language? How does bilingual language development compare to monolingual language development? Can knowing more than one language actually be detrimental? What are the different languages spoken by bilinguals in the Spanish-speaking world? What sorts of bilingual education programs are there in the Spanish-speaking world, including in the U.S.? By answering these questions, this course introduces students to bilingualism and bilingual language acquisition.", "prerequisite": "SPAN 100A"}, {"department": "SPAN", "number": "418", "credits": "3 Credits", "description": "The emergence and development of the sounds and forms of Spanish.", "prerequisite": "SPAN 100A"}, {"department": "SPAN", "number": "418H", "credits": "3 Credits", "description": "The emergence and development of the sounds and forms of Spanish.", "other": ["Honors"]}, {"department": "SPAN", "number": "420", "credits": "3 Credits", "description": "Spanish 420, Spanish for Business and International Trade, is an introduction to business administration (organizational structure, human resources, marketing, accounting, cross-cultural etiquette, business ethics, etc.) within the context of the Spanish language and Hispanic cultures against the backdrop of the global economy. Participants will broaden and deepen their ability to apply their Spanish skills in a professional setting by reading and evaluating current business articles, discussing and analyzing business issues in various Hispanic countries, examining the intersection of business and culture in the Spanish-speaking world, viewing short videos, preparing a resume in Spanish, and participating in other written and oral activities. To complement the core content, various assignments also allow students to focus on their individual majors.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "439", "credits": "3 Credits", "description": "Thorough study of the masterpiece, including its sources, genesis, language, style, success, and influence.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "440", "credits": "3 Credits", "description": "Theories of second language acquisition. Current classroom practices in the teaching of Romance languages.", "prerequisite": "SPAN 100A"}, {"department": "SPAN", "number": "470", "credits": "3 Credits", "description": "Young people have been at the center of political and cultural revolutions around the world and throughout history. For example, revolutions, urban movements, ethnic/racial pride, LGBTQ+, feminist movements, music basaars, DJs and rave parties, and \"barras de futbol\" are only some of the manifestations associated with young people in Latin(a/o) American literature, film, music, and journalism. Nevertheless, the concept of \"youth\" as an academic category only appeared in the 1960's. In this course, we will study different manifestations of youth cultures in the Hemispheric Americas, paying special attention to the Latinx communities in the U.S. and Latin America, since the 1960's and until the contemporary moment.  The key question that will guide us is: How does each of these literary, artistic, and media representations of youth enter into dialogue with political events in which young people have been at the center of efforts to bring about political changes in the U.S. Latinx communities and Latin American? Using short fiction, film and documentaries, songs, blogs, and other cultural materials (YouTube clips, images, graffiti, etc.), we will identify and compare different youth cultures in Latinx communities in the U.S. and Latin America in terms of their productions, representations, and effects in the public sphere. We will enrich our analysis of primary materials with theoretical and critical readings that will help us to contextualize the different manifestations in our study.", "prerequisite": "SPAN 100A", "other": ["Cross-listed with: LTNST 470"]}, {"department": "SPAN", "number": "472", "credits": "3 Credits", "description": "The regionalist and social novel since 1910, together with the social background.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "474", "credits": "3 Credits", "description": "Overview of Mexican literature, culture and history from pre-colonial period to present.", "prerequisite": "SPAN 100A"}, {"department": "SPAN", "number": "476", "credits": "3 Credits", "description": "Reading, analysis, and discussion of selected major works representative of Spanish American prose and poetry.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities", "Bachelor of Arts: Other Cultures"]}, {"department": "SPAN", "number": "479", "credits": "3 Credits", "description": "This course is conducted in Spanish and will analyze some of the central themes that shape the diverse Latina/o experiences in the United States. Some of the main topics that the course will address include: the politics of labeling; definitions of displacements; the politics of language; imaginary homelands and geographic spaces; and conceptualizations of race, gender, and sexuality. These themes will be seen through the lens of Latina/o literature and film. The main objective of this course is to help students think critically about the conceptual, theoretical, historical, and social issues that inform the Latina/o experience in the United States.", "prerequisite": "SPAN 100A", "other": ["Cross-listed with: LTNST 479", "United States Cultures (US)", "General Education: Humanities (GH)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "SPAN", "number": "488", "credits": "3 Credits", "description": "This course, conducted in Spanish, examines Spanish literature from 1898 to 1939.", "prerequisite": "SPAN 100A"}, {"department": "SPAN", "number": "490", "credits": "3 Credits", "description": "Reading, analysis, and discussion of selected masterpieces of Spanish novels, short stories, etc.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "491", "credits": "3 Credits", "description": "Reading, analysis, and discussion of selected masterpieces of Spanish drama and poetry.", "prerequisite": "SPAN 100A", "other": ["Bachelor of Arts: 2nd Foreign/World Language (All)", "Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "494", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "496H", "credits": "3 Credits", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses.", "other": ["Bachelor of Arts: Humanities", "Honors"]}, {"department": "SPAN", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Humanities"]}, {"department": "SPAN", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Contemporary Spanish life and civilization. Emphasis on post-Civil War period: literature, arts, and sociopolitical problems.", "prerequisite": "SPAN 100", "other": ["Bachelor of Arts: Humanities", "International Cultures (IL)"]}]