[{"department": "SRA", "number": "1", "credits": "1 Credits", "description": "Provides introduction to the field of Security and Risk Analysis and assessments of key skills.  SRA 001S First-Year Seminar in Security and Risk Analysis (1) SRA 001S gives first-year students a concrete overview of the field of Security and Risk Analysis (SRA), including discussion of the knowledge and competencies required for careers in this field, familiarity with the variety of career paths and the specific requirements of each, and an understanding of the skills, abilities and knowledge that is common across career paths within this field. As part of this course, students will participate in a Developmental Assessment Center, which will assess their current skill levels in the areas of Oral and Written Communication, Leadership, Conflict Resolution, Decision Making and Problem Solving, as well as other core areas to be identified. Working with the assessment team, the will create specific, individualized plans to develop skills in areas where they are currently deficient and to build on current strengths.", "other": ["First-Year Seminar"]}, {"department": "SRA", "number": "99", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "SRA", "number": "111", "credits": "3 Credits", "description": "Introduction to Security and Risk Analysis is a preliminary course with a broad focus, spanning the areas of security, risk and analysis. In addition to familiarizing the student with basic technical terminology, it will also touch upon social and legal issues, risk analysis and mitigation, crime intelligence and forensics, and information warfare and assurance.This course will motivate students to understand the requirements for security in any government agency or business organization through the use of case studies. Included in this segment are cases related to cyberterrorism, bioterrorism, and critical infrastructure protection. Some concepts to be covered in the area of information security are: confidentiality, integrity, availability, and non-repudiation. Various methods of safe guarding these security concerns will be discussed, such as: single- and multi-factor authentication, encryption, digital signatures, prevention of denial of service attacks, and so forth. This course also covers the principles and the approaches to risk analysis. Here students study vulnerability analysis, crime and intelligence analysis, forensics, techniques for risk assessment and risk mitigation.", "other": ["General Education: Social and Behavioral Scien (GS)", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Key Literacies"]}, {"department": "SRA", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "SRA", "number": "199", "credits": "1-12 Credits", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "SRA", "number": "211", "credits": "3 Credits", "description": "Provides overview of nature, scope, and seriousness of threats to security as a result of terrorism and crime.  SRA 211 Threat of Terrorism and Crime (3) Threat of Terrorism and Crime is a course designed to acquaint students with the security threats posed by both terrorist and criminal activity, and with strategies to combat these threats. Terrorism and security are defined as well as terrorism in its historical context. Varieties of terrorist groups, organizations and their actions are studied with targets of terrorism being a focus. Types of crime including street, employee, organized and white collar crime are studied.Information theft can occur in each of the types of crime. Security threats of each type are studied and mitigation techniques are evaluated. Methods of studying terrorism and crime cover data collection, analysis of the reliability of the data, and fusing the data so that information is obtained that leads to knowledge to combat terrorism and crime.Finally to put the course in perspective, students study critical shortfalls in our understanding of terrorism and crime including unreliable data, biased estimates and a lack of understanding of terrorist and criminal motives and objectives."}, {"department": "SRA", "number": "221", "credits": "3 Credits", "description": "Provides an understanding of the overview of information security including security architecture, access control, and internet secure applications.  SRA 221 Overview of Information Security (3) SRA 221 focuses onan overview of information security. Students will learn the principles of information security, security architectures and models, aspects and methods of information security such as physical security control, operations security, access control, hacks/attacks/defense, systems and programs security, cryptography, network and web security, worms and viruses, and other Internet secure applications. Students will also learn how to plan and manage security, security policies, business continuity plans, disaster recovery plans, and social and legal issues of information security.A major component of the course will be several hands-on exercises and a final team-based project. This course will incorporate collaborative and action-learning experiences wherever appropriate. Emphases will be placed on developing and practicing writing and speaking skills through application of the concepts, theories and technologies that define the course.", "prerequisite": "SRA 111"}, {"department": "SRA", "number": "231", "credits": "3 Credits", "description": "Provides an overview of decision theoretical and analytical concepts and tools in the security risk analysis field.  SRA 231 Decision Theory and Analysis (3) Decision Theory and Analysis is designed for students to build an understanding of how to improve the judgment and decision making of individuals, groups and organizations. Behavioral decision theories provide the theoretical core for the course. These theories draw on insights from a diverse set of disciplines, including cognitive and social psychology as well as economics, statistics and philosophy.Offered annually (and more if demand requires), this course will foster understanding of: (a) the cognitive, emotional, social and institutional factors that influence judgment and choice, (b) normative (economic) models of rational choice, and (c) how judgment and decision making can be predicted and/or improved through prescriptive aids and models.Applications of these theories and methods to real-life venues will be used to engage and focus the students. For example, insights on how such concepts apply to supply chain security, bioterrorism threats, legal decision making, large-scale risk assessments (e.g., assessing risks of transnational threat), and first-response/crisis decision making will be common. Where appropriate, real situations and cases are used to bring concepts and scenarios alive.Overall, the course emphasizes basic skills and concepts that enhance an individual's ability to understand why individuals, groups and organizations behave the way they do, how they formulate the issues and problems they confront, as well as to choose rationally among competing courses of action.", "prerequisite": "SRA 211"}, {"department": "SRA", "number": "268", "credits": "3 Credits", "description": "This course introduces the fundamental principles, methods, and tools of visual analytics that enable security and risk analysts to synthesize information and derive insight from massive, dynamic, ambiguous, and often conflicting data. Decisions in risk and security management are increasingly driven by data. Analysts are faced with a continuously growing set of data originated from a wide range of sources and in a wide variety of formats. Such data need to be analyzed in order to understand a situation and react promptly. This causes significant information overload to analysts and prevents them from developing good situation awareness. Visual Analytics (VA) offers an effective solution for making sense of massive datasets by exploiting interactive visualization technologies to extend human cognitive abilities. It helps analysts in detecting the expected and discover the unexpected, providing timely, defensible, and in communicating findings and assessment effectively for action. SRA 268 provides students with a quick overview of the current state of the art in visual analytics and their applications in data-driven security investigation and risk assessment. It prepares students with advanced data analytic skills and critical thinking with data. Cases studies and projects showcase the applications of visual analytics in cyber security and intelligence analysis, emergency and crisis management, and business intelligence.", "prerequisite": "SRA 111"}, {"department": "SRA", "number": "294", "credits": "1-12 Credits/Maximum of 12", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "SRA", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "SRA", "number": "297", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "SRA", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "SRA", "number": "311", "credits": "3 Credits", "description": "Assessment and mitigation of security vulnerabilities for people, organizations, industry sectors, and the nation.  SRA 311 Risk Management: Assessment and Mitigation (3) Risk Analysis in a Security Context is focused on developing analytical skills aimed at producing credible and meaningful answers to critical questions of risk management. Risk is considered at all levels within this course, including those created by intelligent adversaries, including cybercriminals and terrorists, although risks may also include natural disasters, system failures, accidents, etc. Students successfully completing this course are capable of applying a diverse set of analytic techniques to answer questions in contexts such as information security, counterterrorism and intelligence, or any other particular field where protection is an issue. Topics in this course include critical thinking, systems analysis, risk assessment and associated analysis methods, risk communication, and risk control.", "prerequisite": "SRA 231"}, {"department": "SRA", "number": "311W", "credits": "3 Credits", "description": "This intermediate course is appropriate for students majoring in Security and Risk Analysis. This course provides students with the background, experience and perspective required to document risk and identify policies and procedures that effectively deal with hazards and threats to which the organization is vulnerable, jeopardizing its mission. This writing intensive course requires students to identify and assess organization risks, and recommend controls to executive decision makers. Individual and group writing assignments provide practical experience preparing organizational-level documents that effectively communicate the risk context, risk analysis (e.g., identification and assessment), risk communication, and risk control elements for a risk management plan. Students receive and provide peer feedback on writing assignments, as well as instructor feedback, with the goal of improving writing skills and conforming writing styles to organization and industry expectations.", "prerequisite": "SRA 231", "other": ["Writing Across the Curriculum"]}, {"department": "SRA", "number": "365", "credits": "3 Credits", "description": "Theoretical foundations and practice of intermediate statistics.  SRA 365 Statistics for Security and Risk Analysis (3) SRA 365 is an intermediate-level statistics course emphasizing how to summarize data using descriptive statistics, how to make data-driven decisions using inferential statistics, and how to critically evaluate data presented in the media, all within the context of security, risk, and analysis. This is both a theory and application course. Students will learn about statistical theories, such as regression, and chi-square analyses, and apply their knowledge of these theories by analyzing and interpreting data using a statistical software package.", "prerequisite": "STAT 200"}, {"department": "SRA", "number": "397", "credits": "1-9 Credits", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "SRA", "number": "399", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction.", "other": ["International Cultures (IL)"]}, {"department": "SRA", "number": "421", "credits": "3 Credits", "description": "The Role of information and intelligence introduces students to the architecture and policies of the U.S. Intelligence Community (IC) and examines how U.S. intelligence policies and practices relate to overall U.S. foreign policy objectives and are influenced by today's global enviroment and emerging technologies.  The course examines the users and processes of IC, participants of Competitive Intelligence, and comparative intelligence communities.  SRA 421 The Intelligence Environment (3) This course examines intelligence structures and policies and explores the role and use of information and intelligence in the 21st Century, in support of individual citizens, national defense and corporate America. It will introduce the major actors in the U.S. intelligence community and frame U.S. intelligence policies in terms of overall U.S. foreign policy objectives in the current globalized international arena. The course discusses the history and evolution of U.S. intelligence policies, capabilities and information requirements as well as the legal and constitutional foundations of those policies. The course will examine and apply methods and techniques of the information user and intelligence practitioner. The course will also provide experience in applying principles and techniques learned in the context of a team-based intelligence-analysis simulation exercise.", "prerequisite": "SRA 111"}, {"department": "SRA", "number": "433", "credits": "3 Credits", "description": "Deception tactics, technologies and procedures and approaches to counterdeception analysis.  SRA 433 Deception and Counterdeception (3) This course introduces deception and counterdeception and their role in support of security risk analyses in competitive environments. The course covers fundamental theories of deception, human cognition and its vulnerabilities to deception, and the vulnerabilities of technical collection systems and sensors to deception. The course discusses deceptive practices in use by attackers and defenders, including both non-technical and technical means. The course also provides experience applying technical and non-technical counterdeception techniques to security risk analysis problems.", "prerequisite": "SRA 211"}, {"department": "SRA", "number": "440W", "credits": "3 Credits", "description": "This course is designed to provide IST students enrolled in their last year of study in the SRA major to experience a semester-long security and risk analysis scenario or problem-solving exercise by providing realistic analytic dilemmas requiring solutions that incorporate facets of the three SRA Options. The problems selected for the Capstone should lend themselves to team collaboration and group solutions.", "prerequisite": "SRA 221", "other": ["Writing Across the Curriculum"]}, {"department": "SRA", "number": "450", "credits": "3 Credits", "description": "Cyber-crime and cyber-warfare are among the most critical areas facing information security professionals. Both have emerged as strategic issues facing the United States. This importance is recognized by NSA, DHS and industry. This course will familiarize students with the history, tools, methods, players, laws and policies regarding cyber-crime and cyber-warfare. This course will add to the offerings in the MPS Information Security and Forensics major as well as the SRA BS ICS and IAM options.", "prerequisite": "SRA 111"}, {"department": "SRA", "number": "468", "credits": "3 Credits", "description": "The objective of this course is to develop a spatial perspective on risk analysis empower students with GIS spatial data representation, visualization, and analysis methods that are fundamental to the spatial analysis of risk. Risk analysis is critical for public safety agencies and insurance companies, land developers, and by government planners for better disaster preparedness. Geographical Information systems and associated spatial analytical tools are widely used to characterize hazards (earthquakes, hurricanes, cyclones and floods) and their impacts of life, properties, and environment. Through a set of lectures, labs, and projects, students will develop skills and competencies in mapping hazards, exposure, and vulnerabilities, and integrating these risk components through geospatial relationships. A state-of-the-art GIS software (such as ArcGIS) will be used to support practical data processing (filtering, subsetting, reclassification), GIS analysis (location queries, buffer analysis, and spatial join/overlay), and visualization.", "prerequisite": "IST 210"}, {"department": "SRA", "number": "471", "credits": "3 Credits", "description": "Provides in-depth study of how security informatics is influenced by the risk and post-modern culture.  SRA 471 Informatics, Risk, and the Post-Modern World (3)The post-modern world provides a changing climate and context for defining and understanding threats, intelligence, decisions, and risk. Likewise, post-modern cultures consist of beliefs that are heavily influenced by psychology, social connectivity, collective behavior, religion, ethnicity, and political systems. This system of systems is heavily dependent upon and influenced by information, information technology, and the web (social informatics). When examining human behavior as it impacts risk, these various social-technical factors must be considered in planning for terrorism, intelligence analysis, and emergency events. As the post-modern world becomes increasingly complicated, the ability to discern, identify, and address threats in terms of risk becomes exceedingly more difficult. Provision of learning underlying psychological, social, political, religious, and technical components of how risk accelerates through various stages will be critical for protection of national and international interests within the security sphere. Security informatics will be at the heart of both recognizing emerging situations and employing tools/agents/measures to assuage emergency, terrorist, or even national disaster events. This course provides the student with a broad perspective to critically examine both theories and practice of security informatics as related to the cultures in which threats emerge asymmetrically. Students will be placed on the role of systems analysts to problem solve and analyze information from a broad bandwidth of information specifically as informed by culture, post-modern thought, psychological intent, and situation awareness. The course will be grounded by participation in case studies and/or analyzing exercises of risk. Students will be required to do comprehensive reading assignments, engage in team cognition-social interaction, and become familiar with social informatics concepts and tools as related to risk, terrorism, and information warfare. As the post-modern world becomes increasingly complicated, the ability to discern, identify, and address threats in terms of risk becomes exceedingly more difficult. Provision of understanding some of the underlying psychological, social, political, religious, and technical components of how risk accelerates through various stages will be critical for protection of national and international interests within the security sphere. As extreme events become more prevalent in society, security informatics will be at the heart of both recognizing emerging situations and employing tools/agents to assuage emergency, terrorist, or even national disaster events.", "prerequisite": "SRA 231"}, {"department": "SRA", "number": "472", "credits": "3 Credits", "description": "Exploration of technological, operational, organizational and regulatory issues related to maintenance of individual privacy, confidentiality of organizations, and information protection.  SRA 472 Integration of Privacy and Security (3)This course is designed to introduce students to the major organizational, technical, operational and regulatory issues in information privacy and security, and to give them experience in performing a privacy analysis, designing privacy-aware applications and developing privacy policy in organizations. Topics covered include: conceptualizations and theories of privacy and security, privacy laws and compliance, building a privacy organizational infrastructure, integrating privacy in the software development process, performing a privacy analysis, privacy issues in outsourcing and cross-border data transfers, integrating privacy into customer relationship management and vendor management, information systems audit and intentional standards on privacy and security. This course will mix technical details, applied value and organizational insights of assuring privacy and security through the use of case studies, real-life problems, hands-on exercises and team projects.", "prerequisite": "SRA 211"}, {"department": "SRA", "number": "480", "credits": "3 Credits", "description": "This course examines how information and communication technologies have played a role in saving lives' specifically in the areas of technologies used toward emergency response. It explores disaster response and the inter-connectedness of information, people, and technologies in a crisis. In particular, it examines how information is managed, organized, coordinated, and disseminated during a crisis; it analyzes information needs and seeking behaviors during a crisis, and explores how information and communication technologies can support communities in a crisis. Students reflect on lessons learned from past crises, and develop strategies to manage future crises. This course will equip students with the knowledge and skills to enable them to be key players in crisis response.", "prerequisite": "SRA 111"}, {"department": "SRA", "number": "494", "credits": "1-12 Credits", "description": "Supervised student activities on research projects identified on an individual or small-group basis."}, {"department": "SRA", "number": "496", "credits": "1-18 Credits", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "SRA", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}, {"department": "SRA", "number": "499", "credits": "1-12 Credits/Maximum of 12", "description": "Courses offered in foreign countries by individual or group instruction", "other": ["International Cultures (IL)"]}]