[{"department": "SSED", "number": "100N", "credits": "3 Credits", "description": "SSED 100N provides foundational historical content integrated with key geographic and economic concepts relevant to social studies curriculum at the elementary and middle level (grades K-8). Its main objective is to support educational inquiry (learning based in compelling questions) into historical, geographical, and economic connections across and between past eras, world regions, and the contemporary global context as academic preparation for teaching social studies to young learners. Topic areas include broad overviews of world civilizations from ancient times to the modern era and of U.S. history; fundamental geographic and economic concepts and their effects on human history; and global cultures and economy in contemporary times. The course is arranged as online unit modules that provide instruction, guide reading, and assess learning and cumulative understanding in a sequence and pace that supports building connections across this diverse range of topics and to K-8 education.", "other": ["International Cultures (IL)", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "SSED", "number": "200", "credits": "3 Credits", "description": "Recommended Preparations: HIST 20  Essentials of American Heritage for heritage interpretative education applications.  SS ED 200 American Heritage (3)(US) SS ED 200 is designed to introduce students to Heritage Education as a career opportunity for students interested in teaching history/heritage, working at history museums and heritage sites, Public History, and/or working in related fields and/or to diversify, enhance, and enrich their teacher certification, and/or to enrich their understanding of America's founding. SS ED 200 is the first in a series of four courses that lead to the Heritage Education Certificate (15 credits). Students who complete the program shall be eligible and prepared to complete the requirements for the Certified Interpretative Guide credential as offered by the National Association for Interpretation. In this course, students will synthesize knowledge and understandings of American heritage focused on America's founding as found in past and prevailing curricular sources and more importantly as represented at America's heritage sites and historical museums. Students will have opportunities to apply this knowledge through curricular and presentation experiences. Taking advantage of Penn State's central location and access to heritage/history museums and heritage and historical sites throughout the Northeast, the course will include visitations to select heritage and historical sites and museums. Pending outside funding, one to three field trips to local and regional heritage sites shall be included in this course. Pending arrangements with local and regional sites, typically, trips scheduled shall be \"day-trips.\" Students unable to travel will be provided with alternative assignments. As part of these visits, students will observe heritage presentations by staff, engage staff, view exhibits/collections, make and record observations via technology (pictures, video, and personal notes). Student assessments will include critical essay reviews on past and present presentations of America's founding as found in relevant sources together with assessments of local, regional, and national heritage sites. Two exams shall also be required.", "prerequisite": "any U.S. History selection (3 credits)", "other": ["United States Cultures (US)"]}, {"department": "SSED", "number": "411", "credits": "3 Credits", "description": "SSED 411 Teaching Secondary Social Studies I is the first methods courses in a two-course sequence in preparation for teaching social studies in the secondary grades (7-12), with emphasis on the the subjects most frequently taught in schools and specified in academic standards (civics/government, economics, geography, and history). The principal goal is to provide prospective teachers with a better understanding of the nature, curriculum, and educational structures of social studies in the U.S.; of how to identify, select, instruct, and assess rigorous content and learning outcomes; and of effective strategies for designing, planning, and implementing instruction. Additional topics may be included as determined by the section instructor.", "prerequisite": "GEOG 30N"}, {"department": "SSED", "number": "412W", "credits": "3 Credits", "description": "Writing-intensive course focusing on study of the social studies teacher's role in planning instruction; strategies for teaching.  SS ED 412W Teaching Secondary Social Studies II (3)Advanced study and practice of teaching social studies in the secondary grades (7-12) with emphasis on content and methods for the major subject areas (citizenship and government, economics, geography, and history). The principal goal is to provide prospective teachers with intellectual preparation and relevant practice in selecting and applying rigorous content knowledge to higher-order thinking in the classroom and practical experience designing, planning, and implementing social studies instruction. Topics include the social studies teacher's role in planning and practicing instruction, strategies for implementing and assessing teaching in the social studies, and others as determined by the section instructor. As a writing course (W), SS ED 412W engages students in professional in-depth writing experiences that involve planning, process, development, teaching and learning social studies content, and other relevant writing that teachers are expected to perform.", "prerequisite": "SSED 411", "other": ["Writing Across the Curriculum"]}, {"department": "SSED", "number": "430W", "credits": "3 Credits", "description": "Social studies transforms the social sciences and humanities to promote civic competence (National Council for the Social Studies, 2002). In this course, teacher candidates learn to coordinate and conceptualize the richness of anthropology, economics, geography, history, civics, and sociology for elementary classroom pedagogy. Candidates become familiar with various instructional strategies that support social studies. Candidates gain an understanding of the information, concepts, theories, analytical approaches, and different perspectives-including global and multicultural perspectives-that are important to teaching social studies. Candidates also learn how to assess social studies learning in a variety of ways. This course stresses technology, content integration, social science competence, differentiated instruction, multicultural/global knowledge, teaching social historical inquiry, and constructing democratic learning communities. Teacher candidates learn how to apply the State Learning Frameworks and National Standards in their classroom instruction. At the conclusion of the course, candidates have a good understanding of elementary social studies and are able to develop and demonstrate powerful social studies curricula. Being a \"W\" course, SSED 430 incorporates both formal and informal writing into in-class and graded assignments to encourage teacher candidates to develop as critical thinkers and productive writers. This writing includes an essay describing one's own experiences as a social studies learner, reading responses, the creation of a unit of instruction, and several lesson plans that describe significant activities. These writing tasks are meant to professionalize the communication skills required to effectively teach social studies as well as to effectively communicate with parents, educators, and administrators. SSED 430W is a part of a block of courses in a PSU teacher education program that is unified by a basic set of principles and a field experience component.", "prerequisite": "4th Semester standing Recommended Preparation: 9 credits in history and the social sciences", "other": ["Writing Across the Curriculum"]}, {"department": "SSED", "number": "470", "credits": "1-6 Credits/Maximum of 6", "description": "Concentration on particular issues, trends, and developments in the social studies.", "prerequisite": "Instructional I certificate and teaching experience"}, {"department": "SSED", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, which are supervised on an individual basis and which fall outside the scope of formal courses."}, {"department": "SSED", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}]