[{"department": "STS", "number": "47", "credits": "3 Credits", "description": "Impact of developments in science, literature, and art on changing attitudes toward nature; consequences for conservation, preservation, environmental ethics.", "other": ["Cross-listed with: SOC 47", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "STS", "number": "55", "credits": "3 Credits", "description": "The science and technology of space exploration and exploitation; physical principles; research and development; history, space policy, and social implications.", "other": ["Cross-listed with: AERSP 55", "Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "STS", "number": "100", "credits": "3 Credits", "description": "A survey of the development and culture of science, technology, and medicine in world history.  S T S 100 Science, Technology, and Culture (3) (GH)(BA) This course meets the Bachelor of Arts degree requirements. 'Science, Technology, and Culture' surveys the development and culture of science, technology, and medicine in world history. This course will introduce students to using the humanities, social sciences, and the arts to understand the development and uses of science, technology, and medicine in human history. The course focuses on broad trends and changes over time in their social and cultural contexts. The course is intended to address the needs of a wide range of students. For students majoring in the the arts, humanities and social sciences, the course provides a deeper understanding of the relationship between lay/popular and techno-scientific cultures. For the scientific and technically oriented student, the class exposes students to the study of technical and scientific problems from a broader cultural and historical perspective. All students will develop a knowledge of the values that have motivated and informed scientific, technological, and clinical ventures as well as an appreciation of important cultural dimensions of techno-scientific work, including the influence of religious concepts and practices, the impact of race, class, and gender, the significance of language and symbols, and the role played by local and global traditions. The course also asks students to think critically about the role of science, technology, and medicine in world history and the impact of that history on today's world. Topics include: the role of scientific and technical expertise in society; the social and economic conditions that have fostered and impeded scientific development and technological innovation; the social, aesthetic, and symbolic considerations that have shaped the way scientific ideas have been framed and used; and the impact of scientific notions and technological innovations on social life. Students are required to read both primary and secondary texts. Students are also required to augment their classroom readings with scholarly material that they find through library and electronic research. In addition to regular classroom discussions, students will also participate in team-based learning activities and projects that require the students to interact with their peers and to present their thoughts publicly.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)"]}, {"department": "STS", "number": "100H", "credits": "3 Credits", "description": "A survey of some of the intellectual achievements that highlight humanity's attempts to understand nature and shape the environment.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "Honors"]}, {"department": "STS", "number": "101", "credits": "3 Credits", "description": "Relationships of science and technology to human aspirations, values, and arts.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)"]}, {"department": "STS", "number": "105", "credits": "3 Credits", "description": "This course is an introduction to the central role of food and food production in all areas of human life. The social and technological bases of various food systems are examined from the hunter-gatherer to the agrarian to the modern industrial system and its discontents. The course also considers how different types of food (e.g., meat, milk, cereals, chocolate) are preserved and distributed, examining both the effects of the development of the science and technology on society and vice versa. The roles of various food components (e.g., proteins, carbohydrates, fats, and vitamins) are examined both within the foods as determinants of quality, and also in terms of human nutrition and health. Finally, various other ways food may be considered appropriate or inappropriate will be studied including scientifically based reasons (e.g., safety, taste, adulteration) and non-scientifically based reasons (e.g., ethical, legal, religious).", "other": ["Cross-listed with: FDSC 105", "Bachelor of Arts: Social and Behavioral Sciences", "General Education: Health and Wellness (GHW)", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking"]}, {"department": "STS", "number": "110N", "credits": "3 Credits", "description": "The study and assessment of chemical developments during the First and Second World Wars will form the backbone of this course. As the course is historically focused on the period from 1914 to 1945, the students will develop a basic understanding of the significant historical events that led to the development of chemical innovations in materials, medicine, and weapons. To understand the scientific context of these developments, the students will also learn about the basics of chemistry, including recognizing the nature of the scientific process and discovery. In addition, the students will read, evaluate, and discuss primary and secondary sources to provide them with further insight into significant figures, events, and developments. These lectures, readings, and discussions (along with other assignments) will allow students to explore the ethical dimensions, the economic effects, the social consequences, and the public health impact that these scientific discoveries had on scientists, soldiers, and civilians. The students will also ascertain how many of the scientific discoveries made between 1914 and 1945 have had both beneficial applications and detrimental effects since 1945.", "other": ["International Cultures (IL)", "General Education: Humanities (GH)", "General Education:  Natural Sciences (GN)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Effective Communication", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "STS", "number": "115", "credits": "1-3 Credits/Maximum of 9", "description": "STS 115 (1-3) Pre-departure Cross-cultural Engagement serves as a pre-departure introduction for students to the culture of their international travel destination affiliated with Penn State programing. The course content covers key social issues, practical cultural information that is relevant for travelers and students, and language use for essential communication. In addition, this course seeks to promote safety, mitigate cultural shock, make students more capable abroad, and help Penn State students to become better ambassadors of their university and country. Students in this course can expect to acquire the appropriate context and preparation necessary to confront challenges abroad and have a more enriching experience. In addition, learners will be provided context about the international travel destination to prepare them for their activities abroad, positioning learners to be able to connect course content to topics in science, technology, and society that will be explored in an international environment. By the end of this course, students will be able to express information important about the travel region¿s identity, demonstrate critical thinking related to the location of travel, evaluate cultural differences, articulate key concepts in the local culture and its cuisine, demonstrate proficiency in the ability to use appropriate vocabulary in the target culture, construct effective communication strategies, and employ a capability to be an effective communicator in the local context of their immersion experience abroad. In addition, students will engage in critical analysis of international institutions as they relate to those one is familiar with in their home country, foster cultural humility, and develop cultural intelligence. Students will broaden their comprehension of a variety of factors that influence the local, regional, and national environments. Themes of politics, environment, industry, immigration, history, and cultural tradition will be explored. Furthermore, students engage in critical analysis of international institutions as they relate to those one is familiar with in their home country. Human behavior as it relates to both the host and home country are a focus of the course. The course will employ various methods of distilling knowledge including at the epistemic, theoretical, and empirical levels as it endeavors to provide students with a framework to interpret and subsequently describe events in a global context. In addition, as international culture is a focal point of this course, it is a natural fit to meet the International Cultures (IL) requirement.", "other": ["International Cultures (IL)"]}, {"department": "STS", "number": "122", "credits": "3 Credits", "description": "A history of science and culture from Stonehenge to the scientific revolution.  S T S (HIST) 122 History of Science I (3) (GH) (BA) This course meets the Bachelor of Arts degree requirements.The purpose of this course is to explore the earliest developments in science, beginning with the prehistoric roots of technology and theories of human origins, followed by an engagement with the achievements of the Mayans, Aztecs, and native North Americans. We then turn to science and technology in the ancient Greek and Egyptian worlds, followed by an analysis of early Chinese and East Indian science, medieval science in Europe, selected African sciences, and the rise of modern science in Scientific Revolution and beyond. The point of the course is to show that science is a world tradition with an ancient history, and that many social, political, cultural, and economic forces can push or pull this peculiar form of knowing in one direction rather than another. There are other history of science courses offered at Penn State, but none treats the history of science in general in relation to its social context and influences. Other history of science courses are more thematic than survey courses. HIST/S T S 123, 'History of Science II,' treats science from the scientific revolution to the present. Students may take either course alone or out of sequence; the first will not be a prerequisite for the second. The expectation is that students will combine knowledge acquired in this course with knowledge from their required general education courses in science to develop a broader understanding of history and science. HIST/S T S 122 may be used to fulfill a requirement for the History major and the History minor and it is an essential part of the recently proposed science and technology history theme within the Science Technology & Society minor. Nonmajors may use it to fulfill a general education humanities requirement.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)"]}, {"department": "STS", "number": "123", "credits": "3 Credits", "description": "A history of science and culture from the scientific revolution to the present.  S T S (HIST) 123 History of Science II (3) (GH) (BA) This course meets the Bachelor of Arts degree requirements.The purpose of this course is to explore the earliest developments in science, beginning with the prehistoric roots of technology and theories of human origins, followed by an engagement with the achievements of the Mayans, Aztecs, and native North Americans. We then turn to science and technology in the ancient Greek Egyptian worlds, followed by an analysis of early Chinese and East Indian science, medieval science in Europe, selected African sciences, and the rise of modern science in the Scientific Revolution and beyond. The point of the course is to show that science is a world tradition with an ancient history, and that many social, political, cultural, and economic forces can push or pull this peculiar form of knowing in one direction rather than another. There are other history of science courses offered at Penn State, but none treats the history of science in general in relation to its social context and influences. Other history of science courses are more thematic than survey courses (e.g., 'History of Mathematics' and 'History of Gender in Science and Archaeostronomy'). HIST 122, 'History of Science I,' treats science from Stonehenge to the scientific revolution. Students may take either course alone or out of sequence; the first will not be a prerequisite for the second. The expectation is that students will combine knowledge acquired in this course with knowledge from their required general education courses in science to develop a broader understanding of history and science. HIST/S T S 123 may be used to fulfill a requirement for the History major and the History minor and it is an essential part of the recently proposed science and technology history theme within the Science, Technology and Society minor. Students will learn historical techniques for the objective evaluation of readings and the formulation of clear and valid responses. Students' grades will be formed from a combination of a midterm and a final. Students are also required to do a paper for the class, the topic being subject to the approval of the instructor.", "other": ["Bachelor of Arts: Humanities", "General Education: Humanities (GH)"]}, {"department": "STS", "number": "124", "credits": "3 Credits", "description": "This course explores the history of health, illness, and medicine in western society from Ancient Egypt through the modern world. Relying on both primary and secondary sources, the course examines major developments in the understanding of health, illness, medical treatment, and medical practice in western society from Ancient Egypt to the present. The course will explore such themes as the changing status of medical practitioners, the experience of patients in different historical settings, artistic depictions of illness and healing, and the increasingly prominent role of medicine in public policy in order to better understand the links between medicine and its social, cultural, intellectual, and political contexts.", "other": ["Cross-listed with: HIST 124", "Bachelor of Arts: Humanities", "International Cultures (IL)", "General Education: Humanities (GH)", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "STS", "number": "150", "credits": "3 Credits", "description": "A history of materials, energy and man, with emphasis on their interrelationships.  For nontechnical students.", "other": ["Cross-listed with: EMSC 150", "Bachelor of Arts: Humanities", "Bachelor of Arts: Natural Sciences", "International Cultures (IL)", "General Education:  Natural Sciences (GN)"]}, {"department": "STS", "number": "151N", "credits": "3 Credits", "description": "This course examines the development of technology in the United States from the colonial period to the present, and places into a historical context the reception and influence of these technological developments on the social, economic, and political life of the United States. The technologies serving American society--past and present--range widely and include, for example, new harvesting techniques, railroads and motor vehicles, assembly-line mass production, and electricity and its multiple dependent technologies. Technologies have always influenced, and been influenced by, human societies; this course examines how technologies and Americans have interacted and influenced each other.", "other": ["Cross-listed with: AMST 151N, HIST 151N", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)", "General Education: Humanities (GH)", "General Education: Social and Behavioral Scien (GS)", "General Education -  Integrative: Interdomain", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Key Literacies"]}, {"department": "STS", "number": "157", "credits": "3 Credits", "description": "The role of women and gender in science, technology, and engineering.  S T S (WMNST) 157 Science, Technology, and Gender (3) (GS;US)(BA) This course meets the Bachelor of Arts degree requirements. S T S/WMST 157 examines the role of gender in science, engineering, and technology. The course offers a broad interdisciplinary overview of scholarly research and theory pertaining to women and issues of gender in science, engineering, and technology. The course is interdisciplinary (drawing materials from the natural and social sciences) and cross-cultural (taking a comparative approach to western and non-western sciences and technologies), and it examines the ways that different beliefs and practices related to gender have shaped the practice of science in different times and places. Students study great women scientists and also barriers institutional and ideological - that women have had to overcome in order to participate in science, asking how the presence and absence of women have affected those studies. Students will be graded by several quizzes and two short exams during the semester. To evaluate progress in developing critical thinking skills, the students will be required to write a response journal and/or response papers to major topic areas during the semester. Also, one individual or group presentation will be required. These instruments enable the instructor to assess students' acquisition of knowledge relevant to the general objectives of General Education.", "other": ["Cross-listed with: WMNST 157", "Bachelor of Arts: Social and Behavioral Sciences", "United States Cultures (US)"]}, {"department": "STS", "number": "197", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in-depth, a comparatively narrow subject which may be topical or of special interest.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "STS", "number": "199", "credits": "1-3 Credits/Maximum of 12", "description": "Science, Technology, and Society foreign studies. Courses offered in foreign countries by individual or group instruction."}, {"department": "STS", "number": "200", "credits": "3 Credits", "description": "An overview of interactions between science, technology, and society from social sciences and humanities perspectives.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "General Education: Social and Behavioral Scien (GS)"]}, {"department": "STS", "number": "200S", "credits": "3 Credits", "description": "An overview of interactions between science, technology, and society from social sciences and humanities perspectives.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "First-Year Seminar", "General Education: Social and Behavioral Scien (GS)"]}, {"department": "STS", "number": "201", "credits": "3 Credits", "description": "Studies of global warming, energy options, and biodiversity; their interrelations as sciences and as societal issues.", "other": ["Bachelor of Arts: Natural Sciences", "Bachelor of Arts: Social and Behavioral Sciences", "General Education:  Natural Sciences (GN)"]}, {"department": "STS", "number": "233Z", "credits": "3 Credits", "description": "Humans have always created artifacts and artificial environments to aid us in our survival and to help fulfill our needs and desires. Moreover, today technology is all pervasive, transforming and conditioning our social and political relations, our cultural understanding of ourselves, and our relationship with other animals and the natural environment. Designers make important choices concerning the creation, development, and deployment of many if not most technological innovations. Consequently, the task of the designer is an ethical one. It is therefore important to give future designers the opportunity to reflect upon the meaning of technology, particularly in its moral dimensions. Two means will be used to achieve our course goals. Much of the time will be spent thinking about and discussing the various impacts that particular technologies have upon the social, cultural, and political lives of human beings and upon the natural environment. To facilitate thoughtful discussion, we will read a number of authors, writing short papers in preparation for critical discussion in class. The second means is aimed at putting our ideas into practice by working in teams on several design projects. These design projects will require the integration of readings, discussion, and research and their synthesis to resolve the moral aspect of a design problem. Student teams will work cooperatively on these projects and make oral progress reports as well as final written and oral reports.", "other": ["Cross-listed with: PHIL 233Z", "Bachelor of Arts: Humanities", "General Education: Humanities (GH)", "General Education - Integrative: Linked", "GenEd Learning Objective: Crit and Analytical Think", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "STS", "number": "235", "credits": "3 Credits", "description": "This course investigates the relationship between science and religion in multiple cultures.  S T S 235 Science and Religion (3) (GH)The purpose of this course, designed to fulfill general education requirements in the humanities (GH), is to encourage students to investigate the relationships between the disciplines of science and religion. While most of the emphasis of the course will be on the historical interaction between science and Western religion, we will also investigate science ('natural philosophy') in the Islamic, Hindu, and Eastern religious traditions. Students will read classic texts that discuss science and religion from scientists such as Newton and Darwin as well as from world Scriptures and contemporary positions of various influential scientists and religious scholars concerning views of the material world as it relates to the spiritual world. There will be no attempt to encourage students to accept a particular religious or secular viewpoint. Rather, the course will be successful if at its conclusion the student can articulate a personal viewpoint while appreciating the reasons others might have for holding alternative opinions. Students will develop an understanding of the arguments and the historical context in which they originated which lead to differing positions. Thus, individual students will be expected to demonstrate this understanding in a series of examinations scheduled throughout the semester, and in a final examination if required by the instructor. Discussion and debate are useful devices in the search for understanding. In order to facilitate such discussion, students will be required to make one presentation to the class on an assigned topic. This presentation will serve as the starting point for class exploration of the topic. To encourage active and collaborative learning, the student presentations may be group efforts, however, no group will consist of more than three students.", "prerequisite": "completion of a basic composition course or the equivalent, S T S100 or S T S101 , or completion of 30 credits of coursework", "other": ["General Education: Humanities (GH)"]}, {"department": "STS", "number": "245Z", "credits": "3 Credits", "description": "The objective of Globalization, Technology, and Ethics is to prepare students (especially but not limited to engineering and business students) who are headed into the corporate, NGO (non-profit) or government sectors for the challenges and realities of working in a rapidly globalizing world. This course will encourage students to become leaders in a mobile and diverse transnational workplace and help them to become critical citizens of that world. Through team-centered projects and readings from the social sciences and humanities, students will broaden their understanding of engineering, technology, and culture and then be introduced to how one makes ethical decisions about that world. The course is designed to provide skills, theories and experiences that will help them to be respectful, diplomatic and professional while being able to successfully work with technology in multiple cultures and contexts. Students will understand the relationships and the effects on industry, economics, and the many facets of society in an interdependent global economy. These interrelationships will include the differing impacts on individual countries (winners and losers), the question of responsibilities of use or development of technologies and science (long term verses short term impacts). Students will be able to apply ethical analysis to these and many other issues that professionals face.", "prerequisite": "ENGL 15", "other": ["Cross-Listed", "International Cultures (IL)", "General Education: Social and Behavioral Scien (GS)", "General Education - Integrative: Linked", "GenEd Learning Objective: Global Learning", "GenEd Learning Objective: Integrative Thinking", "GenEd Learning Objective: Soc Resp and Ethic Reason"]}, {"department": "STS", "number": "299", "credits": "1-12 Credits/Maximum of 12", "description": "Science, Technology, and Society foreign studies. Courses offered in foreign countries by individual or group instruction.", "other": ["Bachelor of Arts: Social and Behavioral Sciences", "International Cultures (IL)"]}, {"department": "STS", "number": "399", "credits": "1-3 Credits/Maximum of 12", "description": "Science, Technology, and Society foreign studies. Courses offered in foreign countries by individual or group instruction."}, {"department": "STS", "number": "408", "credits": "3 Credits", "description": "Examination of oral, scribal, print, industrial, and electronic cultures; analysis of impact of technology on communications and social structure.  COMM 408 / STS 408 Cultural Foundations of Communications (3)(BA) This course meets the Bachelor of Arts degree requirements. COMM 408 / STS 408 traces the development of communications technologies and their impact on culture over the last 500 years. Students will examine how different tools for communicating changed the way people organized and made sense of their worlds. The course begins by looking at oral cultures and moves on to the scribal, print, industrial, electronic and post-industrial or postmodern cultures, studying the media developments that marked each of these eras. With each period and its corresponding technology students will examine how and why the new media altered not only the form of communication (the type of speech, form of writing and/or speed of information transfer), but also how such changes altered the content of knowledge (how people made sense of their lives and communities). Readings are drawn from a range of disciplinary perspectives on the issues, from history, sociology and anthropology, to philosophy, communication studies and cultural theory. The historical and theoretical knowledge provided by the course will give students a solid foundation for coming to terms with media trends in present-day society and for thinking through their possible epistemological, political and cultural impacts.The course is a communications elective for the Journalism and Telecommunications majors and the Media Studies minor.", "prerequisite": "COMM 110", "other": ["Cross-listed with: COMM 408", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "STS", "number": "416", "credits": "3 Credits", "description": "The class will focus on race and gender as products of science, and how societal values shape scientific activity.", "other": ["Cross-listed with: AFAM 416", "International Cultures (IL)", "United States Cultures (US)"]}, {"department": "STS", "number": "420", "credits": "3 Credits", "description": "Technology and economics of energy resources, production, and consumption; environmental factors, exhaustion, new technology.", "prerequisite": "3 credits of SOC", "other": ["Cross-listed with: EMSC 420, SOC 420", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "STS", "number": "428", "credits": "3 Credits", "description": "The origins and implications of evolutionary theory.", "prerequisite": "an introductory science course and a history course", "other": ["Cross-listed with: HIST 428", "Bachelor of Arts: Humanities", "International Cultures (IL)"]}, {"department": "STS", "number": "432", "credits": "3 Credits", "description": "Examines ethical, political, and social issues in the research, implementation, and practice of medicine, medical technologies, and healthcare.", "prerequisite": "fifth-semester standing", "other": ["Cross-listed with: PHIL 432", "Bachelor of Arts: Humanities"]}, {"department": "STS", "number": "433", "credits": "3 Credits", "description": "Ethical issues arising in the practice of science and engineering and their philosophical analysis.", "other": ["Cross-listed with: PHIL 433", "Bachelor of Arts: Humanities", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "STS", "number": "460", "credits": "3 Credits", "description": "The all-pervasive importance of science and technology policy in modern societies and mechanisms and processes by which it is made.", "prerequisite": "3 credits in natural sciences or engineering, 3 credits in social   and behavioral sciences", "other": ["Cross-listed with: PLSC 460", "Bachelor of Arts: Social and Behavioral Sciences"]}, {"department": "STS", "number": "470", "credits": "3 Credits", "description": "Nature of technology assessment and technology transfer in product design and development process from federal and university labs, and internationally.", "other": ["Bachelor of Arts: Social and Behavioral Sciences"]}]