[{"department": "SUR", "number": "111", "credits": "4 Credits", "description": "Plane surveying principles; basic measurement statistics; use and care of equipment; traversing, area, and coordinate computations; differential leveling; RTK-GPS measurements.  SUR 111 Plane Surveying (4) The objectives of this first course in surveying is to introduce the surveying profession and cover the fundamental methods of plane surveying which include use and care of equipment, field procedures, computations, and measurement error theory. As a result of completing the classroom component of the course, students will be able to: (1) make accurate conversions between commonly used surveying units, (2) apply the rules of significant figures to surveying measurements and calculations, (3) identify sources and types of error in surveying measurements, (4) understand differential leveling theory including note-form, survey closure, and loop adjustment, (5) compute the standard error of a set of repeated measurements and establish an acceptable range of observed values based upon a specified level of confidence, (6) adjust a set of measured angles and compute line directions for a closed traverse, (7) compute and adjust by compass rule the departures and latitudes of a closed traverse, (8) apply coordinate geometry methods to compute coordinates, direction, distance, and area. As a result of completing the laboratory component of this course, students will be able to: (1) perform a differential leveling survey within FCGS third order work, (2) perform a closed traverse survey with a relative precision of 1/10,000 using a total station, (3) use the RTK-GPS field method to measure position of stations in a closed traverse, and (4) complete a set of traverse computations for a closed traverse and present them in a prescribed format. SUR 111 is a prerequisite to all SUR courses. Student performance is based upon a mixture of homework, field exercises, writing assignments, quizzes, exams and a course portfolio. The final exam is comprehensive. All field exercises are held outside and on the campus grounds. Students must dress for weather conditions of the day of the laboratory exercise."}, {"department": "SUR", "number": "162", "credits": "3 Credits", "description": "CAD applications in mapping; data collection using traditional and satellite techniques; map compilation; COGO.  SUR 162 Methods in Large Scale Mapping (3) SUR 162 is the basic mapping course in the curriculum. The concept of reference datum is introduced; the US national spatial reference system is described. Map design considerations such as scale are introduced. Map compilation emphasizes computer aided drafting. Basic standards and procedures of control and mapping surveys are introduced. Basic concepts of coordinate geometry are introduced. Laboratory exercises incorporate practice in control and mapping surveys, in map compilation and in application of coordinate geometry. As a result of completing the classroom component of the course students will be able to (1) describe hardcopy and softcopy maps, (2) describe the standard series of maps in the US National Mapping Program, (3) describe US national map accuracy standards, (4) apply map design considerations such as map clarity, order and balance, (5) calculate scale and map layout, (6) apply procedures of interpolation to calculate positions of contours, (7) describe the use of triangulated irregular networks to create contours, (8) describe components of the US national spatial reference system, (9) describe design considerations for triangulation, trilateration, traverse and precise leveling, (10) describe the survey procedures used to locate contours, (11) describe procedures to make a digital elevation model, (12)design a survey to collect mapping data using a data collector to enable efficient drawing, (13) use coordinate geometry to calculate position and elevation of a feature, to calculate direction and distance of a line, to calculate coordinates of a station using intersection, to calculate coordinates of an occupied station using resection. As a result of completing the laboratory component of the course students will be able to (1) set up a new map compilation project in a mapping program, (2) create and use blocks for standard map features (eg borders, title boxes), (3) use mapping program COGO features, (4) use mapping program contouring capabilities to create a digital terrain model, (5) use mapping program features to load collected positional data and draft a manuscript, (6) design and conduct a control traverse, and a mapping survey to collect data using an electronic data collector.", "prerequisite": "SUR 111"}, {"department": "SUR", "number": "212", "credits": "4 Credits", "description": "Circular, compound, spiral horizontal curves; equal, unequal tangent vertical curves; alignments, earthwork; control, building, pipe, street, and as-built construction surveys.  SUR 212 Route and Construction Surveying (4) SUR 212 builds directly upon the fundamental surveying principles presented in SUR 111 (Plane Surveying), particularly traverse methods and coordinate geometry calculations. The course covers the fundamental geometric computations for street alignment design starting with simple circular, compound circular and spiral horizontal curves. This includes computation for intersection angles, radius, length, tangents, degree of curvature, stationing and stake-out calculations using coordinate geometry methods. The topics of vertical curve analysis follow which includes street grade, rate of change of grade, stationing, low and high points, passing a curve through fixed point and other alignment related analysis and design. Both equal tangent and unequal tangent vertical curves are discussed. Vertical curves are followed by street cross-sections, templates, slope stake locations, cut/full, earthwork computations and other aspects of 3-D alignment design. Once curve geometry and street alignment calculations are covered, the course moves into field stake-out methods for construction. Street alignment stake-out is covered first, using industry standard software with traditional and RTK-GPS equipment. A road alignment project is used to combine the aspects of geometric analysis and design with field stake-out methods including a control survey. Beyond street stake-out, other construction surveys are addressed including building, pipe line, culverts, storm and sanitary sewers, as-built and other construction related surveys. The laboratory exercises present field methods for construction projects in accordance with design specifications. Computations of earthwork volumes are also covered for other construction projects beyond that of street alignments.", "prerequisite": "SUR 162"}, {"department": "SUR", "number": "222", "credits": "3 Credits", "description": "Basic principles of metric photogrammetry with single and stereopair photos; coordinate transformations; map production with stereo imagery; flight planning. Lab.  SUR 222 - Photogrammetry (3) Photogrammetry covers the basic principles of aerial photography and the geometry of the optics in relation to aerial cameras. Mathematical theories for refining and processing measurements from single aerial photographs are developed. Such measurements are transformed to obtain real world coordinates of features on the surface of the earth. Two-dimensional conformal, affine, and projective coordinate transformation equations and the three-dimensional conformal coordinate transformation equations are developed and applied to the measurements on the photographs. In addition, the theory underlying the geometry of stereopairs of photographs are developed and used to determine elevations of features on the photograph.Stereographic equipment and software are used to produce accurate topographic maps of the overlap areas between stereopairs. The course also covers procedures and considerations for planning an aerial photography mission which include flight planning, cost analysis, equipment selection, placement of photo controls, and overall project management."}, {"department": "SUR", "number": "241", "credits": "3 Credits", "description": "Statistical error analysis of surveying measurements; propagation of random errors; confidence intervals and statistical testing. Lab.  SUR 241 Surveying Measurement Analysis (3) Surveying Measurement Analysis explores the fundamental concepts of statistical error analysis with applications to surveying measurements. It covers the normal distribution function and theories describing the fundamental procedures in data including measures of central tendency and measures of data variation. It then explores sampling distribution theory and develops statistical confidence intervals and testing using the X2 , students t, and F distributions. Fundamental concepts in the propagation of variance are developed and applied to the traditional surveying observations of angles, distances, azimuths, elevation differences. These error propagation techniques are further used to explore the propagation of variance in traditional traverse computations. The accompanying lab exercises help reinforce and validate the theoretical foundations of this class.", "prerequisite": "SUR 111"}, {"department": "SUR", "number": "262", "credits": "2 Credits", "description": "Introduction to coordinate systems used in the Lambert, Mercator, Transverse Mercator, and UTM map projections; reduction of surveying observations.  SUR 262 Coordinate systems in Map Projections (2) Coordinate systems in map projections covers the fundamental relationships between the physical earth, the geoid, the ellipsoid and map projections. It will explore the use of map projections in state plane coordinate systems, and the use of these coordinate systems in large mapping and construction projects. The course explores the corrections that must be made to properly use these coordinate systems including the reduction of observed elevations, distances, azimuths and angle."}, {"department": "SUR", "number": "272", "credits": "3 Credits", "description": "Evolution of land records systems; PLS: property ownership and conveyancing; common and statute law; rules of construction; boundary location procedures.", "prerequisite": "SUR 111"}, {"department": "SUR", "number": "296", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an individual basis and that fall outside the scope of formal courses."}, {"department": "SUR", "number": "297", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject which may be topical or of special interest."}, {"department": "SUR", "number": "313", "credits": "3 Credits", "description": "Control, boundary, mapping and construction surveys; survey planning, coordinating; report and record map preparation.  SUR 313 Integrated Surveying (3) SUR 313 is intended for SRT and SUR E students in their last year in the programs. Objectives of SUR 313 are directed toward providing instruction and practical experience in activities common in surveying practice, experience requiring the integration of virtually all abilities gained in previous surveying courses. The class is organized as a student surveying company with the instructor as general supervisor. Objective 1 of the student surveying company is to analyze a letter from a client (the instructor) requesting a survey. The letter will request a survey (typically ALTA boundary or construction). The client letter will specify standards (ALTA and other) the survey is to meet, standards commonly required in survey practice. The client letter will specify products to be delivered, typically a report of record of survey maps and analyses showing the degree to which required survey standards have been met. In addressing objective 1, students determine exactly what work needs to be done to satisfy client requirements. Typically these include several sub-surveys: (1) a relatively long-range satellite (GNSS) survey to bring control into the project area, (2) a traditional local control survey to create a control network to control subordinate surveys and the surveys producing what the client has requested, typically boundary retracement and mapping surveys. The result of work on objective 1 is the organization of the class into coordinating groups, one per sub-survey plus two additional groups for report compilation and editing and map production and editing. Objective 2 of the student surveying company is to develop detailed work plans for sub-surveys, report preparation and map production. The result of work on objective 2 is the set of work plans. A written contract (as a letter of understanding) between the student surveying company and the client is prepared. Objective 3 is to perform that record search, field work, data analysis, mapping and preliminary report writing for the sub-surveys necessary to meet client requirements. Objective 4 is to compile the final report of survey.", "prerequisite": "SUR 162"}, {"department": "SUR", "number": "341", "credits": "3 Credits", "description": "Matrix methods in least squares; random error propagation; observation equation model; conditions between parameters; basic post-adjustment statistical analysis.  SUR 341 - Adjustment Computations (3) Adjustment computations covers the basic theory and mechanics of a least squares adjustment using the traditional surveying observations of distances, angles, azimuths, and elevation differences. It explores the theory of error propagation, and uses this theory to determine the precision of indirectly measured quantities. It explores post-adjustment analysis through the use of various statistical tests, and error ellipse computation and analysis. This course primarily focuses on the least squares adjustment and analysis of differential leveling, triangulation, trilateration, traverse and network observations.", "prerequisite": "SUR 262"}, {"department": "SUR", "number": "351", "credits": "3 Credits", "description": "Three dimensional geodesy; computations on the ellipsoid; map projections; reduction of observations and elements of physical geodesy.  SUR 351 Geodetic Models (3) Course covers the basic gravimetric and geometric geodesy aspects as related to surveying. Motions of the Earth and the effect on reference systems are explored. The Earth's gravity field, its measurement, reduction of gravity observations to the geoid, uses for gravity and gravity anomalies are studied. Different coordinate reference systems are studied including astronomic, geodetic, and satellite coordinate systems. Transformation between the various coordinate systems is covered while also considering crustal plate motion. Basic mathematical representations and transformations between various representative ellipsoids are explored. Satellite navigation and positioning is discussed at a rudimentary level. Both point positioning and relative positioning techniques are discussed.", "prerequisite": "MATH 141"}, {"department": "SUR", "number": "362", "credits": "3 Credits", "description": "Basic concepts in geographic information engineering; spatial reference frame-works; map and text data; digital environments; software and hardware plat-forms.  SUR 362 Introduction to Geospatial Information Engineering (3) Land has varied meaning and value to different cultures and generations. There is a need to manage land and its resources in order to sustain life and meet the demands of competing interests. Geospatial information technology provides a means through which data about land can be analyzed to obtain information that may be used to support land management decisions. The geospatial information engineering course is the foundation course in the surveying engineering program that introduces students to the technology. The objective of this course is course is to teach students to collect and process spatial data, analyze and make decisions, and to communicate the results using maps and other information delivery formats.This course begins with the introduction of geospatial technology and its application in decision making, resource allocation and management, a socio-economic development. Students learn the different types of data that are used in geospatial information technology. They learn about graphical data structures as well as descriptive databases and how to build them. Three spatial data models are discussed together with their advantages and drawbacks, as well as descriptive databases. Students capture various datasets from the field, convert them into usable formats, and process them using the models that have been discussed so as to reinforce the knowledge. Spatial reference systems and map projections are discussed. Procedures for performing geospatial analyses and querying databases are discussed and students conduct laboratory exercises using the field data that they captured. Map making techniques are discussed and students learn to communicate the results of analysis through maps.", "prerequisite": "SUR 162"}, {"department": "SUR", "number": "372W", "credits": "3 Credits", "description": "Legal research; rules of evidence including classification and evaluation; unwritten rights; land description composition; easements.", "prerequisite": "SUR 272", "other": ["Writing Across the Curriculum"]}, {"department": "SUR", "number": "381", "credits": "4 Credits", "description": "Hydraulics: statics, continuity, energy, friction; hydrology: rainfall, abstractions, travel time, runoff; stormwater design: sewers, culverts, basins, erosion; municipal regulations.  SUR 381 Stormwater Hydraulics and Hydrology (4) Stormwater Management Hydraulics and Hydrology is an elementary treatment of common design practices used to create stormwater management plans for small to medium sized land development projects. Erosion and sedimentation design is also addressed within the context of a stormwater management plan. The course is intended for engineering students who are not required to take formal fluid mechanics or hydrology courses, yet have a need to understand or complete the design aspects of stormwater management as it relates to their professional practice. Some state professional registration laws refer to this type of engineering design as \"minor engineering\" which is engineering design as it relates to land surveys connected to land development activities. Other types of \"minor engineering\" include street alignment, sanitary sewers, water lines, utilities and site grading. The course contains three segments. The first segment covers the elementary hydraulics necessary to design drainage structures and storm water detention facilities. These topics include fluid statics, continuity, conservation of mass, conservation of energy, friction losses, minor losses, energy grade line, open channel flow, weirs and orifices. The second segment covers elementary hydrology methods used to analyze runoff from land development sites and small to medium watersheds. The hydrology topics include watershed characteristics, rainfall, abstractions, runoff, time of concentration, peak flow methods, hydrograph methods, basic channel routing and detention basin routing. The third segment covers government regulations and common design methods used to design storm sewers, detention basins and erosion control plans. A project includes the design of a multiple-element storm sewer system, a stable open channel, a detention facility with a multiple outlet structure, and some erosion control measures.", "prerequisite": "MATH 141"}, {"department": "SUR", "number": "422", "credits": "3 Credits", "description": "Mathematical methods for processing digital imagery, creating digital elevation models and ortho-photographs, and applications in spatial data infrastructure.  SUR 422 Digital Photogrammetry (3) As a continuation to an existing photogrammetry course, this course is designed to provide a deeper understanding of the mathematical principles of photogrammetry as well as current applications of photogrammetric mapping. In recognition of the increasing use of digital images in geospatial technologies, especially in applications involving natural resource inventory and mapping, this course provides advanced knowledge in softcopy photogrammetry. This course deals with mathematical methods for processing tilted aerial photographs. Two- and three-dimensional coordinate transformation methods for correcting the geometry of digital imagery are taught. These are followed with the development of collinearity equations for analytical aerotriangulation and the adjustment of a block of photographs. Extraction of contours and development of elevation models are also taught. Creation of digital ortho-photographs, mosaics and color balancing of mosaicked images are discussed. Applications of ortho-rectified digital images in geospatial technologies are also taught.Laboratory exercises include the use of computer hardware and software to enhance and classify remotely sensed images, apply softcopy photogrammetry methods to develop contour maps, digital elevation models, and digital orthophotographs from a block of photographs. The course has direct relationship to photogrammetry, adjustment computations, and multipurpose land information systems which are all taught in the surveying program. It is a required course which is offered to baccalaureate degree students in the surveying engineering program. Academic achievement is evaluated through quizzes, home works, and examinations.", "prerequisite": "MATH 220"}, {"department": "SUR", "number": "441", "credits": "3 Credits", "description": "Post least squares adjustment analysis of control networks, statistical testing, blunder detection, network design considerations, and computer optimization techniques.", "prerequisite": "STAT 200"}, {"department": "SUR", "number": "455", "credits": "3 Credits", "description": "Stellar coordinate systems; geodetic reference coordinate systems; satellite orbital theory; global positioning systems; pseudo-ranging; GPS vector adjustments.", "prerequisite": "SUR 351"}, {"department": "SUR", "number": "462", "credits": "3 Credits", "description": "Acquisition processing of land parcel data; development of land information system and applications in geospatial information technology.  SUR 462 Parcel-Based Geospatial Information Systems (3) People and cultures around the world have different perceptions of land. Land has different value to many people. As a natural resource, with finite size, there are always competing interests when it comes to allocation use and management of units of land. The basic unit of land is the parcel. All activities are associated with land parcels. With such competing interests, it is important to manage land and its resources in an effective manner so as to ensure its sustainability. To ensure proper stewardship of land, data about each land parcel must be maintained so that information from parcel-based geodatabases may be used to support decisions involving land, people, and communities. Parcel-based information technology serves as a component of the geospatial technology with special applications in placed-based information.This course builds on the knowledge obtained from SUR 362, Geospatial Information Engineering course. It begins by considering various perceptions of the use and value of land to different cultures, communities, and organizations. A justification is made for the need to manage land and resources in land in order to promote good stewardship. The use of technology for land parcel information management is discussed. From there the course progresses through land parcel data types and sources, data conversion and geodatabase development. Applications of land parcel data in place-based information management are discussed. Accuracy considerations for parcel data in various applications are also discussed. Spatial analysis and methods for presenting or communicating results are discussed.", "prerequisite": "SUR 362"}, {"department": "SUR", "number": "471", "credits": "3 Credits", "description": "Ethical issues and legal limits of practice; surveyor as an expert witness; surveyor-client relationship; responsibilities to the profession.", "prerequisite": "SUR 372W"}, {"department": "SUR", "number": "482", "credits": "3 Credits", "description": "The land development process; geometric, environmental, aesthetic aspects of development; local regulatory requirements; preparation of final plat and report.  SUR 482 Land Development Design (3) Land development design is designed for seniors in Surveying Engineering and covers the basic principles of residential design and development. The objective of the course is to provide students with exposure to elements of the land development process from an engineering perspective.Topics covered include land development regulations, site analysis of soils, site evaluation in terms of opportunities and constraints, sketch design, site layout, preliminary design, street layout including horizontal and vertical design, grading plan, drainage design, stormwater management, sewer and water, and erosion and sedimentation controls. Students work in teams of two or three on a design project for a local property. Students will utilize AutoCAD Civil 3D (or similar software) and the Virginia Tech/Penn State Urban Hydrology Model (VTPSUHM) (or similar) in the project design. A site visit to the design property is included in the course. At the end of the course, student teams will exchange their project designs and critique each other's work from the view point of a township engineer. Designs are evaluated for adherence to a pre-selected municipal subdivision and land development ordinance (SALDO). Students are required to present their final designs to the class. They must be prepared to explain their work and defend any design elements that are questioned during the presentation.After completion of this course, students will be able to: 1) evaluate a site for land development potential, 2) prepare sketch designs for a proposed land development site, incorporating opportunities and constraints, 3) prepare a preliminary design including street alignment for a residential subdivision, sanitary sewer for a residential subdivision, storm sewer with inlets and inverts and a grading plan; and 4) prepare a mock final plan for public review and presentation.", "prerequisite": "SUR 212"}, {"department": "SUR", "number": "490", "credits": "1 Credits", "description": "Individual or group work in surveying.", "prerequisite": "Senior standing"}, {"department": "SUR", "number": "496", "credits": "1-18 Credits/Maximum of 18", "description": "Creative projects, including research and design, that are supervised on an indiviudal basis and that fall outside the scope of formal courses."}, {"department": "SUR", "number": "497", "credits": "1-9 Credits/Maximum of 9", "description": "Formal courses given infrequently to explore, in depth, a comparatively narrow subject that may be topical or of special interest."}]